Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: module ~a not found
es: módulo ~a no encontrado
it: modulo ~a non trovato
zh_cn: 未找到模块 ~a

source: You may use @command{guix package --show=foo | grep location} to search for the location of package @code{foo}. If you get the line @code{location: gnu/packages/bar.scm:174:2}, add @code{bar} to the @code{use-package-modules} form.
es: Puede usar @command{guix package --show=foo | grep location} para buscar la ubicación del paquete @code{foo}. Si obtiene la línea @code{location: gnu/packages/bar.scm:174:2}, añada @code{bar} a la forma @code{use-package-modules}.
it: Puoi usare @command{guix package --show=foo | grep location} per cercare la posizione del pacchetto @code{foo}. Se ottieni la linea @code{location: gnu/packages/bar.scm:174:2}, aggiungi @code{bar} al costrutto @code{use-package-modules}.
zh_cn: 可使用命令 @command{guix package --show=foo | grep location} 查询软件包 @code{foo} 的位置信息。 若返回行 @code{location: gnu/packages/bar.scm:174:2}，则将 @code{bar} 添加至 @code{use-package-modules} 表达式中。

source: Try adding @code{(use-package-modules ~a)}.
es: Intente añadir @code{(use-package-modules ~a)}.
it: Prova ad aggiungere @code{(use-package-modules ~a)}.
zh_cn: 尝试添加 @code{(use-package-modules ~a)}。

source: You may use @command{guix system search ~a} to search for a service matching @code{~a}. If you get the line @code{location: gnu/services/foo.scm:188:2}, add @code{foo} to the @code{use-service-modules} form.
es: Puede usar @command{guix system search ~a} para buscar un servicio que corresponda con @code{~a}. Si obtiene la línea @code{location: gnu/services/foo.scm:188:2}, añada @code{foo} a la forma @code{use-service-modules}.
it: Puoi usare @command{guix system search ~a} per cercare un servizio che corrisponda a @code{~a}. Se ottieni la linea @code{location: gnu/services/foo.scm:188:2}, aggiungi @code{foo} al costrutto @code{use-service-modules}.
zh_cn: 可使用命令 @command{guix system search ~a} 搜索匹配 @code{~a} 模式的系统服务。 若返回行 @code{location: gnu/services/foo.scm:188:2}，则将 @code{foo} 添加至 @code{use-service-modules} 表达式中。

source: Try adding @code{(use-service-modules ~a)}.
es: Intente añadir @code{(use-package-modules ~a)}.
it: Prova ad aggiungere @code{(use-service-modules ~a)}.
zh_cn: 尝试添加 @code{(use-service-modules ~a)}。

source: ~a: patch not found
es: ~a: parche no encontrado
it: ~a: patch non trovata
zh_cn: ~a: 未找到补丁

source: ambiguous package specification `~a'~%
es: especificación de paquete ambigua `~a'~%
it: specifica del pacchetto ambigua `~a'~%
zh_cn: 含糊的软件包规范 `~a'~%

source: choosing ~a@~a from ~a~%
es: eligiendo ~a@~a de ~a~%
it: scelgo ~a@~a da ~a~%
zh_cn: 选择 ~a@~a，来自 ~a~%

source: package '~a' has been superseded by '~a'~%
es: el paquete '~a' ha sido reemplazado por '~a'~%
it: il pacchetto '~a' è stato sostituito da '~a'~%
zh_cn: 软件包 '~a' 已被 '~a' 代替~%

source: ~A: package not found for version ~a~%
es: ~A: paquete no encontrado para la versión ~a~%
it: ~A: pacchetto non trovato per la versione ~a~%
zh_cn: ~A: 无法找到版本 ~a~% 的软件包

source: ~A: unknown package~%
es: ~A: paquete desconocido~%
it: ~A: pacchetto sconosciuto~%
zh_cn: ~A: 未知软件包 ~%

source: package `~a' lacks output `~a'~%
es: el paquete '~a' carece de salida '~a'~%
it: il pacchetto `~a' non possiede l'output `~a'~%
zh_cn: 软件包 `~a' 缺乏输出 `~a'~%

source: ~a: no value specified for service of type '~a'
es: ~a: no se ha especificado un valor para el servicio de tipo '~a'
it: ~a: valore non specificato per il servizio di tipo '~a'
zh_cn: ~a: '~a' 类型的服务未指定其值

source: This is a simple service.
es: Este es un servicio sencillo.
it: Questo è un servizio semplice.
zh_cn: 这是一个简单的服务。

source: modify-services: service '~a' was deleted here: ~a
es: modify-services: servicio '~a' se eliminó aquí: ~a
it: modify-services: il servizio '~a' è stato cancellato qui: ~a
zh_cn: modify-services：服务 '~a' 在 '~a' 被删除

source: modify-services: service '~a' not found in service list
es: modify-services: servicio '~a' no encontrado en lista de servicios
it: modify-services: servizio '~a' non trovato nella lista servizi
zh_cn: modify-services: 服务列表中找不到服务 '~a'

source: Build the operating system top-level directory, which in turn refers to everything the operating system needs: its kernel, initrd, system profile, boot script, and so on.
es: Construye el directorio de nivel superior del sistema operativo, que a su vez hace referencia a todo lo que el sistema operativo necesita: su núcleo, initrd, perfil del sistema, script de arranque y demás.
it: Crea la directory principale del sistema operativo, che farà riferimento a tutto ciò di cui il sistema ha bisogno: il suo kernel, initrd, il profilo di sistema, script di avvio, e così via.
zh_cn: 构建操作系统顶级目录，该顶级目录引用了操作系统所需的一切事物：其内核、初始化内存磁盘镜像、系统软件集 profile、启动脚本等等。

source: Produce the operating system's boot script, which is spawned by the initrd once the root file system is mounted.
es: Produce el script de arranque del sistema operativo, que es generado por el initrd una vez que el sistema de ficheros raíz está montado.
it: Produce lo script di avvio del sistema operativo, che è lanciato da initrd una volta che il file system radice è montato.
zh_cn: 产生操作系统的启动脚本，该脚本将由初始化内存磁盘镜像在挂在 root 文件系统后执行。

source: Store provenance information about the system in the system itself: the channels used when building the system, and its configuration file, when available.
es: La información de proveniencia sobre el sistema se almacena en el propio sistema: los canales utilizados al construir el sistema y su fichero de configuración, si está disponible.
it: Salva le informazioni di provenienza del sistema nel sistema stesso: include i canali usati per costruire il sistema, e il suo file di configurazione, quando disponibili.
zh_cn: 在系统中存储其来源信息，包含：构建本系统时所使用 的 channels，以及系统的配置文件，若可得到时。

source: Delete files from @file{/tmp}, @file{/var/run}, and other temporary locations at boot time.
es: Elimina ficheros de @file{/tmp}, @file{/var/run} y otras ubicaciones temporales en el arranque.
it: Elimina i file da @file{/tmp}, @file{/var/run}, e altri percorsi temporanei all'avvio.
zh_cn: 在启动时删除 @file{/tmp}, @file{/var/run}, 以及其他临时目录下的文件。

source: failed to activate '~a'~%
es: error al activar «~a»~%
it: impossibile attivare '~a'~%
zh_cn: 激活 '~a' 失败~%

source: Run @dfn{activation} code at boot time and upon @command{guix system reconfigure} completion.
es: Ejecuta el código de @dfn{activación} durante el arranque y una vez termina @command{guix system reconfigure}.
it: Esegue il codice @dfn{activation} all'avvio e alla fine di @command{guix system reconfigure}.
zh_cn: 在启动和 @command{guix system reconfigure} 完成时执行 @dfn{activation} 代码。

source: This service creates an @file{rc} script in the system; that script is responsible for booting the Hurd.
es: Este servicio crea un @file{rc} script en el sistema; ese script es el responsable de arrancar el Hurd.
it: Questo servizio crea uno script @file{rc} nel sistema; questo script ha il compito di avviare la Hurd.
zh_cn: 这个服务在系统中创建一个 @file{rc} 脚本文件；该脚本负责启动 Hurd。

source: Add special files to the root file system---e.g., @file{/usr/bin/env}.
es: Añade ficheros especiales al sistema de ficheros raíz, por ejemplo @file{/usr/bin/env}.
it: Aggiunge file speciali al file system principale--- ad esempio, @file{/usr/bin/env}.
zh_cn: 向 root 文件系统中添加一些特殊文件，例如： @file{/usr/bin/env} 。

source: duplicate '~a' entry for /etc
es: entrada '~a' duplicada para /etc
it: voce '~a' duplicata per /etc
zh_cn: 为 /etc 指定的条目 '~a' 重复

source: Populate the @file{/etc} directory.
es: Rellena el directorio @file{/etc}.
it: Popola la directory @file{/etc}.
zh_cn: 填充 @file{/etc} 目录。

source: A service for populating @file{/etc/profile.d/} with POSIX scripts having the @file{.sh} file extension, to be sourced when users log in.
es: Un servicio para poblar @file{/etc/profile.d/} con guines POSIX teniendo la extensión del archivo @file{.sh}, para ser leído con `source' cunado acceda.
it: Un servizio per popolare @file{/etc/profile.d/} con script POSIX con estensione @file{.sh}, da reperire quando gli utenti accedono.
zh_cn: 一项服务，用于向 @file{/etc/profile.d/} 填充带有 @file{.sh} 文件扩展名的 POSIX 脚本，这些脚本将在用户登录时被加载。

source: A service for populating @file{/etc/bashrc.d/} with Bash scripts having the @file{.sh} file extension, to be sourced by interactive Bash shells.
es: Un servicio para poblar @file{/etc/bashrc.d/} con guines Bash teniendo la extensión de archivo @file{.sh}, para ser leído con `source' por shell Bash interactivo.
it: Un servizio per popolare @file{/etc/bashrc.d/} con script Bash con estensione @file{.sh}, da utilizzare tramite shell Bash interattive.
zh_cn: 一项服务，用于向 @file{/etc/bashrc.d/} 填充带有 @file{.sh} 文件扩展名的 Bash 脚本，这些脚本将由交互式 Bash shell 加载。

source: A service for adding the @file{/etc/bashrc.d/vte.sh} script to your system, which improves the Bash and Zsh experience when using VTE-powered terminal emulators.
es: Un servicio para añadir el guion @file{/etc/bashrc.d/vte.sh} a su sistema, el cual mejora la experiencia de Bash y Zsh cuando utiliza emuladores de terminal con poder de VTE.
it: Un servizio per aggiungere lo script @file{/etc/bashrc.d/vte.sh} al tuo sistema, migliorando l'esperienza Bash e Zsh quando si utilizzano emulatori di terminale basati su VTE.
zh_cn: 一项服务，用于向您的系统添加 @file{/etc/bashrc.d/vte.sh} 脚本，该脚本可提升使用VTE驱动的终端仿真器时Bash和Zsh的操作体验。

source: so-called privileged-program ~s lacks any privilege~%
es: el llamado programa privilegiado ~s carece de todo privilegio~%
it: il programma "privilegiato" ~s non dispone di alcun privilegio~%
zh_cn: 所谓的特权程序 ~s 没有任何特权 ~%

source: Copy the specified executables to @file{/run/privileged/bin} and apply special privileges like setuid and/or setgid. The deprecated @file{/run/setuid-programs} directory is also populated with symbolic links to their @file{/run/privileged/bin} counterpart. It will be removed in a future Guix release.
es: Copie los ejecutables especificados a @file{/run/privileged/bin} y aplique privilegios especiales como setuid y/o setgid. La carpeta obsoleta @file{/run/setuid-programs} también es completada con enlaces simbólicos a su contra-parte @file{/run/privileged/bin}. Será retirada en una publicación Guix futura.
it: Copia gli eseguibili specificati in @file{/run/privileged/bin} e applicare privilegi speciali come setuid e/o setgid. Viene popolata anche la directory deprecata @file{/run/setuid-programs} collegamenti simbolici alla loro controparte @file{/run/privileged/bin}. Lo sarà rimosso in una futura versione di Guix.
zh_cn: 将指定的可执行文件复制到 @file{/run/privileged/bin}，并应用如 setuid 和（或） setgid 等特殊权限。 已弃用的 @file{/run/setuid-programs} 目录也会被填充为指向其 @file{/run/privileged/bin} 对应文件的符号链接。该目录将在未来的 Guix 版本中移除。

source: This is the @dfn{system profile}, available as @file{/run/current-system/profile}. It contains packages that the sysadmin wants to be globally available to all the system users.
es: Este es el @dfn{perfil del sistema}, disponible como @file{/run/current-system/profile}. Contiene paquetes que la administradora del sistema desea que estén disponibles globalmente a todos los usuarios del sistema.
it: Questo è il @dfn{system profile}, disponibile come @file{/run/current-system/profile}. Contiene i pacchetti che l'amministratore vuole siano disponibili a tutti gli utenti del sistema.
zh_cn: 这是 @dfn{system profile} ，位于 @file{/run/current-system/profile} 。它包含了系统管理员想要的对所有系统用户全局可用的软件包。

source: Make ``firmware'' files loadable by the operating system kernel. Firmware may then be uploaded to some of the machine's devices, such as Wifi cards.
es: Permite la carga de los archivos de ``firmware'' por parte del núcleo del sistema operativo. El firmware puede cargarse en algunos dispositivos de la máquina como tarjetas WiFi.
it: Rende i file ``firmware'' caricabili dal kernel del sistema operativo. Ciò rende possibile l'aggiornamento del firmware per alcuni dispositivi del computer, come le schede WiFi.
zh_cn: 让固件文件可以被系统加载。 这样固件可以被载入到这台机器的设备中， 比如说无线网卡。

source: Register garbage-collector roots---i.e., store items that will not be reclaimed by the garbage collector.
es: Registra raíces del recolector de basura---es decir, elementos del almacén que el recolector de basura no reclamará.
it: Registra le radici del garbage collector, cioè gli oggetti dello store che il garbage collector non rimuoverà.
zh_cn: 注册垃圾回收器的根——即存储垃圾回收器 不会回收的项目。

source: Builds the linux-libre kernel profile, containing the kernel itself and any linux-loadable kernel modules. This can be extended with a function that accepts the current configuration and returns a new configuration.
es: Crear el perfil del kernel linux-libre, conteniendo el kernel mismo y cualquier módulo de kernel cargable en Linux. Esto se puede extender con una función que acepte la configuración actual y devuelva una nueva configuración.
it: Costruisce il profilo del kernel linux-libre, contenente il kernel stesso e i moduli del kernel caricabili da linux. Il profilo può essere anche esteso tramite una funzione che accetta la configurazione corrente e ne restituisce una nuova.
zh_cn: 构建 Linux-libre 内核配置集 profile，包含内核本体及所有可加载内核模块。此配置集可通过接受当前配置并返回新配置的函数进行扩展。

source: Adds packages and package outputs as modules included in the booted linux-libre profile. Other services can extend this service type to add particular modules to the set of linux-loadable modules.
es: Añadir paquetes y salidas de paquete como módulos incluido el perfil linux-libre arrancado. Otros servicios pueden ampliar este tipo de servicio para añadir módulos concretos al conjuntos de módulos linux cargable.
it: Aggiunge pacchetti e i loro output come moduli inclusi nel profilo linux-libre avviato. Altri servizi possono estendere questo tipo di servizio per aggiungere moduli specifici a quelli caricabili nel kernel.
zh_cn: 添加包和包输出作为启动的 linux-libre profile 的模块。 其他服务可已拓展此类服务以向 linux 可加载的模块中添加特定模块。

source: no target of type '~a' for service '~a'
es: ningún objetivo de tipo '~a' para el servicio '~a'
it: nessun target di tipo '~a' per il servizio '~a'
zh_cn: 没有找到类为'~a'的目标，为了服务'~a'

source: more than one target service of type '~a'
es: más de un servicio objetivo de tipo '~a'
it: esiste più di un servizio target di tipo '~a'
zh_cn: 多余一个类为'~a'的目标服务

source: service of type '~a' not found
es: servicio de tipo '~a' no encontrado
it: servizio di tipo '~a' non trovato
zh_cn: 未找到类为'~a'的服务

source: 'services' field must contain a list of services
es: el campo 'services' debe contener un listado de servicios
it: Il campo "services" deve contenere un elenco di servizi
zh_cn: 'services' 字段必须包含服务列表

source: the 'hosts-file' field is deprecated, please use 'hosts-service-type' instead~%
es: el campo 'hosts-file' está obsoleto, utilice 'hosts-service-type' en su lugar~%
it: il campo 'hosts-file' è deprecato: per favore usa 'hosts-service-type' al suo posto~%
zh_cn: 'hosts-file' 字段已弃用，请使用 'hosts-service-type' 代替~%

source: multiple 'nss-certs' packages found; 'nss-certs' is now included by default in '%base-packages'; ensure it is not explicitly listed in the operating system 'packages' field~%
es: múltiples paquetes 'nss.certs' encontrados; 'nss-certs' ahora está incluido por defecto en '%base-packages'; asegúrelo no es explícitamente listado dentro del campo del sistema operativo 'packages'~%
it: trovati più pacchetti 'nss-certs'; 'nss-certs' è ora incluso per impostazione predefinita in '%base-packages'; assicurati che non sia esplicitamente elencato nel campo "packages" del sistema operativo~%
zh_cn: 发现多个 'nss-certs' 包；'nss-certs' 现已默认包含在 '%base-packages' 中；请确保操作系统的 'packages' 字段中未显式列出它~%

source: unrecognized uuid ~a at '~a'~%
es: uuid ~a no reconocida en '~a'~%
it: uuid ~a non riconosciuto in '~a'~%
zh_cn: 有无法识别的 UUID ~a 在 '~a' 中~%

source: unrecognized crypto-devices ~S at '~a'~%
es: dispositivos cifrados no reconocidos ~S en '~a'~%
it: crypto-device ~S non riconosciuti in '~a'~%
zh_cn: 未识别的加密设备 ~S 位于 '~a'~%

source: unrecognized boot parameters at '~a'~%
es: parámetros de arranque en '~a' no reconocidos~%
it: parametri di avvio non riconosciuti in '~a'~%
zh_cn: 无法识别的启动选项：'~a'~%

source: This probably means that this version of Guix is older than the one that created @file{~a}. To address this, you need to update Guix: @example guix pull @end example
es: Esto probablemente significa que esta versión de Guix es más vieja que la que creó @file{~a}. Para solucionar esto tienes que actualizar Guix: @example guix pull @end example
it: Probabilmente vuol dire che questa versione di Guix è meno recente di quella che ha creato @file{~a}. Per risolvere il problema, devi aggiornare Guix: @example guix pull @end example
zh_cn: 这大概意味着此版本的 Guix 比使用 @file{~a} 创建的版本更老。为了解决此问题，需要更新 Guix： @example guix pull @end example

source: mapped device '~a' may be ignored by bootloader~%
es: el dispositivo mapeado '~a' puede ser soslayado por el cargador de arranque.~%
it: il dispositivo mappato '~a' potrebbe essere ignorato dal bootloader~%
zh_cn: 映射设备 '~a' 可能会被引导程序忽略 ~%

source: List elements of the field 'swap-devices' should now use the <swap-space> record, as the old method is deprecated. See "(guix) operating-system Reference" for more details.~%
es: Lista de elementos del campo 'swap-devices' que deberían usar ahora el registro <swap-space> puesto que el método antiguo está obsoleto. Consulte "(guix.es) Referencia de operating-system" para más detalles.~%
it: Gli elementi della lista del campo 'swap-devices' devono ora usare il record <swap-space>, perché il vecchio metodo è deprecato. Vedi "(guix) operating-system Reference" per maggiori dettagli.~%
zh_cn: 字段“swap-devices”的列表元素现在应使用 <swap-space> 记录，因为旧方法已被淘汰。详情请参阅“(guix.zh_CN) 操作系统参考”。~%

source: using a string for file '~a' is deprecated; use 'plain-file' instead~%
es: el uso de una cadena para el archivo '~a' está obsoleto; utilice 'plain-file'~%
it: l'uso di una stringa per il file '~a' è deprecato; usa 'plain-file' al suo posto~%
zh_cn: 使用字符串表示文件‘~a' 已被弃用；请改用 'plain-file' ~%

source: using a monadic value for '~a' is deprecated; use 'plain-file' instead~%
es: el uso de un valor monádico para '~a' está obsoleto; utilice 'plain-file'~%
it: l'uso di un valore monadico per '~a' è deprecato; usa 'plain-file' al suo posto~%
zh_cn: 对 '~a' 使用一元值已被弃用；请改用 'plain-file' ~%

source: missing root file system
es: falta el sistema de archivos raíz
it: manca il file system radice
zh_cn: 缺失 root 文件系统

source: ~a: invalid locale name
es: ~a: nombre de localización no válido
it: ~a: nome localizzazione non valido
zh_cn: ~a:无效的区域名称

source: string value for '~a' is deprecated, use integer instead~%
es: valor de cadena para '~a' está obsoleto, utilice entero en su lugar~%
it: l'uso di una stringa per '~a' è deprecato, usa un numero intero~%
zh_cn: '~a' 的字符串值已被弃用；请改用整数~%

source: string value for 'user' is deprecated, use user-account instead~%
es: valor de cadena para 'user' está obsoleto, utilice en su lugar user-account~%
it: l'uso di una stringa per 'user' è deprecato; usa user-account al suo posto~%
zh_cn: 'user' 的字符串值已弃用，请改用 user-account~%

source: string value for 'group' is deprecated, use user-group instead~%
es: el valor de cadena para 'group' está obsoleto, utilice en su lugar user-group~%
it: l'uso di una stringa per 'group' è deprecato; usa user-group al suo posto~%
zh_cn: 'group' 的字符串值已弃用，请改用 user-group~%

source: symbol value for 'mixer-type' is deprecated, use string instead~%
es: el valor del símbolo para 'mixer-type' está obsoleto, en su lugar utilice la cadena~%
it: l'uso di un simbolo per 'mixer-type' è deprecato; sostituiscilo con una stringa~%
zh_cn: 'mixer-type' 的符号值已废弃，请改用字符串~%

source: Run the Music Player Daemon (MPD).
es: Ejecutar el Music Player Daemon (MPD).
it: Lancia il Music Player Daemon (MPD).
zh_cn: 运行音乐播放器守护进程 (MPD)。

source: string value for 'user' is not supported, use user-account instead~%
es: el valor de cadena para 'user' no está admitido, utilice en su lugar user-account~%
it: l'uso di una stringa per 'user' non è supportato, usa user-account al suo posto~%
zh_cn: 'user' 的字符串值不受支持，请改用 user-account~%

source: string value for 'group' is not supported, use user-group instead~%
es: el valor de cadena para 'group' no está admitido, utilice en su lugar user-group~%
it: l'uso di una stringa per 'group' non è supportato; usa user-group al suo posto~%
zh_cn: 'group' 的字符串值不受支持，请改用 user-group~%

source: syslog symbol value for 'log-to' is deprecated~%
es: valor de símbolo syslog para 'log-to' está obsoleto~%
it: l'uso del valore simbolo syslog per 'log-to' è deprecato~%
zh_cn: 'log-to' 的 syslog 符号值已被弃用~%

source: Run myMPD, a frontend for MPD. (Music Player Daemon)
es: Ejecute myMPD, un frontend para MPD. (Music Player Daemon)
it: Esegui myMPD, un frontend per MPD. (Daemon del lettore musicale)
zh_cn: 运行 myMPD，MPD 的前端。（音乐播放器守护进程）

source: Populate the @file{/etc/fstab} based on the given file system objects.
es: Genera el archivo @file{/etc/fstab} en base a los objetos de sistema de archivos proporcionados.
it: Popola il file @file{/etc/fstab} in base agli oggetti del file system indicati.
zh_cn: 根据给定的文件系统对象 填充 @file{/etc/fstab} 文件。

source: Take care of syncing the root file system and of remounting it read-only when the system shuts down.
es: Tenga cuidad con sincronizar el sistema de archivo raíz y de remontarlo en solo-lectura cuando apague el sistema.
it: Si prende cura di sincronizzare il file system radice e rimontarlo in sola lettura quando il sistema si arresta.
zh_cn: 注意同步根文件系统， 并在系统关闭时以只读方式重新加载。

source: Provide Shepherd services to mount and unmount the given file systems, as well as corresponding @file{/etc/fstab} entries.
es: Proporciona servicios Shepherd para montar y desmontar los sistemas de archivos proporcionados, así como los apuntes @file{/etc/fstab} correspondientes.
it: Fornisce i servizi di Shepherd per montare e smontare i file system indicati e le corrispondenti voci @file{/etc/fstab}.
zh_cn: 提供挂载和卸载给定文件系统的 Shepherd 服务， 以及相应的 @file{/etc/fstab} 条目。

source: Seed the @file{/dev/urandom} pseudo-random number generator (RNG) with the value recorded when the system was last shut down.
es: El número de semilla @file{/dev/urandom} pseudo aleatorio generador (RNG) con el valor registrado cunado el sistema era la última vez que se apagó.
it: Semina il generatore di numeri pseudo casuali (RNG) @file{/dev/urandom} con il valore memorizzato al momento dell'ultimo spegnimento del sisema.
zh_cn: 为 @file{/dev/urandom} 伪随机数生成器 (RNG) 添加上次关闭系统时记录的数值用作种子。

source: Run the @command{rngd} random number generation daemon to supply entropy to the kernel's pool.
es: Ejecuta el daemon de generación del número aleatorio @command{rngd} para proporcionar entropía al pool del núcleo.
it: Esegui il demone per la generazione di numeri casuali @command{rngd} per fornire entropia al pool del kernel.
zh_cn: 运行 @command{rngd} 随机数生成守护进程， 为内核池提供熵。

source: host name '~a' contains invalid characters
es: el nombre de equipo '~a' contiene caracteres no válidos
it: il nome host '~a' contiene caratteri non validi
zh_cn: 主机名 '~a' 包含无效字符

source: Populate the @file{/etc/hosts} file.
es: Genera el contenido del archivo @file{/etc/hosts}.
it: Popola il file @file{/etc/hosts}.
zh_cn: 填充 @file{/etc/hosts} 目录。

source: Initialize the machine's host name.
es: Inicializa el nombre anfitrión de la máquina.
it: Inizializza in nome host della macchina.
zh_cn: 初始化机器的主机名。

source: Ensure the Linux virtual terminals run in UTF-8 mode.
es: Asegure que los terminales virtuales de Linux ejecuten en modo UTF-8.
it: Controlla che i terminali virtuali di Linux girino in modalità UTF-8.
zh_cn: 确保 Linux 虚拟终端以 UTF-8 模式运行。
