Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: File-system type
es: Tipo del sistema de archivos
it: Tipo di file-system
zh_cn: 文件系统类型

source: Primary partitions count exceeded.
es: Se superó el número posible de particiones primarias.
it: Numero di partizioni primarie superato.
zh_cn: 主分区数量超出限制。

source: Creation error
es: Error de creación
it: Errore di creazione
zh_cn: 创建错误

source: Extended partition creation error.
es: Error al crear la partición extendida.
it: Errore di creazione della partizione estesa.
zh_cn: 扩展分区创建错误。

source: Logical partition creation error.
es: Error al crear la partición lógica.
it: Errore di creazione della partizione logica.
zh_cn: 逻辑分区创建错误。

source: Please enter the password for the encryption of partition ~a (label: ~a).
es: Introduzca la contraseña para el cifrado de la partición ~a (etiqueta: ~a).
it: Per favore, inserisci la password per criptare la partizione ~a (etichetta: ~a).
zh_cn: 请输入分区 ~a（标签：~a）的加密密码。

source: Password required
es: Contraseña necesaria
it: Password richiesta
zh_cn: 需要密码

source: Please confirm the password for the encryption of partition ~a (label: ~a).
es: Confirme la contraseña para el cifrado de la partición ~a (etiqueta: ~a).
it: Per favore, conferma la password per criptare la partizione ~a (etichetta: ~a).
zh_cn: 请确认分区 ~a（标签：~a）的加密密码。

source: Password confirmation required
es: Se necesita la confirmación de la contraseña
it: Conferma della password richiesta
zh_cn: 需要密码确认

source: Password mismatch, please try again.
es: Las contraseñas no coinciden. Inténtelo de nuevo.
it: Le password non corrispondono, riprova per favore.
zh_cn: 密码不匹配，请重试。

source: Password error
es: Error de contraseña
it: Errore password
zh_cn: 密码错误

source: Please enter the partition gpt name.
es: Introduzca el nombre de gpt de la partición.
it: Inserisci il nome gpt della partizione per favore.
zh_cn: 请输入分区 GPT 名称。

source: Partition name
es: Nombre de la partición
it: Nome partizione
zh_cn: 分区名称

source: Please enter the encrypted label
es: Introduzca la etiqueta de cifrado
it: Inserire l'etichetta criptata
zh_cn: 请输入加密标签

source: Encryption label
es: Etiqueta de cifrado
it: Etichetta criptata
zh_cn: 加密标签

source: Please enter the size of the partition. The maximum size is ~a.
es: Introduzca el tamaño de la partición. El tamaño máximo es ~a.
it: Inserisci la dimensione della partizione per favore. La dimensione massima è ~a.
zh_cn: 请输入分区大小。最大为~a。

source: Partition size
es: Tamaño de la partición
it: Dimensione partizione
zh_cn: 分区容量

source: The percentage can not be superior to 100.
es: El porcentaje no puede ser superior a 100.
it: La percentuale non può essere superiore a 100.
zh_cn: 百分比不得超过 100。

source: Size error
es: Error en el tamaño
it: Errore dimensione
zh_cn: 大小错误

source: The requested size is incorrectly formatted, or too large.
es: El tamaño solicitado no tiene un formato correcto, o es demasiado grande.
it: La dimensione richiesta non è formattata correttamente, o è troppo grande.
zh_cn: 请求的大小格式不正确，或过大。

source: The request size is superior to the maximum size.
es: El tamaño solicitado es superior al tamaño máximo.
it: La dimensione richiesta è superiore alla dimensione massima.
zh_cn: 请求的大小超过最大限制。

source: Please enter the desired mounting point for this partition. Leave this field empty if you don't want to set a mounting point.
es: Introduzca el punto de montaje deseado para esta partición. Deje este campo vacío si no desea establecer un punto de montaje.
it: Inserisci il punto di montaggio desiderato per questa partizione. Lascia vuoto questo campo se non vuoi impostare un punto di montaggio.
zh_cn: 请输入此分区的挂载点。如果不想设置挂载点，请留空此字段。

source: Mounting point
es: Punto de montaje
it: Punto di montaggio
zh_cn: 挂载点

source: Creating ~a partition starting at ~a of ~a.
es: Creando partición de tipo ~a que comienza en ~a de ~a.
it: Creo la partizione ~a a partire da ~a di ~a.
zh_cn: 正在创建从 ~a 开始，大小为 ~a 的 ~a 分区。

source: You are currently editing partition ~a.
es: Actualmente se encuentra editando la partición ~a.
it: Stai modificando la partizione ~a.
zh_cn: 您当前正在编辑分区 ~a。

source: Partition creation
es: Creación de particiones
it: Creazione partizione
zh_cn: 分区创建

source: Partition edit
es: Edición de particiones
it: Modifica partizione
zh_cn: 分区编辑

source: Are you sure you want to delete everything on disk ~a?
es: ¿Está segura de que desea borrar todo en el disco ~a?
it: Sei sicuro di voler cancellare tutto sul disco ~a?
zh_cn: 确定要删除 ~a 盘上的所有内容吗？

source: Delete disk
es: Borrar disco
it: Elimina disco
zh_cn: 删除盘幅

source: You cannot delete a free space area.
es: No puede borrar un área de espacio libre.
it: Non puoi eliminare un'area di spazio libero.
zh_cn: 您不能删除空闲空间区域。

source: Delete partition
es: Borrar partición
it: Elimina partizione
zh_cn: 删除分区

source: Are you sure you want to delete partition ~a?
es: ¿Está segura de que desea borrar la partición ~a?
it: Sei sicuro di voler eliminare la partizione ~a?
zh_cn: 您确定要删除分区 ~a 吗？

source: You can change a disk's partition table by selecting it and pressing ENTER. You can also edit a partition by selecting it and pressing ENTER, or remove it by pressing DELETE. To create a new partition, select a free space area and press ENTER. At least one partition must have its mounting point set to '/'.
es: Puede cambiar una tabla de particiones de un disco seleccionándola y pulsando INTRO, También puede editar una partición seleccionándola y pulsando INTRO, o borrarla pulsando SUPR. Para crear una nueva partición, seleccione un área con espacio libre y pulse INTRO. Al menos una partición debe tener '/' como su punto de montaje.
it: Puoi modificare la tabella delle partizioni di un disco selezionandolo e premendo ENTER. Puoi anche modificare una partizione selezionandola e premendo ENTER, o rimuoverla premendo DELETE. Per creare una nuova partizione, seleziona uno spazio libero e premi ENTER. Almeno una partizione deve avere il suo punto di montaggio impostato su '/'.
zh_cn: 您可以通过选择磁盘并按 ENTER 来更改其分区表。您也可以通过选择分区并按 ENTER 来编辑分区，或按 DELETE 来移除分区。要创建新分区，请选择空闲空间区域并按 ENTER。 至少有一个分区必须设置挂载点为 '/'。

source: This is the proposed partitioning. It is still possible to edit it or to go back to install menu by pressing the Exit button.~%~%
es: Estas son las particiones propuestas. Todavía es posible editarlas o volver al menú de instalación presionando el botón Salir.~%~%
it: Questa è la partizione proposta. È possibile modificarla o tornare al menu installazione premendo il pulsante Exit.~%~%
zh_cn: 这是建议的分区方案。您仍然可以编辑它，或按退出按钮返回安装菜单。~%~%

source: Guided partitioning
es: Particionado guiado
it: Partizionamento guidato
zh_cn: 引导分区

source: Manual partitioning
es: Particionado manual
it: Partizionamento manuale
zh_cn: 手动分区

source: No root mount point found.
es: No se ha encontrado un punto de montaje para la raíz.
it: Nessun punto di montaggio radice trovato.
zh_cn: 没有找到根挂载点。

source: Missing mount point
es: Falta el punto de montaje
it: Punto di montaggio mancante
zh_cn: 缺少挂载点

source: Cannot read the ~a partition UUID. You may need to format it.
es: No puede leer la UUID de la partición ~a . Es posible que deba formatearla.
it: Impossibile leggere l'UUID della partizione ~a. Potresti doverla formattare.
zh_cn: 无法读取 ~a 分区的 UUID。您可能需要格式化它。

source: Wrong partition format
es: Formato de partición equivocado
it: Formato della partizione sbagliato
zh_cn: 错误分区格式

source: Guided - using the entire disk
es: Guíado - uso del disco completo
it: Guidata - usa l'intero disco
zh_cn: 引导 - 使用整个磁盘

source: Guided - using the entire disk with encryption
es: Guíado - uso del disco completo con cifrado
it: Guidata - usa l'intero disco con crittografia
zh_cn: 引导 - 使用整个磁盘并加密

source: Manual
it: Manuale
zh_cn: 手动

source: Please select a partitioning method.
es: Seleccione un método de particionamiento.
it: Seleziona il metodo di partizionamento per favore.
zh_cn: 请选择分区方法。

source: Partitioning method
es: Método de particionamiento
it: Metodo di partizionamento
zh_cn: 分区方法

source: Currently, none of these is available for the Hurd.
es: Actualmente, ninguna de éstos está disponible para el Hurd.
it: Al momento, nessuna di queste opzioni è disponibile per l'Hurd.
zh_cn: 目前，这些都不适用于 Hurd。

source: Please select the desktop environment(s) you wish to install. If you select multiple desktop environments here, you will be able to choose from them later when you log in.
es: Seleccione el entorno de escritorio que desea instalar. Si selecciona múltiples entornos de escritorio, podrá seleccionar el que va a usar en la pantalla de acceso al sistema.
it: Seleziona l'ambiente desktop che desideri installare. Se selezioni più di un ambiente desktop, potrai scegliere tra di loro al momento del login.
zh_cn: 请选择需要安装的桌面环境。如果此处选中了多个桌面环境，可在登录之后选择性使用。

source: Desktop environment
es: Entorno de escritorio
it: Ambiente desktop
zh_cn: 桌面环境

source: You can now select networking services to run on your system.
es: Ahora puede seleccionar los servicios de red a ejecutar en su sistema.
it: Ora puoi selezionare i servizi di rete da eseguire sul tuo sistema.
zh_cn: 您现在可以选择在系统上运行的网络服务。

source: Network service
es: Servicio de red
it: Servizio di rete
zh_cn: 网络服务

source: You can now select the CUPS printing service to run on your system.
es: Ahora puede seleccionar el servicio de impresión CUPS a ejecutar en su sistema.
it: Ora puoi selezionare il servizio di stampa CUPS da eseguire sul tuo sistema.
zh_cn: 现在可选择在系统上运行的 CUPS 打印服务。

source: Printing and document services
es: Servicios de impresión y documentos
it: Servizi di stampa e documenti
zh_cn: 打印和文档服务

source: Console services
es: Servicios de consola
it: Servizi della console
zh_cn: 控制台服务

source: Select miscellaneous services to run on your non-graphical system.
es: Seleccione servicios varios para ejecutar en su sistema no gráfico.
it: Seleziona i servizi vari da eseguire sul tuo sistema non grafico.
zh_cn: 选择你的非图形系统上要运行的杂项服务。

source: Network management
es: Gestión de red
it: Gestione rete
zh_cn: 网络管理

source: Choose the method to manage network connections. We recommend NetworkManager or Connman for a WiFi-capable laptop; the DHCP client may be enough for a server.
es: Selecciona el método para la gestión de conexiones de red. Recomendamos NetworkManager o Connman para equipos portátiles con WiFi; el cliente DHCP puede ser suficiente para un servidor.
it: Scegli il metodo per gestire le connessioni di rete. Raccomandiamo NetworkManager o Connman per un laptop con WiFi; il client DHCP può essere sufficiente per un server.
zh_cn: 选择管理网络连接的方法。 我们推荐在支持 WiFi 的笔记本上使用 NetworkManager 或 Connman；服务器上 DHCP 客户端可能就足够了。

source: Enable
es: Habilitar
it: Abilita
zh_cn: 启用

source: Disable
es: Deshabilitar
it: Disabilita
zh_cn: 禁用

source: By turning this option on, you allow Guix to fetch substitutes (pre-built binaries) during installation from servers discovered on your local area network (LAN) in addition to the official server. This can increase download throughput. There are no security risks: only genuine substitutes may be retrieved from those servers. However, eavesdroppers on your LAN may be able to see what software you are installing.
es: Activar esta opción permite que Guix busque sustitutos (binarios preconstruidos) durante la instalación en los servidores descubiertos en su red de área local (LAN) además del servidor oficial. Esto puede aumentar el rendimiento de las descargas. No hay riesgos de seguridad: sólo se pueden obtener sustitutos genuinos desde estos servidores. Sin embargo, espías en su red LAN podrían ver qué software está instalando.
it: Attivando questa opzione permetti a Guix, durante l'installazione, di recuperare i sostituti (binari precompilati) dai server individuati sulla rete locale (LAN) in aggiunta al server ufficiale. Questo può aumentare la velocità di download. Non ci sono rischi per la sicurezza: da questi server potranno essere recuperati solo sostituti autentici. Tuttavia, eventuali intercettatori sulla tua LAN potrebbero riuscire a vedere che software stai installando.
zh_cn: 通过启用此选项，您允许 Guix 在安装过程中除了从官方服务器外，还从您本地网络 (LAN) 上发现的服务器获取替代品（预构建的二进制文件）。这可以提高下载吞吐量。 没有安全风险：这些服务器只能提供真实的替代品。 然而，局域网中的窃听者可能能够看到您正在安装的软件。

source: Please select a timezone.
es: Seleccione una zona horaria.
it: Seleziona un fuso orario.
zh_cn: 请选择时区。

source: Name
es: Nombre
it: Nome
zh_cn: 名称

source: Real name
es: Nombre real
it: Vero nome
zh_cn: 真名

source: Home directory
es: Directorio de la cuenta de usuario
it: Directory home
zh_cn: 主目录

source: Empty inputs are not allowed.
es: No se permiten entradas vacías.
it: Input vuoti non sono ammessi.
zh_cn: 不允许空输入。

source: Root account is automatically created.
es: La cuenta root se crea automáticamente.
it: L'account root è creato automaticamente.
zh_cn: root 账号会自动创建。

source: Root account
es: Cuenta root
it: Account root
zh_cn: root 账号

source: Please confirm the password.
es: Confirme la contraseña.
it: Conferma la password per favore.
zh_cn: 请确认密码。

source: Please choose a password for the system administrator ("root").
es: Cree una contraseña para la cuenta de administración del sistema ("root").
it: Scegli una password per l'amministratore di sistema ("root"), per favore.
zh_cn: 请为系统管理员（“root”）选择一个密码。

source: System administrator password
es: Contraseña de administración del sistema
it: Password amministratore di sistema
zh_cn: 系统管理员密码

source: Please add at least one user to system using the 'Add' button.
es: Añada al menos una cuenta de usuario al sistema mediante el botón "Añadir".
it: Aggiungi al sistema almeno un utente usando il tasto 'Aggiungi', per favore.
zh_cn: 请使用“添加”按钮至少添加一个用户到系统中。

source: Add
es: Añadir
it: Aggiungi
zh_cn: 添加

source: Delete
es: Borrar
it: Rimuovi
zh_cn: 删除

source: Please create at least one user.
es: Cree al menos una cuenta de usuario.
it: Crea almeno un utente per favore.
zh_cn: 请至少创建一个用户。

source: No user
es: Ninguna cuenta de usuario
it: Nessun utente
zh_cn: 无用户

source: This may be a false alarm, but possibly your graphics hardware does not work well with only free software. Expect trouble. If after installation, the system does not boot, perhaps you will need to add nomodeset to the kernel arguments and need to configure the uvesafb kernel module.
es: Esto puede ser una alarma falsa, pero posiblemente su hardware gráfico no funciona bien únicamente con software libre. Espere problemas. Si tras la instalación, el sistema no arranca, quizá necesitará añadir nomodeset a los argumentos del núcleo y necesitará configurar el módulo del kernel uvesafb.
it: Potrebbe essere un falso allarme, ma è possibile che il tuo hardware grafico non funzioni bene con il solo software libero. Preparati ad avere qualche problema. Se dopo l'installazione il sistema non dovesse avviarsi, potresti dover aggiungere nomodeset agli argomenti del kernel e configurare il modulo del kernel uvesafb.
zh_cn: 这可能是误报，但您的图形硬件可能无法很好地仅使用自由软件。请预期可能出现问题。如果安装后系统无法启动，您可能需要在内核参数中添加 nomodeset，并配置 uvesafb 内核模块。

source: Pre-install warning
es: Aviso de pre-instalación
it: Avviso di pre-installazione
zh_cn: 安装前警告

source: Devices not supported by free software were found on your computer: ~{ - ~a~%~} Unfortunately, it means those devices will not be usable. To address it, we recommend choosing hardware that respects your freedom as a user--hardware for which free drivers and firmware exist. See "Hardware Considerations" in the manual for more information.
es: Los dispositivos no mantenido por software libre fueron encontrados en equipo: ~{ - ~a~%~} Desafortunadamente, significa que aquellos dispositivos no serán utilizables. Para dirigirolo, recomendamos elegir hardware que respete su libertad como un usuario--hardware para el cual existen los controladores y el firmware libres. Conulte «Consideraciones sobre el hardware» en el manual para más información.
it: Sul tuo computer abbiamo trovato dei dispositivi non supportati dal software libero: ~{ - ~a~%~} Purtroppo significa che questi dispositivi non saranno utilizzabili. Per affrontare il problema, ti consigliamo di scegliere un hardware che rispetta la tua libertà di utente- -ovvero un hardware per il quale esistono driver e firmware liberi. Vedi “Considerazioni Hardware” nel manuale per maggiori informazioni.
zh_cn: 在您的计算机上发现了不被自由软件支持的设备： ~{ - ~a~%~} 不幸的是，这意味着这些设备将无法使用。 为了解决这个问题，我们建议选择尊重您作为用户自由的硬件——即存在自由驱动和固件的硬件。更多信息请参阅手册中的“硬件考虑事项”。

source: Hardware support warning
es: Aviso de mantenimiento de hardware
it: Avviso di supporto hardware
zh_cn: 硬件支持警告

source: Previous installation failed
es: Previa instalación incorrecta
it: Installazione precedente fallita
zh_cn: 此前的安装已失败

source: It seems that the previous installation exited unexpectedly and generated a core dump. Do you want to continue or to report the failure first?
es: Parece que la instalación anterior terminó inesperadamente y generó un volcado del núcleo. ¿Quiere continuar o informar el fallo primero?
it: Sembra che l’installazione precedente sia uscita inaspettatamente creando un core dump. Vuoi continuare o preferisci prima segnalare il fallimento?
zh_cn: 似乎之前的安装意外退出并生成了核心转储。您想继续还是先报告故障？

source: GNU Guix install
es: Instalación de GNU Guix
it: Installazione GNU Guix
zh_cn: GNU Guix 安装

source: Welcome to GNU Guix system installer! You will be guided through a graphical installation program. If you are familiar with GNU/Linux and you want tight control over the installation process, you can instead choose manual installation. Documentation is accessible at any time by pressing Ctrl-Alt-F2.
es: ¡Le damos la bienvenida al instalador del sistema GNU Guix! Se le guiará durante el proceso mediante un programa de instalación gráfica. Si ya conoce GNU/Linux y desea un control exhaustivo sobre el proceso de instalación, puede seleccionar la instalación manual. La documentación se encuentra accesible en todo momento presionando Ctrl+Alt+F2.
it: Ti diamo il benvenuto nell'installatore del sistema GNU Guix! Ti guideremo attraverso un programma grafico di installazione. Se hai familiarità con GNU/Linux e vuoi aver un controllo più fine sul processo di installazione, puoi invece selezionare l'installazione manuale. La documentazione è accessibile in qualsiasi momento premendo Ctrl-Alt-F2.
zh_cn: 欢迎使用 GNU Guix 系统安装程序！ 您将通过图形安装程序进行引导。 如果您熟悉 GNU/Linux 并希望对安装过程进行严格控制，可以选择手动安装。按 Ctrl-Alt-F2 可随时访问文档。

source: Graphical install using a terminal based interface
es: Instalación gráfica mediante una interfaz basada en terminal
it: Installazione grafica con interfaccia a terminale
zh_cn: 使用基于终端的界面进行图形安装

source: Install using the shell based process
es: Instalación mediante el proceso basado en shell
it: Installa con il processo basato su shell
zh_cn: 使用基于 shell 的过程安装

source: Unable to find a wifi technology
es: No se pudo encontrar ninguna tecnología de red inalámbrica
it: Impossibile trovare un'interfaccia wifi
zh_cn: 无法找到 wifi 技术

source: Scanning wifi for available networks, please wait.
es: Buscando redes inalámbricas disponibles; por favor, espere.
it: Cerco reti wifi disponibili, attendi per favore.
zh_cn: 正在扫描可用的 wifi 网络，请稍候。

source: Scan in progress
es: Búsqueda en progreso
it: Scansione in corso
zh_cn: 扫描进行中

source: Please enter the wifi password.
es: Introduzca la contraseña para wifi.
it: Inserisci la password wifi per favore.
zh_cn: 请输入 wifi 密码。

source: The password you entered for ~a is incorrect.
es: La contraseña que introdujo para ~a es incorrecta.
it: La password che hai inserito per ~a non è corretta.
zh_cn: 您为 ~a 输入的密码不正确。

source: Wrong password
es: Contraseña incorrecta
it: Password sbagliata
zh_cn: 密码错误

source: An error occurred while trying to connect to ~a, please retry.
es: Ocurrió un error mientras se intentaba conectar a ~a. Vuelva a intentarlo.
it: Si è verificato un errore durante la connessione a ~a, riprova per favore.
zh_cn: 尝试连接到 ~a 时发生错误，请重试。

source: Connection error
es: Error de conexión
it: Problema di connessione
zh_cn: 连接错误

source: Please select a wifi network.
es: Seleccione una red wifi.
it: Seleziona una rete wifi per favore.
zh_cn: 请选择一个 wifi 网络。

source: Scan
es: Buscar
it: Scansione
zh_cn: 扫描

source: No wifi detected
es: No se detectó wifi
it: Nessun wifi rilevato
zh_cn: 未检测到 wifi

source: Could not open ~a after ~a retries~%.
es: No pudo abrir ~a tras ~a reintentos~%.
it: Impossibile aprire ~a dopo ~a tentativi~%.
zh_cn: 经过 ~a 次重试后无法打开 ~a~%。

source: Free space
es: Espacio libre
it: Spazio libero
zh_cn: 空闲空间

source: Name: ~a
es: Nombre: ~a
it: Nome: ~a
zh_cn: 名称：~a

source: None
es: No proporcionado
it: Nessuno
zh_cn: 无

source: Type: ~a
es: Tipo: ~a
it: Tipo: ~a
zh_cn: 类型：~a

source: File system type: ~a
es: Tipo de sistema de archivos: ~a
it: Tipo filesystem: ~a
zh_cn: 文件系统类型：~a

source: Bootable flag: ~:[off~;on~]
es: Marca «boot»: ~:[desactivada~;activada~]
it: Flag avviabile: ~:[off~;on~]
zh_cn: 可启动标志：~:[关闭~;开启~]

source: ESP flag: ~:[off~;on~]
es: Marca ESP: ~:[desactivada~;activada~]
it: flag ESP: ~:[off~;on~]
zh_cn: ESP 标志：~:[关闭~;开启~]

source: Size: ~a
es: Tamaño: ~a
it: Dimensione: ~a
zh_cn: 大小：~a

source: Encryption: ~:[No~a~;Yes (label '~a')~]
es: Cifrado: ~:[No~a~;Sí (etiqueta '~a')~]
it: Cifratura: ~:[No~a~;Yes (label"~a")~]
zh_cn: 加密：~:[无~a~;是（标签 '~a'）~]

source: Format the partition? ~:[No~;Yes~]
es: ¿Se dará formato a la partición? ~:[No~;Sí~]
it: Formattare la partizione? ~:[No~;Sì~]
zh_cn: 格式化分区？~:[否~;是~]

source: Mount point: ~a
es: Punto de montaje: ~a
it: Punto di montaggio: ~a
zh_cn: 挂载点：~a

source: ;; The list of file systems that get "mounted". The unique ;; file system identifiers there ("UUIDs") can be obtained ;; by running 'blkid' in a terminal.
es: ;; El listado de sistemas de archivo que obtiene "montado". Los ;; identificadores del sistema de archivos únicos allí ("UUIDs") ;; pueden ser obtenidos ejecutando en un terminal 'blkid'.
it: ;; L'elenco dei file system che vengono "montati". Gli identificatori ;; univoci di file system ("UUID") possono essere ottenuti ;; eseguendo 'blkid' in un terminale.
zh_cn: ;; 这是被“挂载”的文件系统列表。唯一的 ;; 文件系统标识符（“UUID”）可以通过 ;; 在终端运行 'blkid' 获得。

source: Device ~a is still in use.
es: El dispositivo ~a está todavía en uso.
it: Il dispositivo ~a è ancora in uso.
zh_cn: 设备 ~a 仍在使用中。

source: OpenSSH secure shell daemon (sshd)
es: Daemon de shell seguro OpenSSH (sshd)
it: Demone di shell sicura OpenSSH (sshd)
zh_cn: OpenSSH 安全 shell 守护进程（sshd）

source: ;; To configure OpenSSH, pass an 'openssh-configuration' ;; record as a second argument to 'service' below.
es: ;; Para configurar OpenSHH, pase un registro de 'openssh-configuration' ;; como un segundo argumento a 'service' a continuación.
it: ;; Per configurare OpenSSH, passa un record 'openssh-configuration' ;; come secondo argomento a 'service' qui sotto.
zh_cn: ;; 要配置 OpenSSH，请将 'openssh-configuration' ;; 记录作为第二个参数传递给下面的 'service'。

source: Tor anonymous network router
es: Encaminador de red anónima Tor
it: Router di rete anonimo Tor
zh_cn: Tor 匿名网络路由器

source: Network time service (NTP), to set the clock automatically
es: Servicio de hora en red (NTP), para establecer el reloj automáticamente
it: Servizio orario di rete (NTP), per impostare l'orologio automaticamente
zh_cn: 网络时间服务（NTP），用于自动设置时钟

source: GPM mouse daemon, to use the mouse on the console
es: Daemon de ratón GPM, para usar el ratón en la consola
it: Demone mouse GPM, per utilizzare il mouse sulla console
zh_cn: GPM 鼠标守护进程，用于在控制台使用鼠标

source: NetworkManager network connection manager
es: Gestor de conexiones de red NetworkManager
it: NetworkManager gestore delle connessioni di rete
zh_cn: NetworkManager 网络连接管理器

source: Connman network connection manager
es: Gestor de conexiones de red Connman
it: Manager di connessioni di rete Connman
zh_cn: Connman 网络连接管理器

source: DHCP client (dynamic IP address assignment)
es: Cliente DHCP (asignación de IP dinámica)
it: Client DHCP (assegnamento indirizzo IP dinamico)
zh_cn: DHCP 客户端（动态 IP 地址分配）

source: Static networking service.
es: Servicio de red estático.
it: Servizio di networking statico.
zh_cn: 静态网络服务。
