Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: (continuous integration information unavailable)~%
es: (información de integración continua no disponible)~%
it: (informazioni sull'integrazione continua non disponibili)~%
zh_cn: （持续集成信息不可用）~%

source: '~a' returned ~a (~s)~%
es: '~a' devolvió ~a (~s)~%
it: '~a' ha restituito ~a (~s)~%
zh_cn: '~a' 返回 ~a (~s)~%

source: ~,1f% (~h out of ~h) of the missing items are queued~%
es: ~,1f% (~h de ~h) de los elementos no encontrados están encolados~%
it: ~,1f% (~h su ~h) degli oggetti mancanti sono in coda~%
zh_cn: ~,1f% （~h 中的 ~h）缺失项目已排队~%

source: at least ~h queued builds~%
es: al menos ~h construcciones encoladas~%
it: almeno ~h build in coda~%
zh_cn: 至少 ~h 个排队构建~%

source: ~h queued builds~%
es: ~h construcciones encoladas~%
it: ~h build in coda~%
zh_cn: ~h 个排队构建~%

source: build rate: ~1,2f builds per hour~%
es: ratio de construcción: ~1,2f construcciones por hora~%
it: rateo di build: ~1,2f build all'ora~%
zh_cn: 构建速率：~1,2f 每小时构建~%

source: ~a: ~,2f builds per hour~%
es: ~a: ~,2f construcciones por hora~%
it: ~a: ~,2f build all'ora~%
zh_cn: ~a: ~,2f 每小时构建~%

source: Substitutes are missing for the following items:~%
es: Faltan sustituciones para los siguientes elementos:~%
it: Sostituti mancanti per gli oggetti seguenti:~%
zh_cn: 以下项目缺少替代品:~%

source: unknown system
es: sistema desconocido
it: sistema sconosciuto

source: Usage: guix weather [OPTIONS] [PACKAGES ...] Report the availability of substitutes.
es: Modo de empleo: guix weather [OPCIONES] [PAQUETES ...] Informa sobre la disponibilidad de sustituciones.
it: Uso: guix weather [OPZIONI] [PACCHETTI ...] Dà notizie sulla disponibilità di sostituti.

source: --substitute-urls=URLS check for available substitutes at URLS
es: --substitute-urls=URLS comprueba sustituciones disponibles en URLS
it: --substitute-urls=URLS controlla i sostituti disponibili su URLS

source: -m, --manifest=MANIFEST look up substitutes for packages specified in MANIFEST
es: -m, --manifest=MANIFIESTO busca sustituciones para paquetes especificados en MANIFIESTO
it: -m, --manifest=MANIFESTO cerca sostituti per i pacchetti specificati nel MANIFESTO
zh_cn: -m, --manifest=MANIFEST 查找 MANIFEST 中指定的包的替代品

source: -e, --expression=EXPR look up substitutes for the package EXPR evaluates to
es: -e, --expression=EXPR busca sustituciones para el paquete al que EXPR evalúa
it: -e, --expression=EXPR cerca sostituti per il pacchetto indicato dal risultato di EXPR
zh_cn: -e, --expression=EXPR 求值表达式 EXPR 得到的包的替代品

source: -c, --coverage[=COUNT] show substitute coverage for packages with at least COUNT dependents
es: -c, --coverage[=CUENTA] muestra la cobertura de sustituciones para paquetes con al menos CUENTA de paquetes dependientes
it: -c, --coverage[=N] mostra la copertura di sostituti per pacchetti che hanno almeno N dipendenti
zh_cn: -c, --coverage[=COUNT] 显示至少有 COUNT 个依赖项的包的替代覆盖率

source: --display-missing display the list of missing substitutes
es: --display-missing exhibe la lista de sustituciones que falten
it: --display-missing mostra la lista dei sostituti mancanti
zh_cn: --display-missing 显示缺失替代品的列表

source: ~a: invalid URL~%
es: ~a: URL no válida~%
it: ~a: URL non valido~%

source: The following ~a package is missing from '~a' for '~a':~%
es: El siguiente ~a paquete falta en '~a' para '~a':~%
it: Il seguente ~a pacchetto manca da '~a' per '~a':~%
zh_cn: 以下 ~a 包在 '~a' 中缺失，针对 '~a':~%

source: ~a package is missing from '~a' for '~a':~%
es: Falta ~a paquete de '~a' para '~a':~%
it: ~a pacchetto manca da '~a' per '~a':~%
zh_cn: ~a 包在 '~a' 中缺失，针对 '~a':~%

source: report on the availability of pre-built package binaries
es: información sobre la disponibilidad de binarios preconstruidos
it: dà notizie sulla disponibilità dei pacchetti binari precompilati
zh_cn: 关于预构建包二进制文件可用性的报告

source: using default substitute URLs~%
es: utilizando por defecto susticiones de las URL~%
it: uso gli URL dei sostituti predefiniti~%
zh_cn: 使用默认替代品 URL~%

source: The available formats are:
es: Los formatos disponibles son:
it: I formati disponibili sono:
zh_cn: 可用格式为:

source: ~a: unsupported output format~%
es: ~a: formato de salida no implementado~%
it: ~a: formato di output non supportato~%
zh_cn: ~a: 不支持的输出格式~%

source: Usage: guix describe [OPTION]... Display information about the channels currently in use.
es: Modo de empleo: guix describe [OPCIÓN]... Muestra información sobre los canales en uso actualmente.
it: Uso: guix describe [OPZIONE]... Mostra informazioni sui canali attualmente in uso.
zh_cn: 用法：guix describe [OPTION]... 显示当前使用的频道信息。

source: -f, --format=FORMAT display information in the given FORMAT
es: -f, --format=FORMATO muestra información en el FORMATO proporcionado
it: -f, --format=FORMATO mostra informazioni nel FORMATO scelto
zh_cn: -f, --format=FORMAT 以给定格式显示信息

source: --list-formats display available formats
es: --list-formats enumera los formatos disponibles
it: --list-formats mostra i formati disponibili
zh_cn: --list-formats 显示可用格式

source: -p, --profile=PROFILE display information about PROFILE
es: -p, --profile=PERFIL muestra información sobre PERFIL
it: -p, --profile=PROFILO mostra informazioni sul PROFILO
zh_cn: -p, --profile=PROFILE 显示关于 PROFILE 的信息

source: ~%;; warning: GUIX_PACKAGE_PATH="~a"~%
es: ~%;; aviso: GUIX_PACKAGE_PATH="~a"~%
it: ~%;; avviso: GUIX_PACKAGE_PATH="~a"~%
zh_cn: ~%;; 警告：GUIX_PACKAGE_PATH="~a"~%

source: 'GUIX_PACKAGE_PATH' is set but it is not captured~%
es: Se le ha asignado un valor a 'GUIX_PACKAGE_PATH' pero no se captura~%
it: 'GUIX_PACKAGE_PATH' è impostato ma non è catturato~%
zh_cn: 'GUIX_PACKAGE_PATH' 已设置，但未被捕获~%

source: failed to determine origin~%
es: no se pudo determinar el origen~%
it: impossibile determinare l'origine~%
zh_cn: 无法确定来源~%

source: Perhaps this @command{guix} command was not obtained with @command{guix pull}? Its version string is ~a.~%
es: ¿Es posible que este comando @command{guix} no se obtuviese con @command{guix pull}? Su cadena de versión es ~a.~%
it: Forse questo comando @command{guix} non è stato ottenuto con @command{guix pull}? La sua stringa di versione è ~a.~%
zh_cn: 也许这个 @command{guix} 命令不是通过 @command{guix pull} 获得的？它的版本 字符串是 ~a.~%

source: Git checkout:~%
es: Copia de trabajo Git:~%
it: checkout Git:~%

source: repository URL: ~a~%
es: URL del repositorio: ~a~%
it: URL del repository: ~a~%
zh_cn: 仓库 URL： ~a~%

source: describe the channel revisions currently used
es: describe las revisiones de los canales usadas actualmente
it: descrive le revisioni canale attualmente usate
zh_cn: 描述当前使用的频道修订版本

source: Usage: guix processes List the current Guix sessions and their processes.
es: Modo de empleo: guix processes Enumera las sesiones Guix actuales y sus procesos.
it: Uso: guix processes Elenca le sessioni Guix correnti e i loro processi.
zh_cn: 用法：guix processes 列出当前的 Guix 会话及其进程。

source: -f, --format=FORMAT display results as normalized record sets
es: -f, --format=FORMATO exhibe resultados como conjuntos de registros normalizados
it: -f, --format=FORMATO mostra i risultati come insiemi di record normalizzati
zh_cn: -f, --format=FORMAT 以标准化记录集显示结果

source: list currently running sessions
es: enumera las sesiones en ejecución actualmente
it: elenca le sessioni attualmente in esecuzione
zh_cn: 列出当前正在运行的会话

source: Usage: guix deploy [OPTION] FILE... Perform the deployment specified by FILE.
es: Modo de empleo: guix deploy [OPCIÓN] ARCHIVO... Realiza el despliegue especificado en ARCHIVO.
it: Uso: guix deploy [OPZIONE] FILE... Esegue il dispiego specificato da FILE.
zh_cn: 用法：guix deploy [OPTION] FILE... 执行 FILE 指定的部署。

source: -e, --expression=EXPR deploy the list of machines EXPR evaluates to
es: -e, --expression=EXPR despliega el listado de máquinas que EXPR evalúa
it: -e, --expression=EXPR dispiega la lista di macchine indicata dal risultato di EXPR
zh_cn: -e, --expression=EXPR 部署求值表达式 EXPR 得到的机器列表

source: -r, --roll-back switch to the previous operating system configuration
es: -r, --roll-back intercambia a la configuración previa del sistema operativo
it: -r, --roll-back torna alla configurazione precedente del sistema operativo
zh_cn: -r, --roll-back 切换到先前的操作系统配置

source: -x, --execute execute the following command on all the machines
es: -x, --execute ejecuta el siguiente comando en todas las máquinas
it: -x, --execute esegue il comando seguente su tutte le macchine
zh_cn: -x, --execute 在所有机器上执行以下命令

source: The following ~d machine would be rolled back:~%
es: La siguiente ~d máquina sería desenrollada:~%
it: Le ~d macchina seguente verrebbe ripristinata:~%
zh_cn: 以下 ~d 台机器将被回滚:~%

source: The following ~d machine would be deployed:~%
es: Sería desplegada ~d máquina mostrada a continuación:~%
it: La macchina ~d seguente verrebbe dispiegata:~%
zh_cn: 将部署以下 ~d 台机器：~%

source: The following ~d machine will be rolled back:~%
es: La siguiente ~d máquina será revertida:~%
it: Le ~d macchina seguente verrà ripristinata:~%
zh_cn: 将回滚以下 ~d 台机器：~%

source: The following ~d machine will be deployed:~%
es: Se desplegará ~d máquina desplegada a continuación:~%
it: La macchina ~d seguente sarà dispiegata:~%
zh_cn: 将部署以下 ~d 台机器：~%

source: deploying to ~a...~%
es: desplegando a ~a...~%
it: dispiego su ~a...~%

source: failed to deploy ~a: ~a~%
es: no se pudo desplegar ~a: ~a~%
it: il dispiego di ~a è fallito: ~a~%

source: rolling back ~a...~%
es: volviendo a la generación previa en ~a...~%
it: eseguo il rollback di ~a...~%
zh_cn: 正在回滚 ~a...~%

source: successfully deployed ~a~%
es: ~a desplegada satisfactoriamente~%
it: il dispiego di ~a è andato a buon fine~%
zh_cn: 成功部署 ~a~%

source: failed to roll back ~a: ~a~%
es: no se pudo restaurar ~a: ~a~%
it: impossibile ripristinare ~a: ~a~%

source: successfully rolled back ~a~%
es: ~a restaurar satisfactoriamente~%
it: eseguito correttamente il rollback di ~a~%

source: ~a: command succeeded~%
es: ~a: el comando ha tenido éxito~%
it: ~a: comando eseguito con successo~%

source: ~a: command exited with code ~a~%
es: ~a: el comando salió con código ~a~%
it: ~a: comando concluso con codice di uscita ~a~%

source: ~a: command stopped with signal ~a~%
es: ~a: comando detenido con señal ~a~%
it: ~a: comando fermato con il segnale ~a~%

source: ~a: command terminated with signal ~a~%
es: ~a: comando terminado con señal ~a~%
it: ~a: comando terminato con il segnale ~a~%
zh_cn: ~a：命令因信号 ~a 终止~%

source: command output on ~a:~%
es: salido de comando en ~a:~%
it: output del comando su ~a:~%

source: deploy operating systems on a set of machines
es: despliega sistemas operativos en un conjunto de máquinas
it: dispiega sistemi operativi su un insieme di macchine
zh_cn: 部署操作系统于一组机器上

source: both '--expression' and a deployment file were provided~%
es: tanto '--expression' como un fichero de despliegue fueron proporcionados~%
it: sono stati forniti sia '--expression' che un file di distribuzione~%
zh_cn: 同时提供了“--expression”和部署文件~%

source: missing deployment file argument~%
es: faltan argumentos para el archivo de despliegue~%
it: manca l'argomento file di dispiego~%
zh_cn: 缺少部署文件参数~%

source: '--' was used, but '-x' was not specified~%
es: '--' fue usado, pero '-x' no fue especificado~%
it: È stato utilizzato '--', ma non è stato specificato '-x'~%
zh_cn: 使用了“--”，但未指定“-x”~%

source: '-x' specified but no command given~%
es: '-x' especificado pero no se ha dado comando~%
it: specificata '-x' ma nessun comando fornito~%
zh_cn: 指定了“-x”，但未给出命令~%

source: resolving '~a' relative to current directory~%
es: la ruta de '~a' se considera relativa al directorio actual~%
it: risolvo '~a' relativamente alla directory corrente~%
zh_cn: 正在将“~a”解析为相对于当前目录~%

source: importing module~{ ~a~} from the host~%
es: importando el módulo~{ ~a~} de la máquina anfitriona~%
it: importo il modulo~{ ~a~} dall'host~%
zh_cn: 从主机导入模块~{ ~a~}~%

source: failed to download '~a': ~a (~a)~%
es: imposible descargar '~a': ~a (~a)~%
it: impossibile scaricare '~a': ~a (~a)~%

source: Updating to a specific version is not yet implemented for SourceForge.
es: La actualización a una versión específica aún no está implementada para SourceForge.
it: L'aggiornamento a una versione specifica non è ancora implementato per SourceForge.
zh_cn: 尚未为 SourceForge 实现更新到特定版本。

source: Updating to a partial version is not yet implemented for SourceForge.
es: La actualización a una versión parcial aún no está implementada para SourceForge.
it: L'aggiornamento a una versione parziale non è ancora implementato per SourceForge.
zh_cn: 尚未为 SourceForge 实现更新到部分版本。

source: Updater for GNU packages
es: Actualizador para paquetes GNU
it: Aggiornatore dei pacchetti GNU
zh_cn: GNU 软件包更新程序

source: Updater for GNU packages only available via FTP
es: Actualizador para paquetes GNU únicamente disponibles a través de FTP
it: Aggiornatore dei pacchetti disponibili solo via FTP
zh_cn: 仅通过 FTP 提供的 GNU 软件包更新程序

source: Updater for packages hosted on savannah.gnu.org
es: Actualizador para paquetes alojados en savannah.gnu.org
it: Aggiornatore dei pacchetti ospitati su savannah.gnu.org
zh_cn: 托管于 savannah.gnu.org 的软件包更新程序

source: Updater for packages hosted on sourceforge.net
es: Actualizador para paquetes alojados en sourceforge.net
it: Aggiornatore dei pacchetti ospitati su sourceforge.net
zh_cn: 托管于 sourceforge.net 的软件包更新程序

source: Updater for X.org packages
es: Actualizador para paquetes X.org
it: Aggiornatore dei pacchetti X.org
zh_cn: X.org 软件包更新程序

source: Updater for packages hosted on kernel.org
es: Actualizador para paquetes alojados en kernel.org
it: Aggiornatore dei pacchetti ospitati su kernel.org
zh_cn: 托管于 kernel.org 的软件包更新程序

source: Updater that crawls HTML pages.
es: Actualizador que examina páginas HTML.
it: Aggiornatore che perlustra pagine HTML.
zh_cn: 爬取 HTML 页面的更新程序。

source: Usage: guix container ACTION ARGS... Build and manipulate Linux containers.
es: Modo de empleo: guix container ACCIÓN PARÁMETROS... Construye y manipula contenedores Linux.
it: Utilizzo: guix container AZIONE ARG... Crea e manipola contenitori Linux.
zh_cn: 用法：guix container ACTION ARGS... 构建和操作 Linux 容器。

source: exec execute a command inside of an existing container
es: exec ejecuta una orden dentro de un contenedor existente
it: exec esegue un comando all'interno di un contenitore esistente
zh_cn: exec 在现有容器内执行命令

source: run code in containers created by 'guix environment -C'
es: ejecuta código en contenedores creados por 'guix environment -C'
it: eseguire il codice nei contenitori creati da 'guix environment -C'
zh_cn: 在由“guix environment -C”创建的容器中运行代码

source: guix container: missing action~%
es: guix container: acción no encontrada~%
it: guix container: azione mancante~%
zh_cn: guix container：缺少操作~%

source: guix container: invalid action~%
es: guix container: acción no válida~%
it: guix container: azione non valida~%
zh_cn: guix container：无效的操作~%

source: Usage: guix container exec PID COMMAND [ARGS...] Execute COMMAND within the container process PID.
es: Modo de empleo: guix container exec PID ORDEN [PARÁMETROS...] Ejecuta ORDEN dentro del proceso del contenedor PID.
it: Utilizzo: guix container exec PID COMANDO [ARGS...] Esegue COMANDO all'interno del PID del processo contenitore.
zh_cn: 用法：guix container exec PID COMMAND [ARGS...] 在容器进程 PID 内执行 COMMAND。

source: ~a: extraneous argument~%
es: ~a: parámetro no esperado~%
it: ~a: argomento estraneo~%

source: no pid specified~%
es: ningún PID especificado~%
it: nessun pid specificato~%
zh_cn: 未指定 pid~%

source: no command specified~%
es: ninguna orden especificada~%
it: nessun comando specificato~%
zh_cn: 未指定命令~%

source: no such process ~d~%
es: no existe el proceso ~d~%
it: processo ~d inesistente~%
zh_cn: 无此进程 ~d~%

source: process terminated with signal ~a~%
es: proceso terminado con señal ~a~%
it: processo terminato con il segnale ~a~%

source: process stopped with signal ~a~%
es: proceso detenido con señal ~a~%
it: processo fermato con il segnale ~a~%

source: process exited with status ~d~%
es: proceso terminado con estado ~d~%
it: processo uscito con stato ~d~%

source: invalid source replacement specification: ~s
es: especificación fuente de reemplazo no válida: ~s
it: specifica di rimpiazzo fonti non valida: ~s

source: invalid replacement specification: ~s
es: especificación de reemplazo no válida: ~s
it: specificazione di rimpiazzo non valida: ~s

source: the source of ~a is not a Git reference
es: la fuente de ~a no es una referencia Git
it: la fonte di ~a non è un riferimento Git
zh_cn: ~a 的来源不是 Git 引用

source: ~a: invalid Git URL replacement specification
es: ~a: especificación de URL de Git de reemplazo no válida
it: ~a: specificazione dell'URL Git di rimpiazzo non valida

source: ~a: invalid toolchain replacement specification
es: ~a: especificación de cadena de construcción de reemplazo no válida
it: ~a: specificazione per il rimpiazzo della toolchain non valida

source: failed to determine which compiler is used
es: no se pudo determinar que compilador se usa
it: impossibile determinare quale compilatore è in uso

source: failed to determine whether ~a supports ~a
es: fallo para determinar si ~a soporta ~a
it: impossibile determinare se ~a supporti ~a

source: compiler ~a does not support micro-architecture ~a
es: el compilador ~a no soporta la micro arquitectura ~a
it: il compilatore ~a non supporta la micro-architettura ~a
zh_cn: 编译器 ~a 不支持微架构 ~a

source: Compiler ~a does not support micro-architectures of ~a.
es: El compilador ~a no admite la micro arquitectura ~a.
it: Il compilatore ~a non supporta le microarchitetture di ~a.
zh_cn: 编译器 ~a 不支持 ~a 的微架构。

source: Compiler ~a supports the following ~a micro-architectures: @quotation ~a @end quotation
es: Compilador ~a acepta las siguientes ~a micro arquitecturas: @quotation ~a @end quotation
it: Il compilatore ~a supporta le seguenti ~a microarchitetture: @quotation ~a @end quotation
zh_cn: 编译器 ~a 支持以下 ~a 微架构： @quotation ~a @end quotation

source: tuning ~a for CPU ~a~%
es: ajustando ~a para CPU ~a~%
it: metto a punto ~a per la CPU ~a~%

source: ~a: invalid package configure flag specification
es: ~a: especificación de indicador de configuración del paquete no válido
it: ~a: specifica dei flag di configurazione pacchetto non valida

source: ~a: invalid package patch specification
es: ~a: especificación de parche de paquete no válido
it: ~a: specificazione di patch di pacchetto non valida

source: could not find version ~a of '~a' upstream~%
es: no se pudo encontrar la versión oficial ~a de '~a'~%
it: impossibile trovare la versione ~a del '~a' upstream~%

source: could not determine latest upstream release of '~a'~%
es: no se pudo determinar la última versión anterior de ~a~%
it: impossibile determinare l'ultima release di '~a'~%
zh_cn: 无法确定“~a”的最新上游版本~%

source: ~a is already the latest version of '~a'~%
es: ~a ya es la última versión de '~a'~%
it: ~a è già l'ultima versione di '~a'~%
zh_cn: ~a 已是“~a”的最新版本~%

source: using ~a ~a, which is older than the packaged version (~a)~%
es: utilizando ~a ~a, el cual es más antiguo que la versión empaquetada (~a)~%
it: utilizzando ~a ~a, che è più vecchia della versione confezionata (~a)~%
zh_cn: 使用 ~a ~a，版本比打包版本 (~a) 旧~%

source: cannot authenticate source of '~a', version ~a~%
es: no se puede autenticar la fuente de '~a', versión ~a~%
it: impossibile autenticare la sorgente di '~a', versione ~a~%
zh_cn: 无法验证“~a”版本 ~a 的来源~%

source: ~a: invalid upstream version specification
es: ~a: especificación de versión oficial no válida
it: ~a: specifica della versione upstream non valida

source: building for ~a instead of ~a, so tuning cannot be guessed~%
es: compilando para ~a en lugar de para ~a, de modo que no se puede adivinar la afinación~%
it: costruzione per ~a invece di ~a, quindi la messa a punto non può essere indovinata~%
zh_cn: 为 ~a 构建而非 ~a，因此无法猜测调优~%

source: Available package transformation options:~%
es: Opciones de transformación de paquetes disponibles:~%
it: Opzioni disponibili per la trasformazione pacchetti:~%
zh_cn: 可用的软件包转换选项：~%

source: --with-source=[PACKAGE=]SOURCE use SOURCE when building the corresponding package
es: --with-source=[PAQUETE=]FUENTE usa FUENTE para la construcción del paquete correspondiente
it: --with-source=[PACCHETTO=]SORGENTE usa SORGENTE durante la costruzione del pacchetto corrispondente
zh_cn: --with-source=[PACKAGE=]SOURCE 构建相应软件包时使用 SOURCE

source: --with-input=PACKAGE=REPLACEMENT replace dependency PACKAGE by REPLACEMENT
es: --with-input=PAQUETE=REEMPLAZO reemplaza la dependencia de PAQUETE por REEMPLAZO
it: --with-input=PACCHETTO=ALTRO rimpiazza il PACCHETTO dipendenza con un ALTRO
zh_cn: --with-input=PACKAGE=REPLACEMENT 用 REPLACEMENT 替换依赖软件包 PACKAGE

source: --with-graft=PACKAGE=REPLACEMENT graft REPLACEMENT on packages that refer to PACKAGE
es: --with-graft=PAQUETE=REEMPLAZO injerta REEMPLAZO en paquetes que hacen referencia a PAQUETE
it: --with-graft=PACCHETTO=SOSTITUZIONE innesta SOSTITUZIONE sui pacchetti che fanno riferimento a PACCHETTO
zh_cn: --with-graft=PACKAGE=REPLACEMENT 将 REPLACEMENT 嵌入引用 PACKAGE 的软件包中

source: --with-branch=PACKAGE=BRANCH build PACKAGE from the latest commit of BRANCH
es: --with-branch=PAQUETE=RAMA construye PAQUETE desde la última revisión de RAMA
it: --with-branch=PACCHETTO=RAMO costruisce PACCHETTO dall'ultimo commit del RAMO
zh_cn: --with-branch=PACKAGE=BRANCH 从 BRANCH 的最新提交构建 PACKAGE

source: --with-commit=PACKAGE=COMMIT build PACKAGE from COMMIT
es: --with-commit=PAQUETE=REVISIÓN construye PAQUETE desde REVISIÓN
it: --with-commit=PACCHETTO=COMMIT costruisce il PACCHETTO a partire da COMMIT
zh_cn: --with-commit=PACKAGE=COMMIT 从 COMMIT 构建 PACKAGE

source: --with-git-url=PACKAGE=URL build PACKAGE from the repository at URL
es: --with-git-url=PAQUETE=URL construye el PAQUETE del repositorio en URL
it: --with-git-url=PACCHETTO=URL costruisce PACCHETTO dal repository all'URL

source: --with-patch=PACKAGE=FILE add FILE to the list of patches of PACKAGE
es: --with-patch=PAQUETE=ARCHIVO añadir ARCHIVO a la lista de parches del PAQUETE
it: --with-patch=PACCHETTO=FILE aggiunge FILE all'elenco delle patch di PACCHETTO

source: --tune[=CPU] tune relevant packages for CPU--e.g., "skylake"
es: --tune[=CPU] ajusta los paquetes relevantes para la CPU--por ejemplo, "skylake"
it: --tune[=CPU] mette a punto i pacchetti rilevanti per la CPU indicata--es., "skylake"
zh_cn: --tune[=CPU] 针对 CPU 调优相关软件包——例如，“skylake”

source: --with-configure-flag=PACKAGE=FLAG append FLAG to the configure flags of PACKAGE
es: --with-configure-flag=PAQUETE=INDICADOR adjunta INDICADOR a los indicadores de configuración de PAQUETE
it: --with-configure-flag=PACCHETTO=FLAG aggiungi FLAG alla configurazione di PACCHETTO

source: --with-latest=PACKAGE use the latest upstream release of PACKAGE
es: --with-latest=PAQUETE utilice la última versión anterior de PAQUETE
it: --with-latest=PACCHETTO usa l'ultima release upstream di PACCHETTO

source: --with-version=PACKAGE=VERSION use the given upstream VERSION of PACKAGE
es: --with-version=PAQUETE=VERSIÓN utilice la última VERSIÓN proporcionada de PAQUETE
it: --with-version=PACKAGE=VERSION usa la tale VERSIONE upstream di questo PACCHETTO

source: --with-c-toolchain=PACKAGE=TOOLCHAIN build PACKAGE and its dependents with TOOLCHAIN
es: --with-c-toolchain=PAQUETE=CADENA_DE_CONSTRUCCIÓN construye PAQUETE y quienes dependan de él con CADENA_DE_CONSTRUCCIÓN
it: --with-c-toolchain=PACCHETTO=TOOLCHAIN costruisce PACCHETTO e i suoi dipendenti con TOOLCHAIN
zh_cn: --with-c-toolchain=PACKAGE=TOOLCHAIN 使用 TOOLCHAIN 构建 PACKAGE 及其依赖项

source: --with-debug-info=PACKAGE build PACKAGE and preserve its debug info
es: --with-debug-info=PAQUETE construye PAQUETE y conserva su información de depuración
it: --with-debug-info=PACCHETTO costruisce PACCHETTO e preserva le sue informazioni di debug
zh_cn: --with-debug-info=PACKAGE 构建 PACKAGE 并保留其调试信息
