Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: The build-machine object lacks a value for its 'systems' field.
es: El objeto de la máquina de construcción carece de un valor para su campo 'systems'.
it: L'oggetto build-machine manca di un valore per il suo campo 'systems'.
zh_cn: build-machine 对象缺少其 'systems' 字段的值。

source: '~a' did not return a list of build machines; ignoring it~%
es: '~a' no ha devuelto una lista de las máquinas de construcción; ignorarlo~%
it: '~a' non ha restituito un elenco di macchine di compilazione; lo ignoro~%
zh_cn: '~a' 未返回构建机器列表；已忽略~%

source: failed to open machine file '~a': ~a~%
es: fallo al abrir el archivo máquina '~a': ~a~%
it: impossibile aprire il file macchina '~a': ~a~%

source: failed to load machine file '~a': ~s~%
es: fallo al cargar el archivo máquina '~a': ~s~%
it: impossibile caricare il file macchina '~a': ~s~%

source: failed to load SSH private key from '~a': ~a
es: fallo al cargar la clave privada SSH desde '~a': ~a
it: fallito il caricamento della chiave privata SSH da '~a': ~a
zh_cn: 无法从 '~a' 加载 SSH 私钥：~a

source: SSH public key authentication failed for '~a': ~a~%
es: fallo la autenticación de la clave pública SSH por '~a': ~a~%
it: autenticazione con chiave pubblica SSH fallita per '~a': ~a~%
zh_cn: SSH 公钥认证失败，针对 '~a'：~a~%

source: failed to connect to '~a': ~a~%
es: fallo al conectar a '~a': ~a~%
it: impossibile connettersi a '~a': ~a~%

source: derivation '~a' offloaded to '~a' failed: ~a~%
es: derivación '~a' descargada a '~a' fallo: ~a~%
it: offload della derivazione '~a' su '~a' fallita: ~a~%
zh_cn: 派生 '~a' 转移到 '~a' 失败：~a~%

source: build failure may have been caused by lack of free disk space on '~a'~%
es: el fallo en la construcción puede estar causado por la falta de espacio de disco libre en '~a'~%
it: il fallimento della compilazione potrebbe essere stato causato dalla mancanza di spazio disco libero su '~a'~%
zh_cn: 构建失败可能是由于 '~a' 上缺少可用磁盘空间~%

source: failed to run 'guix repl' on machine '~a'~%
es: fallo para ejecutar 'guix repl' sobre máquina '~a'~%
it: fallita l'esecuzione di 'guix repl' sulla macchina '~a'~%

source: timeout expired while offloading '~a'~%
es: el tiempo de espera expiró mientras se descargaba '~a'~%
it: tempo scaduto durante l'offload di '~a'~%
zh_cn: 转移 '~a' 时超时~%

source: Guile-SSH lacks zlib support
es: Guile-SSH carece de soporte zlib
it: Guile-SSH non ha il supporto per zlib
zh_cn: Guile-SSH 缺少 zlib 支持

source: data transfers will *not* be compressed!
es: ¡los datos transferidos *no* serán comprimidos!
it: i trasferimenti di dati *non* saranno compressi!
zh_cn: 数据传输将*不会*被压缩！

source: '~a' is running GNU Guile ~a~%
es: '~a' está ejecutando GNU Guile ~a~%
it: '~a' impiega GNU Guile ~a~%
zh_cn: '~a' 正在运行 GNU Guile ~a~%

source: failed to run 'guix repl' on '~a'~%
es: fallo al ejecutar 'guix repl' sobre '~a'~%
it: impossibile eseguire 'guix repl' su '~a'~%

source: (guix) module not usable on remote host '~a'
es: (guix) módulo no utilizable sobre el host remoto '~a'
it: modulo (guix) non utilizzabile sull'host remoto '~a'
zh_cn: (guix) 模块在远程主机 '~a' 上不可用

source: Guix is usable on '~a' (test returned ~s)~%
es: Guix se puede usar en '~a' (la prueba devolvió ~s)~%
it: Guix è utilizzabile su '~a' (il test ha restituito ~s)~%
zh_cn: Guix 可用于 '~a'（测试返回 ~s）~%

source: failed to talk to guix-daemon on '~a' (test returned ~s)~%
es: fallo al hablar con el daemon guix sobre '~a' (prueba devuelta ~s)~%
it: fallita la comunicazione con guix-daemon su '~a' (il test ha restituito ~s)~%
zh_cn: 无法与 '~a' 上的 guix-daemon 通信（测试返回 ~s）~%

source: '~a' successfully imported '~a'~%
es: '~a' importado con éxito '~a'~%
it: '~a' ha importato con successo '~a'~%
zh_cn: '~a' 成功导入了 '~a'~%

source: '~a' was not properly imported on '~a'~%
es: '~a' no se importó apropiadamente sobre '~a'~%
it: '~a' non è stato importato correttamente su '~a'~%
zh_cn: '~a' 在 '~a' 上未正确导入~%

source: successfully imported '~a' from '~a'~%
es: importado con éxito '~a' desde '~a'~%
it: importazione riuscita di '~a' da '~a'~%
zh_cn: 成功从 '~a' 导入了 '~a'~%

source: failed to import '~a' from '~a'~%
es: fallo al importar '~a' desde '~a'~%
it: impossibile importare '~a' da '~a'~%

source: testing ~a build machines defined in '~a'...~%
es: probando ~a máquinas de construcción definidas en '~a'...~%
it: test di ~a macchine di build definite in '~a'...~%
zh_cn: 正在测试定义在 '~a' 中的 ~a 构建机器...~%

source: getting status of ~a build machines defined in '~a'...~%
es: obteniendo estatus de ~a máquinas de construcción definidas en '~a'...~%
it: recupero dello stato di ~a macchine di compilazione definite in '~a'...~%
zh_cn: 正在获取定义在 '~a' 中的 ~a 构建机器的状态...~%

source: machine '~a' is ~a seconds behind~%
es: la máquina '~a' está ~a segundos detrás~%
it: la macchina '~a' è indietro di ~a secondi~%
zh_cn: 机器 '~a' 落后 ~a 秒~%

source: set up and operate build offloading
es: configurar y utilizar la delegación de construcción
it: imposta e opera l'offload delle build
zh_cn: 设置并操作构建转移

source: invalid request line: ~s~%
es: línea de petición no válida: ~a~%
it: riga della richiesta non valida: ~s~%

source: Usage: guix offload SYSTEM MAX-SILENT-TIME PRINT-BUILD-TRACE? BUILD-TIMEOUT Process build offload requests written on the standard input, possibly offloading builds to the machines listed in '~a'.~%
es: Modo de empleo: guix offload SISTEMA MAX-SILENT-TIME PRINT-BUILD-TRACE? BUILD-TIMEOUT Procesa las peticiones de descarga de construcción escritas en la entrada estándar, posiblemente descargando construcciones a las máquinas listadas en '~a'.~%
it: Uso: guix offload SISTEMA TEMPO-MAX-SILENZIO STAMPA-TRACCIA-BUILD? TIMEOUT-BUILD Elabora le richieste di offload di costruzione scritte sull'input standard, possibilmente eseguendo l'offload delle costruzioni sulle macchine elencate in '~a'.~%
zh_cn: 用法：guix offload SYSTEM MAX-SILENT-TIME PRINT-BUILD-TRACE? BUILD-TIMEOUT 处理写入标准输入的构建转移请求，可能将构建转移到列在 '~a' 的机器上。~%

source: This tool is meant to be used internally by 'guix-daemon'.
es: Esta herramienta está hecha para uso interno en 'guix-daemon'.
it: Questo strumento è inteso per uso interno da parte di 'guix-daemon'.
zh_cn: 此工具旨在由 'guix-daemon' 内部使用。

source: invalid arguments: ~{~s ~}~%
es: argumentos no válidos: ~{~s ~}~%
it: argomenti non validi: ~{~s ~}~%

source: ~S is not in the store~%
it: ~S non è nell'archivio~%

source: ~a: missing URL~%
es: ~a: URL desaparecida~%
it: ~a: URL mancante~%

source: ~a: missing Git URL~%
es: ~a: falta la URL de Git~%
it: ~a: URL Git mancante~%

source: ~a: missing Git commit~%
es: ~a: falta un commit de Git~%
it: ~a: commit Git mancante~%

source: refusing to run with elevated privileges (UID ~a)~%
es: rechazando ejecutar con privilegios elevados (UID ~a)~%
it: rifiuto di eseguire con privilegi elevati (UID ~a)~%
zh_cn: 拒绝以提升的权限（UID ~a）运行~%

source: perform download described by fixed-output derivations
es: realizar la descarga descrita por las derivaciones de salida fija
it: esegui il download descritto dalle derivazioni ad output fissi

source: ~a: unknown builtin builder
es: ~a: desconoce construidor empotrado
it: ~a: builder interno sconosciuto

source: ~a is not a fixed-output derivation~%
es: ~a no es una derivación de salida fija~%
it: ~a non è una derivazione con output fissi~%

source: fixed-output derivation and output file name expected~%
es: se esperan derivación de salida fija y nombre de archivo de salida~%
it: derivazione ad output fisso e nome del file di output attesi~%
zh_cn: 预期固定输出派生和输出文件名~%

source: invalid module: ~a~%
es: módulo inválido: ~a~%
it: modulo non valido: ~a~%

source: ~a: invalid selection; expected `core', `non-core' or `module:NAME'~%
es: ~a: selección inválida; se esperaba `core', `non-core' o `module:NOMBRE'~%
it: ~a: selezione non valida; atteso `core', `non-core' o `module:NOME'~%
zh_cn: ~a：无效选择；预期为 `core`、`non-core` 或 `module:NAME`~%

source: Usage: guix refresh [OPTION]... [PACKAGE]... Update package definitions to match the latest upstream version. When PACKAGE... is given, update only the specified packages. Otherwise update all the packages of the distribution, or the subset thereof specified with `--select'.
es: Modo de empleo: guix refresh [OPCIÓN]... [PAQUETE]... Actualiza las definiciones de paquete para coincidir con la última versión anterior. Cuando se da PAQUETE..., actualiza sólo los paquetes especificados. De otro modo actualiza todos los paquetes de la distribución o el subconjunto de la misma especificado con `--select'.
it: Uso: guix refresh [OPZIONE]... [PACCHETTO]... Aggiorna le definizioni pacchetto in modo che corrispondano all'ultima versione upstream. Quando PACCHETTO... è usato, aggiorna solo i pacchetti dati. Altrimenti aggiorna tutti i pacchetti della distribuzione, o un sottoinsieme scelto con `--select'.
zh_cn: 用法：guix refresh [OPTION]... [PACKAGE]... 更新软件包定义以匹配最新的上游版本。 当提供 PACKAGE... 时，仅更新指定的软件包。否则， 更新发行版中的所有软件包，或使用 `--select` 指定的子集。

source: -u, --update update source files in place
es: -u, --update actualiza los archivos fuente en su lugar
it: -u, --update aggiorna i file sorgente in situ

source: -s, --select=SUBSET select all the packages in SUBSET, one of `core`, `non-core' or `module:NAME' (eg: module:guile) the module can also be fully specified as 'module:(gnu packages guile)'
es: -s, --select=SUBSET selecciona todos los paquetes en SUBSET, uno de `core`, `non-core' o `module:NOMBRE' (ej: module:guile) el módulo también puede ser especificado completamente como 'module:(gnu packages guile)'
it: -s, --select=SOTTOINSIEME seleziona tutti i pacchetti in SOTTOINSIEME, uno tra `core`, `non-core' o `module:NOME' (es: module:guile) il modulo può anche essere specificato completamente come 'module:(gnu packages guile)'
zh_cn: -s, --select=SUBSET 选择 SUBSET 中的所有软件包，SUBSET 为 `core`、 `non-core` 或 `module:NAME`（例如：module:guile） 模块也可以完全指定为 'module:(gnu packages guile)'

source: -m, --manifest=FILE select all the packages from the manifest in FILE
es: -m, --manifest=ARCHIVO selecciona todos los paquetes desde el manifiesto en ARCHIVO
it: -m, --manifest=FILE seleziona tutti i pacchetti dal manifest in FILE
zh_cn: -m, --manifest=FILE 从 FILE 中的清单选择所有软件包

source: --target-version=VERSION update the package or packages to VERSION VERSION may be partially specified, e.g. as 6 or 6.4 instead of 6.4.3
es: --target-version=VERSIÓN actualiza el paquete o paquetes a la VERSIÓN VERSIÓN puede ser especificada parcialmente p.e. como 6 o 6.4 en vez de 6.4.3
it: --target-version=VERSIONE aggiorna il pacchetto o i pacchetti alla VERSIONE VERSIONE può essere specificata parzialmente, es. come 6 o 6.4 invece di 6.4.3

source: -t, --type=UPDATER,... restrict to updates from the specified updaters (e.g., 'gnu')
es: -t, --type=ACTUALIZADOR,... restringe las actualizaciones desde los actualizadores especificados (p.ej., 'gnu')
it: -t, --type=AGGIORNATORE,... limita agli aggiornamenti dagli aggiornatori specificati (es., 'gnu')
zh_cn: -t, --type=UPDATER,... 限制为指定更新器的更新 （例如，'gnu'）

source: --list-updaters list available updaters and exit
es: --list-updaters lista los actualizadores disponibles y termina
it: --list-updaters elenca gli aggiornatori disponibili ed esce
zh_cn: --list-updaters 列出可用的更新器并退出

source: -l, --list-dependent list top-level dependent packages that would need to be rebuilt as a result of upgrading PACKAGE...
es: -l, --list-dependent lista los paquetes dependientes de alto nivel que sería necesario reconstruir como resultado de la actualización de PAQUETE...
it: -l, --list-dependent elenca i pacchetti dipendenti di primo livello che dovrebbero essere ricompilati come risultato dell'aggiornamento di PACCHETTO...
zh_cn: -l, --list-dependent 列出升级 PACKAGE 后需要重建的顶层依赖包...

source: -r, --recursive check the PACKAGE and its inputs for upgrades
es: -r, --recursive comprueba el PAQUETE y sus entradas para actualizaciones
it: -r, --recursive controlla PACCHETTO e i suoi input per aggiornamenti
zh_cn: -r, --recursive 检查 PACKAGE 及其输入项的升级情况

source: -T, --list-transitive list all the packages that PACKAGE depends on
es: -T, --list-transitive lista todos los paquetes de los que depende PAQUETE
it: -T, --list-transitive elenca tutti i pacchetti da cui PACCHETTO dipende
zh_cn: -T, --list-transitive 列出 PACKAGE 依赖的所有软件包

source: --keyring=FILE use FILE as the keyring of upstream OpenPGP keys
es: --keyring=ARCHIVO utiliza ARCHIVO como el anillo de las claves OpenPGP anteriores
it: --keyring=FILE usa FILE come portachiavi delle chiavi OpenPGP upstream
zh_cn: --keyring=FILE 使用 FILE 作为上游 OpenPGP 密钥环

source: --key-server=HOST use HOST as the OpenPGP key server
es: --key-server=HOST utiliza HOST como el servidor de clave OpenPGP
it: --key-server=HOST usa HOST come server di chiavi OpenPGP
zh_cn: --key-server=HOST 使用 HOST 作为 OpenPGP 密钥服务器

source: --gpg=COMMAND use COMMAND as the GnuPG 2.x command
es: --gpg=COMANDO utiliza COMANDO como el comando GnuPG 2.x
it: --gpg=COMANDO usa COMANDO come comando GnuPG 2.x
zh_cn: --gpg=COMMAND 使用 COMMAND 作为 GnuPG 2.x 命令

source: --key-download=POLICY handle missing OpenPGP keys according to POLICY: 'auto', 'always', 'never', and 'interactive'. When left unspecified, the default policy is 'auto', which automatically selects interactive or always.
es: --key-download=NORMATIVA maneja claves OpenPGP desaparecidas de acuerdo a NORMATIVA 'auto', 'always', 'never' e 'interactive'. Cuando deje no especificado la normativa predeterminada es 'auto', la cual auto-selecciona interactive o always.
it: --key-download=POLITICA gestisce le chiavi OpenPGP mancanti secondo la POLITICA: 'auto', 'always', 'never', e 'interactive'. Se non specificata, la politica predefinita è 'auto', che seleziona automaticamente interactive o always.
zh_cn: --key-download=POLICY 根据 POLICY 处理缺失的 OpenPGP 密钥： 'auto'、'always'、'never' 和 'interactive'。 如果未指定，默认策略为 'auto'， 会自动选择 interactive 或 always。

source: ~a: no such updater~%
es: ~a: no hay tal actualizador~%
it: ~a: aggiornatore inesistente~%
zh_cn: ~a：无此更新程序~%

source: Available updaters:~%
es: Actualizadores disponibles:~%
it: Aggiornatori disponibili:~%
zh_cn: 可用的更新程序：~%

source: - ~a: ~a (~2,1f% coverage)~%
es: - ~a: ~a (~2,1f% de cobertura)~%
it: - ~a: ~a (~2,1f% di copertura)~%
zh_cn: - ~a：~a (~2,1f% 覆盖率)~%

source: ~2,1f% of the packages are covered by these updaters.~%
es: ~2,1f% de los paquetes están cubiertos por estos actualizadores.~%
it: Il ~2,1f% dei pacchetti è coperto da questi aggiornatori.~%
zh_cn: ~2,1f% 的软件包被这些更新程序覆盖。~%

source: no updater for ~a~%
es: sin actualizador para ~a~%
it: aggiornatore mancante per ~a~%

source: ~a: updating from version ~a to version ~a...~%
es: ~a: actualizado de versión ~a a versión ~a...~%
it: ~a: aggiorno dalla versione ~a alla versione ~a...~%

source: ~a: version ~a could not be downloaded and authenticated; not updating~%
es: ~a: versión ~a no pudo ser descargada y autenticada; no se actualizó~%
it: ~a: la versione ~a non ha potuto essere scaricata e autenticata; non aggiorno~%
zh_cn: ~a：版本 ~a 无法下载和认证；不进行更新~%

source: ~a would be upgraded from ~a to ~a~%
es: ~a se actualizaría de ~a a ~a~%
it: ~a verrebbe aggiornato da ~a a ~a~%

source: ~a is already the latest version of ~a~%
es: ~a ya es la última versión de ~a~%
it: ~a è già l'ultima versione di ~a~%
zh_cn: ~a 已是 ~a 的最新版本~%

source: ~a would be downgraded from ~a to ~a~%
es: ~a se rebajaría de ~a a ~a~%
it: ~a verrebbe retrocesso da ~a a ~a~%

source: ~a is greater than the latest known version of ~a (~a)~%
es: ~a es más grande que la última versión conocida de ~a (~a)~%
it: ~a è maggiore dell'ultima versione nota di ~a (~a)~%
zh_cn: ~a 高于已知的 ~a 最新版本 (~a)~%

source: '~a' updater failed to find version ~a of '~a'~%
es: '~a' fallo en el actualizador al encontrar la versión ~a de '~a'~%
it: l'updater '~a' non ha trovato la versione ~a di '~a'~%

source: '~a' updater failed to determine available releases for ~a~%
es: '~a' fallo en el actualizador para determinar las versiones disponibles para ~a~%
it: l'aggiornatore '~a' non è riuscito a determinare le release disponibili per ~a~%
zh_cn: '~a' 更新程序未能确定 ~a 的可用版本~%

source: No dependents other than itself: ~{~a~}~%
es: Sin dependiente aparte de si mismo: ~{~a~}~%
it: Nessun dipendente oltre a sé stesso: ~{~a~}~%

source: A single dependent package: ~a~%
es: Un solo paquete dependiente: ~a~%
it: Un singolo pacchetto dipendente: ~a~%
zh_cn: 单个依赖软件包：~a~%

source: Building the following ~d package would ensure ~d dependent packages are rebuilt: ~{~a~^ ~}~%
es: Construyendo el siguiente ~d paquete aseguraría que ~d paquetes dependientes son reconstruidos: ~{~a~^ ~}~%
it: La compilazione del seguente ~d pacchetto assicurerebbe la ricompilazione di ~d pacchetto dipendente: ~{~a~^ ~}~%
zh_cn: 构建以下 ~d 个软件包将触发 ~d 个依赖包的重建：~{~a~^ ~}~%

source: ~a depends on the following ~d packages: ~{~a~^ ~}~%.
es: ~a depende de los siguientes ~d paquetes: ~{~a~^ ~}~%.
it: ~a dipende dai seguenti ~d pacchetti: ~{~a~^ ~}~%.
zh_cn: ~a 依赖以下 ~d 个软件包：~{~a~^ ~}~%。

source: The following ~d packages all are dependent packages: ~{~a~^ ~}~%
es: Los siguientes ~d paquetes son todos paquetes dependientes: ~{~a~^ ~}~%
it: I seguenti ~d pacchetti sono tutti pacchetti dipendenti: ~{~a~^ ~}~%
zh_cn: 以下 ~d 个软件包均为依赖软件包：~{~a~^ ~}~%

source: update existing package definitions
es: actualizar las definiciones existentes de los paquetes
it: aggiorna definizioni pacchetto esistenti
zh_cn: 更新现有软件包定义

source: Usage: guix repl [OPTIONS...] [-- FILE ARGS...] In the Guix execution environment, run FILE as a Guile script with command-line arguments ARGS. If no FILE is given, start a Guile REPL.
es: Modo de empleo: guix repl [OPCIONES...] [-- ARCHIVO ARGUMENTOS...] En el entorno de ejecución Guix, ejecuta ARCHIVO como secuencia de comandos Guile con los argumentos de línea de comandos ARGUMENTOS. Si no se da ARCHIVO, inicia un Guile REPL.
it: Uso: guix repl [OPZIONI...] [-- FILE ARGOMENTI...] Nell'ambiente di esecuzione Guix, esegue FILE come uno script Guile passandogli gli ARGOMENTI dati. Senza un FILE, avvia un REPL Guile.
zh_cn: 用法：guix repl [OPTIONS...] [-- FILE ARGS...] 在 Guix 执行环境中，将 FILE 作为 Guile 脚本运行， 并传递命令行参数 ARGS。如果未指定 FILE，则启动 Guile REPL。

source: --list-types display REPL types and exit
es: --list-types muestra tipos de REPL y finaliza
it: --list-types mostra i tipi di REPL ed esce

source: -t, --type=TYPE start a REPL of the given TYPE
es: -t, --type=TIPO inicia un REPL del TIPO proporcionado
it: -t, --type=TIPO avvia un REPL del TIPO specificato
zh_cn: -t, --type=TYPE 启动指定 TYPE 的 REPL

source: --listen=ENDPOINT listen to ENDPOINT instead of standard input
es: --listen=ENDPOINT escucha en ENDPOINT en lugar de en la entrada estándar
it: --listen=ENDPOINT si mette in ascolto su ENDPOINT invece che sull'input standard
zh_cn: --listen=ENDPOINT 监听 ENDPOINT 而非标准输入

source: -q inhibit loading of ~/.guile
es: -q inhibe la carga de ~/.guile
it: -q impedisci il caricamenteo di ~/.guile

source: -i, --interactive launch REPL after evaluating FILE
es: -i, --interactive lanza REPL después de evaluar el FICHERO
it: -i, --interactive lancia un REPL dopo aver valutato FILE
zh_cn: -i, --interactive 在求值 FILE 后启动 REPL

source: ~A: invalid listen specification~%
es: ~A: especificación de escucha no válida~%
it: ~A: specificazione di ascolto non valida~%
zh_cn: ~A: 无效的监听规范~%

source: ~A: unsupported protocol family~%
es: ~A: familia de protocolos no implementada~%
it: ~A: famiglia di protocolli non supportata~%
zh_cn: ~A：不支持的协议族~%

source: accepted connection~%
es: aceptada conexión desde~%
it: connessione accettata~%
zh_cn: 连接已接受~%

source: accepted connection from ~a~%
es: aceptada conexión desde ~a~%
it: accettata connessione da ~a~%
zh_cn: 正在接受来自 ~a 的连接~%

source: connection closed~%
es: conexión cerrada~%
it: connessione chiusa~%
zh_cn: 连接已关闭~%

source: read-eval-print loop (REPL) for interactive programming
es: bucle de lectura-evaluación-impresión (REPL) para programación interactiva
it: read-eval-print loop (REPL) per la programmazione interattiva
zh_cn: 用于交互式编程的读取-求值-输出循环（REPL）

source: ~a: unknown type of REPL~%
es: ~a: tipo de REPL desconocido~%
it: ~a: tipo di REPL sconosciuto~%
zh_cn: ~a: 未知 REPL 类型~%

source: guix-daemon -- perform derivation builds and store accesses
es: guix-daemon -- realiza construcciones de derivaciones y accesos al almacén
it: guix-daemon -- esegue compilazioni di derivazioni e accessi allo store
zh_cn: guix-daemon -- 执行派生构建和存储访问

source: This program is a daemon meant to run in the background. It serves requests sent over a Unix-domain socket. It accesses the store, and builds derivations on behalf of its clients.
es: Este programa es un daemon destinado a la ejecución en segundo plano. Responde a las peticiones enviadas por un socket de dominio Unix. Accede al almacén y construye derivaciones en delegación de sus clientes.
it: Questo programma è un demone pensato per essere eseguito in background. Serve richieste inviate tramite un socket di dominio Unix. Accede allo store e compila derivazioni per conto dei suoi client.
zh_cn: 此程序是一个守护进程，旨在后台运行。它通过 Unix 域套接字处理请求，访问存储，并代表客户端构建派生。

source: SYSTEM
es: SISTEMA
it: SISTEMA
zh_cn: 系统

source: assume SYSTEM as the current system type
es: asume SISTEMA como el tipo de sistema actual
it: assumi il tipo di SISTEMA corrente indicato
zh_cn: 假设 <系统> 为当前系统类型

source: use N CPU cores to build each derivation; 0 means as many as available
es: usa N núcleos de la CPU para construir cada derivación; 0 significa tantos como estén disponibles
it: usa N core della CPU per costruire ciascuna derivazione; 0 significa il massimo numero disponibile
zh_cn: 使用 N 个 CPU 核心来构建每个派生；0 表示使用所有可用核心

source: allow at most N build jobs
es: permite como máximo N trabajos de construcción
it: permetti al massimo N build contemporanee
zh_cn: 最多允许 N 个构建任务

source: SECONDS
es: SEGUNDOS
it: SECONDI
zh_cn: 秒

source: mark builds as failed after SECONDS of activity
es: marca las construcciones como fallidas tras SEGUNDOS de actividad
it: segna le build come fallite dopo tot SECONDI di attività
zh_cn: 在活动持续 SECONDS 秒后将构建标记为失败

source: mark builds as failed after SECONDS of silence
es: marca las construcciones como fallidas tras SEGUNDOS de silencio
it: segna le build come fallite dopo tot SECONDI di silenzio
zh_cn: 在静默持续 SECONDS 秒后将构建标记为失败

source: disable chroot builds
es: desactiva las construcciones en chroot
it: disabilita le build in chroot
zh_cn: 禁用 chroot 构建

source: add DIR to the build chroot
es: añade DIR al chroot de construcción
it: aggiungi DIR al chroot della build
zh_cn: 将 DIR 添加到构建 chroot 中

source: GROUP
es: GRUPO
it: GRUPPO
zh_cn: 组

source: perform builds as a user of GROUP
es: realiza las construcciones como un usuario del GRUPO
it: svolgi le build come utente di GRUPPO
zh_cn: 以 GROUP 用户身份执行构建

source: do not use substitutes
es: no usa sustituciones
it: non usare sostituti
zh_cn: 不使用替代品

source: use URLS as the default list of substitute providers
es: usa URLS como lista predeterminada de proveedoras de sustituciones
it: usa URLS come lista di default dei fornitori di sostituti
zh_cn: 使用 URLS 作为默认的替代提供者列表

source: do not attempt to offload builds
es: no intenta delegar las construcciones
it: non tentare l'offload delle build
zh_cn: 不尝试卸载构建

source: cache build failures
es: almacena los fallos de construcción en la caché
it: mantiene una cache delle build fallite
zh_cn: 对构建失败进行缓存

source: build each derivation N times in a row
es: construye cada derivación N veces seguidas
it: costruisce ciascuna derivazione per N volte di seguito
zh_cn: 连续构建每个派生 N 次

source: do not keep build logs
es: no mantiene los registros de construcción
it: non tenere log delle compilazioni
zh_cn: 不要保留构建日志

source: disable compression of the build logs
es: desactiva la compresión de los registros de construcción
it: disabilita la compressione dei log delle compilazioni
zh_cn: 禁用构建日志压缩
