Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: Run @command{ipfs daemon}, the reference implementation of the IPFS peer-to-peer storage network.
es: Ejecute @command{ipfs daemon}, la implementación de referencia de la red de almacenaje punto a punto de IPFS.
it: Esegue @command{ipfs daemon}, l'implementazione di riferimento della rete di archiviazione peer-to-peer IPFS.
zh_cn: 运行 @command{ipfs daemon}，IPFS 点对点存储网络的参考实现。

source: Run @uref{https://www.keepalived.org/, Keepalived} routing software.
es: Ejecute @uref{https://www.keepalived.org/, Keepalived} software de enrutado.
it: Esegue @uref{https://www.keepalived.org/, Keepalived}, un software di routing.
zh_cn: 运行 @uref{https://www.keepalived.org/, Keepalived} 路由软件。

source: the 'share-path' and 'share-comment' fields is deprecated, please use 'modules' instead~%
es: los campos 'system-path' y 'share-comment' están obsoletos, utilice en su lugar 'modules'~%
it: i campi 'share-path' e 'share-comment' sono deprecati, usa 'modules' al loro posto~%

source: Run the rsync file copying tool in daemon mode. This allows remote hosts to keep synchronized copies of the files exported by rsync.
es: Ejecute la herramienta de copia de archivos rsync en modo daemon. Esta le permite a hosts remotos conservar copias sincronizadas de los archivos exportados por rsync.
it: Esegui lo strumento di copia file rsync in modalità demone. Ciò consente agli host remoti di mantenere copie sincronizzate dei file esportati da rsync.
zh_cn: 以守护进程模式运行 rsync 文件复制工具。这允许远程主机保持与 rsync 导出的文件同步的副本。

source: Run @uref{https://www.samba.org/, Samba}, a network file and print service for all clients using the SMB/CIFS protocol. Samba is an important component to seamlessly integrate Linux/Unix Servers and Desktops into Active Directory environments. It can function both as a domain controller or as a regular domain member.
es: Ejecute @uref{https://www.samba.org/, Samba}, un servicio de ficheros e impresión en red para todos los clientes que utilicen el protocolo SMB/CIFS. Samba es un componente importante para integrar sin problemas servidores y escritorios Linux/Unix en entornos Active Directory. Puede funcionar como controlador de dominio o como un miembro normal del dominio.
it: Esegue @uref{https://www.samba.org/, Samba}, un servizio di file e stampa di rete per tutti i client che utilizzano il protocollo SMB/CIFS. Samba è un componente importante per integrare senza problemi i server e i desktop Linux/Unix in ambienti Active Directory. Può funzionare sia come controller di dominio che come membro regolare di un dominio.
zh_cn: 运行 @uref{https://www.samba.org/, Samba}，一个为所有使用 SMB/CIFS 协议的客户端提供网络文件和打印服务的软件。Samba 是无缝集成 Linux/Unix 服务器和桌面到 Active Directory 环境的重要组件。它既可以作为域控制器，也可以作为普通域成员运行。

source: Web Service Discovery Daemon
es: Daemon de descubrimiento de servicios Web
it: Demone per la scoperta dei servizi web
zh_cn: Web 服务发现守护进程

source: fail2ban: '~a' is not a supported backend~%
es: fail2ban: '~a' no es un backend mantenido~%
it: fail2ban: '~a' non è un backend supportato~%
zh_cn: fail2ban: 不支持 '~a' 后端 ~%

source: fail2ban: '~a' is not a supported log encoding~%
es: fail2ban: '~a' no es una codificación de registro mantenida~%
it: fail2ban: '~a' non è una codifica del log supportata~%
zh_cn: fail2ban: 不支持 '~a' 日志编码~%

source: Run the fail2ban server.
es: Ejecuta el servidor fail2ban.
it: Lancia il server fail2ban.
zh_cn: 运行 fail2ban 服务器。

source: Run the GNU Shepherd as PID 1---i.e., the operating system's first process. The Shepherd takes care of managing services such as daemons by ensuring they are started and stopped in the right order.
es: Ejecuta GNU Shepherd con el PID 1---es decir, el primer proceso del sistema operativo. Shepherd se encarga de la gestión de servicios, como un daemon, y se asegura de que se arrancan y paran en el orden correcto.
it: Esegue GNU Shepherd come PID 1---cioè come primo processo del sistema operativo. Lo Shepherd si occupa di organizzare servizi come i demoni verificando che siano avviati e fermati nell'ordine corretto.
zh_cn: 以 PID 1 运行 GNU Shepherd——即操作系统的第一个进程。Shepherd 负责管理服务，例如守护进程，确保它们按正确的顺序启动和停止。

source: 'provision' must be a non-empty list of symbols
es: 'provision' debe ser un listado no vacío de símbolos
it: 'provision' deve essere una lista non vuota di simboli
zh_cn: 'provision' 必须是一个非空的符号列表

source: service '~a' provided more than once
es: se proporciona el servicio '~a' más de una vez
it: servizio '~a' fornito più di una volta
zh_cn: 服务 '~a' 被提供了多次

source: service '~a' requires '~a', which is not provided by any service
es: el servicio '~a' necesita '~a', que no se proporciona por ningún servicio
it: il servizio '~a' richiede '~a', che non è fornito da nessun servizio
zh_cn: 服务 '~a' 需要 '~a'，但没有任何服务提供该服务

source: The @code{user-processes} service is responsible for terminating all the processes so that the root file system can be re-mounted read-only, just before rebooting/halting. Processes still running after a few seconds after @code{SIGTERM} has been sent are terminated with @code{SIGKILL}.
es: El servicio @code{user-processes} es responsable de terminar todos los procesos de modo que el sistema de archivos raíz pueda montarse en modo de solo-lectura, justo antes de reiniciar/detener. Los procesos que todavía permanezcan en ejecución tras pasar algunos segundos desde el envío de la señal @code{SIGTERM} se finalizan con la señal @code{SIGKILL}.
it: Il servizio @code{user-processes} è responsabile di terminare tutti i processi in modo tale che il file system radice possa essere ri-montato in sola lettura, appena prima del riavvio/spegnimento. I processi ancora in esecuzione dopo alcuni secondi dall'invio di @code{SIGTERM} saranno terminati usando @code{SIGKILL}.
zh_cn: @code{user-processes} 服务负责终止所有进程，以便在重启/停止之前可以重新挂载根文件系统为只读。在发送 @code{SIGTERM} 后几秒钟仍在运行的进程将被 @code{SIGKILL} 终止。

source: The Shepherd @code{timer} service lets you schedule commands dynamically, similar to the @code{at} command that your grandparents would use on that Slackware they got on a floppy disk. For example, consider this command: @example herd schedule timer at 07:00 -- mpg123 Music/alarm.mp3 @end example It does exactly what you would expect.
es: El servicio @code{timer} de Shepherdlets planifica instrucciones dinámicamente, similar a la instrucción @code{at} que sus abuelos usarían en ese Slackware obtuvo en un disco floppy. Por ejemplo considere este comando: @example herd schedule timer at 07:00 -- mpg123 Music/alarm.mp3 @end example Hace exactamente lo que esperarías.
it: Il servizio Shepherd @code{timer} consente di pianificare i comandi in modo dinamico, in modo simile al comando @code{at} che i tuoi nonni usavano su quello Slackware che avevano su un floppy disk. Ad esempio, considera questo comando: @example herd schedule timer at 07:00 -- mpg123 Music/alarm.mp3 @end example Fa esattamente ciò che ti aspetteresti.
zh_cn: Shepherd 的 @code{timer} 服务让您动态调度命令，类似于您的祖父母在他们的软盘 Slackware 上使用的 @code{at} 命令。例如，考虑这个命令： @example herd schedule timer at 07:00 -- mpg123 Music/alarm.mp3 @end example 它的效果正如您所期待的那样。

source: The Shepherd @code{transient} service lets you run commands asynchronously, in the background, similar to @command{systemd-run}, as in this example: @example herd spawn transient -E SSH_AUTH_SOCK=$SSH_AUTH_SOCK -- \ rsync -e ssh -vur . backup.example.org: @end example This runs @command{rsync} in the background, as a service that you can inspect with @command{herd status} and stop with @command{herd stop}.
es: El servicio @code{transient} de Shepherd le permite ejecutar comandos asíncronicamente, en segundo plano, similar a @command{systemd-run}, como en este ejemplo: @example herd spawn transient -E SSH_AUTH_SOCK=$SSH_AUTH_SOCK -- \ rsync -e ssh -vur . respaldo.ejemplo.org: @end example Esto ejecuta @command{rsync} en segundo plano, como un servicio que pude inspeccionar con @command{herd status} y detener con @command{herd stop}.
it: Il servizio Shepherd @code{transient} consente di eseguire comandi in modo asincrono, in background, in modo simile a @command{systemd-run}, come in questo esempio: @example herd spawn transient -E SSH_AUTH_SOCK=$SSH_AUTH_SOCK -- \ rsync -e ssh -vur . backup.example.org: @end example Questo esegue @command{rsync} in background, come un servizio che puoi ispezionare con @command{herd status} e arrestare con @command{herd stop}.
zh_cn: Shepherd 的 @code{transient} 服务让您异步运行命令，在后台，类似于 @command{systemd-run}，如下例所示： @example herd spawn transient -E SSH_AUTH_SOCK=$SSH_AUTH_SOCK -- \ rsync -e ssh -vur . backup.example.org: @end example 这将在后台运行 @command{rsync}，作为您可以使用 @command{herd status} 检查并使用 @command{herd stop} 停止的服务。

source: The Shepherd's @code{system-log} service plays the role of traditional @command{syslogd} program, reading data logged by daemons to @file{/dev/log} and writing it to several files in @file{/var/log} according to user-provided dispatching rules.
es: El servicio @code{system-log} de Shepherd reproduce el rol de programa tradicional de @command{syslogd}, leyendo datos registrados por daemon a @file{/dev/log} y escribiendo a varios archivos en @file{/var/log} de acuerdo a usuario-proporcionado despachando reglas.
it: Il servizio @code{system-log} di Shepherd svolge il ruolo del tradizionale programma @command{syslogd}, leggendo i dati registrati dai daemon in @file{/dev/log} e scrivendoli in diversi file in @file{/var/log} in base alle regole di distribuzione fornite all'utente.
zh_cn: Shepherd 的 @code{system-log} 服务充当传统的 @command{syslogd} 程序，读取守护进程记录到 @file{/dev/log} 的数据，并根据用户提供的调度规则将其写入 @file{/var/log} 中的多个文件。

source: Configure low-level Linux sound support, ALSA.
es: Configure soporte de sonido Linux a bajo nivel, ALSA.
it: Configura il supporto audio a basso livello di Linux, ALSA.
zh_cn: 配置低级 Linux 声音支持，ALSA。

source: ~a is not a local-file, plain-file or computed-file object~%
es: ~a no es un objeto de local-file, plain-file o computed-file~%
it: ~a non è un oggetto local-file, plain-file o computed-file~%
zh_cn: ~a 不是本地文件、普通文件或计算文件对象~%

source: `~a' lacks the required `.pa' file name extension~%
es: `~a' carece de extensión de nombre de archivo `.pa' requerida~%
it: `~a' non ha l'estensione richiesta `.pa'~%
zh_cn: `~a' 缺少所需的 `.pa' 文件名扩展名~%

source: Configure PulseAudio sound support.
es: Configura el soporte de sonido PulseAudio.
it: Configura il supporto audio PulseAudio.
zh_cn: 配置 PulseAudio 声音支持。

source: Configure LADSPA plugins.
es: Configura complementos LADSPA.
it: Configura i plugin LADSPA.
zh_cn: 配置 LADSPA 插件。

source: Run @command{speakersafetyd}, a user space daemon that implements an analogue of the Texas Instruments Smart Amp speaker protection model. It can be used to protect the speakers on Apple Silicon devices.
es: Ejecute @command{speakersafetyd},un daemon en espacio de usuario que implementa un análogo del modelo de la protección de escucha de Texas Instruments Smart Amp. Puede ser utilizado para proteger los altavoces en dispositivos Apple Silicon.
it: Esegui @command{speakersafetyd}, un demone dello spazio utente che implementa un analogo del modello di protezione degli altoparlanti Smart Amp di Texas Instruments. Può essere utilizzato per proteggere gli altoparlanti sui dispositivi Apple Silicon.
zh_cn: 运行 @command{speakersafetyd}，一个用户空间守护进程，实现德州仪器智能放大器扬声器保护模型的类似物。它可以用于保护 Apple Silicon 设备上的扬声器。

source: Run the GNU@tie{}lsh secure shell (SSH) daemon, @command{lshd}.
es: Ejecute el daemon de intérprete seguro GNU@tie{}lsh (SSH), @command{lshd}.
it: Esegui il demone GNU@tie{}lsh secure shell (SSH), @command{lshd}.
zh_cn: 运行 GNU@tie{}lsh 安全外壳（SSH）守护进程，@command{lshd}。

source: Run the OpenSSH secure shell (SSH) server, @command{sshd}.
es: Ejecuta el intérprete seguro del servidor OpenSSH (SSH), @command{sshd}.
it: Lancia il server secure shell OpenSSH, @command{sshd}.
zh_cn: 运行 OpenSSH 安全外壳（SSH）服务器，@command{sshd}。

source: Run the Dropbear secure shell (SSH) server.
es: Ejecuta el servidor intérprete seguro Dropbear (SSH).
it: Lancia il server secure shell (SSH) Dropbear.
zh_cn: 运行 Dropbear 安全外壳（SSH）服务器。

source: Automatically set up ssh connections (and keep them alive).
es: Configura automáticamente las conexiones ssh (y las conserva vivas).
it: Imposta automaticamente le connessioni ssh (e mantienile attive).
zh_cn: 自动设置 ssh 连接（并保持连接活跃）。

source: webssh: reject policy requires `known-hosts'.
es: webssh: normativa rechazar requiere `known-hosts'.
it: webssh: la policy di rifiuto richiede l'impostazione dei `known-hosts'.
zh_cn: webssh：拒绝策略需要 `known-hosts`。

source: Run the webssh.
es: Ejecuta el webssh.
it: Lancia la webssh.
zh_cn: 运行 webssh。

source: Run the Jami daemon (@command{jamid}). This service is geared toward the use case of hosting Jami rendezvous points over a headless server. If you use Jami on your local machine, you may prefer to setup a user Shepherd service for it instead; this way, the daemon will be shared via your normal user D-Bus session bus.
es: Ejecute el daemon Jami (@command{jamid}). Este servicio es generado por medo del caso de uso de hospedaje puntos rendezvous Jami sobre un servidor sin cabecera. Su utiliza Jami en su máquina local, quizá prefiera instalar un usuario de servicio Shepherd en su lugar; esta manera será compartido por medio de su usuario normal de bus de sesión D-Bus.
it: Esegui il demone Jami (@command{jamid}). Questo servizio è orientato al caso d'uso di hosting dei punti di incontro Jami su un server headless. Se utilizzi Jami sulla tua macchina locale, potresti preferire impostare un servizio utente Shepherd per esso; in questo modo, il demone verrà condiviso tramite il tuo normale bus di sessione D-Bus utente.
zh_cn: 运行 Jami 守护进程（@command{jamid}）。该服务针对在无头服务器上托管 Jami 汇聚点的使用场景。如果您在本地机器上使用 Jami，您可能更愿意为其设置用户 Shepherd 服务；这样，守护进程将通过您的普通用户 D-Bus 会话总线共享。

source: Run the Mumble voice-over-IP (VoIP) server.
es: Ejecuta el servidor (VoIP) Mumble voz-sobre-IP.
it: Lancia il server voice-over-IP (VoIP) Mumble.
zh_cn: 运行 Mumble 语音通信（VoIP）服务器。

source: Expose Git repositories over the insecure @code{git://} TCP-based protocol.
es: Expone repositorios Git sobre el protocolo inseguro @code{git://} basadlo en TCP.
it: Esponi i repository Git usando il protocollo TCP non sicuro @code{git://}.
zh_cn: 通过不安全的基于 TCP 的 @code{git://} 协议公开 Git 仓库。

source: Set up @command{gitolite}, a Git hosting tool providing access over SSH. By default, the @code{git} user is used, but this is configurable. Additionally, Gitolite can integrate with with tools like gitweb or cgit to provide a web interface to view selected repositories.
es: Configure @command{gitolite}, un Git hospedando herramienta dando acceso a SSH. Por defecto, el usuario de @code{git} es utilizado, pero esto es configurable. Adicionalmente, Gitolite puede integrar con herramientas como gitweb o cgit para proporciona un interfaz web para ver repos seleccionados.
it: Configura @command{gitolite}, uno strumento di hosting Git che fornisce accesso via SSH. Di default usa l'utente @code{git}, ma è modificabile. In più, Gitolite può integrarsi con strumenti come gitweb o cgit e fornire un'interfaccia web per vedere repository selezionati.
zh_cn: 设置 @command{gitolite}，一个通过 SSH 提供访问的 Git 托管工具。默认使用 @code{git} 用户，但此配置可更改。此外，Gitolite 可以与 gitweb 或 cgit 等工具集成，提供查看选定仓库的网页界面。

source: Run Gitile, a small Git forge. Expose public repositories on the web.
es: Ejecuta Gitile, una forja pequeña de Git. Expone repositorios públicos en la web.
it: Esegue Gitile, una piccola Git-forge. Espone repository pubblici sul web.
zh_cn: 运行 Gitile，一个小型 Git 平台。在网页上公开公共仓库。

source: Setup the @uref{https://bitmask.net, Bitmask} VPN application.
es: Configura la aplicación VPN @uref{https://bitmask.net, Bitmask}.
it: Configura l'applicazione VPN @uref{https://bitmask.net, Bitmask}.
zh_cn: 设置 @uref{https://bitmask.net, Bitmask} VPN 应用程序。

source: Run the OpenVPN server, which allows you to @emph{host} a @acronym{VPN, virtual private network}.
es: Ejecute el servidor OpenVPN, el cual le permite @emph{hospedar} una @acronym{VPN, virtual private network}.
it: Esegui il server OpenVPN, che ti consente di @emph{ospitare} una @acronym{VPN, virtual private network}.
zh_cn: 运行 OpenVPN 服务器，允许您 @emph{host} 一个 @acronym{VPN, virtual private network}。

source: Run the OpenVPN client service, which allows you to connect to an existing @acronym{VPN, virtual private network}.
es: Ejecute el servicio cliente de OpenVPN, el cual le permite conectar a una @acronym{VPN, virtual private network} exitente.
it: Esegui il servizio client OpenVPN, che ti consente di connetterti a una @acronym{VPN, virtual private network} esistente.
zh_cn: 运行 OpenVPN 客户端服务，允许您连接到现有的@acronym{VPN，虚拟私人网络}。

source: strongSwan ipsec-conf and ipsec-secrets must both be (un)set
es: strongSwan ipsec-conf e ipsec-secrets deben ambos ser (un)set
it: strongSwan ipsec-conf e ipsec-secrets devono essere entrambi (de)impostati
zh_cn: strongSwan ipsec-conf 和 ipsec-secrets 必须同时（未）设置

source: Connect to an IPsec @acronym{VPN, Virtual Private Network} with strongSwan.
es: Conectar a un IPsec @acronym{VPN, Virtual Private Network} con strongSwan.
it: Connettiti a una @acronym{VPN, Virtual Private Network} IPsec con strongSwan.
zh_cn: 使用 strongSwan 连接到 IPsec @acronym{VPN，虚拟私人网络}。

source: 'monitor-ips?' is #t but no host name to monitor~%
es: 'monitor-ips?' es #t pero ningún nombre de equipo para monitor~%
it: 'monitor-ips?' è #t ma non c'è un nome host da monitorare~%
zh_cn: “monitor-ips?”为 #t，但没有要监控的主机名~%

source: Set up Wireguard @acronym{VPN, Virtual Private Network} tunnels.
es: Configura túneles Wireguard @acronym{VPN, Virtual Private Network}.
it: Imposta i tunnel @acronym{VPN, Virtual Private Network} di Wireguard.
zh_cn: 设置 Wireguard @acronym{VPN，虚拟私人网络} 隧道。

source: Build the home environment top-level directory, which in turn refers to everything the home environment needs: its packages, configuration files, activation script, and so on.
es: Construye el directorio de nivel superior del entorno home, el cual a su vez hace referencia a todo lo que el entorno home necesita: sus paquetes, archivos de configuración, guión de arranque y demás.
it: Crea la directory principale dell'ambiente home, che farà riferimento a tutto ciò di cui la home ha bisogno: i suoi pacchetti, i file di configurazione, lo script di attivazione, e così via.
zh_cn: 构建主目录环境顶层目录，该目录又引用主目录环境所需的一切：其软件包、配置文件、激活脚本等。

source: This is the @dfn{home profile} and can be found in @file{~/.guix-home/profile}. It contains packages and configuration files that the user has declared in their @code{home-environment} record.
es: Este es el @dfn{home profile} y se puede encontrar en @file{~/.guix-home/profile}. Contiene paquetes y archivos de configuración que el usuario ha declarado en su registro @code{home-environment}.
it: Questo è il profilo @dfn{home}. Si trova in @file{~/.guix-home/profile}. Contiene i pacchetti e i file di configurazione che l'utente ha dichiarato nel suo record @code{home-environment}.
zh_cn: 这是 @dfn{主目录配置文件}，位于 @file{~/.guix-home/profile}。它包含用户在其 @code{home-environment} 记录中声明的软件包和配置文件。

source: duplicate definition for `~a' environment variable ~%
es: definición duplicada para la variable de entorno `~a' ~%
it: definizione doppia per la variabile ambiente `~a' ~%
zh_cn: 环境变量 ~a 的重复定义 ~%

source: Set the environment variables.
es: Establecer las variables de entorno.
it: Imposta le variabili ambiente.
zh_cn: 设置环境变量。

source: duplicate '~a' entry for files/
es: el apunte '~a' está por duplicado para archivos/
it: voce '~a' duplicata per files/
zh_cn: 文件的重复 '~a' 条目

source: Files that will be put in @file{~/.guix-home/files}, and further processed during activation.
es: Archivos que serán puestos en @file{~/.guix-home/files}, y más procesados durante la activación.
it: File che verranno inseriti in @file{~/.guix-home/files}, ed elaborati durante l'attivazione.
zh_cn: 将放入 @file{~/.guix-home/files} 的文件，并在激活期间进一步处理。

source: Files that will be put in @file{~/.guix-home/files/.config}, and further processed during activation.
es: Archivos que serán puestos en @file{~/.guix-home/files/.config}, y más procesados durante la activación.
it: File che verranno messi in @file{~/.guix-home/files/.config}, ed elaborati durante l'attivazione.
zh_cn: 将放入 @file{~/.guix-home/files/.config} 的文件，并在激活期间进一步处理。

source: Files that will be put in @file{~/.guix-home/files/.local/share}, and further processed during activation.
es: Archivos que serán puestos en @file{~/.guix-home/files/.local/share}, y procesados durante la activación.
it: File che verranno messi in @file{~/.guix-home/files/.local/share}, ed elaborati durante l'attivazione.
zh_cn: 将放入 @file{~/.guix-home/files/.local/share} 的文件，并在激活期间进一步处理。

source: XDG_RUNTIME_DIR doesn't exists, on-first-login script won't execute anything. You can check if xdg runtime directory exists, XDG_RUNTIME_DIR variable is set to appropriate value and manually execute the script by running '$HOME/.guix-home/on-first-login'~%
es: XDG_RUNTIME_DIR no existe, en la secuencia de comandos de primer acceso no ejecutará nada. Puede comprobar si existe el directorio en tiempo de ejecución xdg, la variable XDG_RUNTIME_DIR está establecida con un valor apropiado y ejecute manualmente la secuencia de comandos ejecutando '$HOME/.guix-home/on-first-login'~%
it: XDG_RUNTIME_DIR non esiste, lo script on-first-login non eseguirà nulla. Puoi verificare che la directory di runtime esista, che la variabile XDG_RUNTIME_DIR sia impostata correttamente e infine eseguire manualmente lo script lanciando '$HOME/.guix-home/on-first-login'~%
zh_cn: XDG_RUNTIME_DIR 不存在，on-first-login 脚本不会执行任何操作。您可以检查 xdg 运行时目录是否存在，XDG_RUNTIME_DIR 变量是否设置为适当的值，并通过运行 '$HOME/.guix-home/on-first-login' 手动执行该脚本~%

source: Run gexps on first user login. Can be extended with one gexp.
es: Ejecuta gexps en el primer acceso de usuario. Se puede extender con un gexp.
it: Esegue gexp al primo login utente. Può essere esteso con una gexp.
zh_cn: 首次用户登录时运行 gexps。可以通过一个 gexp 扩展。

source: Run gexps to activate the current generation of home environment and update the state of the home directory. @command{activate} script automatically called during reconfiguration or generation switching. This service can be extended with one gexp, but many times, and all gexps must be idempotent.
es: Ejecute gexps para activar la generación actual del entorno personal y actualizar el estado del directorio personal. La secuencia @command{activate} automáticamente invocada durante reconfiguración o conmutación de generación. Este servicio se puede extender con un gexp, pero muchas veces y todos los gexps deben ser idempotentes.
it: Esegue gexp per attivare la generazione corrente dell'ambiente home e aggiornare lo stato della directory home. Lo script @command{activate} viene automaticamente chiamato durante la riconfigurazione o il cambio generazione. Questo servizio può essere esteso con una gexp, ma ripetutamente, e tutte le gexp devono essere idempotenti.
zh_cn: 运行 gexps 以激活当前代的家环境并更新主目录的状态。@command{activate} 脚本在重新配置或代切换时自动调用。此服务可以通过一个 gexp 扩展，但多次调用，且所有 gexp 必须是幂等的。

source: Comparing ~a and ~10t~a...
es: Comparando ~a y ~10t~a...
it: Confronto ~a e ~10t~a...
zh_cn: 正在比较 ~a 和 ~10t~a...

source: done (~a)
es: hecho (~a)
it: fatto (~a)
zh_cn: 完成 (~a)

source: Evaluating on-change gexps.
es: Evaluando cambiar gexps.
it: Valuto le gexp on-change.
zh_cn: 正在对 on-change gexp 求值。

source: On-change gexps evaluation finished.
es: Evaluación de cambio de gexps terminada.
it: Valutazione delle gexp on-change terminata.
zh_cn: on-change G 表达式求值完成。
