Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: G-expressions to run if the specified files have changed since the last generation. The extension should be a list of lists where the first element is the pattern for file or directory that expected to be changed, and the second element is the G-expression to be evaluated.
es: Expresiones G a ejecutar si los archivos especificados han sido cambiados desde la última generación. La extensión debería ser una lista donde el primer elemento es el patrón para el archivo o directorio que espera ser cambiado y el segundo elemento es la expresión-G a evaluar.
it: Gexp da eseguire se i file specificati sono stati modificati dall'ultima generazione. L'estensione dovrebbe essere una lista di liste dove il primo elemento è il pattern del file o directory che si presume siano cambiati, e il secondo elemento è l'espressione-G da valutare.
zh_cn: 如果指定的文件自上次生成以来发生变化，则运行的 G 表达式。扩展应为列表的列表，其中第一个元素是预期发生变化的文件或目录的模式，第二个元素是要求值的 G 表达式。

source: Store provenance information about the home environment in the home environment itself: the channels used when building the home environment, and its configuration file, when available.
es: Almacena información de proveniencia acerca del entorno home en el entorno home mismo: los canales que se usaron al construir el entorno home y su archivo de configuración, cuando estén disponibles.
it: Salva le informazioni di origine dell'ambiente home nell'ambiente stesso: include i canali usati per costruirlo, e il suo file di configurazione, quando disponibili.
zh_cn: 在家环境本身中存储有关家环境的来源信息：构建家环境时使用的渠道，以及其配置文件（如果可用）。

source: Create a @code{x11-display} Shepherd service that waits for the X Window (or ``X11'') graphical display server to be up and running, up to a configurable delay, and sets the @code{DISPLAY} environment variable of @command{shepherd} itself accordingly. If no accessible X11 server shows up during that time, the @code{x11-display} service is marked as failing to start.
es: Crea un servicio Shepherd @code{x11-display} que espera que su servidor de pantalla gráfica X Window (o ``X11'') esté configurada y funcionando, hasta que un retardo configurable, y establezca la variable de entorno @code{DISPLAY} de @command{shepherd} misma de acuerdo. Si ningún servidor X11 accesible aparezca durante ese tiempo, el servicio @code{x11-display} está marcado como incorrecto al iniciar.
it: Crea un servizio Shepherd @code{x11-display} che attende che il server grafico X Window (o ``X11'') sia in esecuzione, entro un tempo configurabile, e imposta di conseguenza la variabile ambiente @code{DISPLAY} di @command{shepherd} stesso. Se in quel lasso non compare nessun server X11 accessibile, il servizio @code{x11-display} viene contrassegnato come fallito all'avvio.
zh_cn: 创建一个 @code{x11-display} Shepherd 服务，等待 X 窗口（或“X11”）图形显示服务器启动，最长等待可配置的延迟时间，并相应地设置 @command{shepherd} 本身的 @code{DISPLAY} 环境变量。如果在此期间没有可访问的 X11 服务器出现，@code{x11-display} 服务将被标记为启动失败。

source: Run Redshift, a program that adjusts the color temperature of display according to time of day.
es: Ejecute Redshift, un programa que ajusta la temperatura de pantalla de acuerdo a la hora del día.
it: Esegui Redshift, un programma che aggiusta la temperatura colore del display in base all'ora del giornata.
zh_cn: 运行 Redshift，一款根据一天中时间调整显示器色温的程序。

source: Run the session-specific D-Bus inter-process message bus.
es: Ejecute el D-Bus de sesión-específica del bus de mensaje de inter-procesos.
it: Esegue un bus messaggi inter-processo D-Bus specifico per la sessione.
zh_cn: 运行会话特定的 D-Bus 进程间消息总线。

source: Run the @code{unclutter} daemon, which, on systems using the Xorg graphical display server, automatically hides the cursor after a user-defined timeout has expired.
es: Ejecute el daemon @code{unclutter}, el cual en sistemas utilizando el servidor de pantalla gráfica Xorg, automáticamente oculta el cursor tras un tiempo de espera definido por el usuario ha caducado.
it: Esegue il demone @code{unclutter}, che sui sistemi che utilizzano il server di visualizzazione grafica Xorg, nasconde automaticamente il cursore dopo un timeout definito dall'utente.
zh_cn: 运行 @code{unclutter} 守护进程，在使用 Xorg 图形显示服务器的系统上，用户定义的超时后自动隐藏光标。

source: Run the @code{xmodmap} utility to modify keymaps and pointer buttons under the Xorg display server via user-defined expressions.
es: Ejecuta la utilidad @code{xmodmap} para modificar distribuciones de teclas y apunte de botones bajo el servidor de pantalla Xorg vía expresiones definidas por el usuario.
it: Esegue la @code{xmodmap} utility per modificare la mappatura tasti e il pulsante del puntatore sotto il server di visualizzazione Xorg tramite espressioni definite dall'utente.
zh_cn: 运行 @code{xmodmap} 工具，通过用户定义的表达式修改 Xorg 显示服务器下的键盘映射和指针按钮。

source: layout field of home-dotfiles-configuration should be either 'plain or 'stow, but ~a was found.
es: campo layout de home-dotfiles-configuration serían o bien 'plain o bien 'stow, pero fue encontrado ~a.
it: il campo layout di home-dotfiles-configuration dovrebbe essere 'plain o 'stow, ma è stato trovato ~a.
zh_cn: home-dotfiles-configuration 的 layout 字段应为 'plain' 或 'stow'，但发现了 ~a。

source: Files that will be put in the user's home directory following GNU Stow's algorithm, and further processed during activation.
es: Archivos que serán puestos dentro de la carpeta personal del usuario siguiente los algoritmos de GNU Stow, y más procesados durante la activación.
it: File che verranno messi nella directory home dell'utente seguendo l'algoritmo di GNU Stow, e ulteriormente elaborati durante l'attivazione.
zh_cn: 根据 GNU Stow 算法将放入用户主目录的文件，并在激活期间进一步处理。

source: Provides configuration file for fontconfig and make fc-* utilities aware of font packages installed in Guix Home's profile.
es: Proporciona archivos de configuración para fontconfig y utilidades make fc-* relativas de paquetes de tipografías instalados en el perfil de Guix Home.
it: Fornisce il file di configurazione per fontconfig e crea utilità fc-* che riconoscono i pacchetti di caratteri installati nel profilo Home di Guix.
zh_cn: 提供 fontconfig 的配置文件，使 fc-* 工具能够识别安装在 Guix Home 配置文件中的字体包。

source: Configure GnuPG's agent, @command{gpg-agent}, which is responsible for managing OpenPGP and optionally SSH private keys. When SSH support is enabled, @command{gpg-agent} acts as a drop-in replacement for OpenSSH's @command{ssh-agent}.
es: Configure el agente de GnuPG, @command{gpg-agent}, el cual es responsable para gestionar OpenPGP y opcionalmente claves privadas SSH. Cuando soporte de SSH esté activo, @command{gpg-agent} actúa como un remplazo drop-in para los @command{ssh-agent} de OpenSSH.
it: Configura l'agente GnuPG, @command{gpg-agent}, che è responsabile della gestione delle chiavi private OpenPGP e, opzionalmente, SSH. Quando il supporto SSH è abilitato, @command{gpg-agent} agisce come sostituto immediato di OpenSSH @command{ssh-agent}.
zh_cn: 配置 GnuPG 的代理 @command{gpg-agent}，负责管理 OpenPGP 以及可选的 SSH 私钥。当启用 SSH 支持时，@command{gpg-agent} 作为 OpenSSH 的 @command{ssh-agent} 的替代品。

source: Incrementally refresh GnuPG keyrings over Tor.
es: Recargar incrementalmente anillos GnuPG sobre Tor.
it: Rinnova i portachiavi GnuPG per gradi attraverso Tor.
zh_cn: 通过 Tor 增量刷新 GnuPG 密钥环。

source: Manages the per-user Guix channels specification.
es: Gestiona especificación de los canales Guix por usuario.
it: Gestisce la specificazione per utente dei canali Guix.
zh_cn: 管理每个用户的 Guix 频道规范。

source: Install and configure the Kodi media center so that it runs as a Shepherd service.
es: Instala y configura el centro del medio Kodi tal que ejecuta como un servicio Shepherd.
it: Installa e configura Kodi media center in modo che funzioni come servizio Shepherd.
zh_cn: 安装并配置 Kodi 媒体中心，使其作为 Shepherd 服务运行。

source: Install and configure @command{znc}, an @acronym{IRC, Internet Relay Chat} bouncer, as a Shepherd service.
es: Instala y configura @command{znc}, un bouncer @acronym{IRC, Internet Relay Chat}, como un servicio Shepherd.
it: Installa e configura @command{znc}, un @acronym{IRC, Internet Relay Chat} bouncer, come servizio Shepherd.
zh_cn: 安装并配置 @command{znc}，一个 @acronym{IRC, Internet Relay Chat} 中继器，作为 Shepherd 服务。

source: Run batsignal, a battery watching and notification daemon.
es: Ejecuta batsignal, un daemon de batería viendo y notificando.
it: Esegue batsignal, un demone di notifica e monitoraggio della batteria.
zh_cn: 运行 batsignal，电池监控和通知守护进程。

source: Create @file{~/.profile}, which is used for environment initialization of POSIX compliant login shells. This service type can be extended with a list of file-like objects.
es: Crea @file{~/.profile}, el cual es utilizado para inicialización de entorno de intérprete de acceso compatible con POSIX. Este tipo de servicio puede ser extendido con un listado de objetos tipo-archivo.
it: Crea @file{~/.profile}, che viene usato per l'inizializzazione ambiente delle shell di login compatibili con POSIX. Questo tipo servizio può essere esteso con una lista di oggetti file-like.
zh_cn: 创建 @file{~/.profile}，用于 POSIX 兼容登录 shell 的环境初始化。此服务类型可以通过文件列表进行扩展。

source: Install and configure Zsh.
es: Instala y configura Zsh.
it: Installa e configura Zsh.
zh_cn: 安装并配置 Zsh。

source: Install and configure GNU Bash.
es: Instala y configura GNU Bash.
it: Installa e configura GNU Bash.
zh_cn: 安装并配置 GNU Bash。

source: Install and configure Fish, the friendly interactive shell.
es: Instala y configura Fish, el intérprete interactivo amigable.
it: Installa e configura Fish, la shell interattiva amichevole.
zh_cn: 安装并配置 Fish，友好的交互式 shell。

source: Configure readline in @code{.inputrc}.
es: Configure readline en @code{.inputrc}.
it: Configura readline in @code{.inputrc}.
zh_cn: 配置 @code{.inputrc} 中的 readline。

source: Configure and install userland Shepherd.
es: Configura e instala como usuario Shepherd.
it: Configura e installa Shepherd nello spazio utente.
zh_cn: 配置并安装用户空间 Shepherd。

source: Start essential PipeWire services.
es: Iniciar servicios PipeWire esenciales.
it: Avvia i servizi PipeWire essenziali.
zh_cn: 启动必要的 PipeWire 服务。

source: Define a PulseAudio sink to broadcast audio output over RTP, which can then by played by another PulseAudio instance.
es: Define un pozo PulseAudio para difusión de salida audio sobre RTP, el cual puede entonces reproducido por otra instancia PulseAudio.
it: Definire un sink (output) PulseAudio per trasmettere l'uscita audio su RTP, che può quindi essere riprodotto da un'altra istanza PulseAudio.
zh_cn: 定义一个 PulseAudio 接收端，通过 RTP 广播音频输出，供另一个 PulseAudio 实例播放。

source: Define a PulseAudio source to receive audio broadcasted over RTP by another PulseAudio instance.
es: Defina un origen de PulseAudio para recibir sonido transmitido sobre RTP por otra instancia PulseAudio.
it: Definire una sorgente PulseAudio per ricevere l'audio trasmesso su RTP da un'altra istanza di PulseAudio.
zh_cn: 定义一个 PulseAudio 源，用于接收另一个 PulseAudio 实例通过 RTP 广播的音频。

source: ~s: invalid address family value
es: ~s: valor de familia de dirección no válido
it: ~s: valore della famiglia di indirizzi non valido
zh_cn: ~s: 无效的地址组

source: define either 'name' or 'match-criteria', not both
es: defina o bien 'name' o bien 'match-criteria', pero no ambos
it: definisci 'name' oppure 'match-criteria', non entrambi
zh_cn: 只能定义 'name' 或 'match-criteria' 中的一个，不能同时定义两者

source: define either 'name' or 'match-criteria' once
es: defina o bien 'name' o 'match-criteria' una vez
it: definisci 'name' oppure 'match-criteria' una sola volta
zh_cn: 只能定义 'name' 或 'match-criteria' 中的一个，且只能定义一次

source: ~s: invalid 'add-keys-to-agent' value
es: ~s: valor de 'add-keys-to-agent' no válido
it: ~s: valore di 'add-keys-to-agent' non valido

source: Configure the OpenSSH @acronym{SSH, secure shell} client by providing a @file{~/.ssh/config} file, which is honored by the OpenSSH client,@command{ssh}, and by other tools such as @command{guix deploy}.
es: Configura el cliente de OpenSSH @acronym{SSH, secure shell} mediante el fichero @file{~/.ssh/config}, que es seguido por el cliente de OpenSSH, @command{ssh}, y por otras herramientas como @command{guix deploy}.
it: Configura il client OpenSSH @acronym{SSH, secure shell} fornendo un @file{~/.ssh/config}, che è rispettato dal client OpenSSH,@command{ssh}, e da altri tools come @command{guix deploy}.
zh_cn: 通过提供 @file{~/.ssh/config} 文件配置 OpenSSH @acronym{SSH, secure shell} 客户端，该文件被 OpenSSH 客户端 @command{ssh} 以及其他工具如 @command{guix deploy} 所认可。

source: Install and configure @command{ssh-agent} as a Shepherd service.
es: Instale y configure @command{ssh-agent} como un servicio Shepherd.
it: Installa e configura @command{ssh-agent} come un servizio Shepherd.
zh_cn: 安装并配置 @command{ssh-agent} 作为 Shepherd 服务。

source: Backing up ~a...
es: Respaldando '~a'…
it: Eseguo il backup di ~a...
zh_cn: 正在备份 ~a...

source: done
es: hecho
it: fatto
zh_cn: 完成

source: Cleaning up symlinks from previous home at ~a.~%
es: Vaciando los enlaces simbólicos del anterior entorno home en ~a.~%
it: Pulisco i collegamenti simbolici dalla precedente home in ~a.~%
zh_cn: 正在清理之前主目录中的符号链接 ~a.~%

source: Removing ~a...
es: Quitando ~a...
it: Rimuovo ~a...
zh_cn: 正在删除 ~a…

source: Skipping ~a (not a symlink to store)... done
es: Se omite ~a (no es un enlace simbólico a almacenar)... hecho
it: Salto ~a (non è un link simbolico allo store)... fatto
zh_cn: 跳过 ~a（不是要存储的符号链接）... 完成

source: Removed ~a.
es: ~a ha sido quitado.
it: Rimosso ~a
zh_cn: 已移除 ~a。

source: Skipping ~a (not an empty directory)... done
es: Se omite ~a (no es un directorio vacío)... hecho
it: Salto ~a (non è una directory vuota)... fatto
zh_cn: 跳过 ~a（不是空目录）... 完成

source: Skipping ~a (underlying device is busy)... done
es: Se omite ~a (dispositivo subyacente ocupado)... hecho
it: Salto ~a (il device sottostante è occupato)... fatto
zh_cn: 跳过 ~a（底层设备正忙）... 完成

source: Cleanup finished.
es: Purga finalizada.
it: Pulizia terminata.
zh_cn: 清理完成。

source: Symlinking ~a -> ~a...
es: Enlazando simbólicamente ~a -> ~a...
it: Creo il link simbolico ~a -> ~a...
zh_cn: 正在创建符号链接 ~a -> ~a...

source: failed to create directory ~a: ~s~%
es: no se pudo crear el directorio ~a: ~s~%
it: impossibile creare la cartella ~a: ~s~%
zh_cn: 创建目录 ~a 失败：~s~%

source: done Finished updating symlinks.
es: hecho Actualización de enlaces simbólicos finalizada.
it: fatto Aggiornamento dei link simbolici terminato.
zh_cn: 完成 符号链接更新完成。

source: Provide an @code{update-symlinks} script, which creates symlinks to configuration files and directories on every activation. If an existing file would be overwritten by a symlink, backs up that file first.
es: Provee una secuencia de comandos @code{update-symlinks}, que crea enlaces simbólicos para la configuración de archivos y directorios en cada activación. Si un archivo existente debería ser sobrescrito por un enlace simbólico, respaldará ese archivo primero.
it: Fornisce uno script @code{update-symlinks} che crea dei collegamenti simbolici ai file e alle directory di configurazione a ogni attivazione. Se un file esistente verrebbe sovrascritto da un link simbolico, prima ne esegue il backup.
zh_cn: 提供一个 @code{update-symlinks} 脚本，该脚本在每次激活时创建指向配置文件和目录的符号链接。如果符号链接会覆盖现有文件，则先备份该文件。

source: Configure XDG base directories. The services of this service-type is instantiated by default, to provide non-default value, extend the service-type (using @code{simple-service} for example).
es: Configure directorios base XDG. Los servicios de este tipo está instanciados por defecto, para proporcionar valor no predeterminado, extiende el tipo-servicio (utilizando @code{simple-service} por ejemplo).
it: Configura le directory base XDG. I servizi di questo service-type sono istanziati in modo predefinito, per fornire un valore diverso dal default, estendi il service-type (usando per esempio @code{simple-service}).
zh_cn: 配置 XDG 基础目录。此服务类型的服务默认实例化，若要提供非默认值，请扩展该服务类型（例如使用 @code{simple-service}）。

source: Configure XDG user directories. To disable a directory, point it to the $HOME.
es: Configure carpetas del usuario XDG. Para desactivar un directorio, apúntelo a $HOME.
it: Configura le directory utente XDG. Per disabilitare una directory, indirizzala su $HOME.
zh_cn: 配置 XDG 用户目录。要禁用某个目录，请将其指向 $HOME。

source: The value of an XDG MIME entry must be a list, string or symbol, was given ~a
es: El valor de un apunte MIME XDG debe ser un listado, cadena o símbolo, fue dado ~a
it: Il valore di una voce MIME XDG dev'essere del tipo lista, stringa o simbolo, fornito ~a
zh_cn: XDG MIME 条目的值必须是列表、字符串或符号，实际给出的是 ~a

source: XDG desktop type must be of of ~a, was given: ~a
es: Tipo de escritorio XDG debe ser de ~a, fue proporcionado: ~a
it: il tipo desktop XDG deve essere uno tra ~a, fornito: ~a
zh_cn: XDG 桌面类型必须是 ~a 中的一个，实际给出的是：~a

source: Configure XDG MIME applications, and XDG desktop entries.
es: Configure aplicaciones MIME XDG, y apuntes de escritorio XDG.
it: Configura le applicazioni MIME XDG , e le voci desktop XDG.
zh_cn: 配置 XDG MIME 应用程序和 XDG 桌面条目。

source: invalid file system mount flag:~{ ~s~}~%
es: indicador de montaje de sistema de archivos no válido:~{ ~s~}~%
it: flag di montaggio file system non valido:~{~s~}~%
zh_cn: 无效文件系统挂载标志：~{~s~}~%

source: The store is on a Btrfs subvolume, but the subvolume name is unknown.
es: El almacén es un subvolumen Btrfs, pero el nombre del subvolumen es desconocido.
it: Lo store è in un sottovolume Btrfs, ma il nome del sottovolume è sconosciuto.
zh_cn: 存储位于 Btrfs 子卷上，但子卷名称未知。

source: Use the @code{subvol} Btrfs file system option.
es: Utilice la opción del sistema de archivos Btrfs @code{subvol}.
it: Usa l'opzione @code{subvol} del file system Btrfs.
zh_cn: 使用 @code{subvol} Btrfs 文件系统选项。

source: image lacks a partition with the 'boot' flag
es: en la imagen falta una partición con el indicador 'boot'
it: l'immagine manca di una partizione con il flag 'boot'
zh_cn: 映像缺少带有“boot”标志的分区

source: unsupported image type: ~a
es: tipo de imagen no soportado: ~a
it: tipo di immagine non supportato: ~a
zh_cn: 不支持的映像类型：~a

source: unsupported partition type: ~a
es: tipo de partición no soportado: ~a
it: tipo di partizione non supportato: ~a
zh_cn: 不支持的分区类型：~a

source: EFI bootloader required with GPT partitioning
es: Cargador EFI requerido con particionado GPT
it: Il partizionamento GPT richiede un bootloader EFI
zh_cn: GPT 分区需要 EFI 引导加载程序

source: ~a: unsupported image format
es: ~a: formato de imagen no soportado
it: ~a: formato immagine non supportato

source: ~a: no such image type
es: ~a: no hay tal tipo de imagen
it: ~a: tipo di immagine non esistente
zh_cn: ~a：无此映像类型

source: Provide loopback and networking without actually doing anything. This service is used by guest systems running in containers, where networking support is provided by the host.
es: Proporciona loopback y red sin hacer en este momento nada. Este servicio se usa por sistemas invitados corriendo en contenedores, donde el soporte de red es proporcionado por el huésped.
it: Fornisce loopback e networking senza fare nulla. Questo servizio è usato da sistemi guest in esecuzione dentro a contenitori, dove il supporto al networking è fornito dall'host.
zh_cn: 提供回环和网络功能，但实际上不执行任何操作。此服务用于在容器中运行的来宾系统，网络支持由主机提供。

source: Usage: run-container [OPTION ...] Run the container with the given options.
es: Modo de empleo: run-container [OPCIÓN ...] Ejecuta el contenedor con las opciones proporcionadas.
it: Uso: run-container [OPZIONE ...] Avvia il contenitore con le opzioni date.
zh_cn: 用法：run-container [OPTION ...] 使用给定选项运行容器。

source: --share=SPEC share host file system with read/write access according to SPEC
es: --share=SPEC comparte el sistema de ficheros del host en modo lectura/escritura de acuerdo con SPEC
it: --share=SPEC condividi il file system host con permessi lettura/scrittura secondo SPEC
zh_cn: --share=SPEC 根据 SPEC 共享主机文件系统，具有读写权限

source: --expose=SPEC expose host file system directory as read-only according to SPEC
es: --expose=SPEC expone el sistema de ficheros del host en modo solo lectura de acuerdo con SPEC
it: --expose=SPEC esponi la directory del file system host in sola lettura secondo SPEC
zh_cn: --expose=SPEC 根据 SPEC 以只读方式暴露主机文件系统目录

source: -h, --help display this help and exit
es: -h, --help exhibe este mensaje de ayuda y termina
it: -h, --help mostra questo aiuto ed esce
zh_cn: -h, --help 显示这份说明并退出

source: ~A: unrecognized option~%
es: ~A: opción no reconocida~%
it: ~A: opzione non riconosciuta~%
zh_cn: ~A: 无法识别的选项~%

source: system container is running as PID ~a~%
es: contenedor del sistema está corriendo como PID ~a~%
it: il contenitore sistema è in esecuzione con PID ~a~%
zh_cn: 系统容器正在以 PID ~a 运行~%

source: Run 'sudo guix container exec ~a /run/current-system/profile/bin/bash --login'
es: Ejecutar 'sudo guix container exec ~a /run/current-system/profile/bin/bash --login'
it: Esegui 'sudo guix container exec ~a /run/current-system/profile/bin/bash --login'
zh_cn: 运行 'sudo guix container exec ~a /run/current-system/profile/bin/bash --login'

source: or run 'sudo nsenter -a -t ~a' to get a shell into it.~%
es: o ejecutar 'sudo nsenter -a -t ~a' para obtener una shell en él.~%
it: o esegui 'sudo nsenter -a -t ~a' per aprire una shell al suo interno.~%
zh_cn: 或运行 'sudo nsenter -a -t ~a' 进入该容器的 shell。~%

source: Map a device node using Linux's device mapper.
es: Mapear un dispositivo nodo usando el mapeador de dispositivo de Linux.
it: Mappa un nodo dispositivo usando il device mapper di Linux.
zh_cn: 使用 Linux 设备映射器映射设备节点。

source: you may need these modules in the initrd for ~a:~{ ~a~}
es: puede necesitar añadir estos módulos al initrd para ~a:~{ ~a~}
it: potresti aver bisogno di questi moduli in initrd per ~a:~{ ~a~}
zh_cn: 您可能需要在 initrd 中为 ~a 加载这些模块：~{ ~a~}

source: Try adding them to the @code{initrd-modules} field of your @code{operating-system} declaration, along these lines: @example (operating-system ;; @dots{} (initrd-modules (append (list~{ ~s~}) %base-initrd-modules))) @end example If you think this diagnostic is inaccurate, use the @option{--skip-checks} option of @command{guix system}.
es: Intente añadirlos al campo @code{initrd-modules} de su declaración @code{operating-system}, más o menos así: @example (operating-system ;; @dots{} (initrd-modules (append (list~{ ~s~}) %base-initrd-modules))) @end example Si piensa que este diagnóstico no es acertado, use la opción @option{--skip-checks} de @command{guix system}.
it: Prova ad aggiungerli al campo @code{initrd-modules} della tua dichiarazione @code{operating-system}, sulla falsariga di: @example (operating-system ;; @dots{} (initrd-modules (append (list~{ ~s~}) %base-initrd-modules))) @end example Se pensi che questo messaggio diagnostico sia inaccurato, usa l'opzione @option{--skip-checks} di @command{guix system}.
zh_cn: 尝试将它们添加到您的 @code{operating-system} 声明的 @code{initrd-modules} 字段，类似如下： @example (operating-system ;; @dots{} (initrd-modules (append (list~{ ~s~}) %base-initrd-modules))) @end example 如果您认为此诊断不准确，请使用 @command{guix system} 的 @option{--skip-checks} 选项。

source: invalid value ~s for #:extra-options argument of `open-luks-device'
it: valore non valido ~s per l'argomento #:extra-options di `open-luks-device'

source: no LUKS partition with UUID '~a'
es: ninguna partición LUKS con UUID '~a'
it: nessuna partizione LUKS con UUID '~a'
zh_cn: 没有 UUID 为 '~a' 的 LUKS 分区
