Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: Install the given fonts on the specified ttys (fonts are per virtual console on GNU/Linux). The value of this service is a list of tty/font pairs. The font can be the name of a font provided by the @code{kbd} package or any valid argument to @command{setfont}, as in this example: @example `(("tty1" . "LatGrkCyr-8x16") ("tty2" . ,(file-append font-tamzen "/share/kbd/consolefonts/TamzenForPowerline10x20.psf")) ("tty3" . ,(file-append font-terminus "/share/consolefonts/ter-132n"))) ; for HDPI @end example
es: Instala las tipografías proporcionadas en las pantallas tty especificadas (tipografías son por consola virtual en GNU/Linux). El valor de este servicio es un listado de parejas tty/tipografía. La tipografía puede ser el nombre de una tipografía proporcionada por el paquete @code{kbd} o cualquier argumento dado válido a @command{setfont}, como en este ejemplo: @example `(("tty1" . "LatGrkCyr-8x16") ("tty2" . ,(file-append font-tamzen "/share/kbd/consolefonts/TamzenForPowerline10x20.psf")) ("tty3" . ,(file-append font-terminus "/share/consolefonts/ter-132n"))) ; para HDPI @end example
it: Installa i font dati sulle tty specificate (ogni console ha i suoi font su un sistema GNU/Linux). Il valore di questo servizio è una lista di coppie tty/font. Il font può essere un nome fornito dal pacchetto @code{kbd} o un argomento valido per @command{setfont}, come in questo esempio: @example `(("tty1" . "LatGrkCyr-8x16") ("tty2" . ,(file-append font-tamzen "/share/kbd/consolefonts/TamzenForPowerline10x20.psf")) ("tty3" . ,(file-append font-terminus "/share/consolefonts/ter-132n"))) ; for HDPI @end example
zh_cn: 在指定的 tty 上安装给定的字体（字体是 GNU/Linux 每个虚拟控制台的字体）。 此服务的值是一个由 tty/font 对构成的列表。 字体可以是 @code{kbd} 软件包提供的字体名称，也可以是 @command{setfont} 的任何有效参数，如本例所示： @example `(("tty1" . "LatGrkCyr-8x16") ("tty2" . ,(file-append font-tamzen "/share/kbd/consolefonts/TamzenForPowerline10x20.psf")) ("tty3" . ,(file-append font-terminus "/share/consolefonts/ter-132n"))) ; for HDPI @end example

source: Provide a console log-in service as specified by its configuration value, a @code{login-configuration} object.
es: Proporciona un servicio de acceso por consola como especificó por su valor de configuración, un objeto @code{login-configuration}.
it: Fornisce un servizio di login a console come specificato dal suo valore di configurazione, un oggetto @code{login-configuration}.
zh_cn: 提供由 @code{login-configuration} 对象配置值 指定的控制台登录服务。

source: Provide console login using the @command{agetty} program.
es: Proporcione acceso por consola utilizando el programa @command{agetty}.
it: Fornisce un login a console usando il programma @command{agetty}.
zh_cn: 使用 @command{agetty} 程序 提供控制台登录功能。

source: Provide console login using the @command{mingetty} program.
es: Proporcione acceso por consola utilizando el programa @{command{mingetty}.
it: Fornisce un login a console usando il programma @command{mingetty}.
zh_cn: 使用 @command{mingetty} 程序 提供控制台登录功能。

source: Runs libc's @dfn{name service cache daemon} (nscd) with the given configuration---an @code{<nscd-configuration>} object. @xref{Name Service Switch}, for an example.
es: Ejecuta las libc de @dfn{daemon de caché del servicio de nombres} (nscd) con la configuración dada---un objeto @code{<nscd-configuration>}. Véase @ref{Selector de servicios de nombres} por ejemplo.
it: Esegue il @dfn{name service cache daemon} (nscd) di libc con la configurazione data---un oggetto @code{<nscd-configuration>}. V. @ref{Name Service Switch}, per un esempio.
zh_cn: 使用指定的配置，即一个 @code{<nscd-configuration>} 对象 来运行 libc 的 @dfn{name service cache daemon} (nscd)。 请参阅例子 @ref{Name Service Switch}。

source: Service syslog has been asked to reload its settings file.
es: Ha sido solicitado el servicio syslog para recargar su archivo de opciones.
it: Al servizio syslog è stato chiesto di ricaricare il proprio file di impostazioni.
zh_cn: syslog 服务被要求重新加载其配置文件。

source: Service syslog is not running.
es: El servicio syslog no está ejecutándose.
it: Il servizio syslog non sta girando.
zh_cn: syslog 服务未运行。

source: Run the syslog daemon, @command{syslogd}, which is responsible for logging system messages.
es: Ejecute el daemon syslog, @command{syslogd}, el cual es responsable para registrar mensajes del sistema.
it: Esegue il demone syslog, @command{syslogd}, che è responsabile del log dei messaggi di sistema.
zh_cn: 运行负责记录系统信息的系统日志守护进程 @command{syslogd}。

source: Using file-like value for 'pam-limits-service-type' is deprecated~%
es: Utilizando un valor tipo-archivo para 'pam-limits-service-type' está obsoleto~%
it: L'uso di un valore file-like per 'pam-limits-service-type' è deprecato.~%
zh_cn: 为 'pam-limits-service-type' 使用类似文件的值已被弃用~%

source: invalid input for 'pam-limits-service-type'~%
es: entrada no válida para 'pam-limits-service-type'~%
it: input non valido per 'pam-limits-service-type'~%
zh_cn: 'pam-limits-service-type' 的输入无效~%

source: Use the @code{pam_limits} authentication module to set the specified resource usage limits.
es: Utilice el módulo de autenticación @code{pam_limits} para establecer el recurso especificado en los límites del uso.
it: Usa il modulo di autenticazione @code{pam_limits} per impostare i limiti d'uso delle risorse specificati.
zh_cn: 使用 @code{pam_limits} 身份验证模块设置指定资源的使用限制。

source: Run the build daemon of GNU@tie{}Guix, aka. @command{guix-daemon}.
es: Ejecuta el daemon de construcción de GNU@tie{}Guix, también conocido como @command{guix-daemon}.
it: Esegue il demone di costruzione di GNU@tie{}Guix, ossia @command{guix-daemon}.
zh_cn: 运行 GNU@tie{}Guix 的构建进程，即 @command{guix-daemon}.

source: Add a Shepherd service running @command{guix publish}, a command that allows you to share pre-built binaries with others over HTTP.
es: Añade un servicio Shepherd ejecutando @command{guix publish}, una instrucción que le permite compartir binarios pre-construidos con otros sobre HTTP.
it: Aggiunge un servizio Shepherd che esegue @command{guix publish}, un comando che permette di condividere con altri via HTTP dei binari precompilati.
zh_cn: 添加一个运行 @command{guix publish} 的 Shepherd 服务， 该命令可让您通过 HTTP 与他人共享预编译的二进制文件。

source: Run @command{udev}, which populates the @file{/dev} directory dynamically. Get extra rules from the packages listed in the @code{rules} field of its value, @code{udev-configuration} object.
es: Ejecute @command{udev}, el cual rellena la carpeta @file{/dev} dinámicamente. Obtenga reglas adicionales desde los paquetes listados en el campo @code{rules} de su valor, objeto @code{udev-configuration}.
it: Esegue @command{udev}, che popola la directory @file{/dev} dinamicamente. Ottiene regole extra dai pacchetti elencati nel campo @code{rules} del suo valore, l'oggetto @code{udev-configuration}.
zh_cn: 运行 @command{udev}，动态填充 @file{/dev} 目录。通过其值的 @code{udev-configuration} 对象中的 @code{rules} 字段列出的包获取额外规则。

source: This service adds udev rules.
es: Este servicio añade reglas de udev.
it: Questo servizio aggiunge regole udev.
zh_cn: 此服务添加了 udev 规则。

source: This service adds udev hardware files.
es: Este servicio añade archivos de hardware udev.
it: Questo servizio aggiunge file hardware udev.
zh_cn: 此服务添加了 udev 硬件文件。

source: Turn on the virtual memory swap area.
es: Activa el área de intercambio de memoria virtual.
it: Attiva l'area swap su memoria virtuale.
zh_cn: 打开虚拟内存交换区。

source: Run GPM, the general-purpose mouse daemon, with the given command-line options. GPM allows users to use the mouse in the console, notably to select, copy, and paste text. The default options use the @code{ps2} protocol, which works for both USB and PS/2 mice.
es: Ejecute GPM, el daemon de ratón de propósito general, con las opciones de línea de comando dada. GPM permite a los usuarios utilizar el ratón en la consola, notablemente para seleccionar, copiar, y pegar texto. Las opciones por defecto utilizan el protocolo @code{ps2}, el cual funciona para ambos ratones USB y PS/2.
it: Esegue GPM, il demone per mouse di uso generale, con le opzioni a linea di comando date. GPM permette di usare il mouse nella console, in particolare di selezionare, copiare e incollare testo. Le opzioni di default usano il protocollo @code{ps2}, che funziona con mouse USB e PS/2.
zh_cn: 使用给定的命令行选项运行 GPM 通用鼠标守护进程。GPM 允许用户在控制台中使用鼠标，特别是选择、复制和粘贴文本。默认选项使用 @code{ps2} 协议，适用于 USB 和 PS/2 鼠标。

source: Start the @command{kmscon} virtual terminal emulator for the Linux @dfn{kernel mode setting} (KMS).
es: Inicie el emulador del terminar virtual @command{kmscon} para los @dfn{kernel mode setting} de Linux (KMS).
it: Avvia l'emulatore di terminale virtuale @command{kmscon} per il @dfn{kernel mode setting} (KMS) di Linux.
zh_cn: 启动用于 Linux @dfn{kernel mode setting} (KMS) 的 @command{kmscon} 虚拟终端模拟器。

source: address '~a' lacks a network mask
es: a la dirección '~a' le falta una máscara de red
it: l'indirizzo '~a' non ha la maschera di rete
zh_cn: 地址 '~a' 缺少网络掩码

source: Write, say, @samp{"~a/24"} for a 24-bit network mask.
es: Escriba, dice, @samp{"~a/24"} para una máscara de red de 24-bit.
it: Scrivi per es. @samp{"~a/24"} per una maschera di rete a 24 bit.
zh_cn: 例如，写成 @samp{"~a/24"} 表示 24 位网络掩码。

source: Value (~S) is not a valid mac address.~%
es: El valor (~S) no es una dirección mac válida.~%
it: Il valore (~S) non è un indirizzo mac valido.~%
zh_cn: 值 (~S) 不是有效的 MAC 地址。~%

source: Value (~S) is not a symbol.~%
es: El valor (~S) no es un símbolo.~%
it: Il valore (~S) non è un simbolo.~%
zh_cn: 值 (~S) 不是一个符号。~%

source: network links are currently ignored on GNU/Hurd~%
es: enlaces de red son actualmente omitidos en GNU/Hurd~%
it: i link di rete sono attualmente ignorati su GNU/Hurd~%
zh_cn: 当前在 GNU/Hurd 上网络链接被忽略~%

source: ignoring network route for '~a'~%
es: descartando ruta de red para '~a'~%
it: ignoro la network route per '~a'~%
zh_cn: 忽略'~a' 的网络路由~%

source: Turn up the specified network interfaces upon startup, with the given IP address, gateway, netmask, and so on. The value for services of this type is a list of @code{static-networking} objects, one per network interface.
es: Activa los interfaces especificados de red para el inicio, con la dirección IP, puerta de enlace, máscara de red y demás. El valor para servicios de este tipo es un listado de objetos de @code{static-networking}, uno por interfaz de red.
it: Accende le interfacce di rete specificate all'avvio, con gli indirizzi IP, i gateway, le maschere, ecc. forniti. Il valore per servizi di questo tipo è una lista di oggetti @code{static-networking}, uno per interfaccia di rete.
zh_cn: 启动时激活指定的网络接口，使用给定的 IP 地址、网关、子网掩码等。此类服务的值是一个 @code{static-networking} 对象列表，每个网络接口一个。

source: Provides necessary infrastructure for logging into the system including @code{greetd} PAM service, @code{pam-mount} module to mount/unmount /run/user/<uid> directory for user and @code{greetd} login manager daemon.
es: Proporcione infraestructura necesaria para acceder al sistema incluyendo servicio PAM @code{greetd}, módulo de @code{pam-mount} para montar/desmontar la carpeta /run/user/<uid> para usuario y el daemon gestor de acceso @code{greetd}.
it: Fornisce l'infrastruttura necessaria per il login nel sistema incluso il servizio PAM @code{greetd}, il modulo @code{pam-mount} per montare/smontare la directory dell'utente /run/user/<uid> e il demone gestore di login @code{greetd}.
zh_cn: 提供登录系统所需的基础设施，包括 @code{greetd} PAM 服务、用于挂载/卸载用户的 /run/user/<uid> 目录的 @code{pam-mount} 模块，以及 @code{greetd} 登录管理守护进程。

source: Automatically renew @url{https://letsencrypt.org, Let's Encrypt} HTTPS certificates by adjusting the nginx web server configuration and periodically invoking @command{certbot}.
es: Automáticamente renueva certificados @url{https://letsencrypt.org, Let's Encrypt} HTTPS ajustando la configuración del servidor web nginx e invocar periódicamente @command{certbot}.
it: Rinnova automaticamente i certificati HTTPS @url{https://letsencrypt.org, Let's Encrypt} aggiustando la configurazione del server web nginx e invocando periodicamente @command{certbot}.
zh_cn: 通过调整 nginx 网络服务器配置并定期调用 @command{certbot}，自动续订 @url{https://letsencrypt.org, Let's Encrypt} HTTPS 证书。

source: invalid value ~s for field '~a'
es: valor no válido ~s para el campo '~a'
it: valore ~s non valido per il campo '~a'
zh_cn: 字段 '~1@*~a' 的值 ~0@*~s 无效

source: specifying serializers after documentation is deprecated, use (serializer ~a) instead~%
es: especificar serializadores tras la documentación esté obsoleta, utilice (serializer ~a) en su lugar~%
it: specificare serializers dopo la documentazione è deprecato, usa (serializer ~a) piuttosto~%

source: The GRAMMAR value must be 'infix or 'suffix, but ~a provided.
es: El valor de GRAMMAR debe ser o bien 'infix' o bien 'suffix', pero se ha provisto ~a.
it: Il valore GRAMMAR deve essere 'infix o 'suffix, non ~a come fornito.
zh_cn: GRAMMAR 的值必须是 'infix 或者 'suffix, 但是提供了 ~a.

source: Run @command{upowerd}, a system-wide monitor for power consumption and battery levels, with the given configuration settings. It implements the @code{org.freedesktop.UPower} D-Bus interface, and is notably used by GNOME.
es: Ejecuta @command{upowerd}, un monitor de para todo el sistema para energía consumida y niveles de batería, con la configuración dada. Implementa el interfaz D-Bus @code{org.freedesktop.UPower}, y es usado notablemente por GNOME.
it: Esegui @command{upowerd}, un monitor di sistema per il consumo di energia e i livelli della batteria, con le impostazioni di configurazione fornite. Implementa l'interfaccia D-Bus @code{org.freedesktop.UPower} ed è utilizzato in modo particolare da GNOME.
zh_cn: 运行 @command{upowerd}，一个系统范围的电源消耗和电池电量监控程序，使用给定的配置设置。它实现了 @code{org.freedesktop.UPower} D-Bus 接口，尤其被 GNOME 使用。

source: Run the @command{geoclue} location service. This service provides a D-Bus interface to allow applications to request access to a user's physical location, and optionally to add information to online location databases.
es: Ejecuta el servicio de localización @command{geoclue}. Este servicio proporciona un interfaz D-Bus para permitir que las aplicaciones soliciten acceso a un lugar físico del usuario, y opcionalmente para añadir información a las bases de datos de ubicación por conexión.
it: Esegui il servizio di localizzazione @command{geoclue}. Questo servizio fornisce un'interfaccia D-Bus per consentire alle applicazioni di richiedere l'accesso alla posizione fisica di un utente e, facoltativamente, di aggiungere informazioni ai database di localizzazione online.
zh_cn: 运行 @command{geoclue} 位置服务。 该服务提供一个 D-Bus 接口，允许应用程序请求访问用户的物理位置，并可选择向在线位置数据库添加信息。

source: Run the @command{bluetoothd} daemon, which manages all the Bluetooth devices and provides a number of D-Bus interfaces.
es: Ejecute el daemon @command{bluetoothd}, el cual gestiona todos los dispositivos Bluetooth y proporciona un número de interfaces de D-Bus.
it: Esegui il demone @command{bluetoothd}, che gestisce tutti i dispositivi Bluetooth e fornisce una serie di interfacce D-Bus.
zh_cn: 运行 @command{bluetoothd} 守护进程，管理所有蓝牙设备并提供多个 D-Bus 接口。

source: Run @command{colord}, a system service with a D-Bus interface to manage the color profiles of input and output devices such as screens and scanners.
es: Ejecuta @command{colord}, un servicio del sistema con un interfaz de D-Bus para administrar los perfiles de color de dispositivos de entrada y salida como las pantallas y escáneres.
it: Esegui @command{colord}, un servizio di sistema con un'interfaccia D-Bus per gestire i profili colore dei dispositivi di input e output come schermi e scanner.
zh_cn: 运行 @command{colord}，一个带有 D-Bus 接口的系统服务，用于管理输入和输出设备（如屏幕和扫描仪）的颜色配置文件。

source: Run UDisks, a @dfn{disk management} daemon that provides user interfaces with notifications and ways to mount/unmount disks. Programs that talk to UDisks include the @command{udisksctl} command, part of UDisks, and GNOME Disks.
es: Ejecuta UDisks, un daemon de @dfn{gestión de discos} que proporciona interfaces de usuario con notificaciones y formas de montar/ desmontar discos. Los programas que se comunican con UDisks incluyen la orden @command{udisksctl}, parte de UDisks, y la utilidad Discos de GNOME.
it: Esegui UDisks, un demone di @dfn{gestione dei dischi} che fornisce interfacce utente con notifiche e modi per montare/smontare i dischi. I programmi che comunicano con UDisks includono il comando @command{udisksctl}, parte di UDisks e GNOME Disks.
zh_cn: 运行 UDisks，一个提供用户界面、通知以及挂载/卸载磁盘方式的 @dfn{disk management} 守护进程。与 UDisks 通信的程序包括 UDisks 的 @command{udisksctl} 命令和 GNOME 磁盘工具。

source: Make GVfs virtual file systems (Trash, SFTP, SMB, HTTP, and many other) available for GIO applications.
es: Hace disponibles los sistemas de archivos virtuales de GVfs (Basura, SFTP, SMB, HTTP, y muchos otros) para aplicaciones GIO.
it: Rendere disponibili i file system virtuali GVfs (Trash, SFTP, SMB, HTTP e molti altri) per le applicazioni GIO.
zh_cn: 使 GVfs 虚拟文件系统（垃圾桶、SFTP、SMB、HTTP 及其他许多）可供 GIO 应用程序使用。

source: Run the @command{elogind} login and seat management service. The @command{elogind} service integrates with PAM to allow other system components to know the set of logged-in users as well as their session types (graphical, console, remote, etc.). It can also clean up after users when they log out.
es: Ejecute el acceso con @command{elogind} y vea el servicio de gestión de asiento. El servicio @command{elogind} se integra con PAM para permitir otros componentes del sistema a conocer el conjunto de usuarios accedidos a sí como sus tipos de sesión (gráfica, consola, remota, etc.) Además puede vaciar tras los usuarios cuando salgan.
it: Esegui il servizio di gestione di accesso e posti @command{elogind}. Il servizio @command{elogind} si integra con PAM per consentire ad altri componenti di sistema di conoscere il set di utenti registrati e i loro tipi di sessione (grafica, console, remota, ecc.). Può anche ripulire dopo che gli utenti si disconnettono.
zh_cn: 运行 @command{elogind} 登录和座位管理服务。@command{elogind} 服务与 PAM 集成，允许其他系统组件了解已登录用户及其会话类型（图形、控制台、远程等）。它还可以在用户注销时进行清理。

source: Run AccountsService, a system service available over D-Bus that can list available accounts, change their passwords, and so on. AccountsService integrates with PolicyKit to enable unprivileged users to acquire the capability to modify their system configuration.
es: Ejecuta AccountsService, un servicio del sistema disponible a través de D-Bus que puede enumerar las cuentas disponibles, el cambio de sus contraseñas, etc. AccountsService se integra con PolicyKit para permitir a los usuarios sin privilegios la adquisición de la capacidad de modificar la configuración de su sistema.
it: Esegui AccountsService, un servizio di sistema disponibile su D-Bus che può elencare gli account disponibili, modificarne le password e così via. AccountsService si integra con PolicyKit per consentire agli utenti non privilegiati di acquisire la capacità di modificare la configurazione del loro sistema.
zh_cn: 运行 AccountsService，一个通过 D-Bus 提供的系统服务，可以列出可用账户、更改密码等。AccountsService 与 PolicyKit 集成，使非特权用户能够获得修改系统配置的权限。

source: PolicyKit helper to configure CUPS with fine-grained privileges.
es: Ayudante de PolicyKit para configurar CUPS con privilegios de grano fino.
it: Helper di PolicyKit per configurare CUPS con privilegi dettagliati.
zh_cn: PolicyKit 辅助程序，用于配置具有细粒度权限的 CUPS。

source: 'sane' service now expects a 'sane-configuration' record~%
it: Il servizio 'sane' ora si aspetta un record 'sane-configuration'~%

source: 'sane-backends' does not include 'hplip' backend anymore. Add it explicitly when needed.~%
it: 'sane-backends' non include più il backend 'hplip'. Aggiungilo esplicitamente quando necessario.~%

source: This service provides access to scanners @i{via} @uref{http://www.sane-project.org, SANE} by installing the necessary udev rules.
es: Este servicio proporciona acceso a escáneres por medio de @uref{http://www.sane-project.org, SANE} mediante la instalación de las reglas necesarias de udev.
it: Questo servizio fornisce l'accesso agli scanner @i{via} @uref{http://www.sane-project.org, SANE} installando le regole udev necessarie.
zh_cn: 此服务通过安装必要的 udev 规则，提供 @i{via} @uref{http://www.sane-project.org, SANE} 访问扫描仪的功能。

source: Return a service, that extends PAM with entries using @code{pam_gnome_keyring.so}, unlocking a user's login keyring when they log in or setting its password with passwd.
es: Devuelve un servicio, que extiende PAM con apuntes utilizando @code{pam_gnome_keyring.so}, desbloqueando un anillo de acceso de usuario cuando accede o establezca su contraseña con passwd.
it: Restituisce un servizio che estende PAM con voci usando @code{pam_gnome_keyring.so}, sbloccando il portachiavi di accesso di un utente quando effettua l'accesso o impostandone la password con passwd.
zh_cn: 返回一个服务，使用 @code{pam_gnome_keyring.so} 扩展 PAM 条目，在用户登录时解锁其登录密钥环，或通过 passwd 设置其密码。

source: Using a meta-package for gnome-desktop is discouraged.~%
es: Se desaconseja utilizar un meta-paquete para el escritorio de GNOME.~%
it: L'uso di un metapacchetto per gnome-desktop è scoraggiato.~%
zh_cn: 不建议使用 gnome-desktop 的元包。~%

source: Run the GNOME desktop environment.
es: Ejecuta el entorno de escritorio GNOME.
it: Lancia l'ambiente desktop GNOME.
zh_cn: 运行 GNOME 桌面环境。

source: Run the MATE desktop environment.
es: Ejecuta el entorno de escritorio MATE.
it: Lancia l'ambiente desktop MATE.
zh_cn: 运行 MATE 桌面环境。

source: Run the Xfce desktop environment.
es: Ejecuta el entorno de escritorio Xfce.
it: Lancia l'ambiente desktop XFCE.
zh_cn: 运行 Xfce 桌面环境。

source: Run LXQt desktop environment.
es: Ejecuta el entorno de escritorio LXQt.
it: Lancia l'ambiente desktop LXQt.
zh_cn: 运行 LXQt 桌面环境。

source: Run the Sugar desktop environment.
es: Ejecuta el entorno de escritorio Sugar.
it: Lancia l'ambiente desktop Sugar.
zh_cn: 运行 Sugar 桌面环境。

source: Create @file{/tmp/.X11-unix} for XWayland. When using X11, libxcb takes care of creating that directory however, when using XWayland, we need to create it beforehand.
es: Crea @file{/tmp/.X11-unix} para XWayland. Cuando utilice X11, libxcb toma en cuenta la creación de ese directorio, sin embargo, cuando utiliza XWayland, necesitamos crearlo de antemano.
it: Crea @file{/tmp/.X11-unix} per XWayland. Quando si usa X11, libxcb si occupa di creare quella directory, tuttavia, quando si usa XWayland, dobbiamo crearla in anticipo.
zh_cn: 为 XWayland 创建 @file{/tmp/.X11-unix}。使用 X11 时，libxcb 会负责创建该目录，但使用 XWayland 时，需要提前创建。

source: Return a service that adds the @code{enlightenment} package to the system profile, and extends dbus with the ability for @code{efl} to generate thumbnails and privileges the programs which enlightenment needs to function as expected.
es: Devuelva un servicio que añada el paquete @code{enlightenment} al perfil del sistema, y extienda dbus con la habilidad de @code{efi} genere huellas y privilegios para los programas los cuales enlightenment necesita para funcionar como se espera.
it: Restituisce un servizio che aggiunge il pacchetto @code{enlightenment} al profilo di sistema ed estende dbus con la possibilità per @code{efl} di generare miniature e assegnare privilegi ai programmi di cui enlightenment ha bisogno per funzionare come previsto.
zh_cn: 返回一个服务，将 @code{enlightenment} 包添加到系统配置文件，并扩展 dbus，使 @code{efl} 能生成缩略图，并赋予 enlightenment 运行所需的权限。
