Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: The 'GUIX_PULL_URL' environment variable is deprecated. Use '~/.config/guix/channels.scm' instead.
es: La variable de entorno 'GUIX_PULL_URL' está obsoleta. Use '~/.config/guix/channels.scm' en vez de dicha variable.
it: La variabile ambiente 'GUIX_PULL_URL' è deprecata. Usa '~/.config/guix/channels.scm' al suo posto.
zh_cn: 环境变量 'GUIX_PULL_URL' 已弃用。 请改用 '~/.config/guix/channels.scm'。

source: directory '~a' is not owned by user ~a
es: carpeta '~a' no propiedad por usuario ~a
it: la directory '~a' non appartiene all'utente ~a

source: You should run this command as ~a; use @command{sudo -i} or equivalent if you really want to pull as ~a.
es: Ejecutaría esta instrucción como ~a; emplee @command{sudo -i} o equivalente si realmente desea traer como ~a.
it: Dovresti eseguire questo comando come ~a; usa @command{sudo -i} o simile se vuoi davvero fare un pull come ~a.
zh_cn: 您应该以 ~a 身份运行此命令；如果确实想以 ~a 拉取，请使用 @command{sudo -i} 或等效命令。

source: pull the latest revision of Guix
es: obtiene la última revisión de Guix
it: ottiene l'ultima revisione di Guix
zh_cn: 拉取 Guix 的最新修订版本

source: Building from this channel:~%
es: Construyendo a partir de este canal:~%
it: Costruisco da questo canale:~%
zh_cn: 正在使用下列频道构建：~%

source: authentication and authorization of substitutes disabled!~%
es: ¡la validación y autorización de sustituciones no está activada!~%
it: autenticazione e autorizzazione dei sostituti disabilitate!~%
zh_cn: 替代品的认证和授权已禁用！~%

source: host name lookup error: ~a~%
es: error en la búsqueda de nombres de máquinas: ~a~%
it: errore di ricerca del nome host: ~a~%
zh_cn: 主机名查找错误：~a~%

source: TLS error in procedure '~a': ~a~%
es: error TLS en el procedimiento '~a': ~a~%
it: errore TLS nella procedura '~a': ~a~%
zh_cn: 过程 '~a' 中的 TLS 错误：~a~%

source: Usage: guix substitute OPTION [ARGUMENT]... Internal tool to substitute a pre-built binary to a local build.
es: Modo de empleo: guix substitute OPCIÓN [ARGUMENTO]... Herramienta interna para sustituir un binario preconstruido por una construcción local.
it: Uso: guix substitute OPZIONE [ARGOMENTO]... Strumento interno per sostituire un binario precostruito con una build locale.
zh_cn: 用法：guix substitute OPTION [ARGUMENT]... 内部工具，用于将预构建的二进制替代为本地构建。

source: --query report on the availability of substitutes for the store file names passed on the standard input
es: --query informa de la disponibilidad de sustituciones para el almacén de nombres de archivo pasados por la entrada estándar
it: --query rappòrta sulla disponibilità di sostituti per i nomi dei file dello store passati sullo standard input
zh_cn: --query 报告标准输入传入的存储文件名的替代品可用性

source: --substitute STORE-FILE DESTINATION download STORE-FILE and store it as a Nar in file DESTINATION
es: --substitute ARCHIVO-ALMACÉN DESTINO descarga ARCHIVO-ALMACÉN y lo almacena como un Nar en el archivo DESTINO
it: --substitute FILE-DELLO-STORE DESTINAZIONE scarica FILE-DELLO-STORE e memorizzalo come Nar in file DESTINAZIONE
zh_cn: --substitute STORE-FILE DESTINATION 下载 STORE-FILE 并将其作为 Nar 存储到文件 DESTINATION

source: looking for substitutes on '~a'... ~5,1f%
es: buscando sustituciones en '~a'... ~5,1f%
it: cerco i sostituti su '~a'... ~5,1f%
zh_cn: 正在 '~a' 上查询替代品…~5,1f%

source: while fetching ~a: server is somewhat slow~%
es: durante la obtención de ~a: el servidor va lento por alguna razón~%
it: nello scaricare ~a: il server è alquanto lento~%
zh_cn: 获取 ~a 时：服务器响应较慢~%

source: try `--no-substitutes' if the problem persists~%
es: intente «--no-substitutes» si el problema persiste~%
it: prova `--no-substitutes' se il problema persiste~%
zh_cn: 如果问题持续，尝试 `--no-substitutes'~%

source: unsupported substitute URI scheme: ~a~%
es: esquema de URI de sustituciones no implementado: ~a~%
it: schema URI per la sostituzione non supportato: ~a~%
zh_cn: 不支持的替代 URI 方案：~a~%

source: download from '~a' failed, trying next URL~%
es: la descarga desde '~a' ha fallado, intento el siguiente URI ~%
it: scaricamento da '~a' fallito, provo l'URL successivo~%
zh_cn: 从 '~a' 下载失败，尝试下一个 URL~%

source: Downloading ~a...~%
es: Descargando ~a...~%
it: Scarico ~a...~%
zh_cn: 正在下载 ~a...~%

source: no valid nar URLs for ~a at ~a~%
es: nar URLs no válida para ~a en ~a~%
it: nessun URL nar valido per ~a a ~a~%

source: failed to find alternative substitute for '~a'~%
es: incorrecto al encontrar sustitución alternativa para '~a'~%
it: repository per ~a~% non recuperato

source: download from '~a' failed: ~a, ~s~%
es: la descarga desde '~a' ha fallado: ~a, ~s~%
it: scaricamento da '~a' fallito: ~a, ~s~%
zh_cn: 从 '~a' 下载失败：~a，~s~%

source: no valid substitute for '~a'~%
es: ninguna sustitución válida para '~a'~%
it: nessun sostituto valido per '~a'~%

source: retrying download of '~a' with other substitute URLs...~%
es: reintentando descargar de '~a' con otras URLs de sustituciones...~%
it: nuovo tentativo di download di "~a" con altri URL sostitutivi...~%
zh_cn: 正在尝试使用其他替代 URL 重新下载 '~a'...~%

source: ACL for archive imports seems to be uninitialized, substitutes may be unavailable
es: El control de acceso (ACL) para las importaciones de archivos parece no estar inicializado, las sustituciones pueden no estar disponibles
it: L'ACL per le importazioni di archivi sembra non essere inizializzato, i sostituti potrebbero non essere disponibili
zh_cn: 归档导入的 ACL 似乎未初始化，替代品可能不可用

source: ~a: invalid URI~%
es: ~a: URI no válida~%
it: ~a: URI non valido~%

source: implement the build daemon's substituter protocol
es: implementación del protocolo de sustituciones del daemon de construcción
it: implementa il protocollo di sostituzione del demone di build
zh_cn: 实现构建守护进程的替代协议

source: ~a: unrecognized options~%
es: ~a: opciones no reconocidas~%
it: ~a: opzioni non riconosciute~%
zh_cn: ~a: 无法识别的选项~%

source: failed to load key pair at '~a': ~a~%
es: no se pudo cargar el par de claves en '~a': ~a~%
it: impossiibile caricare la coppia di chiavi in '~a': ~a~%

source: invalid signature: ~a
es: firma no válida: ~a
it: firma non valida: ~a

source: unauthorized public key: ~a
es: clave pública no autorizada: ~a
it: chiave pubblica non autorizzata: ~a

source: corrupt signature data: ~a
es: datos de firma corruptos: ~a
it: dati di firma corrotti: ~a

source: sign or verify signatures on normalized archives (nars)
es: firma o verificación de ficheros normalizados (nar)
it: firmare o verificare firme su archivi normalizzati (nars)
zh_cn: 对规范化归档（nars）进行签名或验证签名

source: Usage: guix authenticate OPTION... Sign data or verify signatures. This tool is meant to be used internally by 'guix-daemon'.
es: Modo de empleo: guix authenticate OPCIÓN... Firma datos o verifica firmas. Esta herramienta está destinada al uso interno por parte de 'guix-daemon'.
it: Uso: guix authenticate OPZIONE... Firma i dati o verifica le firme. Questo strumento è pensato per essere utilizzato internamente da 'guix-daemon'.
zh_cn: 用法：guix authenticate OPTION... 签名数据或验证签名。此工具旨在由 'guix-daemon' 内部使用。

source: ~s: invalid command; ignoring~%
es: ~s: orden no válida; se ignora~%
it: ~s: comando non valido; lo ignoro~%

source: wrong arguments~%
es: parámetros incorrectos~%
it: argomenti sbagliati~%

source: copying to '~a'...
es: copiando a '~a'...
it: copio in '~a'...
zh_cn: 正在复制到 '~a'...

source: initializing the current root file system~%
es: inicializando el sistema de archivos raíz actual~%
it: inizializzo il file system radice corrente~%
zh_cn: 正在初始化当前根文件系统~%

source: not running as 'root', so the ownership of '~a' may be incorrect!~%
es: ¡no se está ejecutando como 'root', por lo que la propiedad de '~a' puede ser incorrecta!~%
it: non in esecuzione come 'root', quindi la proprietà di '~a' potrebbe essere errata!~%
zh_cn: 未以 'root' 身份运行，因此 '~a' 的所有权可能不正确！~%

source: bootloader successfully installed on~{ ~a~}~%
es: cargador de arranque instalado satisfactoriamente en ~{ ~a~}~%
it: bootloader installato con successo su ~{ ~a~}~%
zh_cn: 引导加载程序已成功安装在~{ ~a~}~%

source: while talking to shepherd: ~a~%
es: durante la comunicación con shepherd: ~a~%
it: nel dialogare con shepherd: ~a~%
zh_cn: 与 shepherd 通信时出错：~a~%

source: service '~a' could not be found~%
es: no se pudo encontrar el servicio '~a'~%
it: impossibile trovare il servizio '~a'~%

source: service '~a' does not have an action '~a'~%
es: el servicio '~a' no tiene una acción '~a'~%
it: il servizio '~a' non ha un'azione chiamata '~a'~%
zh_cn: 服务 '~a' 没有动作 '~a'~%

source: exception caught while executing '~a' on service '~a':~%
es: se ha capturado una excepción durante la ejecución de '~a' en el servicio '~a':~%
it: eccezione catturata nell'eseguire '~a' sul servizio '~a':~%
zh_cn: 执行服务 '~a' 上的 '~a' 时捕获异常：~%

source: something went wrong: ~s~%
es: algo fue mal: ~s~%
it: qualcosa è andato storto: ~s~%
zh_cn: 出了点问题：~s~%

source: shepherd error~%
es: error de shepherd~%
it: errore di shepherd~%
zh_cn: shepherd 错误~%

source: some services could not be upgraded~%
es: no se pudo actualizar algunos servicios~%
it: non è stato possibile aggiornare alcuni servizi~%
zh_cn: 有些服务无法升级~%

source: To allow changes to all the system services to take effect, you will need to reboot.
es: Es necesario que reinicie la máquina para que los cambios tengan efecto sobre todos los servicios del sistema.
it: Perché le modifiche a tutti i servizi abbiano effetto occorre riavviare il sistema.
zh_cn: 要让所有对系统服务的更改生 效，您需要重新启动。

source: cannot switch to system generation '~a'~%
es: no se pudo pasar a la generación '~a' del sistema~%
it: impossibile passare alla generazione di sistema '~a'~%
zh_cn: 不能切换到系统生成 '~a'~%

source: the DAG of services
es: el GAD de servicios
it: il digrafo aciclico dei servizi
zh_cn: 服务的有向无环图（DAG）

source: the dependency graph of shepherd services
es: el grafo de dependencias de los servicios de shepherd
it: il grafo delle dipendenze dei servizi shepherd
zh_cn: shepherd 服务的依赖图

source: repository URL: ~a~%
es: URL del repositorio: ~a~%
it: URL del repository: ~a~%
zh_cn: 仓库 URL：~a~%

source: file name: ~a~%
es: nombre de archivo: ~a~%
it: nome del file: ~a~%
zh_cn: 文件名：~a~%

source: canonical file name: ~a~%
es: nombre canónico de archivo: ~a~%
it: nome file canonico: ~a~%
zh_cn: 规范文件名：~a~%

source: label: ~a~%
es: etiqueta: ~a~%
it: etichetta: ~a~%
zh_cn: 标签：~a~%

source: root device: ~[UUID: ~a~;label: ~s~;~a~]~%
es: dispositivo raíz: ~[UUID: ~a~;etiqueta: ~s~;~a~]~%
it: dispositivo radice: ~[UUID: ~a~;etichetta: ~s~;~a~]~%
zh_cn: 根设备：~[UUID: ~a~;标签：~s~;~a~]~%

source: channels:~%
es: canales:~%
it: canali:~%
zh_cn: 频道：~%

source: configuration file: ~a~%
es: archivo de configuración: ~a~%
it: file di configurazione: ~a~%
zh_cn: 配置文件：~a~%

source: packages:
es: paquetes:
it: pacchetti:
zh_cn: 软件包：

source: device '~a' not found: ~a~%
es: dispositivo '~a' no encontrado: ~a~%
it: dispositivo '~a' non trovato: ~a~%

source: If '~a' is a file system label, write @code{(file-system-label ~s)} in your @code{device} field.
es: Si '~a' es una etiqueta del sistema de archivos, escriba @code{(file-system-label ~s)} en su campo @code{device}.
it: Se '~a' è un file system label, scrivi @code{(file-system-label ~s)} nel campo @code{device}.
zh_cn: 如果 '~a' 是文件系统标签，请在您的 @code{device} 字段中写入 @code{(file-system-label ~s)}。

source: file system with label '~a' not found~%
es: sistema de archivos con etiqueta '~a' no encontrado~%
it: file system con etichetta '~a' non trovato~%
zh_cn: 未找到标签为 '~a' 的文件系统 ~%

source: file system with UUID '~a' not found~%
es: sistema de archivos con UUID '~a' no encontrado~%
it: file system con UUID '~a' non trovato~%
zh_cn: 未找到 UUID 为 '~a' 的文件系统 ~%

source: 'disk-image' is deprecated: use 'image' instead~%
es: 'disk-image' está obsoleto: use en su lugar 'image'~%
it: è deprecato l'uso di 'disk-image': usa invece 'image'~%
zh_cn: 'disk-image' 已被弃用：用 'image' 代替 ~%

source: 'vm-image' is deprecated: use 'image' instead~%
es: 'vm-image' está obsoleto: use en su lugar 'image'~%
it: 'vm-image' è deprecato: usa 'image' al suo posto~%
zh_cn: 'vm-image' 已被弃用：用 'image' 代替 ~%

source: 'docker-image' is deprecated: use 'image' instead~%
es: 'docker-image' está obsoleto: use en su lugar 'image'~%
it: 'docker-image' è deprecato: usa 'image' al suo posto~%

source: Consider running 'guix pull' before 'reconfigure'.~%
es: Considere ejecutar 'guix pull' antes de 'reconfigure'.~%
it: Valuta se eseguire 'guix pull' prima di 'reconfigure'.~%
zh_cn: 考虑在 'reconfigure' 之前运行 'guix pull'。~%

source: Failing to do that may downgrade your system!~%
es: ¡En caso de no hacerlo puede desactualizar su sistema!~%
it: Scegliere di non farlo può comportare la retrocessione del tuo sistema!~%
zh_cn: 如果不这样做，可能会使您的系统降级！~%

source: bootloader successfully installed on '~a'~%
es: cargador de arranque instalado satisfactoriamente en '~a'~%
it: bootloader installato con successo su '~a'~%
zh_cn: 引导加载程序已成功安装在 '~a'~%

source: activating system...~%
es: activando sistema...~%
it: attivo il sistema...~%
zh_cn: 正在激活系统...~%

source: To complete the upgrade, run 'herd restart SERVICE' to stop, upgrade, and restart each service that was not automatically restarted.
es: Para completar la actualización, ejecute 'herd restart SERVICIO' para parar, actualizar y reiniciar cada servicio que no se reinició automáticamente.
it: Per completare l'aggiornamento, esegui 'herd restart SERVIZIO' per fermare, aggiornare, e riavviare ogni servizio che non è stato riavviato in automatico.
zh_cn: 要完成升级，请运行 'herd restart SERVICE' 来停止、升级并重启未自动重启的每个服务。

source: Run 'herd status' to view the list of services on your system.
es: Ejecute 'herd status' para ver la lista de servicios en su sistema.
it: Esegui 'herd status' per vedere la lista dei servizi sul tuo sistema.
zh_cn: 运行 'herd status' 以查看您系统上的服务的列表。

source: system loaded for fast reboot with 'reboot --kexec'~%
es: sistema cargado para reinicio rápido con 'reboot --kexec'~%
it: sistema caricato per riavvio rapido con 'reboot --kexec'~%
zh_cn: 系统已加载以支持使用 'reboot --kexec' 快速重启~%

source: initializing operating system under '~a'...~%
es: inicializando el sistema operativo en '~a'...~%
it: inizializzo il sistema operativo sotto '~a'...~%
zh_cn: 正在初始化操作系统于 '~a' 下...~%

source: The available image types are:
es: Los tipos de imagen disponibles son:
it: I tipi di immagine disponibili sono:
zh_cn: 可用的镜像类型有：

source: Usage: guix system [OPTION ...] ACTION [ARG ...] [FILE] Build the operating system declared in FILE according to ACTION. Some ACTIONS support additional ARGS.
es: Modo de empleo: guix system [OPCIÓN ...] ACCIÓN [PARÁMETRO ...] [ARCHIVO] Construye el sistema operativo declarado en ARCHIVO de acuerdo con ACCIÓN. Algunas ACCIONES permiten PARÁMETROS adicionales.
it: Uso: guix system [OPZIONE ...] AZIONE [ARG ...] [FILE] Costruisci il sistema operativo dichiarato in FILE secondo AZIONE. Alcune AZIONI supportano ARGS aggiuntivi.
zh_cn: 用法：guix system [OPTION ...] ACTION [ARG ...] [FILE] 根据 ACTION 构建 FILE 中声明的操作系统。 某些 ACTION 支持额外的 ARGS。

source: search search for existing service types
es: search busca tipos de servicio existentes
it: search cerca tra i tipi di servizio esistenti
zh_cn: search 搜索现有服务类型

source: edit edit the definition of an existing service type
es: edit edita la definición de un tipo de servicio existente
it: edit modifica la definizione di un tipo servizio esistente
zh_cn: edit 编辑现有服务类型的定义

source: reconfigure switch to a new operating system configuration
es: reconfigure cambia a una configuración nueva de sistema operativo
it: reconfigure passa a una nuova configurazione del sistema operativo
zh_cn: reconfigure 切换到新的操作系统配置

source: roll-back switch to the previous operating system configuration
es: roll-back cambia a la configuración previa del sistema operativo
it: roll-back passa alla precedente configurazione del sistema operativo
zh_cn: roll-back 切换到之前的操作系统配置

source: describe describe the current system
es: describe describe el sistema actual
it: describe descrive il sistema corrente
zh_cn: describe 描述当前系统

source: list-generations list the system generations
es: list-generations enumera las generaciones del sistema
it: list-generations elenca le generazioni di sistema
zh_cn: list-generations 列出系统代

source: switch-generation switch to an existing operating system configuration
es: switch-generation cambia a configuración existente del sistema operativo
it: switch-generation passa a un'altra configurazione esistente del sistema operativo
zh_cn: switch-generation 切换到现有的操作系统配置

source: delete-generations delete old system generations
es: delete-generations borra generaciones antiguas del sistema
it: delete-generations elimina le vecchie generazioni sistema
zh_cn: delete-generations 删除旧的系统代

source: build build the operating system without installing anything
es: build construye el sistema operativo sin instalar nada
it: build costruisce il sistema operativo senza installare nulla
zh_cn: build 构建操作系统但不安装任何内容

source: container build a container that shares the host's store
es: container construye un contenedor que comparte el almacén de la máquina anfitriona
it: container costruisce un contenitore che condivide lo store dell'host
zh_cn: container 构建一个共享主机存储的容器

source: vm build a virtual machine image that shares the host's store
es: vm construye una imagen de máquina virtual que comparte el almacén de la máquina anfitriona
it: vm costruisce un'immagine per vm che condivide lo store dell'host
zh_cn: vm 构建一个共享主机存储的虚拟机镜像

source: image build a Guix System image
es: image construye una imagen Guix System
it: image costruisce un'immagine del Sistema Guix
zh_cn: image 构建 Guix 系统镜像

source: docker-image build a Docker image
es: docker-image construye una imagen Docker
it: docker-image costruisce un'immagine Docker
zh_cn: docker-image 构建 Docker 镜像

source: init initialize a root file system to run GNU
es: init inicializa un sistema de archivos raíz para ejecutar GNU
it: init inizializza un file system radice per eseguire GNU
zh_cn: init 初始化根文件系统以运行 GNU

source: installer run the graphical installer
es: installer ejecuta un instalador gráfico
it: installer lancia l'installatore grafico
zh_cn: installer 运行图形安装程序

source: extension-graph emit the service extension graph in Dot format
es: extension-graph emite el grafo de extensiones de servicios en formato Dot
it: extension-graph emette il grafo dell'estensione del servizio in formato Dot
zh_cn: extension-graph 以 Dot 格式输出服务扩展图

source: shepherd-graph emit the graph of shepherd services in Dot format
es: shepherd-graph emite el grafo de servicios de shepherd en formato Dot
it: shepherd-graph emette il grafo dei servizi Shepherd in formato Dot
zh_cn: shepherd-graph 以 Dot 格式输出 shepherd 服务图

source: -d, --derivation return the derivation of the given system
es: -d, --derivation devuelve la derivación del sistema proporcionado
it: -d, --derivation restituisce la derivazione del sistema specificato
zh_cn: -d, --derivation 返回给定系统的派生文件

source: -e, --expression=EXPR consider the operating-system EXPR evaluates to instead of reading FILE, when applicable
es: -e, --expression=EXPR considera el sistema operativo al cual EXPR evalúa en vez de leer ARCHIVO, cuando sea posible
it: -e, --expression=EXPR considera il sistema operativo a cui ESPR fa riferimento invece di leggere FILE, quando applicabile
zh_cn: -e, --expression=EXPR 考虑操作系统 EXPR 的计算结果，适用时替代读取 FILE

source: --allow-downgrades for 'reconfigure', allow downgrades to earlier channel revisions
es: --allow-downgrades con 'reconfigure', permite la vuelta a revisiones previas del canal
it: --allow-downgrades per 'reconfigure', consente i downgrade a versioni precedenti revisioni del canale
zh_cn: --allow-downgrades 对于 'reconfigure'，允许降级到更早的频道修订版本

source: --on-error=STRATEGY apply STRATEGY (one of nothing-special, backtrace, or debug) when an error occurs while reading FILE
es: --on-error=ESTRATEGIA aplica ESTRATEGIA (o bien 'nothing-special', 'backtrace' o 'debug') cuando suceda un error durante la lectura de ARCHIVO
it: --on-error=STRATEGIA applica STRATEGIA (una tra nothing-special, backtrace, o debug) in caso di errore durante la lettura di FILE
zh_cn: --on-error=STRATEGY 当读取 FILE 时发生错误，应用 STRATEGY（可选值：nothing-special、backtrace 或 debug）

source: --list-image-types list available image types
es: --list-image-types enumera los tipos de imagen disponibles
it: --list-image-types elenca i tipi di immagine disponibili
zh_cn: --list-image-types 列出可用的镜像类型

source: -t, --image-type=TYPE for 'image', produce an image of TYPE
es: -t, --image-type=TYPE para 'image', produce una imagen de TYPE
it: -t, --image-type=TIPO per 'image', produce un'immagine di TIPO
zh_cn: -t, --image-type=TYPE 对于 'image'，生成 TYPE 类型的镜像

source: --image-size=SIZE for 'image', produce an image of SIZE
es: --image-size=TAMAÑO para 'image', produce una imagen de TAMAÑO
it: --image-size=SIZE per 'image', produce un'immagine di SIZE
zh_cn: --image-size=SIZE 对于 'image'，生成 SIZE 大小的镜像

source: --no-bootloader for 'init', do not install a bootloader
es: --no-bootloader con 'init', no instala un cargador de arranque
it: --no-bootloader per 'init', non installare un bootloader
zh_cn: --no-bootloader 对于 'init'，不安装引导加载程序

source: --no-kexec for 'reconfigure', do not load system for kexec reboot
es: --no-kexec para 'reconfigure', no carga el sistema para rearrancar kexec
it: --no-kexec per 'reconfigure', non caricare il sistema per il riavvio di kexec
zh_cn: --no-kexec 对于 'reconfigure'，不加载系统以进行 kexec 重启

source: --volatile for 'image', make the root file system volatile
es: --volatile para 'image', hace el sistema de archivos root volátil
it: --volatile per 'image', rendere volatile il file system radice
zh_cn: --volatile 对于 'image'，使根文件系统为易失性

source: --persistent for 'vm', make the root file system persistent
es: --persistent para 'vm', hace el sistema de archivos root persistente
it: --persistent per 'vm', rende persistente il file system radice
zh_cn: --persistent 对于 'vm'，使根文件系统为持久性

source: --label=LABEL for 'image', label disk image with LABEL
es: --label=ETIQUETA para 'image', etiqueta la imagen de disco con ETIQUETA
it: --label=ETICHETTA per 'image', etichetta l'immagine disco con ETICHETTA
zh_cn: --label=LABEL 对于 'image'，用 LABEL 标记磁盘镜像

source: --save-provenance save provenance information
es: --save-provenance almacena información de la proveniencia
it: --save-provenance salva le informazioni di provenienza
zh_cn: --save-provenance 保存来源信息

source: --share=SPEC for 'vm' and 'container', share host file system with read/write access according to SPEC
es: --share=SPEC con 'vm' y 'container', comparte acceso de lectura/escritura al sistema de archivos del sistema anfitrión según SPEC
it: --share=SPEC per 'vm' e 'container', condivide il file system dell'host con accesso in lettura/scrittura secondo SPEC
zh_cn: --share=SPEC 对于 'vm' 和 'container'，根据 SPEC 共享主机文件系统的读写权限

source: --expose=SPEC for 'vm' and 'container', expose host file system directory as read-only according to SPEC
es: --expose=SPEC con 'vm' y 'container', expone el directorio del sistema de archivos del anfitrión con acceso de sólo-lectura según SPEC
it: --expose=SPEC per 'vm' e 'container', espone la directory del file system dell'host come sola lettura secondo SPEC
zh_cn: --expose=SPEC 对于 'vm' 和 'container'，根据 SPEC 以只读方式暴露主机文件系统目录

source: -N, --network for 'container', allow containers to access the network
es: -N, --network para 'container', permite el acceso a la red a los contenedores
it: -N, --network per 'container', permette ai contenitori di accedere alla rete
zh_cn: -N, --network 对于 'container'，允许容器访问网络
