Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: failed to create ~a derivation: ~a
es: no se pudo crear derivación para ~a: ~a
it: impossibile creare una derivazione per ~a: ~a
zh_cn: 创建 ~a 派生关系失败：~a

source: failed to create ~a derivation: ~s
es: no se pudo crear la derivación para ~a: ~s
it: impossibile creare una derivazione per ~a: ~s
zh_cn: 创建 ~a 派生失败：~s

source: propagated inputs ~a and ~a collide
es: las entradas propagadas ~a y ~a colisionan
it: gli input propagati ~a e ~a si scontrano
zh_cn: 传播的输入 ~a 和 ~a 冲突

source: invalid license field
es: campo license no válido
it: campo della licenza non valido
zh_cn: 无效的许可证字段

source: while retrieving CVE vulnerabilities
es: durante la obtención de vulnerabilidades CVE
it: durante il recupero delle vulnerabilità CVE
zh_cn: 检索 CVE 漏洞时

source: failed to get list of CVE vulnerabilities from '~a': ~a (~a)~%
es: incorrecto al obtener el listado de vulnerabilidad CVE desde '~a': ~a (~a)~%
it: impossibile ottenere l'elenco delle vulnerabilità CVE da '~a': ~a (~a)~%
zh_cn: 向 ~a 获取 CVE 漏洞列表时失败：~a(~a)~%

source: probably vulnerable to ~a
es: probablemente vulnerable a ~a
it: probabilmente vulnerabile a ~a
zh_cn: 可能易受 ~a 攻击

source: '~a' should be set with the '~a' flag
it: '~a' dovrebbe essere impostata con il flag '~a'

source: no updater for ~a
es: sin actualizador para ~a
it: nessun aggiornatore per ~a
zh_cn: 没有适用于 ~a 的更新器

source: while retrieving upstream info for '~a'
es: durante la obtención de información oficial para '~a'
it: durante il recupero delle informazioni upstream per '~a'
zh_cn: 检索 '~a' 的上游信息时

source: can be upgraded to ~a
es: puede actualizarse a ~a
it: può essere aggiornato a ~a
zh_cn: 可升级至 ~a

source: updater '~a' failed to find upstream releases
es: el actualizador '~a' falló para encontrar versiones anteriores
it: l'aggiornatore '~a' non è riuscito a trovare rilasci upstream
zh_cn: 更新器 '~a' 未能找到上游版本

source: failed to access Disarchive database at ~a
es: falló el acceso a la base de datos Disarchive en ~a
it: impossibile accedere al database Disarchive in ~a

source: Software Heritage rate limit reached; try again later
es: límite de la tasa de Software Heritage alcanzado; pruebe de nuevo más tarde
it: limite di velocità di Software Heritage raggiunto; riprova più tardi
zh_cn: Software Heritage 速率限制已达；请稍后再试

source: '~a' returned ~a
es: '~a' devolvió ~a
it: '~a' ha restituito ~a
zh_cn: '~a' 返回了 ~a

source: scheduled Software Heritage archival
es: archivo planificado en Software Heritage
it: archiviazione su Software Heritage programmata
zh_cn: 已安排 Software Heritage 归档

source: archival rate limit exceeded; try again later
es: límite de la tasa de archivo superado; pruebe de nuevo más tarde
it: limite di velocità di archiviazione superato; riprova più tardi
zh_cn: 归档速率限制超出；请稍后再试

source: source code cannot be archived
es: el código fuente no puede ser archivado
it: il codice sorgente non può essere archiviato
zh_cn: 源代码无法归档

source: source not archived on Software Heritage and missing from the Disarchive database
es: fuente no archivada en Software Heritage y desaparecida de la base de datos Disarchive
it: sorgente non archiviata su Software Heritage e mancante dal database Disarchive
zh_cn: 源未在 Software Heritage 归档且在 Disarchive 数据库中缺失

source: Disarchive entry refers to non-existent SWH directory '~a'
es: La entrada Disarchive se refiere a un directorio SWH que no existe '~a'
it: La voce di Disarchive fa riferimento a una directory SWH inesistente, '~a'
zh_cn: Disarchive 条目引用了不存在的 SWH 目录 '~a'

source: source is not an origin, it cannot be archived
es: la fuente no es un origen, no puede ser archivada
it: la sorgente non è un'origine, non può essere archiviata
zh_cn: 源不是起点，无法归档

source: while connecting to Software Heritage
es: durante la conexión a Software Heritage
it: durante la connessione a Software Heritage
zh_cn: 连接 Software Heritage 时

source: ahead of Stackage LTS version ~a
es: por delante de Stackage LTS versión ~a
it: prima della versione LTS di Stackage ~a
zh_cn: 领先 Stackage LTS 版本 ~a

source: tabulation on line ~a, column ~a
es: tabulador en línea ~a, columna ~a
it: tabulazione sulla riga ~a, colonna ~a
zh_cn: 第 ~a 行，第 ~a 列的制表符

source: trailing white space on line ~a
es: espacio en blanco al final de la línea ~a
it: spazio bianco finale sulla riga ~a
zh_cn: 第 ~a 行的尾随空白

source: line ~a is way too long (~a characters)
es: la línea ~a es demasiado larga (~a caracteres)
it: la riga ~a è troppo lunga (~a caratteri)
zh_cn: 第 ~a 行过长 (~a 字符)

source: parentheses feel lonely, move to the previous or next line
es: el paréntesis se siente solo, muevalo a la línea anterior o posterior
it: le parentesi si sentono sole, spostale nella riga precedente o successiva
zh_cn: 括号显得孤立，请移至上一行或下一行

source: source file not found
es: archivo de fuentes no encontrado
it: file sorgente non trovato

source: Validate package names
es: Valida los nombres de los paquetes
it: Convalida i nomi dei pacchetti
zh_cn: 验证包名

source: Check if tests are explicitly enabled
es: Revisa si las pruebas están activadas explícitamente
it: Controlla se i test sono esplicitamente abilitati
zh_cn: 检查测试是否明确启用

source: Check that cross-compilers are used when cross-compiling
es: Revisa que se usen los compiladores cruzados cuando haya compilación cruzada
it: Controlla che siano usati dei cross-compilatori quando si cross-compila
zh_cn: 检查交叉编译时是否使用交叉编译器

source: Validate package descriptions
es: Valida las descripciones de los paquetes
it: Convalida le descrizioni dei pacchetti
zh_cn: 验证包描述

source: Identify inputs that should be native inputs
es: Identifica entradas que deberían ser entradas nativas
it: Identifica gli input che dovrebbero essere nativi
zh_cn: 识别应为本地输入的输入项

source: Identify inputs that shouldn't be inputs at all
es: Identifica entradas que no deberían ser entradas en absoluto
it: Identifica gli input che non dovrebbero essere tali
zh_cn: 识别不应作为输入的输入项

source: Identify inputs that should use their minimal variant
es: Identifica entradas que deberían utilizar su variante mínima
it: Identifica gli input che dovrebbero usare la loro variante minima
zh_cn: 识别应使用其最小变体的输入项

source: Identify input labels that do not match package names
es: Identifica etiquetas de entradas que no coinciden con nombres de paquete
it: Identifica le etichette di input che non corrispondono ai nomi dei pacchetti
zh_cn: 识别与包名不匹配的输入标签

source: Make sure 'wrap-program' can find its interpreter.
es: Verifica que «wrap-program» pueda encontrar su intérprete.
it: Assicura che 'wrap-program' possa trovare il suo interprete.
zh_cn: 确保 'wrap-program' 能找到它的解释器。

source: Make sure the 'license' field is a <license> or a list thereof
es: Verifica que el campo «license» sea un objeto <license> o una lista de ellos
it: Assicura che il campo 'license' sia una <license> o un elenco di queste
zh_cn: 确保 'license' 字段是一个 <license> 或者它们的列表

source: Make sure tests are only run when requested
es: Verifica que las pruebas se ejecuten únicamente cuando se solicite
it: Assicura che i test vengano eseguiti solo quando richiesto
zh_cn: 确保测试仅在请求时运行

source: Suggest 'mirror://' URLs
es: Sugiere URL del tipo «mirror://»
it: Suggerisce gli URL "mirror://
zh_cn: 建议使用 'mirror://' URL

source: Validate file names of sources
es: Valida nombres de archivo de fuentes
it: Convalida i nomi dei file delle sorgenti
zh_cn: 验证源文件名

source: Check for autogenerated tarballs
es: Verifica si las fuentes corresponden a archivadores tar autogenerados
it: Controlla la presenza di tarball autogenerati
zh_cn: 检查自动生成的 tar 包

source: Check for misplaced flags
it: Controllo flag posizionati male
zh_cn: 检查错误放置的标志

source: Report failure to compile a package to a derivation
es: Informa fallos al compilar un paquete en una derivación
it: Segnala il fallimento nel compilare un pacchetto in una derivazione
zh_cn: 报告将包编译为派生项失败

source: Report collisions that would occur due to propagated inputs
es: Informa de colisiones que puedan ocurrir debido a entradas propagadas
it: Segnala le collisioni che si verificherebbero a causa di input propagati
zh_cn: 报告因传播输入而可能发生的冲突

source: Validate file names and availability of patches
es: Valida nombres de archivo y disponibilidad de parches
it: Convalida i nomi dei file e la disponibilità delle patch
zh_cn: 验证补丁的文件名和可用性

source: Validate patch headers
es: Valida las cabeceras de los parches
it: Convalida le intestazioni delle patch
zh_cn: 验证补丁头信息

source: Look for formatting issues in the source
es: Busca problemas en el formato de las fuentes
it: Cerca problemi di formattazione nella sorgente
zh_cn: 检查源代码中的格式问题

source: Validate package synopses
es: Valida las sinopsis de los paquetes
it: Convalida le sinossi dei pacchetti
zh_cn: 验证包的简介

source: Validate synopsis & description of GNU packages
es: Valida sinopsis y descripciones de paquetes GNU
it: Convalida la sinossi e la descrizione dei pacchetti GNU
zh_cn: 验证 GNU 包的简介和描述

source: Validate home-page URLs
es: Valida URL de las páginas Web de los paquetes
it: Convalida gli URL delle pagine home
zh_cn: 验证主页 URL

source: Validate source URLs
es: Valida las URL de las fuentes
it: Convalida gli URL delle sorgenti
zh_cn: 验证源代码 URL

source: Suggest GitHub URLs
es: Sugiere URL de GitHub
it: Suggerisce gli URL di GitHub
zh_cn: 建议使用 GitHub URL

source: Check the Common Vulnerabilities and Exposures (CVE) database
es: Comprueba la base de datos de vulnerabilidades y exposiciones comunes (CVE)
it: Controlla il database CVE (Common Vulnerabilities and Exposures)
zh_cn: 检查常见漏洞和暴露（CVE）数据库

source: Check the package for new upstream releases
es: Comprueba el paquete en busca de nuevas publicaciones oficiales
it: Verifica la presenza di nuovi rilasci upstream del pacchetto
zh_cn: 检查包是否有新的上游版本

source: Ensure source code archival on Software Heritage
es: Asegura el archivado del código fuente en Software Heritage
it: Assicura l'archiviazione del codice sorgente su Software Heritage
zh_cn: 确保源代码存档在 Software Heritage 上

source: Ensure Haskell packages use Stackage LTS versions
es: Verifica que los paquetes de Haskell usen versiones de Stackage LTS
it: Assicura che i pacchetti Haskell utilizzino le versioni LTS di Stackage
zh_cn: 确保 Haskell 包使用 Stackage LTS 版本

source: Usage: guix download [OPTION] URL Download the file at URL to the store or to the given file, and print its file name and the hash of its contents.
es: Modo de empleo: guix download [OPCIÓN] URL Descarga el archivo en URL al almacén o al archivo proporcionado, e imprime su nombre de archivo y el hash de su contenido.
it: Uso: guix download [OPZIONE] URL Scarica il file all'URL nello store o nel file indicato e stampa il nome del file e l'hash del suo contenuto.
zh_cn: 用法：guix download [OPTION] URL 将 URL 处的文件下载到存储或指定文件，并打印其文件名和内容的哈希值。

source: Supported formats: 'base64', 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
es: Formatos disponibles: 'base64', 'nix-base32' (predeterminado), 'base32' y 'base16' (también se puede usar 'hex' y 'hexadecimal').
it: Formati supportati: 'base64', 'nix-base32' (predefinito), 'base32', e 'base16' (anche 'hex' e 'hexadecimal' vanno bene).
zh_cn: 支持的格式：'base64'，'nix-base32'（默认），'base32'，和 'base16'（也可使用 'hex' 和 'hexadecimal'）。

source: -f, --format=FMT write the hash in the given format
es: -f, --format=FMT escribe el hash en el formato proporcionado
it: -f, --format=FMT scrive l'hash nel formato dato
zh_cn: -f, --format=FMT 以指定格式写入哈希值

source: -H, --hash=ALGORITHM use the given hash ALGORITHM
es: -H, --hash=ALGORITMO usa el ALGORITMO de hash proporcionado
it: -H, --hash=ALGORITMO usa questo ALGORITMO di hash
zh_cn: -H, --hash=ALGORITHM 使用指定的哈希算法 ALGORITHM

source: --no-check-certificate do not validate the certificate of HTTPS servers
es: --no-check-certificate no valida el certificado de los servidores HTTPS
it: --no-check-certificate non convalidare il certificato dei server HTTPS
zh_cn: --no-check-certificate 不验证 HTTPS 服务器的证书

source: -o, --output=FILE download to FILE
es: -o, --output=ARCHIVO descarga en ARCHIVO
it: -o, --output=FILE scarica in FILE
zh_cn: -o, --output=FILE 下载到 FILE

source: -g, --git download the default branch's latest commit of the Git repository at URL
es: -g, --git descarga la última confirmación rama predeterminada de efectuar del repositorio Git en URL
it: -g, --git scarica dall'URL del repository Git l'ultimo commit del branch principale

source: --commit=COMMIT-OR-TAG download the given commit or tag of the Git repository at URL
es: --commit=COMMIT-O-TAG descarga el commit dado o etiqueta del repositorio Git en URL
it: --commit=COMMIT-O-TAG scarica dall'URL del repository Git il COMMIT o il TAG dati
zh_cn: --commit=COMMIT-OR-TAG 下载 URL 处 Git 仓库的指定提交或标签

source: --branch=BRANCH download the given branch of the Git repository at URL
es: --branch=BRANCH descarga la ramificación dado desde el repositorio Git en el URL
it: --branch=BRANCH scarica dall'URL del repository Git il BRANCH dato

source: -r, --recursive download a Git repository recursively
es: -r, --recursive descarga recursivamente un repositorio Git
it: -r, --recursive scarica un repository Git ricorsivamente

source: unsupported hash format: ~a~%
es: formato de hash no implementado: ~a~%
it: formato hash non supportato: ~a~%
zh_cn: 不支持的哈希格式：~a~%

source: ~a: unknown hash algorithm~%
es: ~a: algoritmo de hash desconocido~%
it: ~a: algoritmo di hash sconosciuto~%

source: download a file to the store and print its hash
es: descarga un archivo al almacén y muestra su hash
it: scarica un file nello store e stampa il suo hash
zh_cn: 下载文件到存储并打印其哈希值

source: ~A: extraneous argument~%
es: ~A: parámetro no conocido~%
it: ~A: argomento estraneo~%
zh_cn: ~A：多余的参数~%

source: no download URI was specified~%
es: ninguna URI de descarga fue especificada~%
it: non è stato specificato un URI per il download~%
zh_cn: 未指定下载 URI~%

source: ~a: failed to parse URI~%
es: ~a: se produjo un fallo al procesar la URI~%
it: ~a: parse di URI fallito~%
zh_cn: ~a：解析 URI 失败~%

source: ~a: download failed~%
es: ~a: descarga fallida~%
it: ~a: download fallito~%
zh_cn: ~a：下载失败~%

source: not removing generation ~a, which is current~%
es: no se borra la generación ~a, que es la actual~%
it: non rimuovo la generazione ~a, che è la corrente~%
zh_cn: 不删除当前的生成版本 ~a~%

source: no matching generation~%
es: ninguna generación corresponde con el patrón~%
it: nessuna generazione corrispondente~%
zh_cn: 无匹配的生成版本~%

source: nothing to be done~%
es: nada que hacer~%
it: niente da fare~%
zh_cn: 无操作需要执行~%

source: package '~a' no longer exists~%
es: paquete '~a' ya no existe~%
it: il pacchetto '~a' non esiste più~%
zh_cn: 软件包“~a”已不再存在~%

source: Consider setting the necessary environment variables by running: @example GUIX_PROFILE="~a" . "$GUIX_PROFILE/etc/profile" @end example Alternately, see @command{guix package --search-paths -p ~s}.
es: Considere proporcionar valor a las variables de entorno necesarias ejecutando: @example GUIX_PROFILE="~a" . "$GUIX_PROFILE/etc/profile" @end example Alternativamente, véase @command{guix package --search-paths -p ~s}.
it: Valuta di impostare le necessarie variabili ambiente eseguendo: @example GUIX_PROFILE="~a" . "$GUIX_PROFILE/etc/profile" @end example In alternativa, vedi @command{guix package --search-paths -p ~s}.
zh_cn: 考虑通过运行以下命令设置必要的环境变量： @example GUIX_PROFILE="~a" . "$GUIX_PROFILE/etc/profile" @end example 或者，参见 @command{guix package --search-paths -p ~s}。

source: ;; This "manifest" file can be passed to 'guix package -m' to reproduce ;; the content of your profile. This is "symbolic": it only specifies ;; package names. To reproduce the exact same profile, you also need to ;; capture the channels being used, as returned by "guix describe". ;; See the "Replicating Guix" section in the manual.
es: ;; Este archivo "manifest" se puede pasar a 'guix package -m' para reproducir ;; el contenido de su perfil. Esto es "symbolic": sólo especifica ;; nombres de paquete. Para reproducir el mismo perfil exacto, necesita también ;; capturar los canales que se están usando, devueltos por "guix describe". ;; Vea la sección "Replicando Guix" en el manual.
it: ;; Questo file "manifest" può essere passato a 'guix package -m' per riprodurre ;; il contenuto del profilo. Questo file è "simbolico": specifica solo i ;; i nomi dei pacchetti. Per riprodurre esattamente lo stesso profilo, è ;; necessario anche catturare i canali utilizzati, come restituiti da ;; "guix describe". Si veda la sezione "Replicating Guix" del manuale.
zh_cn: ;; 此“manifest”文件可传递给 'guix package -m' 以重现 ;; 您的配置文件内容。这是“符号化”的：它只指定 ;; 包名。要重现完全相同的配置文件，您还需要 ;; 捕获所使用的频道，如“guix describe”返回的那样。 ;; 参见手册中的“复制 Guix”部分。

source: no provenance information for this profile~%
es: no hay información de procedencia para este perfil~%
it: nessuna informazione di provenienza per questo profilo~%
zh_cn: 此配置文件无来源信息~%

source: ;; This channel file can be passed to 'guix pull -C' or to ;; 'guix time-machine -C' to obtain the Guix revision that was ;; used to populate this profile.
es: ;; Este archivo de canal se puede pasar a 'guix pull -C' o a ;; 'guix time-machine -C' para obtener la revisión Guix que se ;; uso para propagar este perfil.
it: ;; Questo file channel può essere passato a 'guix pull -C' o a ;; 'guix time-machine -C' per ottenere la revisione Guix che è stata ;; usata per popolare questo profilo
zh_cn: ;; 此频道文件可传递给 'guix pull -C' 或 ;; 'guix time-machine -C' 以获取用于填充此配置文件的 Guix 修订版本。

source: ;; Note: these other commits were also used to install some of the packages in this profile:~%
es: ;; Aviso: estas otras confirmaciones también se usaron para instalar algunos de los paquetes en este perfil:~%
it: ;; Nota: questi altri commit sono stati usati per installare alcuni dei pacchetti in questo profilo:~%
zh_cn: ;; 注意：这些其他提交也用于安装此配置文件中的某些软件包：~%

source: Usage: guix package [OPTION]... Install, remove, or upgrade packages in a single transaction.
es: Modo de empleo: guix package [OPCIÓN]... Instala, elimina o actualiza paquetes en una única transacción.
it: Uso: guix package [OPZIONE]... Installa, rimuovi, o aggiorna pacchetti in una singola transazione.
zh_cn: 用法：guix package [OPTION]... 在单个事务中安装、移除或升级软件包。

source: -i, --install PACKAGE ... install PACKAGEs
es: -i, --install PAQUETE ... instala PAQUETE
it: -i, --install PACCHETTO ... installa uno o più pacchetti
zh_cn: -i, --install PACKAGE ... 安装 PACKAGEs

source: -e, --install-from-expression=EXP install the package EXP evaluates to
es: -e, --install-from-expression=EXP instala el paquete al que EXP evalúa
it: -e, --install-from-expression=EXP installa il pacchetto corrispondente al valore di EXP
zh_cn: -e, --install-from-expression=EXP 安装 EXP 计算得到的软件包

source: -f, --install-from-file=FILE install the package that the code within FILE evaluates to
es: -f, --install-from-file=ARCHIVO instala el paquete al que el código en ARCHIVO evalúa
it: -f, --install-from-file=FILE installa il pacchetto corrispondente al valore restituito dal codice in FILE
zh_cn: -f, --install-from-file=FILE 安装 FILE 中代码计算得到的软件包

source: -r, --remove PACKAGE ... remove PACKAGEs
es: -r, --remove PAQUETE ... elimina PAQUETE
it: -r, --remove PACCHETTO ... rimuove uno o più pacchetti
zh_cn: -r, --remove PACKAGE ... 移除 PACKAGEs

source: -u, --upgrade[=REGEXP] upgrade all the installed packages matching REGEXP
es: -u, --upgrade[=EXPREG] actualiza todos los paquetes instalados cuyo nombre coincida con EXPREG
it: -u, --upgrade[=REGEXP] aggiorna tutti i pacchetti installati che corrispondono a REGEXP
zh_cn: -u, --upgrade[=REGEXP] 升级所有匹配 REGEXP 的已安装软件包

source: -m, --manifest=FILE create a new profile generation with the manifest from FILE
es: -m, --manifest=ARCHIVO crea una nueva generación del perfil con el manifiesto del ARCHIVO
it: -m, --manifest=FILE crea una nuova generazione profilo con il manifesto contenuto in FILE
zh_cn: -m, --manifest=FILE 使用来自 FILE 的清单创建新的配置文件生成

source: --do-not-upgrade[=REGEXP] do not upgrade any packages matching REGEXP
es: --do-not-upgrade[=REGEXP] no actualiza ningún paquete que REGEXP acepte
it: --do-not-upgrade[=REGEXP] non aggiornare i pacchetti corrispondenti a REGEXP
zh_cn: --do-not-upgrade[=REGEXP] 不升级任何匹配 REGEXP 的软件包

source: --roll-back roll back to the previous generation
es: --roll-back vuelve a la generación previa
it: --roll-back torna alla generazione precedente
zh_cn: --roll-back 回滚到上一个生成

source: --search-paths[=KIND] display needed environment variable definitions
es: --search-paths[=CLASE] muestra las definiciones de variables de entorno necesarias
it: --search-paths[=KIND] mostra le definizioni delle variabili ambiente necessarie
zh_cn: --search-paths[=KIND] 显示所需的环境变量定义

source: -l, --list-generations[=PATTERN] list generations matching PATTERN
es: -l, --list-generations[=PATRÓN] enumera las generaciones que correspondan con PATRÓN
it: -l, --list-generations[=PATTERN] elenca le generazioni che corrispondono a PATTERN
zh_cn: -l, --list-generations[=PATTERN] 列出匹配 PATTERN 的生成

source: -d, --delete-generations[=PATTERN] delete generations matching PATTERN
es: -d, --delete-generations[=PATRÓN] borra las generaciones que correspondan con PATRÓN
it: -d, --delete-generations[=PATTERN] elimina le generazioni che corrispondono a PATTERN
zh_cn: -d, --delete-generations[=PATTERN] 删除匹配 PATTERN 的生成

source: -S, --switch-generation=PATTERN switch to a generation matching PATTERN
es: -S, --switch-generation=PATRÓN cambia a una generación que corresponda con PATRÓN
it: -S, --switch-generation=PATTERN passa a una generazione corrispondente a PATTERN
zh_cn: -S, --switch-generation=PATTERN 切换到匹配 PATTERN 的生成

source: --export-manifest print a manifest for the chosen profile
es: --export-manifest imprime un manifiesto para el perfil elegido
it: --export-manifest stampa un manifesto per il profilo scelto
zh_cn: --export-manifest 打印所选配置文件的清单

source: --export-channels print channels for the chosen profile
es: --export-channels imprime canales para el perfil elegido
it: --export-channels stampa i canali per il profilo scelto
zh_cn: --export-channels 打印所选配置文件的频道

source: -p, --profile=PROFILE use PROFILE instead of the user's default profile
es: -p, --profile=PERFIL usa PERFIL en vez del perfil predeterminado del usuario
it: -p, --profile=PROFILO usa PROFILO invece del profilo predefinito dell'utente
zh_cn: -p, --profile=PROFILE 使用 PROFILE 替代用户的默认配置文件

source: --list-profiles list the user's profiles
es: --list-profiles enumera los perfiles del usuario
it: --list-profiles elenca i profili dell'utente
zh_cn: --list-profiles 列出用户的配置文件

source: --allow-collisions do not treat collisions in the profile as an error
es: --allow-collisions no toma las colisiones en el perfil como errores
it: --allow-collisions non trattare le collisioni nel profilo come un errore
zh_cn: --allow-collisions 不将配置文件中的冲突视为错误

source: --bootstrap use the bootstrap Guile to build the profile
es: --bootstrap usa la oreja Guile para construir el perfil
it: --bootstrap usa il Guile di bootstrap per costruire il profilo
zh_cn: --bootstrap 使用引导 Guile 构建配置文件

source: -s, --search=REGEXP search in synopsis and description using REGEXP
es: -s, --search=REGEXP busca en las sinopsis y descripciones usando REGEXP
it: -s, --search=REGEXP ricerca nella sinossi e nella descrizione usando REGEXP
zh_cn: -s, --search=REGEXP 使用 REGEXP 在概要和描述中搜索

source: -I, --list-installed[=REGEXP] list installed packages matching REGEXP
es: -I, --list-installed[=REGEXP] enumera los paquetes instalados que REGEXP acepte
it: -I, --list-installed[=REGEXP] elenca i pacchetti installati che corrispondono a REGEXP
zh_cn: -I, --list-installed[=REGEXP] 列出匹配 REGEXP 的已安装软件包

source: -A, --list-available[=REGEXP] list available packages matching REGEXP
es: -A, --list-available[=REGEXP] enumera los paquetes disponibles que REGEXP acepte
it: -A, --list-available[=REGEXP] elenca i pacchetti disponibili che corrispondono a REGEXP
zh_cn: -A, --list-available[=REGEXP] 列出匹配 REGEXP 的可用软件包
