Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: Populate @file{/etc/environment}, which is honored by @code{pam_env}, with the specified environment variables. The value of this service is a list of name/value pairs for environments variables, such as: @example '(("TZ" . "Canada/Pacific")) @end example
es: Poblar @file{/etc/environment}, lo cual es honrado por @code{pam_env}, con las variables del entorno especificado. El valor de este servicio es un listado de parejas nombre/valor para variables de los entornos, tales como: @example '(("TZ" . "Canada/Pacific")) @end example
it: Popola @file{/etc/environment}, che è onorato da @code{pam_env}, con le variabili di ambiente specificate. Il valore di questo servizio è un elenco di coppie nome/valore per variabili di ambiente, come: @example '(("TZ" . "Canada/Pacific")) @end example
zh_cn: 填充 @file{/etc/environment}，该文件被 @code{pam_env} 认可，使用指定的环境变量。该服务的值是环境变量的名称/值对列表，例如： @example '(("TZ" . "Canada/Pacific")) @end example

source: 'pam-root-service-type' extensions should now use the <pam-extension> record~%
es: las extensiones 'pam-root-service-type' ahora utilizarían el registro <pam-extension>~%
it: Le estensioni 'pam-root-service-type' dovrebbero ora utilizzare il record <pam-extension>~%
zh_cn: 'pam-root-service-type' 扩展现在应使用 <pam-extension> 记录~%

source: Configure the Pluggable Authentication Modules (PAM) for all the specified @dfn{PAM services}. Each PAM service corresponds to a program, such as @command{login} or @command{sshd}, and specifies for instance how the program may authenticate users or what it should do when opening a new session.
es: Configure el PAM (Plugable Authentication Modules) para todos los @dfn{servicios PAM} especificados. Cada servicio PAM corresponde a un programa, tal como @command{login} o @command{sshd}, y especifica para instancia como el programa puede autenticar usuarios o que haría cuando abre una sesión nueva.
it: Configura i Pluggable Authentication Modules (PAM) per tutti i @dfn{servizi PAM} specificati. Ogni servizio PAM corrisponde a un programma, come @command{login} o @command{sshd}, e specifica ad esempio come il programma può autenticare gli utenti o cosa dovrebbe fare quando apre una nuova sessione.
zh_cn: 为所有指定的 @dfn{PAM 服务} 配置可插拔身份验证模块 (PAM)。每个 PAM 服务对应一个程序，例如 @command{login} 或 @command{sshd}，并指定例如程序如何验证用户或在打开新会话时应执行的操作。

source: the following accounts appear more than once:~{ ~a~}~%
es: las siguientes cuentas aparecen más de una vez:~{ ~a~}~%
it: i seguenti account compaiono più di una volta:~{ ~a~}~%
zh_cn: 以下账户出现多次：~{ ~a~}~%

source: the following groups appear more than once:~{ ~a~}~%
es: los siguientes grupos aparecen más de una vez:~{ ~a~}~%
it: i seguenti gruppi compaiono più di una volta:~{ ~a~}~%
zh_cn: 以下组出现多次：~{ ~a~}~%

source: supplementary group '~a' of user '~a' is undeclared
es: el grupo suplementario '~a' de la cuenta '~a' no se ha declarado
it: il gruppo supplementare '~a' per l'utente '~a' non è dichiarato
zh_cn: 用户 '~a' 的附加组 '~a' 未声明

source: primary group '~a' of user '~a' is undeclared
es: el grupo primario '~a' de la cuenta '~a' no se ha declarado
it: il gruppo principale '~a' per l'utente '~a' non è dichiarato
zh_cn: 用户 '~a' 的主组 '~a' 未声明

source: Ensure the specified user accounts and groups exist, as well as each account home directory.
es: Asegura que las cuentas y grupos que se hayan especificado existen, así como el directorio de cada cuenta de usuario.
it: Verifica che gli account utente e i gruppi esistono, così come ogni directory home utente.
zh_cn: 确保指定的用户账户和组存在，以及每个账户的主目录。

source: The configured ranges are more than the ~a max allowed.
es: Los intervalos configurados son más que el ~a máx. permitido.
it: Gli intervalli configurati sono superiori al massimo consentito ~a.
zh_cn: 配置的范围超过了允许的最大值 ~a。

source: One subid-range starts before the minimum allowed sub id ~a.
es: Un intervalo de sub-id comienza antes de ser permitido el mínimo sub id ~a.
it: Gli intervalli sub-id configurati sono superiori al massimo sub-id consentito ~a.
zh_cn: 一个 subid-range 在允许的最小 sub id ~a 之前开始。

source: One subid-range ends after the maximum allowed sub id ~a.
es: Un intervalo de sub-id finaliza tras el sub-id permitido máximo ~a.
it: Un intervallo di sub-id termina dopo il massimo sub-id consentito ~a.
zh_cn: 一个 subid-range 在允许的最大 sub id ~a 之后结束。

source: One subid-range has a null name.
es: Un intervalo de sub-id tiene un nombre nulo.
it: Un intervallo di sub-id ha un nome nullo.
zh_cn: 一个 subid-range 的名称为空。

source: One subid-range has a name equal to the empty string.
es: Un intervalo sub-id tiene un nombre igual a la cadena vacía.
it: Un subid-range ha un nome uguale alla stringa vuota.
zh_cn: 一个 subid-range 的名称等于空字符串。

source: Ensure the specified sub UIDs and sub GIDs exist in /etc/subuid and /etc/subgid.
es: Asegure el sub UID especificado y sub GID existe en /etc/subuid y /etc/subgid.
it: Assicurarsi che i sub UID e i sub GID specificati esistano in /etc/subuid e /etc/subgid.
zh_cn: 确保指定的 sub UID 和 sub GID 在 /etc/subuid 和 /etc/subgid 中存在。

source: size (~a) can only be 'guess or a numeric expression ~%
es: tamaño (~a) solo puede ser 'guess o una expresión numérica ~%
it: size (~a) può essere solo un'ipotesi o un'espressione numerica ~%
zh_cn: 大小 (~a) 只能是 'guess' 或数字表达式 ~%

source: the partition offset (~a) can only be a numeric expression ~%
es: el desplazamiento de partición (~a) solo puede ser una expresión numérica ~%
it: l'offset della partizione (~a) può essere solo un'espressione numerica ~%
zh_cn: 分区偏移 (~a) 只能是数字表达式 ~%

source: unsupported partition flag(s): ~a ~%
es: indicador(es) de partición no admitidos: ~a ~%
it: flag di partizione non supportato/i: ~a ~%
zh_cn: 不支持的分区标志： ~a ~%

source: ~s: invalid '~a' value
es: ~s: valor '~a' no válido
it: ~s: valore '~a' non valido
zh_cn: ~s: 无效的 '~a' 之数值~%

source: Timezone
es: Zona horaria
it: Fuso orario
zh_cn: 时区

source: Keyboard mapping selection
es: Selección de distribución de teclado
it: Selezione mappa tastiera
zh_cn: 键盘映射选择

source: Hostname
es: Nombre de máquina
it: Nome host
zh_cn: 主机名

source: Network selection
es: Selección de red
it: Selezione rete
zh_cn: 选择网络

source: Substitute server discovery
es: Descubrimiento de servidor sustituto
it: Scoperta dei server per i sostituti
zh_cn: 替代服务器发现

source: User creation
es: Creación de cuentas de usuarios
it: Creazione utente
zh_cn: 创建用户

source: Services
es: Servicios
it: Servizi
zh_cn: 服务

source: Partitioning
es: Particionamiento
it: Partizionamento
zh_cn: 分区

source: Configuration file
es: Archivo de configuración
it: File di configurazione
zh_cn: 配置文件

source: cannot determine installer provenance~%
es: no se puede determinar la proveniencia del instalador~%
it: impossibile determinare la provenienza dell'installatore~%
zh_cn: 无法确定安装程序来源~%

source: Could not determine the state of connman.
es: No se pudo determinar el estado de connman.
it: Impossibile determinare lo stato di connman.
zh_cn: 无法确定 connman 的状态。

source: Unable to find expected regexp.
es: No se pudo encontrar la expresión regular esperada.
it: Impossibile trovare la regexp attesa.
zh_cn: 无法找到预期的正则表达式。

source: ~a ~a (networking device)
es: ~a ~a (dispositivo de red)
it: ~a ~a (dispositivo di rete)
zh_cn: ~a ~a (网络设备)

source: ;; "noide" disables the gnumach IDE driver, enabling rumpdisk.
es: ;; "noide" deshabilita el controlador IDE gnumach, activando rumpdisk.
it: ;; "noide" disabilita il driver IDE gnumach, abilitando rumpdisk.
zh_cn: ;; "noide" 禁用 gnumach IDE 驱动，启用 rumpdisk。

source: Press <F1> for installation parameters.
es: Pulse <F1> para los parámetros de instalación.
it: Premi <F1> per i parametri di installazione.
zh_cn: 按 <F1> 查看安装参数。

source: The installer has encountered an unexpected problem. The backtrace is displayed below. You may choose to exit or create a dump archive.
es: El instalador ha encontrado un problema inesperado. La pila de llamadas se muestra a continuación. Puede elegir salir o crear un archivo de volcado.
it: Il programma di installazione ha incontrato un problema imprevisto. Il backtrace è mostrato qui sotto. Puoi scegliere se uscire o creare un archivio di dump.
zh_cn: 安装程序遇到了意外问题。下面显示了回溯信息。您可以选择退出或创建转储档案。

source: Unexpected problem
es: Problema inesperado
it: Problema inatteso
zh_cn: 意外问题

source: Exit
es: Salir
it: Esci
zh_cn: 退出

source: The dump archive was created as ~a. Would you like to send this archive to the Guix servers?
es: El archivo de volcado fue creado como ~a. ¿Le gustaría enviar este archivo a los servidores Guix?
it: L'archivio dump è stato creato come ~a. Desideri inviare questo archivio ai server Guix?
zh_cn: 转储档案已创建为 ~a。您想将此档案发送到 Guix 服务器吗？

source: Dump archive created
es: Archivo de volcado creado
it: Archivio dump creato
zh_cn: 转储档案已创建

source: The dump was uploaded as ~a. Please report it by email to ~a.
es: El volcado fue subido como ~a. Por favor informe por correo electrónico a ~a.
it: Il dump è stato caricato come ~a. Per favore segnalalo via email a ~a.
zh_cn: 转储已上传为 ~a。请通过电子邮件报告至 ~a。

source: The dump could not be uploaded.
es: El volcado no pudo ser cargado.
it: Caricamento dump non riuscito.
zh_cn: 无法上传转储文件。

source: Dump upload result
es: Resultado de la carga del volcado
it: Risultato del caricamento del dump
zh_cn: 转储上传结果

source: External command ~s exited with code ~a
es: Comando externo ~s salió con código ~a
it: Comando esterno ~s uscito con codice ~a
zh_cn: 外部命令 ~s 以代码 ~a 退出

source: External command ~s terminated by signal ~a
es: Comando externo ~s terminado por señal ~a
it: Comando esterno ~s terminato dal segnale ~a
zh_cn: 外部命令 ~s 被信号 ~a 终止

source: External command ~s stopped by signal ~a
es: Comando externo ~s detenido por señal ~a
it: Comando esterno ~s fermato dal segnale ~a
zh_cn: 外部命令 ~s 被信号 ~a 停止

source: External command error
es: Error de comando externo
it: Errore del comando esterno
zh_cn: 外部命令错误

source: No ethernet service available, please try again.
es: Sin servicio ethernet disponible, inténtelo de nuevo.
it: Nessun servizio ethernet disponibile, riprova per favore.
zh_cn: 没有可用的以太网服务，请重试。

source: No service
es: Sin servicio
it: Nessun servizio
zh_cn: 无服务

source: Please select an ethernet network.
es: Seleccione una red ethernet.
it: Seleziona una rete ethernet per favore.
zh_cn: 请选择一个以太网网络。

source: Ethernet connection
es: Conexión Ethernet
it: Connessione ethernet
zh_cn: 以太网连接

source: We're now ready to proceed with the installation! A system configuration file has been generated, it is displayed below. This file will be available as '~a' on the installed system. The new system will be created from this file once you've pressed OK. This will take a few minutes.
es: ¡Estamos preparadas para continuar con la instalación! Se ha generado un archivo de configuración del sistema, el cual se muestra a continuación. Este archivo estará disponible como '~a' en el sistema instalado. El nuevo sistema se creará desde este archivo una vez haya pulsado «Aceptar». Tardará algunos minutos.
it: Siamo pronti per procedere con l'installazione! Un file di configurazione è stato generato, ed è mostrato qui sotto. Questo file sarà disponibile come '~a' nel sistema installato. Il nuovo sistema verrà creato a partire da questo file una volta che premerai OK. Il tutto richiederà qualche minuto.
zh_cn: 我们现在准备继续安装！系统配置文件已生成，显示如下。该文件将在已安装系统中作为 '~a' 可用。按下确定后，将从此文件创建新系统。此过程将花费几分钟。

source: Installation complete
es: Instalación completada
it: Installazione completata
zh_cn: 安装完成

source: Reboot
es: Rearrancar
it: Riavvia
zh_cn: 重启

source: Congratulations! Installation is now complete. You may remove the device containing the installation image and press the button to reboot.
es: ¡Enhorabuena! La instalación se ha completado. Puede retirar el dispositivo que contiene la imagen de instalación y pulsar el botón para reiniciar.
it: Congratulazioni! L'installazione è ora completa. Puoi rimuovere il dispositivo che contiene l'immagine di installazione e premere il bottone per riavviare.
zh_cn: 恭喜！安装现已完成。您可以移除包含安装映像的设备并按按钮重启。

source: Installation failed
es: Fallo en la instalación
it: Installazione fallita
zh_cn: 安装失败

source: Resume
es: Reanudar
it: Riprendi
zh_cn: 继续

source: Restart the installer
es: Reiniciar el instalador
it: Riavvia il programma di installazione
zh_cn: 重新启动安装程序

source: Report the failure
es: Informar sobre este defecto
it: Segnala il fallimento
zh_cn: 报告失败

source: The final system installation step failed. You can resume from a specific step, or restart the installer.
es: El paso final de instalación del sistema ha fallado. Puede volver a empezar desde un paso específico, o reiniciar el instalador.
it: L'ultimo passaggio di installazione del sistema è fallito. Puoi riprendere da un passo specifico, o riavviare il programma di installazione.
zh_cn: 最终系统安装步骤失败。您可以从特定步骤恢复，或重新启动安装程序。

source: Please enter the HTTP proxy URL. If you enter an empty string, proxy usage will be disabled.
es: Introduzca el URL del proxy HTTP. Si proporciona una cadena vacía, no se hará uso de un servidor de proxy.
it: Inserisci l'URL del proxy HTTP per favore. Se inserisci una stringa vuota, l'uso di un proxy verrà disabilitato.
zh_cn: 请输入 HTTP 代理 URL。如果输入空字符串，将禁用代理使用。

source: HTTP proxy configuration
es: Configuración del proxy HTTP
it: Configurazione proxy HTTP
zh_cn: HTTP 代理配置

source: Change keyboard layout
es: Cambiar la distribución del teclado
it: Cambia layout tastiera
zh_cn: 更改键盘布局

source: Configure HTTP proxy
es: Configurar el proxy HTTP
it: Configura proxy HTTP
zh_cn: 配置 HTTP 代理

source: Please choose one of the following parameters or press ‘Back’ to go back to the installation process.
es: Seleccione uno de los siguientes parámetros o pulse «Atrás» para volver al proceso de instalación.
it: Scegli uno dei seguenti parametri per favore, o premi ‘Indietro’ per tornare al processo di installazione.
zh_cn: 请选择以下参数之一，或按“返回”返回安装过程。

source: Installation parameters
es: Parámetros de la instalación
it: Parametri di installazione
zh_cn: 安装参数

source: Back
es: Atrás
it: Indietro
zh_cn: 返回

source: Please enter the system hostname.
es: Introduzca el nombre de máquina del sistema.
it: Per favore inserisci il nome host del sistema.
zh_cn: 请输入系统主机名。

source: Please select a kernel. When in doubt, choose "Linux Libre". The Hurd is offered as a technology preview and development aid; many packages are not yet available in Guix, such as a desktop environment or even a windowing system (X, Wayland).
es: Seleccione un kernel. Cuando lo dude, elija «Linux Libre». El Hurd se ofrece como una vista previa tecnológica y ayuda de desarrollo; muchos paquetes aún no están disponibles en Guix, tales como un entorno de escritorio o incluso un sistema de ventanas (X, Wayland).
it: Seleziona un kernel. In caso di dubbi, scegli "Linux Libre". Hurd è offerto come anteprima tecnologica e aiuto allo sviluppo; molti pacchetti non sono ancora disponibili in Guix, come un ambiente desktop o persino un sistema a finestre (X, Wayland).
zh_cn: 请选择一个内核。如有疑问，请选择“Linux Libre”。 Hurd 作为技术预览和开发辅助提供；Guix 中许多软件包尚不可用，如桌面环境甚至窗口系统（X，Wayland）。

source: Please choose your keyboard layout. It will only be used during the installation process. Non-Latin layouts can be toggled with Alt+Shift.
es: Elija su distribución de teclado. Se usará únicamente durante el proceso de instalación. Las distribuciones no-latinas pueden seleccionarse con Alt+Shift.
it: Inserisci il layout della tua tastiera. Sarà usato solo durante il processo di installazione. Layout non-latini possono essere attivati con Alt+Shift.
zh_cn: 请选择您的键盘布局。它仅在安装过程中使用。非拉丁布局可通过 Alt+Shift 切换。

source: Please choose your keyboard layout. It will be used during the install process, and for the installed system. Non-Latin layouts can be toggled with Alt+Shift. You can switch to a different layout at any time from the parameters menu.
es: Elija su distribución de teclado. Se usará durante el proceso de instalación y en el sistema instalado. Las distribuciones no-latinas pueden seleccionarse con Alt+Shift. Puede cambiar a una distribución diferente en cualquier momento mediante el menú de parámetros.
it: Per favore scegli il layout della tua tastiera. Sarà usata durante il processo di installazione, e per il sistema installato. Layout non-latini possono essere attivati con il tasto Alt+Shift. Puoi cambiare layout in qualsiasi momento dal menu dei parametri.
zh_cn: 请选择您的键盘布局。它将在安装过程中及已安装系统中使用。非拉丁布局可通过 Alt+Shift 切换。您可以随时从参数菜单切换到不同布局。

source: Continue
es: Continuar
it: Continua
zh_cn: 连续

source: Variant
es: Variante
it: Variante
zh_cn: 变体

source: Please choose a variant for your keyboard layout.
es: Elija una variante de su distribución del teclado.
it: Scegli una variante del tuo layout tastiera per favore.
zh_cn: 请选择一个键盘布局的变体。

source: Locale language
es: Idioma de localización
it: Scegli lingua del locale
zh_cn: 本地语言

source: Choose the language to use for the installation process and for the installed system.
es: Seleccione el idioma a usar en el proceso de instalación y para el sistema instalado.
it: Scegli la lingua da usare per il processo di installazione e per il sistema che verrà installato.
zh_cn: 选择安装过程和已安装系统使用的语言。

source: Locale location
es: Lugar del idioma
it: Regione del locale

source: Choose a territory for this language.
es: Elija un territorio para este idioma.
it: Scegli un territorio per questa lingua.
zh_cn: 为这种语言选择一个地域。

source: Locale codeset
es: Conjunto de códigos del lugar
it: Codeset del locale
zh_cn: 区域设置编码

source: Choose the locale encoding.
es: Elija la codificación del lugar.
it: Scegli la codifica caratteri del locale.
zh_cn: 选择区域编码。

source: Locale modifier
es: Modificadores de la localización
it: Modificatore locale
zh_cn: 区域设置修饰符

source: Choose your locale's modifier. The most frequent modifier is euro. It indicates that you want to use Euro as the currency symbol.
es: Seleccione los modificadores de su localización. El más frecuente es euro. Indica que desea usar Euro como símbolo de la moneda.
it: Scegli un modificatore della tua lingua. Quello usato più frequentemente è euro. Indica che vuoi usare l'Euro come simbolo di valuta.
zh_cn: 选择您的区域修饰符。最常见的修饰符是 euro。它表示您想使用欧元作为货币符号。

source: No location
es: Ningún lugar
it: Nessuna regione

source: No modifier
es: Ningún modificador
it: Nessun modificatore
zh_cn: 无修饰符

source: Choose where you want to resume the install. You can also abort the installation by pressing the Abort button.
es: Elija donde desea reanudar la instalación. También puede interrumpir la instalación pulsando el botón Abortar.
it: Scegli da dove vuoi riprendere l'installazione. Puoi anche interrompere l'installazione premendo il pulsante Annulla.
zh_cn: 选择您想从哪里继续安装。您也可以按“中止”按钮终止安装。

source: Installation menu
es: Menú de instalación
it: Menu di installazione
zh_cn: 安装菜单

source: Abort
es: Abortar
it: Annulla
zh_cn: 中止

source: Internet access
es: Acceso a internet
it: Accesso ad internet
zh_cn: 互联网访问

source: The install process requires Internet access but no network devices were found. Do you want to continue anyway?
es: El proceso de instalación necesita acceso a internet pero no se ha encontrado ningún dispositivo de red. ¿Desea continuar de todos modos?
it: Il processo di installazione richiede l'accesso ad Internet, ma nessun dispositivo di rete è stato trovato. Vuoi continuare comunque?
zh_cn: 安装过程需要互联网访问，但未找到网络设备。您仍然想继续吗？

source: The install process requires Internet access. Please select a network device.
es: El proceso de instalación necesita acceso a internet. Seleccione un dispositivo de red.
it: Il processo di installazione richiede l'accesso ad internet. Per favore, seleziona un dispositivo di rete.
zh_cn: 安装过程需要互联网访问。请选择一个网络设备。

source: Powering technology
es: Tecnología de alimentación
it: Tecnologia di alimentazione
zh_cn: 供电技术

source: Waiting for technology ~a to be powered.
es: Esperando al encendido de la tecnología ~a.
it: Aspetto che la tecnologia ~a venga alimentata.
zh_cn: 正在等待技术 ~a 供电。

source: Checking connectivity
es: Comprobando la conectividad
it: Controllo connettività
zh_cn: 检查连接性

source: Waiting for Internet access establishment...
es: Esperando al establecimiento del acceso a Internet…
it: Attendo che l'accesso ad Internet sia stabilito...
zh_cn: 正在等待互联网访问建立...

source: Connecting to ~a, please wait.
es: Conectando a ~a, espere, por favor.
it: Connessione a ~a, attendi per favore.
zh_cn: 正在连接到 ~a，请稍候。

source: Connection in progress
es: Conexión en progreso
it: Connessione in corso
zh_cn: 连接进行中

source: Show
es: Mostrar
it: Mostra
zh_cn: 显示

source: Please enter a non empty input.
es: Por favor, proporcione una entrada no vacía.
it: Per favore inserisci un input non vuoto.
zh_cn: 请输入非空内容。

source: Empty input
es: Entrada vacía
it: Input vuoto
zh_cn: 输入为空

source: Edit
es: Editar
it: Modifica
zh_cn: 编辑

source: Everything is one partition
es: Todo en una partición
it: Tutto in un'unica partizione
zh_cn: 所有内容为一个分区

source: Separate /home partition
es: Partición separada para /home
it: Separa la partizione /home
zh_cn: 单独的 /home 分区

source: Please select a partitioning scheme.
es: Seleccione un esquema de particionado.
it: Seleziona uno schema di partizionamento per favore.
zh_cn: 请选择一个分区方案。

source: Partition scheme
es: Esquema de particionado
it: Schema di partizionamento
zh_cn: 分区方案

source: We are about to write the configured partition table to the disk and format the partitions listed below. Their data will be lost. Do you wish to continue?~%~%~{ - ~a~%~}
es: Se va a escribir al disco la tabla de particiones configurada y se dará formato a las particiones mostradas a continuación. Sus datos se perderán. ¿Desea continuar?~%~%~{ - ~a~%~}
it: Stiamo per scrivere sul disco la tabella delle partizioni configurata, e formattare le partizioni elencate qui sotto. I dati contenuti in queste ultime andranno persi. Desideri continuare?~%~%~{ - ~a~%~}
zh_cn: 我们即将将配置的分区表写入磁盘并格式化以下列出的分区。它们的数据将丢失。您是否要继续？~%~%~{ - ~a~%~}

source: Format disk?
es: ¿Dar formato al disco?
it: Formattare il disco?
zh_cn: 格式化磁盘？

source: Partition formatting is in progress, please wait.
es: El formateo de la partición está en progreso. Espere, por favor.
it: Formattazione partizione in corso, attendi per favore.
zh_cn: 分区格式化进行中，请稍候。

source: Preparing partitions
es: Preparando las particiones
it: Preparo le partizioni
zh_cn: 准备分区

source: Please select a disk. The installation device as well as the small devices are filtered.
es: Seleccione un disco. Se filtran tanto el dispositivo de instalación como los pequeños dispositivos.
it: Per favore seleziona un disco. Il dispositivo di installazione e i piccoli dispositivi sono stati filtrati.
zh_cn: 请选择一个磁盘。安装设备和小型设备已被过滤。

source: Disk
es: Disco
it: Disco
zh_cn: 磁盘

source: This will create a new ~a partition table, all data on disk will be lost, are you sure you want to proceed?
es: Esto creará una tabla de partición ~a nueva, todos los datos en el disco serán eliminados, ¿está seguro que desea proceder?
it: Questo creerà una nuova tabella di partizione ~a, tutti i dati sul disco andranno persi, sei sicuro di voler procedere?
zh_cn: 这将创建一个新的 ~a 分区表，磁盘上的所有数据将丢失，您确定要继续吗？

source: Select a new partition table type. Be careful, all data on the disk will be lost.
es: Seleccione un nuevo tipo de tabla de particiones. Tenga cuidado, se perderán todos los datos en el disco.
it: Seleziona un nuovo tipo di tabella delle partizioni. Fai attenzione, tutti i dati sul disco andranno persi.
zh_cn: 选择新的分区表类型。请注意，磁盘上的所有数据将丢失。

source: Partition table
es: Tabla de particiones
it: Tabella partizioni
zh_cn: 分区表

source: Please select a partition type.
es: Seleccione un tipo de partición.
it: Seleziona un tipo di partizione per favore.
zh_cn: 请选择分区类型。

source: Partition type
es: Tipo de partición
it: Tipo partizione
zh_cn: 分区类型

source: Please select the file-system type for this partition.
es: Seleccione el tipo de sistema de archivos para esta partición.
it: Seleziona il tipo di file-system per questa partizione.
zh_cn: 请选择此分区的文件系统类型。
