Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: the graph of package modules
es: el grafo de módulos de paquetes
it: il grafo dei moduli pacchetto
zh_cn: 软件包模块的图

source: ~a: unknown node type~%
es: ~a: tipo de nodo desconocido~%
it: ~a: tipo di nodo sconosciuto~%
zh_cn: ~a: 未知节点类型~%

source: The available node types are:
es: Los tipos de nodo disponibles son:
it: I tipi di nodo disponibili sono:
zh_cn: 可用的节点类型有：

source: The available backend types are:
es: Los tipos de motor disponibles son:
it: I tipi di backend disponibili sono:
zh_cn: 可用的后端类型有：

source: no path from '~a' to '~a'~%
es: no existe ninguna ruta desde '~a' hasta '~a'~%
it: non esiste un percorso da '~a' a '~a'~%
zh_cn: 从 '~a' 到 '~a' 无路径~%

source: Usage: guix graph PACKAGE... Emit a representation of the dependency graph of PACKAGE...
es: Modo de empleo: guix graph PAQUETE... Emite una representación del grafo de dependencias de PAQUETE...
it: Utilizzo: guix graph PACCHETTO... Emette una rappresentazione del grafo delle dipendenze di PACCHETTO...
zh_cn: 用法：guix graph PACKAGE... 输出 PACKAGE 的依赖关系图表示...

source: -b, --backend=TYPE produce a graph with the given backend TYPE
es: -b, --backend=TIPO produce un grafo con el motor TIPO proporcionado
it: -b, --backend=TIPO produce un grafo con il backend di TIPO dato
zh_cn: -b, --backend=TYPE 使用指定的后端 TYPE 生成图形

source: --list-backends list the available graph backends
es: --list-backends enumera los motores de grafo disponibles
it: --list-backends elenca i backend per grafi disponibili
zh_cn: --list-backends 列出可用的图形后端

source: -t, --type=TYPE represent nodes of the given TYPE
es: -t, --type=TIPO representa nodos del TIPO proporcionado
it: -t, --type=TIPO rappresenta nodi del TIPO dato
zh_cn: -t, --type=TYPE 表示指定 TYPE 的节点

source: --list-types list the available graph types
es: --list-types enumera los tipos de grafo disponibles
it: --list-types elenca i tipi di grafo disponibili
zh_cn: --list-types 列出可用的图形类型

source: -M, --max-depth=DEPTH limit to nodes within distance DEPTH
es: -M, --max-depth=PROFUNDIDAD limita a los nodos dentro de la distancia PROFUNDIDAD
it: -M, --max-depth=PROFONDITA limita ai nodi entro la distanza PROFONDITA
zh_cn: -M, --max-depth=DEPTH 限制为距离 DEPTH 内的节点

source: --path display the shortest path between the given nodes
es: --path muestra la ruta más corta entre los nodos proporcionados
it: --path mostra il percorso più breve tra i nodi dati
zh_cn: --path 显示两个给定节点间的最短路径

source: view and query package dependency graphs
es: visualización y consulta del grafo de dependencias de paquetes
it: visualizza e interroga i grafi di dipendenza dei pacchetti
zh_cn: 查看和查询软件包依赖图

source: no arguments specified; creating an empty graph~%
es: no se especificaron argumentos; creando un grafo vacío~%
it: nessun argomento specificato; creo un grafo vuoto~%
zh_cn: 未指定参数；创建空图~%

source: '--path' option requires exactly two nodes (given ~a)~%
es: La opción '--path' necesita exáctamente dos nodos (se ha proporcionado ~a)~%
it: l'opzione '--path' richiede esattamente due nodi (~a forniti)~%
zh_cn: '--path' 选项需要恰好两个节点（给定 ~a）~%

source: differing file:~%
es: archivo diferente:~%
it: file differente:~%
zh_cn: 不同的文件：~%

source: failed to delete '~a': ~a~%
es: incorrecto al borrar '~a': ~a~%
it: impossibile cancellare '~a': ~a~%

source: local hash: ~a~%
es: hash local: ~a~%
it: hash locale: ~a~%
zh_cn: 本地哈希：~a~%

source: no local build for '~a'~%
es: no existe una construcción local de '~a'~%
it: nessuna build locale per '~a'~%
zh_cn: '~a' 无本地构建~%

source: ~a contents differ:~%
es: el contenido de ~a es diferente:~%
it: il contentuto di ~a differisce:~%
zh_cn: ~a 内容不同：~%

source: could not challenge '~a': no local build~%
es: no se pudo poner a prueba '~a': no existe una construcción local~%
it: impossibile mettere alla prova '~a': build locale non presente~%
zh_cn: 无法挑战 '~a'：无本地构建~%

source: could not challenge '~a': no substitutes~%
es: no se pudo poner a prueba '~a': no existen sustituciones~%
it: impossibile mettere alla prova '~a': non esistono sostituti~%
zh_cn: 无法挑战 '~a'：无替代品~%

source: ~a contents match:~%
es: el contenido de ~a corresponde:~%
it: il contenuto di ~a coincide:~%
zh_cn: ~a 内容匹配：~%

source: ~h store items were analyzed:~%
es: ~h elementos del almacén fueron analizados:~%
it: analizzati ~h oggetti dello store:~%
zh_cn: 分析了 ~h 个存储项：~%

source: - ~h (~,1f%) were identical~%
es: - ~h (~,1f%) fueron idénticos~%
it: - ~h (~,1f%) erano identici~%
zh_cn: - ~h (~,1f%) 完全相同~%

source: - ~h (~,1f%) differed~%
es: - ~h (~,1f%) fueron diferentes~%
it: - ~h (~,1f%) erano differenti~%
zh_cn: - ~h (~,1f%) 不同~%

source: - ~h (~,1f%) were inconclusive~%
es: - ~h (~,1f%) no arrojaron resultados concluyentes~%
it: - ~h (~,1f%) non hanno dato un risultato certo~%
zh_cn: - ~h (~,1f%) 结果不确定~%

source: Usage: guix challenge [PACKAGE...] Challenge the substitutes for PACKAGE... provided by one or more servers.
es: Modo de empleo: guix challenge [PAQUETE…] Pone a prueba las sustituciones para PAQUETE… proporcionadas por uno o más servidores.
it: Utilizzo: guix challenge [PACCHETTO...] Contesta i sostituti di PACCHETTO... forniti da uno o più server.
zh_cn: 用法：guix challenge [PACKAGE...] 挑战由一个或多个服务器提供的 PACKAGE... 的替代品。

source: --substitute-urls=URLS compare build results with those at URLS
es: --substitute-urls=URLS compara los resultados de construcción en dichas URLS
it: --substitute-urls=URLS confronta i risultati della compilazione con quelli presenti agli URLS
zh_cn: --substitute-urls=URLS 与 URLS 的构建结果对比

source: -v, --verbose show details about successful comparisons
es: -v, --verbose muestra detalles sobre comparaciones logradas
it: -v, --verbose mostra dettagli sui confronti riusciti
zh_cn: -v, --verbose 显示成功比较的详细信息

source: --diff=MODE show differences according to MODE
es: --diff=MODO muestra las diferencias de acuerdo al MODO
it: --diff=MODO mostra le differenze usando il MODO specificato
zh_cn: --diff=MODE 根据 MODE 显示差异

source: ~a: unknown diff mode~%
es: ~a: modo de diff desconocido~%
it: ~a: modalità di diff sconosciuta~%

source: challenge substitute servers, comparing their binaries
es: comprueba servidores de sustituciones, comparando sus binarios
it: mette alla prova i server dei sostituti, confrontando i loro binari
zh_cn: 挑战替代服务器，比较它们的二进制文件

source: ~a: invalid TCP port number~%
es: ~a: número no válido de puerto TCP~%
it: ~a: numero di porta TCP non valido~%

source: ~a: invalid SSH specification~%
es: ~a: especificación SSH no válida~%
it: ~a: specificazione SSH non valida~%

source: no arguments specified, nothing to copy~%
es: no se especificaron argumentos, nada que copiar~%
it: nessun argomento specificato, niente da copiare~%
zh_cn: 未指定参数，无内容可复制~%

source: Usage: guix copy [OPTION]... ITEMS... Copy ITEMS to or from the specified host over SSH.
es: Modo de empleo: guix copy [OPCIÓN]... ELEMENTOS... Copia ELEMENTOS a o desde la máquina especificada a través de SSH.
it: Utilizzo: guix copy [OPZIONE]... ELEMENTI... Copia gli ELEMENTI da o verso l'host specificato tramite SSH.
zh_cn: 用法：guix copy [OPTION]... ITEMS... 通过 SSH 将项目复制到指定主机或从指定主机复制项目。

source: --to=HOST send ITEMS to HOST
es: --to=DIRECCIÓN envía ELEMENTOS a DIRECCIÓN
it: --to=HOST invia OGGETTI all'HOST
zh_cn: --to=HOST 将项目发送到 HOST

source: --from=HOST receive ITEMS from HOST
es: --from=DIRECCIÓN recive ELEMENTOS desde DIRECCIÓN
it: --from=HOST ricevi OGGETTI dall'HOST
zh_cn: --from=HOST 从 HOST 接收项目

source: copy store items remotely over SSH
es: copia elementos del almacén de manera remota a través de SSH
it: copia gli oggetti dello store in remoto su SSH
zh_cn: 通过 SSH 远程复制存储项目

source: use '--to' or '--from'~%
es: use '--to' o '--from'~%
it: usa '--to' oppure '--from'~%
zh_cn: 使用 '--to' 或 '--from'~%

source: symlink target is absolute: '~a'~%
es: destino de enlace simbólico es absoluto: '~a'~%
it: il target del link simbolico è assoluto: '~a'~%
zh_cn: 符号链接目标是绝对路径：'~a'~%

source: The target of the symlink must be relative rather than absolute, as it is relative to the profile created. Perhaps the source and target components of the symlink spec were inverted? Below is a valid example, where the @file{/usr/bin/env} symbolic link is to target the profile's @file{bin/env} file: @example --symlink=/usr/bin/env=bin/env @end example
es: El destino del enlace simbólico debe ser relativo en vez de absoluto, ya que es relativo para el perfil creado. ¿Quizá el origen y el destino de componentes del enlace simbólico específico fue invertido? A continuación hay un ejemplo válido, donde el enlace simbólico @file{/usr/bin/env} es para el destino del archivo de perfil @file{bin/env @example --symlink=/usr/bin/env=bin/env @end example
it: La destinazione del collegamento simbolico deve essere relativa piuttosto che assoluta, poiché è relativa al profilo creato. Forse i componenti sorgente e destinazione della specifica del collegamento simbolico sono stati invertiti? Di seguito è riportato un esempio valido, in cui il collegamento simbolico @file{/usr/bin/env} serve per destinare il file @file{bin/env} del profilo: @example --symlink=/usr/bin/env=bin/env @end example
zh_cn: 符号链接的目标必须是相对路径，而非绝对路径，因为它是相对于创建的配置文件的。 也许符号链接规范中的源和目标组件被颠倒了？ 下面是一个有效的示例，其中 @file{/usr/bin/env} 符号链接指向 配置文件的 @file{bin/env} 文件： @example --symlink=/usr/bin/env=bin/env @end example

source: ~a: invalid symlink specification~%
es: ~a: especificación de enlace simbólico no válida~%
it: ~a: specificazione di link simbolico non valida~%

source: entry point not supported in the '~a' format~%
es: punto de entrada no implementado en el formato '~a'~%
it: punto di ingresso non supportato nel formato '~a'~%
zh_cn: 不支持 '~a' 格式的入口点~%

source: ~a is not a valid Debian archive compressor. Valid compressors are: ~a~%
es: ~a no es un compresor válido de archivadores de Debian. Los compresores válidos son: ~a~%
it: ~a non è un compressore di archivio Debian valido. I compressori validi sono: ~a~%
zh_cn: ~a 不是有效的 Debian 归档压缩器。有效的压缩器有：~a~%

source: entry-point must be provided in the '~a' format~%
es: punto de entrada debe ser proporcionado en el formato '~a'~%
it: il punto di ingresso deve essere fornito nel formato '~a'~%
zh_cn: 入口点必须以 '~a' 格式提供~%

source: AppImages should be built with the --relocatable flag~%
es: AppImages sería construido con el indicador --relocatable~%
it: Le AppImage dovrebbero essere create con il flag --relocatable~%
zh_cn: AppImages 应使用 --relocatable 标志构建~%

source: ~a is not a valid squashfs archive compressor used in generating the AppImage. Valid compressors are: ~a~%
es: ~a no es un compresor válido de archivadores squashfs utilizado al generar el AppImage. Los compresores válidos son: ~a~%
it: ~a non è un compressore di archivio SquashFS valido utilizzato per generare l'AppImage. I compressori validi sono: ~a~%
zh_cn: ~a 不是用于生成 AppImage 的有效 squashfs 归档压缩器。有效的压缩器有：~a~%

source: The supported formats for 'guix pack' are:
es: Los formatos implementados por 'guix pack' son:
it: I formati supportati per 'guix pack' sono:
zh_cn: “guix pack”支持的格式有：

source: tarball Self-contained tarball, ready to run on another machine
es: tarball Archivador tar autocontenido, preparado para ejecutarse en otra máquina
it: tarball Tarball auto-contenuto, pronto per essere eseguito su un'altra macchina
zh_cn: tarball 自包含的 tar 包，可在另一台机器上运行

source: squashfs Squashfs image suitable for Singularity
es: squashfs Imagen squashfs adecuada para Singularity
it: squashfs immagine Squashfs adatta per Singularity
zh_cn: squashfs 适用于 Singularity 的 Squashfs 镜像

source: docker Tarball ready for 'docker load'
es: docker Archivador tar preparado para 'docker load'
it: docker Tarball pronto per il comando 'docker load'
zh_cn: docker 准备好用于 'docker load' 的 tar 包

source: deb Debian archive installable via dpkg/apt
es: deb Archivador de Debian que se instala con dpkg/apt
it: deb archivio Debian installabile via dpkg/apt
zh_cn: deb 可通过 dpkg/apt 安装的 Debian 归档

source: rpm RPM archive installable via rpm/yum
es: rpm Archivador de RPM que se instala por medio de rpm/yum
it: rpm archivio RPM installabile via rpm/yum
zh_cn: rpm 可通过 rpm/yum 安装的 RPM 归档

source: appimage AppImage self-contained and executable format
es: appimage AppImage contenedor para sí y formato ejecutable
it: appimage Formato AppImage auto-contenuto ed eseguibile
zh_cn: appimage AppImage 自包含且可执行的格式

source: --help-docker-format list options specific to the docker format
es: --help-docker-format enumera las opciones específicas del formato docker
it: --help-docker-format elenca le opzioni specifiche per il formato docker
zh_cn: --help-docker-format 列出 docker 格式特定的选项

source: --image-tag=NAME Use the given NAME for the Docker image repository -A, --entry-point-argument=COMMAND/PARAMETER Value(s) to use for the Docker ENTRYPOINT arguments. Multiple instances are accepted. This is only valid in conjunction with the --entry-point option --max-layers=N Number of image layers
es: --image-tag=NOMBRE Utilice el NOMBRE dado para el repositorio de imagen de Docker -A, --entry-point-argument=COMANDO/PARÁMETRO Valor(es) a utiliza para los argumentos de ENTRYPOINT de Docker. Se aceptan múltiples instancias. Esto solo es válido junto con la opción --entry-point --max-layers=N Número de capas de imagen
it: --image-tag=NOME Usa il NOME dato per il repository dell'immagine Docker -A, --entry-point-argument=COMANDO/PARAMETRO Valore(i) da usare per gli argomenti dell'ENTRYPOINT Docker. Sono accettate istanze multiple. È valido solo in congiunzione con l'opzione --entry-point --max-layers=N Numero di livelli dell'immagine
zh_cn: --image-tag=NAME 使用给定的 NAME 作为 Docker 镜像仓库名称 -A, --entry-point-argument=COMMAND/PARAMETER 用于 Docker ENTRYPOINT 参数的值。 可接受多个实例。仅在与 --entry-point 选项一起使用时有效。 --max-layers=N 镜像层数

source: --help-deb-format list options specific to the deb format
es: --help-deb-format enumera las opciones específicas del formato deb
it: --help-deb-format elenca le opzioni specifiche per il formato deb
zh_cn: --help-deb-format 列出特定于 deb 格式的选项

source: --control-file=FILE Embed the provided control FILE
es: --control-file=ARCHIVO Incrusta el ARCHIVO de control proporcionado
it: --control-file=FILE Incorpora il FILE di controllo dato

source: --postinst-file=FILE Embed the provided postinst script
es: --postinst-file=ARCHIVO Incrusta el guión de posinstalación proporcionado
it: --postinst-file=FILE Incorpora lo script postinst fornito

source: --triggers-file=FILE Embed the provided triggers FILE
es: --triggers-file=ARCHIVO Incrusta el ARCHIVO de activadores proporcionado
it: --triggers-file=FILE Incorpora il FILE dei trigger dato

source: --help-rpm-format list options specific to the RPM format
es: --help-rpm-format enumera las opciones específicas del formato RPM
it: --help-rpm-format elenca le opzioni specifiche per il formato RPM
zh_cn: --help-rpm-format 列出特定于 RPM 格式的选项

source: --prein-file=FILE Embed the provided prein script
es: --prein-file=ARCHIVO Incrusta el guion prein proporcionado
it: --prein-file=FILE Incorpora lo script prein fornito

source: --postin-file=FILE Embed the provided postin script
es: --postin-file=ARCHIVO Incrusta el guión de post-instalación proporcionado
it: --postin-file=FILE Incorpora lo script postin specificato

source: --preun-file=FILE Embed the provided preun script
es: --preun-file=ARCHIVO Incrusta el guion de preun proporcionado
it: --preun-file=FILE Incorpora lo script preun specificato

source: --postun-file=FILE Embed the provided postun script
es: --postun-file=ARCHIVO Incrusta el guion de postun proporcionado
it: --postun-file=FILE Incorpora lo script postun specificato

source: ~a: unsupported profile name~%
es: ~a: nombre de perfil no implementado~%
it: ~a: nome profilo non supportato~%
zh_cn: ~a: 不支持的配置文件名称~%

source: Usage: guix pack [OPTION]... PACKAGE... Create a bundle of PACKAGE.
es: Modo de empleo: guix pack [OPCIÓN]... PAQUETE... Crea un empaquetado con PAQUETE.
it: Uso: guix pack [OPZIONE]... PACCHETTO... Confeziona il PACCHETTO.

source: --file=FORMAT build a pack the code within FILE evaluates to
es: --file=FORMAT compila un paquete el código dentro del archivo FILE evalúa a
it: --file=FORMAT crea una confezione il codice all'interno di FILE valuta come
zh_cn: --file=FORMAT 构建一个包，代码在 FILE 中求值为

source: -f, --format=FORMAT build a pack in the given FORMAT
es: -f, --format=FORMATO construye un empaquetado en el FORMATO especificado
it: -f, --format=FORMATO crea una confeziona nel FORMATO dato
zh_cn: -f, --format=FORMAT 以给定的 FORMAT 构建一个包

source: --list-formats list the formats available
es: --list-formats enumera los formatos disponibles
it: --list-formats elenca i formati disponibili
zh_cn: --list-formats 列出可用的格式

source: -R, --relocatable produce relocatable executables
es: -R, --relocatable produce ejecutables reposicionables
it: -R, --relocatable produce eseguibili che si possono riposizionare
zh_cn: -R, --relocatable 生成可重定位的可执行文件

source: -C, --compression=TOOL compress using TOOL--e.g., "lzip"
es: -C, --compression=HERRAMIENTA comprime con HERRAMIENTA--por ejemplo, "lzip"
it: -C, --compression=TOOL comprime usando il TOOL dato--es., "lzip"
zh_cn: -C, --compression=TOOL 使用 TOOL 压缩--例如，“lzip”

source: -S, --symlink=SPEC create symlinks to the profile according to SPEC
es: -S, --symlink=SPEC crea enlaces simbólicos al perfil de acuerdo con SPEC
it: -S, --symlink=SPEC crea collegamenti simbolici al profilo secondo SPEC
zh_cn: -S, --symlink=SPEC 根据 SPEC 创建指向配置文件的符号链接

source: -m, --manifest=FILE create a pack with the manifest from FILE
es: -m, --manifest=ARCHIVO crea un empaquetado con el manifiesto de ARCHIVO
it: -m, --manifest=FILE crea una confeziona con il manifest da FILE
zh_cn: -m, --manifest=FILE 使用来自 FILE 的清单创建一个包

source: --entry-point=PROGRAM use PROGRAM as the entry point of the pack
es: --entry-point=PROGRAMA usa PROGRAMA como punto de entrada del empaquetado
it: --entry-point=PROGRAMMA usa PROGRAMMA come punto di ingresso della confeziona
zh_cn: --entry-point=PROGRAM 使用 PROGRAM 作为包的入口点

source: --localstatedir include /var/guix in the resulting pack
es: --localstatedir incluye /var/guix en el empaquetado resultante
it: --localstatedir includi /var/guix nella confezione risultante
zh_cn: --localstatedir 在生成的包中包含 /var/guix

source: --profile-name=NAME populate /var/guix/profiles/.../NAME
es: --profile-name=NOMBRE genera /var/guix/profiles/.../NOMBRE
it: --profile-name=NOME popola /var/guix/profiles/.../NOME
zh_cn: --profile-name=NAME 填充 /var/guix/profiles/.../NAME

source: -d, --derivation return the derivation of the pack
es: -d, --derivation devuelve la derivación del empaquetado
it: -d, --derivation restituisce la derivazione della confeziona

source: --bootstrap use the bootstrap binaries to build the pack
es: --bootstrap usa los binarios del lanzamiento inicial para construir el empaquetado
it: --bootstrap usa i binari di bootstrap per creare la confeziona
zh_cn: --bootstrap 使用引导二进制文件构建包

source: create application bundles
es: creación de empaquetados de aplicaciones
it: crea delle confezioni applicativo
zh_cn: 创建应用程序包

source: could not determine provenance of package ~a~%
es: no se pudo determinar la proveniencia del paquete ~a~%
it: impossibile determinare la provenienza del pacchetto ~a~%
zh_cn: 无法确定包的来源 ~a~%

source: both a manifest and a package list were given~%
es: se ha proporcionado tanto un manifiesto como una lista de paquetes~%
it: sono stati forniti sia un manifesto che un elenco di pacchetti~%
zh_cn: 同时提供了清单和包列表~%

source: file provided with option ~a does not exist: ~a~%
es: no existe el archivo proporcionado con opción ~a: ~a~%
it: il file fornito con l'opzione ~a non esiste: ~a~%
zh_cn: 使用选项 ~a 提供的文件不存在：~a~%

source: ~a: unknown pack format~%
es: ~a: formato de empaquetado desconocido~%
it: ~a: formato confezione sconosciuto~%

source: no packages specified; building an empty pack~%
es: no se especificó ningún paquete; construyendo un empaquetado vacío~%
it: nessun pacchetto specificato; costruisco una confezione vuota~%
zh_cn: 未指定包；正在构建一个空包~%

source: Singularity requires you to provide a shell~%
es: Singularity necesita que proporcione un shell~%
it: Singularity richiede che venga fornita una shell~%
zh_cn: Singularity 要求您提供一个 shell~%

source: Add @code{bash} or @code{bash-minimal} to your package list.
es: Añada @code{bash} o @code{bash-minimal} a su lista de paquetes.
it: Aggiungi @code{bash} o @code{bash-minimal} al tuo elenco di pacchetti.
zh_cn: 将 @code{bash} 或 @code{bash-minimal} 添加到您的包列表中。

source: computing ~h package derivations for ~a...~%
es: calculando ~h derivaciones de paquete para ~a...~%
it: calcolo ~h derivazioni pacchetto per ~a...~%
zh_cn: 计算适用于 ~1@*~a 的 ~0@*~h 个软件包派生...~%

source: could not read '~a': ~a~%
es: no se pudo leer '~a': ~a~%
it: non ho potuto leggere '~a': ~a~%

source: '~a' is unreadable, cannot determine whether substitutes are authorized~%
es: '~a' es no legible, no puede determinar si sustituciones son autorizados~%
it: '~a' è illeggibile, non è possibile determinare se le sostituzioni sono autorizzate~%
zh_cn: '~a' 不可读，无法确定是否授权替代品~%

source: substitutes from '~a' are unauthorized~%
es: sustituciones desde '~a' no están autorizadas~%
it: i sostituti provenienti da '~a' non sono autorizzati~%

source: To authorize all substitutes from @uref{~a} to be downloaded, the following command needs to be run as root: @example guix archive --authorize <<EOF ~a EOF @end example Alternatively, on Guix System, you can add the signing key above to the @code{authorized-keys} field of @code{guix-configuration}. See "Getting Substitutes from Other Servers" in the manual for more information.
es: Para autorizar todos las sustituciones desde @uref{~a} para ser descargado, la instrucción siguiente necesita ser ejecutada como root: @example guix archive --authorize <<EOF ~a EOF @end example Alternativamente, en Guix System, puede añadir la clave de firma encima para el campo @code{authorized-keys} de @code{guix-configuration}. Consulte «Obtención de sustiticiones desde otros servidores» en el manual para más información.
it: Per autorizzare il download di tutti i sostituti da @uref{~a}, devi eseguire il comando seguente come root: @example guix archive --authorize <<EOF ~a EOF @end example In alternativa, su un Sistema Guix, puoi aggiungere la chiave di firma qui sopra al campo @code{authorized-keys} di @code{guix-configuration}. Vedi "Getting Substitutes from Other Servers" nel manuale per più informazioni.
zh_cn: 要授权从 @uref{~a} 下载所有替代品，需要以 root 身份运行以下命令： @example guix archive --authorize <<EOF ~a EOF @end example 或者，在 Guix 系统上，您可以将上述签名密钥添加到 @code{guix-configuration} 的 @code{authorized-keys} 字段中。 有关更多信息，请参见手册中的“从其他服务器获取替代品”。

source: looking for ~h store items on ~a...~%
es: buscando ~h elementos del almacén en ~a...~%
it: cerco ~h oggetti dello store su ~a...~%
zh_cn: 正在 ~1@*~a 上查询 ~0@*~h 个存储项…~%

source: ~,1f% substitutes available (~h out of ~h)~%
es: ~,1f% sustituciones disponibles (~h de ~h)~%
it: ~,1f% sostituti disponibili (~h di ~h)~%
zh_cn: ~,1f% 可用替代品 (~h 中的 ~h)~%

source: unknown substitute sizes~%
es: tamaños de sustituciones desconocidos~%
it: dimensioni sostituti sconosciute~%
zh_cn: 未知的替代品大小~%

source: ~,1h MiB of nars (compressed)~%
es: ~,1h MiB de nars (comprimidos)~%
it: ~,1h MiB di nars (compressi)~%
zh_cn: ~,1h MiB 的 nars（压缩）~%

source: at least ~,1h MiB of nars (compressed)~%
es: al menos ~,1h MiB de nars (comprimidos)~%
it: almeno ~,1h MiB di nars (compressi)~%
zh_cn: 至少 ~,1h MiB 的 nars（压缩）~%

source: ~,1h MiB on disk (uncompressed)~%
es: ~,1h MiB en disco (sin comprimir)~%
it: ~,1h MiB su disco (non compressi)~%
zh_cn: ~,1h MiB 的磁盘空间（未压缩）~%

source: ~,3h seconds per request (~,1h seconds in total)~%
es: ~,3h segundos por petición (~,1h segundos en total)~%
it: ~,3h secondi per richiesta (~,1h secondi in totale)~%
zh_cn: 每个请求 ~,3h 秒（总共 ~,1h 秒）~%

source: ~,1h requests per second~%
es: ~,1h peticiones por segundo~%
it: ~,1h richieste al secondo~%
zh_cn: 每秒 ~,1h 请求~%
