Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: ;; Fill-in your IP.
es: ;; Rellene su IP.
it: ;; Inserisci il tuo IP.
zh_cn: ;; 填写您的 IP。

source: ;; Fill-in your gateway IP.
es: ;; Rellene su IP de puerta de enlace.
it: ;; Inserisci l'IP del tuo gateway.
zh_cn: ;; 填写您的网关 IP。

source: ;; Fill-in your nameservers.
es: ;; Rellene sus servidores de nombres.
it: ;; Inserisci i tuoi server dei nomi.
zh_cn: ;; 填写您的域名服务器。

source: CUPS printing system (no Web interface by default)
es: Sistema de impresión CUPS (no hay interfaz Web predeterminada)
it: Sistema di stampa CUPS (di default senza interfaccia Web)
zh_cn: CUPS 打印系统（默认无 Web 界面）

source: ;; Below is the list of system services. To search for available ;; services, run 'guix system search KEYWORD' in a terminal.
es: ;; Debajo está el listado de servicio del sistema. Para buscar servicios ;; disponibles, ejecute 'guix system search PALABRA CLAVE' en un terminal.
it: ;; Di seguito è riportato l'elenco dei servizi di sistema. Per cercare i ;; servizi disponibili, esegui 'guix system search PAROLA-CHIAVE' in un terminale.
zh_cn: ;; 以下是系统服务列表。要搜索可用 ;; 服务，请在终端运行 'guix system search KEYWORD'。

source: ;; Packages installed system-wide. Users can also install packages ;; under their own account: use 'guix search KEYWORD' to search ;; for packages and 'guix install PACKAGE' to install a package.
es: ;; Paquetes instalado por todo el sistema. Los usuarios pueden además ;; instalar paquetes bajo su propia cuenta: utilice 'guix search CLAVE' para ;; buscar paquetes y 'guix install PAQUETE para instalar un paquete.
it: ;; Pacchetti installati per l'intero sistema. Gli utenti possono anche installare ;; pacchetti sotto i loro account: usa 'guix search PAROLA-CHIAVE' per cercare ;; pacchetti e 'guix install PACCHETTO' per installarne uno.
zh_cn: ;; 系统范围内安装的软件包。用户也可以在 ;; 自己的账户下安装软件包：使用 'guix search KEYWORD' 搜索 ;; 软件包，使用 'guix install PACKAGE' 安装软件包。

source: ;; This is the default list of services we ;; are appending to.
es: ;; Este es el listado predet. de servicios al ;; que estamos agregados.
it: ;; Questo è l'elenco predefinito dei servizi a cui ;; aggiungeremo gli altri.
zh_cn: ;; 这是我们正在追加的默认服务列表。

source: ;; Indicate which modules to import to access the variables ;; used in this configuration.
es: ;; Indica cuales módulos a importar para acceder las variables ;; utilizadas dentro de esta configuración.
it: ;; Indica quali moduli importare per accedere alle variabili ;; utilizzate in questa configurazione.
zh_cn: ;; 指示要导入哪些模块以访问此配置中使用的变量。

source: ;; This is an operating system configuration generated ;; by the graphical installer. ;; ;; Once installation is complete, you can learn and modify ;; this file to tweak the system configuration, and pass it ;; to the 'guix system reconfigure' command to effect your ;; changes.
es: ;; Esta es una configuración de sistema operativo generada ;; por el instalador gráfico. ;; ;; Una vez que la instalación está completada, puede aprender y ;; modificar este archivo para ajustar la configuración del sistema ;; y pasarlo a la instrucción 'guix system reconfigure' para efectuar ;; sus cambios.
it: ;; Questa è una configurazione del sistema operativo generata ;; dal programma di installazione grafico. ;; ;; Una volta completata l'installazione, puoi imparare come modificare ;; questo file per mettere a punto la configurazione del sistema, e passarlo ;; al comando 'guix system reconfigure' per rendere effettive le tue ;; modifiche.
zh_cn: ;; 这是由图形安装程序生成的操作系统配置。 ;; ;; 安装完成后，您可以学习并修改此文件以调整系统配置， ;; 并将其传递给 'guix system reconfigure' 命令以生效您的更改。

source: Unable to locate path: ~a.
es: No se pudo encontrar la ruta: ~a.
it: Impossibile trovare il percorso: ~a.
zh_cn: 无法定位路径：~a。

source: ;; The list of user accounts ('root' is implicit).
es: ;; El listado de cuentas de usuario ('root' es implícito).
it: ;; La lista degli account utente ('root' è implicito).
zh_cn: ;; 用户账户列表（'root' 是隐含的）。

source: Press Enter to continue.~%
es: Presione Entrar para continuar.~%
it: Premi Invio per continuare.~%
zh_cn: 按回车键继续。~%

source: Command ~s exited with value ~a
es: Comando ~s salió con valor ~a
it: Comando ~s uscito con valore ~a
zh_cn: 命令 ~s 以值 ~a 退出

source: Command ~s killed by signal ~a
es: Comando ~s muerto por señal ~a
it: Comando ~s terminato dal segnale ~a
zh_cn: 命令 ~s 被信号 ~a 杀死

source: Command ~s stopped by signal ~a
es: Comando ~s detenido por señal ~a
it: Comando ~s fermato dal segnale ~a
zh_cn: 命令 ~s 被信号 ~a 停止

source: Command ~s succeeded
es: Comando ~s logrado
it: Comando ~s eseguito con successo
zh_cn: 命令 ~s 成功

source: %run-command-in-installer not set
es: %run-command-in-installer no establecido
it: %run-command-in-installer non impostato
zh_cn: %run-command-in-installer 未设置

source: no signing key '~a'. Have you run 'guix archive --generate-key'?
es: no existe la clave de firma '~a'. ¿Ha ejecutado 'guix archive --generate-key'?
it: nessuna chiave di firma '~a'. Hai eseguito 'guix archive --generate-key'?
zh_cn: 没有签名密钥 '~a'。您是否运行过 'guix archive --generate-key'？

source: could not determine root file system type
es: no se pudo determinar el tipo de sistema del archivo root
it: non è stato possibile determinare il tipo di file system root
zh_cn: 无法判定根文件系统的类型

source: Hetzner Cloud access token was not provided. This may be fixed by setting the environment variable GUIX_HETZNER_API_TOKEN to one procured from https://docs.hetzner.com/cloud/api/getting-started/generating-api-token
es: Vale de acceso a Hetzner Cloud no fue proporcionado. Esto puede ser fijado por parámetros de la variable de entorno GUIX_HETZNER_API_TOKEN a uno procurado desde https://docs.hetzner.com/cloud/api/getting-started/generating-api-token
it: Il token di accesso Hetzner Cloud non è stato fornito. Questo problema può essere risolto impostando la variabile di ambiente GUIX_HETZNER_API_TOKEN su una ottenuta da https://docs.hetzner.com/cloud/api/getting-started/generating-api-token
zh_cn: 未提供 Hetzner Cloud 访问令牌。可以通过将环境变量 GUIX_HETZNER_API_TOKEN 设置为从 https://docs.hetzner.com/cloud/api/getting-started/generating-api-token 获取的令牌来解决此问题

source: unsupported machine configuration '~a' for environment of type '~a'
es: configuración de máquina '~a' no implementada para el entorno de tipo '~a'
it: configurazione macchina non supportata '~a' per ambiente di tipo '~a'
zh_cn: 环境类型 '~a' 的机器配置 '~a' 不受支持

source: server type '~a' not supported~%~%Available server types:~%~%~a~%~%For more details and prices, see: ~a
es: tipo de servidor '~a' no admitido ~%~%Tipos del servidor disponible:~%~%~a~%~%Para más detalles y precios, vea: ~a
it: tipo di server '~a' non supportato~%~%Tipi di server disponibili:~%~%~a~%~%Per maggiori dettagli e prezzi, vedere: ~a
zh_cn: 服务器类型 '~a' 不受支持~%~%可用服务器类型：~%~%~a~%~%更多详情和价格，请参见：~a

source: server location '~a' not supported~%~%Available locations:~%~%~a~%~%For more details, see: ~a
es: lugar del servidor '~a' no admitido~%~%Lugares disponibles:~%~%~a~%~%Para más detalles, consulte: ~a
it: posizione del server '~a' non supportata~%~%Posizioni disponibili:~%~%~a~%~%Per maggiori dettagli, vedere: ~a
zh_cn: 服务器位置 '~a' 不受支持~%~%可用位置：~%~%~a~%~%更多详情，请参见：~a

source: primary ip '~a' does not exist.
es: ip primaria '~a' no existe.
it: l'IP primario '~a' non esiste.
zh_cn: 主 IP '~a' 不存在。

source: failed to run script '~a' on machine, exit code: '~a'
es: fallo al ejecutar guion '~a' sobre máquina, código de salida: '~a'
it: impossibile eseguire lo script '~a' sulla macchina, codice di uscita: '~a'
zh_cn: 在机器上运行脚本 '~a' 时失败，退出码：'~a'

source: unsupported root file system type '~a'
es: tipo de sistema de archivo raíz '~a' no soportado
it: tipo di file system root non supportato '~a'
zh_cn: 不支持的根文件系统类型 '~a'

source: no server provisioned for machine '~a' on the Hetzner Cloud service
es: ningún servidor proporcionado para la máquina '~a' en el servicio Hetzner Cloud
it: nessun server predisposto per la macchina '~a' sul servizio Hetzner Cloud
zh_cn: Hetzner Cloud 服务中未为机器 '~a' 配置服务器

source: Provisioning of virtual machine servers on the Hetzner Cloud service.
es: Proporcionar servidores de máquina virtual en el servicio Hetzner Cloud.
it: Provisioning di server di macchine virtuali sul servizio Hetzner Cloud.
zh_cn: 在 Hetzner Cloud 服务上配置虚拟机服务器。

source: expected a list of Hetzner API responses
es: esperaba un listado de respuestas API Hetzner
it: previsto un elenco di risposte API Hetzner
zh_cn: 预期 Hetzner API 响应列表

source: unexpected HTTP status code: ~a, expected: ~a~%~a
es: código de estado HTTP no esperado: ~a, esperado: ~a~%~a
it: codice di stato HTTP inaspettato: ~a, previsto: ~a~%~a
zh_cn: 意外的 HTTP 状态码：~a，预期：~a~%~a

source: expected at least one action id, but got '~a'
es: esperado al menos una id de acción, pero obtuvo '~a'
it: previsto almeno un ID azione, ma ho ottenuto '~a'
zh_cn: 预期至少一个操作 ID，但得到 '~a'

source: server action '~a' not found
es: acción de servidor '~a' no encontrada
it: azione del server '~a' non trovata
zh_cn: 未找到服务行为 '~a'

source: expected one server action, but got '~a'
es: esperaba una acción de servidor, pero obtuvo '~a'
it: previsto un'azione del server, ma ho ottenuto '~a'
zh_cn: 预期一个服务器操作，但得到 '~a'

source: ~a: invalid system type; must be a string
es: ~a: tipo de sistema no válido; debe ser una cadena
it: ~a: tipo di sistema non valido; deve essere una stringa
zh_cn: ~a：无效的系统类型；必须是字符串

source: ~a: unknown system type
es: ~a: tipo de sistema desconocido
it: ~a: tipo di sistema sconosciuto
zh_cn: ~a: 未知系统类型

source: Did you mean @code{~a}?
es: ¿Quería decir @code{~a}?
it: Intendevi @code{~a}?
zh_cn: 您的意思是 @code{~a} 吗？

source: <machine-ssh-configuration> without a 'host-key' is deprecated~%
es: <machine-ssh-configuration> sin 'host-key' está obsoleto~%
it: <machine-ssh-configuration> senza una 'host-key' è deprecato~%
zh_cn: <machine-ssh-configuration> 没有 'host-key' 已弃用~%

source: device '~a' not found: ~a
es: dispositivo '~a' no encontrado: ~a
it: dispositivo '~a' non trovato: ~a
zh_cn: 未找到设备 '~a'：~a

source: no file system with label '~a'
es: ningún sistema de archivos con etiqueta '~a'
it: nessun file system con etichetta '~a'
zh_cn: 没有标签为 '~a' 的文件系统

source: no file system with UUID '~a'
es: ningún sistema de archivos con UUID '~a'
it: nessun file system con UUID '~a'
zh_cn: 没有 UUID 为 '~a' 的文件系统

source: missing modules for ~a:~{ ~a~}~%
es: módulos de ~a no encontrados:~{ ~a~}~%
it: moduli mancanti per ~a: ~{ ~a~}~%
zh_cn: 缺少模块用于 ~a：~{ ~a~}~%

source: incorrect target system ('~a' was given, while the system reports that it is '~a')~%
es: sistema destino incorrecto (se proporcionó '~a', mientras que el sistema informa ser '~a')~%
it: sistema target errato (è stato fornito '~a', ma il sistema riporta che è '~a')~%
zh_cn: 目标系统不正确（给定 '~a'，而系统报告为 '~a'）~%

source: failed to switch systems while deploying '~a':~%~{~s ~}
es: fallo al conmutar sistema mientras se despliegan '~a':~%~{~s ~}
it: impossibile passare da un sistema all'altro durante il dispiego di '~a':~%~{~s ~}
zh_cn: 部署 '~a' 时切换系统失败：~%~{~s ~}

source: an error occurred while upgrading services on '~a':~%~{~s ~}~%
es: ha ocurrido un error mientras se actualizan servicios sobre '~a':~%~{~s ~}~%
it: si è verificato un errore durante l'aggiornamento dei servizi su '~a':~%~{~s ~}~%
zh_cn: 升级 '~a' 上的服务时发生错误：~%~{~s ~}~%

source: failed to load system of '~a' for kexec reboot:~%~{~s~^ ~}~%
es: incorrecto al cargar sistema de '~a' para re-arranque kexec:~%~{~s~^ ~}~%
it: caricamento del sistema di '~a' per il reboot kexec non riuscito:~%~{~s~^ ~}~%

source: failed to install bootloader on '~a':~%~{~s ~}~%
es: fallo al instalar el cargador de arranque sobre '~a':~%~{~s ~}~%
it: impossibile installare il bootloader su '~a':~%~{~s ~}~%

source: could not roll-back machine
es: no se pudo volver a la generación previa en la máquina
it: non è stato possibile fare il rollback della macchina
zh_cn: 无法回滚机器

source: Provisioning for machines that are accessible over SSH and have a known host-name. This entails little more than maintaining an SSH connection to the host.
es: Provisión de máquinas accesibles a través de SSH y con nombre de máquina conocido. Esto implica poco más que mantener una conexión SSH con la máquina.
it: Provisioning per le macchine accessibili tramite SSH e con un nome host noto. Consiste nel mantenere una connessione SSH con l'host e poco più.
zh_cn: 为可以通过 SSH 访问并且具有已知主机名的机器进行配置。这仅涉及维护与主机的 SSH 连接。

source: unsupported machine configuration '~a' for environment of type '~a'
es: configuración de máquina '~a' no implementada para el entorno de tipo '~a'
it: configurazione macchina '~a' non supportata per un ambiente di tipo '~a'
zh_cn: 环境类型'~a'的机器配置'~a'不受支持

source: could not find bootstrap binary '~a' for system '~a'
es: no se pudo encontrar el binario del lanzamiento inicial '~a' para el sistema '~a'
it: non è stato possibile trovare il binario di bootstrap '~a' per il sistema '~a'
zh_cn: 无法找到引导二进制 '~a'，用于系统 '~a'

source: Raw build system with direct store access
es: Sistema de construcción básico con acceso directo al almacén
it: Sistema di build grezzo con accesso diretto allo store
zh_cn: 具有直接存储访问的原始构建系统

source: Bootstrap Guile
es: Guile para el lanzamiento inicial
it: Guile di bootstrap
zh_cn: 引导 Guile

source: Pre-built Guile for bootstrapping purposes.
es: Guile pre-construido para el lanzamiento inicial.
it: Guile precompilato con funzione di bootstrap.
zh_cn: 用于引导目的的预构建 Guile。

source: Bootstrap binaries and headers of the GNU C Library
es: Binarios y cabeceras de la biblioteca C de GNU para el lanzamiento inicial
it: Binari e header di bootstrap della libreria GNU C
zh_cn: GNU C 库的引导二进制文件和头文件

source: Bootstrap binaries of the GNU Compiler Collection
es: Binarios del compilador GNU GCC para el lanzamiento inicial
it: Binari bootstrap della GNU Compiler Collection
zh_cn: GNU 编译器集合的引导二进制文件

source: '~a~{ ~a~}' exited with status ~a; output follows:~%~%~{ ~a~%~}
es: '~a~{ ~a~}' salió con estado ~a; la salida fue la siguiente:~%~%~{ ~a~%~}
it: '~a~{ ~a~}' è uscito con lo stato ~a; di seguito l'output:~%~%~{ ~a~%~}
zh_cn: '~a~{ ~a~}'以状态~a 退出；输出如下：~%~%~{ ~a~%~}

source: main commands
es: órdenes principales
it: comandi principali
zh_cn: 主要命令

source: software development commands
es: órdenes de desarrollo de software
it: comandi per lo sviluppo software
zh_cn: 软件开发命令

source: packaging commands
es: órdenes para paquetes
it: comandi per la gestione dei pacchetti
zh_cn: 打包命令

source: plumbing commands
es: órdenes de bajo nivel
it: comandi di servizio
zh_cn: 管道命令

source: internal commands
es: órdenes internas
it: comandi interni
zh_cn: 内部命令

source: extension commands
es: comandos de extensión
it: comandi estensioni
zh_cn: 扩展命令

source: invalid argument: ~a~%
es: parámetro no válido: ~a~%
it: argomento non valido: ~a~%
zh_cn: 无效参数：~a~%

source: Did you mean @code{~a}?~%
es: ¿Quería decir @code{~a}?~%
it: Intendevi @code{~a}?~%
zh_cn: 您是想说@code{~a}吗？~%

source: Your Guix installation is ~a day old.
es: Su instalación de Guix es de hace ~a día.
it: La tua installazione di Guix è vecchia di ~a giorno.
zh_cn: 您的 Guix 安装已有 ~a 天。

source: Consider running 'guix pull' followed by '~a' to get up-to-date packages and security updates.
es: Considere la ejecución 'guix pull' seguida de '~a' para obtener paquetes actualizados y actualizaciones de seguridad.
it: Valuta di eseguire 'guix pull' seguito da '~a' per ottenere pacchetti aggiornati e aggiornamenti di sicurezza.
zh_cn: 建议运行 'guix pull'，然后运行 '~a' 以获取最新的软件包和安全更新。

source: only ~,1f GiB of free space available on ~a~%
es: solo hay ~,1f% GiB de espacio libre disponible en ~a~%
it: solo ~,1f GiB di spazio libero disponibile su ~a~%
zh_cn: ~1@*~a 上仅有 ~0@*~,1f GiB 的可用空间~%

source: Consider deleting old profile generations and collecting garbage, along these lines: @example guix gc --delete-generations=1m @end example
es: Considere el borrado de generaciones de perfil antiguas y la recolección de basura, más o menos así: @example guix gc --delete-generations=1m @end example
it: Valuta di eliminare vecchie generazioni profilo e reclamare lo spazio sprecato, su questa falsariga: @example guix gc --delete-generations=1m @end example
zh_cn: 考虑删除旧的配置生成并收集垃圾，类似于以下内容： @example guix gc --delete-generations=1m @end example

source: cannot access build log at '~a':~%
es: no se pudo acceder al registro de construcción de construcción en '~a':~%
it: impossibile accedere al log di compilazione su '~a':~%

source: failed to create GC root `~a': ~a~%
es: no se pudo crear la raíz recolector de basura «~a»: ~a~%
it: impossibile creare la radice GC `~a': ~a~%
zh_cn: 无法创建 GC 根`~a'：~a~%

source: -L, --load-path=DIR prepend DIR to the package module search path
es: -L, --load-path=DIR antepone DIR a la ruta de búsqueda del módulo del paquete
it: -L, --load-path=DIR premette DIR al percorso di ricerca del modulo del pacchetto
zh_cn: -L, --load-path=目录 将 <目录> 加入到软件包模块搜索目录之前

source: -K, --keep-failed keep build tree of failed builds
es: -K, --keep-failed mantiene el árbol de construcción de las construcciones fallidas
it: -K, --keep-failed mantiene l'albero delle build fallite
zh_cn: -K, --keep-failed 保留失败构建的构建树

source: -k, --keep-going keep going when some of the derivations fail
es: -k, --keep-going sigue adelante cuando falla alguna de las derivaciones
it: -k, --keep-going vai avanti nel caso alcune derivazioni falliscano

source: -n, --dry-run do not build the derivations
es: -n, --dry-run no construye las derivaciones
it: -n, --dry-run non costruire le derivazioni
zh_cn: -n, --dry-run 不要构建派生包

source: --fallback fall back to building when the substituter fails
es: --fallback vuelve a construir cuando el sustituto falla
it: --fallback ripiega sulla costruzione quando l'uso di sostituti fallisce
zh_cn: --fallback 如果替换器失败，回落到构建

source: --no-substitutes build instead of resorting to pre-built substitutes
es: --no-substitutes construye en vez de obtener sustituciones preconstruídas
it: --no-substitutes costruisce invece di ricorrere a sostituiti pre-compilati
zh_cn: --no-substitutes 构建而不使用预先构建的替代品

source: --substitute-urls=URLS fetch substitute from URLS if they are authorized
es: --substitute-urls=URL obtiene las sustituciones de las URL si están autorizadas
it: --substitute-urls=URLS recupera i sostituti da questi URLS se sono autorizzati
zh_cn: --substitute-urls=URLS 从 URLS 获取替代品，如果这些链接被授权的话

source: --no-grafts do not graft packages
es: --no-grafts no injerta paquetes
it: --no-grafts non innestare i pacchetti
zh_cn: --no-grafts 不要嫁接软件包

source: --no-offload do not attempt to offload builds
es: --no-offload no intenta delegar las construcciones
it: --no-offload non tentare l'offload delle costruzioni
zh_cn: --no-offload 不要尝试卸载构建

source: --max-silent-time=SECONDS mark the build as failed after SECONDS of silence
es: --max-silent-time=SEGUNDOS marca la construcción como fallida tras SEGUNDOS de silencio
it: --max-silent-time=SECONDI segna la build come non riuscita dopo tot SECONDI di silenzio
zh_cn: --max-silent-time=SECONDS 在 SECONDS 的静默后将构建标记为失败

source: --timeout=SECONDS mark the build as failed after SECONDS of activity
es: --timeout=SEGUNDOS marca la construcción como fallida tras SEGUNDOS de actividad
it: --timeout=SECONDI segna la build come non riuscita dopo tot SECONDI di attività
zh_cn: --timeout=SECONDS 在 SECONDS 的活动后将构建标记为失败

source: --rounds=N build N times in a row to detect non-determinism
es: --rounds=N construye N veces seguidas en una fila para detectar no-determinismo
it: --rounds=N costruisce N volte di seguito per rilevare non-determinismo
zh_cn: --rounds=N 连续构建 N 次以检测非确定性

source: -c, --cores=N allow the use of up to N CPU cores for the build
es: -c, --cores=N permite el uso de hasta N núcleos de la CPU para la construcción
it: -c, --cores=N permetti di usare fino a N core della CPU per la costruzione
zh_cn: -c, --cores=N 允许在构建中使用最多 N 个 CPU 核心

source: -M, --max-jobs=N allow at most N build jobs
es: -M, --max-jobs=N permite N trabajos de construcción como máximo
it: -M, --max-jobs=N permetti al massimo N build contemporanee
zh_cn: -M, --max-jobs=N 最多允许 N 个构建作业

source: --debug=LEVEL produce debugging output at LEVEL
es: --debug=NIVEL el NIVEL de depuración en la salida
it: --debug=LIVELLO produce un output di debug a questo LIVELLO
zh_cn: --debug=LEVEL 以此級别LEVEL生成调试输出

source: --list-targets list available targets
es: --list-targets enumera los destinos disponibles
it: --list-targets elenca i target disponibili
zh_cn: --list-targets 列出可用目标

source: --target=TRIPLET cross-build for TRIPLET--e.g., "aarch64-linux-gnu"
es: --target=TRIPLETA construcción cruzada para la TRIPLETA—por ejemplo "aarch64-linux-gnu"
it: --target=TRIPLET cross-compila per TRIPLET--es. "aarch64-linux-gnu"
zh_cn: --target=TRIPLET 为 TRIPLET 交叉构建，例如"aarch64-linux-gnu"

source: --list-systems list available systems
es: --list-systems enumera los sistemas disponibles
it: --list-systems elenca i sistemi disponibili
zh_cn: --list-systems 列出可用系统

source: -s, --system=SYSTEM attempt to build for SYSTEM--e.g., "i686-linux"
es: -s, --system=SISTEMA intenta la construcción para el SISTEMA—por ejemplo, "i686-linux"
it: -s, --system=SISTEMA tenta di compilare per questo SISTEMA--es. "i686-linux"
zh_cn: -s, --system=系统 尝试为 <系统> 构建——比如，"i686-linux"

source: '--keep-failed' ignored since you are talking to a remote daemon
es: '--keep-failed' se descarta ya que se está comunicando con un dæmon remoto
it: '--keep-failed' ignorato perché stai dialogando con un demone remoto
zh_cn: '--keep-failed' 被忽略，因为您正在与远程守护进程通信

source: '--no-build-hook' is deprecated; use '--no-offload' instead~%
es: '--no-build-hook' está obsoleto; use '--no-offload' en su lugar~%
it: '--no-build-hook' è deprecata; usa invece '--no-offload'~%
zh_cn: '--no-build-hook'已被弃用；请改用'--no-offload'~%

source: not a number: '~a' option argument: ~a~%
es: no es un número: argumento de opción '~a': ~a~%
it: non è un numero: '~a' argomento dell'opzione: ~a~%
zh_cn: 不是一个数字：'~a'选项参数：~a~%

source: The available systems are:
es: Los sistemas disponibles son:
it: I sistemi disponibili sono:
zh_cn: 可用的系统有：

source: The available targets are:
es: Los destinos disponibles son:
it: I target disponibili sono:
zh_cn: 可用的目标有：

source: '~a' is not a supported cross-compilation target~%
es: '~a' no es un destino de compilación cruzada admitidas~%
it: '~a' non è un target di cross-compilazione supportato~%
zh_cn: ~a: 不是受支持的交叉编译目标~%

source: Did you mean @code{~a}? Try @option{--list-targets} to view available targets.~%
es: ¿Quiso decir @code{~a}? Intente @option{--list-targets} para ver destinos disponibles.~%
it: Intendevi @code{~a}? Prova @option{--list-targets} per vedere I target disponibili.~%
zh_cn: 您是想说@code{~a}吗？尝试@option{--list-targets}查看可用目标。~%

source: Try @option{--list-targets} to view available targets.~%
es: Intente @option{--list-targets} para ver destinos disponibles.~%
it: Prova @option{--list-targets} per vedere i target disponibili. ~%
zh_cn: 尝试@option{--list-targets}查看可用目标。~%

source: '~a' is not a supported system~%
es: '~a' no es un sistema mantenido~%
it: '~a' non è un sistema supportato~%
zh_cn: ~a: 不是受支持的系统~%

source: Did you mean @code{~a}? Try @option{--list-systems} to view available system types.~%
es: ¿Quiere decir @code{~a}? Intente @option{--list-system} para ver tipos de sistemas disponibles.~%
it: Intendevi @code{~a}? Prova @option{--list-systems} per vedere i tipi di sistema disponibili.~%
zh_cn: 您是想说@code{~a}吗？尝试@option{--list-systems}查看可用系统类型。~%

source: Try @option{--list-systems} to view available system types.~%
es: Intente @option{--list-systems} para ver tipos del sistema disponibles.~%
it: Prova @option{--list-systems} per vedere i tipi di sistema disponibili.~%
zh_cn: 尝试 @option{--list-systems} 查看可用的系统类型。~%
