Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: -r, --root=FILE for 'vm', 'image', 'container' and 'build', make FILE a symlink to the result, and register it as a garbage collector root
es: -r, --root=ARCHIVO para 'vm', 'image', 'container' y 'build' crea ARCHIVO como un enlace simbólico al resultado y lo registra como recolector de basura de root
it: -r, --root=FILE per 'vm', 'image', 'container' e 'build', rende FILE un collegamento simbolico al risultato, e lo registra come radice per il garbage collector
zh_cn: -r, --root=FILE 对于 'vm'、'image'、'container' 和 'build'， 将 FILE 设为结果的符号链接，并 将其注册为垃圾收集器根

source: --full-boot for 'vm', make a full boot sequence
es: --full-boot con 'vm', genera una secuencia de arranque completa
it: --full-boot per 'vm', crea una sequenza di avvio completa
zh_cn: --full-boot 对于 'vm'，执行完整的启动序列

source: --no-graphic for 'vm', use the tty that we are started in for IO
es: --no-graphic para 'vm', use la tty por la que empezamos la IO
it: --no-graphic per 'vm', usa il tty da cui è stato avviato per l'I/O
zh_cn: --no-graphic 对于 'vm'，使用我们启动时所在的 tty 进行 IO

source: --skip-checks skip file system and initrd module safety checks
es: --skip-checks omite las comprobaciones de seguridad del sistema de archivos y de módulos de initrd
it: --skip-checks salta i controlli di sicurezza del file system e dei moduli initrd
zh_cn: --skip-checks 跳过文件系统和 initrd 模块的安全检查

source: --graph-backend=BACKEND use BACKEND for 'extension-graph' and 'shepherd-graph'
es: --graph-backend=BACKEND usar BACKEND para 'extension-graph' y 'shepherd-graph'
it: --graph-backend=BACKEND usa BACKEND per 'extension-graph' e 'shepherd-graph'
zh_cn: --graph-backend=BACKEND 对于 'extension-graph' 和 'shepherd-graph' 使用 BACKEND

source: -I, --list-installed[=REGEXP] for 'describe' and 'list-generations', list installed packages matching REGEXP
es: -I, --list-installed[=EXPREG] para 'describe' y 'list-generations', enumera paquetes instalados que coincidan con su EXPREG
it: -I, --list-installed[=REGEXP] per 'describe' e 'list-generations', elenca i pacchetti installati che corrispondono a REGEXP
zh_cn: -I, --list-installed[=REGEXP] 对于 'describe' 和 'list-generations'，列出匹配 REGEXP 的已安装包

source: --help-docker-format list options specific to the docker image type.
es: --help-docker-format enumera opciones específicas del tipo de imagen del muelle.
it: --help-docker-format elenca le opzioni specifiche per il tipo di immagine docker.
zh_cn: --help-docker-format 列出特定于 docker 镜像类型的选项。

source: --max-layers=N Number of image layers
es: --max-layers=N Número de capas de imagen
it: --max-layers=N Numero massimo di layer dell'immagine

source: '~a' does not return an operating system or an image~%
es: '~a' no devuelve ni un sistema operativo ni una imagen~%
it: '~a' non restituisce un sistema operativo o un'immagine~%
zh_cn: '~a' 未返回操作系统或镜像~%

source: both file and expression cannot be specified~%
es: no se pueden especificar tanto el archivo como la expresión~%
it: non è possibile specificare file ed espressione insieme~%
zh_cn: 文件和表达式不能同时指定~%

source: no configuration specified~%
es: ninguna configuración especificada~%
it: nessuna configuazione specificata~%

source: image lacks an operating-system
es: a la imagen le falta un sistema operativo
it: l'immagine non ha un oggetto operating-system
zh_cn: 镜像缺少操作系统

source: wrong number of arguments~%
es: número de parámetros incorrecto~%
it: numero di argomenti sbagliato~%
zh_cn: 参数数量错误~%

source: no system generation, nothing to describe~%
es: ninguna generación del sistema, nada que describir~%
it: nessuna generazione di sistema, niente da descrivere~%
zh_cn: 无系统生成，无法描述~%

source: build and deploy full operating systems
es: construcción y despliegue de sistemas operativos completos
it: costruisce e dispiega interi sistemi operativi
zh_cn: 构建和部署完整操作系统

source: ~a: unknown action~%
es: ~a: acción desconocida~%
it: ~a: azione sconosciuta~%
zh_cn: ~a：未知操作~%

source: wrong number of arguments for action '~a'~%
es: número de parámetros incorrecto para la acción '~a'~%
it: numeri di argomenti sbagliato per l'azione '~a'~%
zh_cn: 操作 '~a' 的参数数量错误~%

source: guix system: missing command name~%
es: guix system: falta el nombre de la orden~%
it: guix system: nome comando mancante~%
zh_cn: guix system：缺少命令名称~%

source: Try 'guix system --help' for more information.~%
es: Pruebe 'guix system --help' para más información.~%
it: Prova 'guix system --help' per maggiori informazioni.~%
zh_cn: 尝试 'guix system --help' 以获取更多信息。~%

source: ~a: no such service type~%
es: ~a: no hay tal tipo de servicio~%
it: ~a: tipo di servizio non presente~%

source: no service types specified, nothing to edit~%
es: no se especificaron tipos de servicios, nada que editar~%
it: nessun tipo di servizio specificato, niente da modificare~%
zh_cn: 未指定服务类型，无法编辑~%

source: ~a: ~a matching service type~%
es: ~a: ~a coincidiendo tipo de servicio~%
it: ~a: ~a tipo di servizio corrispondente~%
zh_cn: ~a：~a 匹配的服务类型~%

source: Usage: guix system installer [OPTION]... Run the system installer.
es: Modo de empleo: guix system installer [OPCIÓN]… Ejecuta el instalador del sistema.
it: Utilizzo: guix system installer [OPZIONE]... Esegui il programma di installazione del sistema.
zh_cn: 用法：guix system installer [OPTION]... 运行系统安装程序。

source: -n, --dry-run skip network setup, partitioning, and actual install
es: -n, --dry-run omite configuración de red, particionado, e instalación actual
it: -n, --dry-run salta la configurazione di rete, il partizionamento e l'installazione effettiva

source: run the graphical installer program
es: ejecute el programa de instalador gráfico
it: lancia il programma di installazione grafico
zh_cn: 运行图形安装程序

source: unknown
es: desconocida
it: sconosciuto
zh_cn: 未知

source: failed to load operating system for kexec: ~a~%
es: incorrecto al cargar sistema operativo para kexex: ~a~%
it: caricamento del sistema operativo per kexec non riuscito: ~a~%

source: aborting reconfiguration because commit ~a of channel '~a' is not a descendant of ~a
es: abortando la reconfiguración porque acometer '~a' de canal ~a, no desciende de ~a
it: interruzione della riconfigurazione perché il commit ~a del canale '~a' non è un discendente di ~a
zh_cn: 中止重新配置，因为频道 '~a' 的提交 ~a 不是 ~a 的后代

source: Use @option{--allow-downgrades} to force this downgrade.
es: Use @option{--allow-downgrades} para permitir el paso a esta versión anterior.
it: Usa @option{--allow-downgrades} per forzare questa retrocessione.
zh_cn: 使用 @option{--allow-downgrades} 强制 此降级。

source: cannot determine provenance for current system~%
es: no se pudo determinar la proveniencia para el sistema actual~%
it: impossibile determinare la provenienza del sistema corrente~%
zh_cn: 无法确定当前系统的来源~%

source: cannot determine provenance of ~a~%
es: no se pudo determinar la proveniencia de ~a~%
it: impossibile determinare la provenienza di ~a~%
zh_cn: 无法确定 ~a 的来源~%

source: Available checkers:~%
es: Comprobaciones disponibles:~%
it: Analizzatori disponibili:~%
zh_cn: 可用的检查器：~%

source: Usage: guix lint [OPTION]... [PACKAGE]... Run a set of checkers on the specified package; if none is specified, run the checkers on all packages.
es: Modo de empleo: guix lint [OPCIÓN]... [PAQUETE]... Ejecuta un conjunto de comprobaciones en el paquete especificado; si no se especifica ninguno, ejecuta las comprobaciones en todos los paquetes.
it: Utilizzo: guix lint [OPZIONE]... [PACCHETTO]... Esegue un set di controlli sul pacchetto specificato; se non ne è specificato nessuno, esegue i controlli su tutti i pacchetti.
zh_cn: 用法：guix lint [OPTION]... [PACKAGE]... 对指定的软件包运行一组检查器；如果未指定， 则对所有软件包运行检查器。

source: -c, --checkers=CHECKER1,CHECKER2... only run the specified checkers
es: -c, --checkers=COMPROBACIÓN1,COMPROBACIÓN2... ejecuta únicamente las comprobaciones especificadas
it: -c, --checkers=ANA1,ANA2... esegui solo gli analizzatori specificati
zh_cn: -c, --checkers=CHECKER1,CHECKER2... 仅运行指定的检查器

source: -x, --exclude=CHECKER1,CHECKER2... exclude the specified checkers
es: -x, --exclude=COMPROBACIÓN1,COMPROBACIÓN2... excluye las comprobaciones especificadas
it: -x, --exclude=ANA1,ANA2... esclude gli analizzatori specificati
zh_cn: -x, --exclude=CHECKER1,CHECKER2... 排除指定的检查器

source: -n, --no-network only run checkers that do not access the network
es: -n, --no-network ejecuta únicamente comprobaciones que no necesitan acceso a internet
it: -n, --no-network esegue solo i controllori che non accedono alla rete
zh_cn: -n, --no-network 仅运行不访问网络的检查器

source: -e, --expression=EXPR consider the package EXPR evaluates to
es: -e, --expression=EXPR considera el paquete al que EXPR evalúa
it: -e, --expression=EXPR considera il pacchetto che risulta dalla valutazione di EXPR
zh_cn: -e, --expression=EXPR 考虑软件包 EXPR 计算的结果

source: -l, --list-checkers display the list of available lint checkers
es: -l, --list-checkers muestra la lista de comprobaciones lint disponibles
it: -l, --list-checkers mostra l'elenco dei controllori di lint disponibili
zh_cn: -l, --list-checkers 显示可用的 lint 检查器列表

source: ~a: invalid checker~%
es: ~a: comprobación no válida~%
it: ~a: analizzatore non valido~%
zh_cn: ~a：无效的检查器~%

source: validate package definitions
es: validación de definiciones de paquete
it: convalida le definizioni dei pacchetti
zh_cn: 验证软件包定义

source: ~a: database is locked by another process~%
es: ~a: base de datos bloqueada por otro proceso~%
it: ~a: il database è bloccato da un altro processo~%
zh_cn: ~a：数据库被另一个进程锁定~%

source: schema version: ~a~%
es: versión de esquema: ~a~%
it: versione schema: ~a~%
zh_cn: 模式版本： ~a~%

source: number of packages: ~9h~%
es: número de paquetes: ~9h~%
it: numero di pacchetti: ~9h~%
zh_cn: 软件包数量： ~9h~%

source: number of files: ~9h~%
es: número de archivos: ~9h~%
it: numero di file: ~9h~%
zh_cn: 文件数量： ~9h~%

source: database size: ~9h MiB~%
es: tamaño de base de datos: ~9h MiB~%
it: dimensione database: ~9h MiB~%
zh_cn: 数据库大小： ~9h MiB~%

source: indexing ~h packages
es: indexando ~h paquetes
it: indicizzo ~h pacchetti
zh_cn: 正在索引 ~h 个软件包

source: traversing local profile manifests...~%
es: atravesando manifiestos de perfil local…~%
it: percorro i manifesti del profilo locale...~%
zh_cn: 正在遍历本地配置文件清单...~%

source: Usage: guix locate [OPTIONS...] FILE... Locate FILE and return the list of packages that contain it.
es: Modo de empleo: guix locate [OPCIONES...] FICHERO... Encuentra el FICHERO y devuelve el listado de paquetes que lo contienen.
it: Utilizzo: guix locate [OPZIONI...] FILE... Individua FILE e restituisce l'elenco dei pacchetti che lo contengono.
zh_cn: 用法：guix locate [OPTIONS...] FILE... 定位文件并返回包含该文件的软件包列表。

source: -g, --glob interpret FILE as a glob pattern
es: -g, --glob interpreta FICHERO como un patrón burbuja
it: -g, --glob interpreta FILE come un pattern glob
zh_cn: -g, --glob 将文件解释为通配符模式

source: --stats display database statistics
es: --stats exhibe estadísticas de base de datos
it: -h, --aiuto visualizzare la guida e uscire
zh_cn: --stats 显示数据库统计

source: -u, --update force a database update
es: -u, --update fuerza una actualización de la base de datos
it: -u, --update forza un aggiornamento del database

source: --clear clear the database
es: --clear vacía la base de datos
it: repair riparare gli elementi specificati

source: --database=FILE store the database in FILE
es: --database=ARCHIVO almacena la base de datos en ARCHIVO
it: --database=FILE conserva il database in FILE
zh_cn: --database=FILE 将数据库存储在 FILE 中

source: --method=METHOD use METHOD to select packages to index; METHOD can be 'manifests' (fast) or 'store' (slower)
es: --method=MÉTODO utiliza MÉTODO para seleccionar paquetes a índice; MÉTODO puede ser 'manifests' (rápida) o 'store' (más lenta)
it: --method=METODO usa METODO per selezionare i pacchetti da indicizzare; METODO può essere 'manifests' (veloce) o 'store' (più lento)
zh_cn: --method=METHOD 使用 METHOD 选择要索引的软件包；METHOD 可以是 'manifests'（快速）或 'store'（较慢）

source: -h, --help display this help and exit
es: -h, --help exhibe esta ayuda y termina
it: -h, --help mostra questo aiuto ed esce
zh_cn: -h, --help 显示此说明并退出

source: -V, --version display version information and exit
es: -V, --version exhibe información de la versión y termina
it: -V, --version mostra informazioni sulla versione ed esce
zh_cn: -V, --version 显示版本信息并退出

source: ~a: unknown indexing method~%
es: ~a: método índice desconocido~%
it: ~a: metodo di indicizzazione sconosciuto~%

source: search for packages providing a given file
es: busca paquetes que proporcionen los archivos indicados
it: cerca pacchetti che forniscono un certo file
zh_cn: 搜索提供指定文件的软件包

source: clearing database...~%
es: vaciando base de datos…~%
it: svuoto il database...~%
zh_cn: 正在清除数据库...~%

source: indexing files from ~a...~%
es: indexando archivos desde ~a...~%
it: indicizzo i file da ~a...~%
zh_cn: 从 ~a 中索引文件…~%

source: no files to search for~%
es: sin archivos para búsqueda~%
it: nessun file da cercare~%
zh_cn: 无文件可搜索~%

source: file~{ '~a'~} not found in database '~a'~%
es: archivo~{ '~a'~} no encontrado en la base de datos '~a'~%
it: file~{ '~a'~} non trovato nel database '~a'~%

source: Usage: guix publish [OPTION]... Publish ~a over HTTP.
es: Modo de empleo: guix publish [OPCIÓN]… Publica ~a por HTTP.
it: Utilizzo: guix publish [OPZIONE]... Pubblica ~a tramite HTTP.
zh_cn: 用法：guix publish [OPTION]... 通过 HTTP 发布 ~a。

source: -p, --port=PORT listen on PORT
es: -p, --port=PUERTO escucha en PUERTO
it: -p, --port=PORTA resta in ascolto su PORTA
zh_cn: -p, --port=PORT 监听端口 PORT

source: --listen=HOST listen on the network interface for HOST
es: --listen=DIRECCIÓN escucha en la interfaz de red de DIRECCIÓN
it: --listen=HOST si mette in ascolto sull'interfaccia di rete per HOST
zh_cn: --listen=HOST 监听网络接口 HOST

source: -u, --user=USER change privileges to USER as soon as possible
es: -u, --user=USUARIO cambia los privilegios al usuario USER tan pronto como sea posible
it: -u, --user=UTENTE cambia i privilegi all'UTENTE il prima possibile
zh_cn: -u, --user=USER 尽快切换到用户 USER 的权限

source: -a, --advertise advertise on the local network
es: -a, --advertise anunciar en la red local
it: -a, --advertise pubblicizza sulla rete locale

source: -C, --compression[=METHOD:LEVEL] compress archives with METHOD at LEVEL
es: -C, --compression[=MÉTODO:NIVEL] comprime los archivos con MÉTODO al NIVEL
it: -C, --compression[=METODO:LIVELLO] comprime gli archivi usando METODO al dato LIVELLO

source: -c, --cache=DIRECTORY cache published items to DIRECTORY
es: -c, --cache=DIRECTORIO almacena los elementos publicados en caché en el DIRECTORIO
it: -c, --cache=DIRECTORY conserva gli oggetti pubblicati in DIRECTORY
zh_cn: -c, --cache=目录 缓存发布的项目到目录

source: --cache-bypass-threshold=SIZE serve store items below SIZE even when not cached
es: --cache-bypass-threshold=TAMAÑO proporciona elementos del almacén con tamaño menor a TAMAÑO incluso cuando no están en la caché
it: --cache-bypass-threshold=DIMENSIONE serve gli elementi dello store sotto DIMENSIONE anche se non in cache
zh_cn: --cache-bypass-threshold=SIZE 即使未缓存，也为小于 SIZE 的存储项目提供服务

source: --workers=N use N workers to bake items
es: --workers=N usa N trabajadores para cocinar elementos
it: --workers=N usa N thread di lavoro per preparare gli oggetti
zh_cn: --workers=N 使用 N 个工作线程处理项目

source: --ttl=TTL announce narinfos can be cached for TTL seconds
es: --ttl=TTL anuncia que los archivos narinfo pueden estar en caché durante TTL segundos
it: --ttl=TTL annuncia che i narinfo possono essere messi in cache per TTL secondi
zh_cn: --ttl=TTL 宣告 narinfos 可缓存 TTL 秒

source: --negative-ttl=TTL announce missing narinfos can be cached for TTL seconds
es: --negative-ttl=TTL anuncia que los narinfo faltantes se pueden guardar en caché por TTL segundos
it: --negative-ttl=TTL annuncia che i narinfo mancanti possono essere messi in cache per TTL secondi
zh_cn: --negative-ttl=TTL 宣告缺失的 narinfos 可缓存 TTL 秒

source: --nar-path=PATH use PATH as the prefix for nar URLs
es: --nar-path=RUTA usa RUTA como prefijo para las URL de nar
it: --nar-path=PERCORSO usa PERCORSO come prefisso per gli URL nar
zh_cn: --nar-path=PATH 使用 PATH 作为 nar URL 的前缀

source: --public-key=FILE use FILE as the public key for signatures
es: --public-key=ARCHIVO usa ARCHIVO como clave pública para firmas
it: --public-key=FILE usa FILE come chiave pubblica per le firme
zh_cn: --public-key=FILE 使用 FILE 作为签名的公钥

source: --private-key=FILE use FILE as the private key for signatures
es: --private-key=ARCHIVO usa ARCHIVO como clave privada para firmas
it: --private-key=FILE usa FILE come chiave privata per le firme
zh_cn: --private-key=FILE 使用 FILE 作为签名的私钥

source: -r, --repl[=PORT] spawn REPL server on PORT
es: -r, --repl[=PUERTO] lanza un servidor REPL en PUERTO
it: -r, --repl[=PORTA] lancia un server REPL sulla PORTA indicata
zh_cn: -r, --repl[=PORT] 在端口 PORT 启动 REPL 服务器

source: lookup of host '~a' failed: ~a~%
es: falló la búsqueda de la máquina '~a': ~a~%
it: ricerca dell'host '~a' fallita: ~a~%
zh_cn: 主机 '~a' 查询失败：~a~%

source: lookup of host '~a' returned nothing
es: la búsqueda de la máquina '~a' no ha devuelto nada
it: la ricerca dell'host '~a' non ha ritornato niente
zh_cn: 主机 '~a' 查询无结果

source: ~a: unsupported compression type~%
es: ~a: tipo de compresión no implementado~%
it: ~a: tipo di compressione non supportato~%
zh_cn: ~a：不支持的压缩类型~%

source: ~a: invalid duration~%
es: ~a: duración no válida~%
it: ~a: durata non valida~%

source: Advertising ~a~%.
es: Anunciando ~a~%.
it: Pubblicizzo ~a~%.
zh_cn: 正在推销 ~a~%。

source: ~a: unexpected number of startup file descriptors
es: ~a: número inesperado de descriptores de archivo de arranque
it: ~a: numero di descrittori di file di avvio inatteso
zh_cn: ~a：启动文件描述符数量异常

source: user '~a' not found: ~a~%
es: la cuenta '~a' no se ha encontrado: ~a~%
it: utente '~a' non trovato: ~a~%
zh_cn: 用户 '~a' 未找到：~a~%

source: publish build results over HTTP
es: publicación de resultados de construcciones a través de HTTP
it: pubblica i risultati di build via HTTP
zh_cn: 通过 HTTP 发布构建结果

source: server running as root; consider using the '--user' option!~%
es: servidor en ejecución como root; ¡considere el uso de la opción '--user'!~%
it: server in esecuzione come root; si consiglia di utilizzare l'opzione '--user'!~%
zh_cn: 服务器以 root 身份运行；考虑使用 '--user' 选项！~%

source: publishing (started via socket activation)~%
es: publicando (iniciado por medio de activación de socket)~%
it: pubblicazione (iniziata da attivazione socket)~%
zh_cn: 发布中（通过套接字激活启动）~%

source: publishing ~a on ~a, port ~d~%
es: publicando ~a en ~a, puerto ~d~%
it: pubblico ~a su ~a, porta ~d~%
zh_cn: 正在 ~a 上的 ~a 端口 ~d 发布~%

source: using '~a' compression method, level ~a~%
es: usando el método de compresión '~a', nivel ~a~%
it: uso il metodo di compressione '~a' al livello ~a~%
zh_cn: 使用 '~a' 压缩方法，级别 ~a~%

source: Usage: guix edit PACKAGE... Start $VISUAL or $EDITOR to edit the definitions of PACKAGE...
es: Modo de empleo: guix edit PAQUETE... Inicia $VISUAL o $EDITOR para editar las definiciones de PAQUETE...
it: Utilizzo: guix edit PACCHETTO... Avvia $VISUAL o $EDITOR per modificare le definizioni di PACCHETTO...
zh_cn: 用法：guix edit PACKAGE... 启动 $VISUAL 或 $EDITOR 编辑软件包定义...

source: file '~a' not found in search path ~s~%
es: archivo '~a' no encontrado en la ruta de búsqueda ~s~%
it: file '~a' non trovato nel percorso di ricerca ~s~%
zh_cn: 未找到文件 '~a'于搜索路径 ~s 中~%

source: failed to launch '~a': ~a~%
es: no se pudo ejecutar '~a': ~a~%
it: impossibile lanciare '~a': ~a~%

source: view and edit package definitions
es: visualización y edición de definiciones de paquetes
it: vedi e modifica le definizioni dei pacchetti
zh_cn: 查看和编辑软件包定义

source: no packages specified, nothing to edit~%
es: no se especificaron paquetes, nada que editar~%
it: nessun pacchetto specificato, niente da modificare~%
zh_cn: 未指定软件包，无内容可编辑~%

source: no local build or substitute available for '~a'~%
it: nessuna build locale o sostituto disponibile per '~a'~%

source: store item
es: elemento del almacén
it: oggetto dello store
zh_cn: 存储项

source: total
it: in totale
zh_cn: 总用量

source: total: ~,1f MiB~%
it: totale: ~,1f MiB~%
zh_cn: 总计：~,1f MiB~%

source: store profile
es: perfil del almacén
it: profilo dello store
zh_cn: 存储配置文件

source: Usage: guix size [OPTION]... PACKAGE|STORE-ITEM Report the size of the PACKAGE or STORE-ITEM, with its dependencies.
es: Modo de empleo: guix size [OPCIÓN]... PAQUETE|ELEMENTO-DEL-ALMACÉN Informa del tamaño de PAQUETE o del ELEMENTO-DEL-ALMACÉN, incluyendo sus dependencias.
it: Utilizzo: guix size [OPZIONE]... PACCHETTO|STORE-ITEM Riporta la dimensione del PACCHETTO o STORE-ITEM, con le sue dipendenze.

source: --sort=KEY sort according to KEY--"closure" or "self"
es: --sort=CLAVE ordena de acuerdo a CLAVE--"closure" o "self"
it: --sort=CHIAVE ordina secondo CHIAVE--"closure" o "self"
zh_cn: --sort=KEY 根据 KEY--"closure" 或 "self" 排序

source: -m, --map-file=FILE write to FILE a graphical map of disk usage
es: -m, --map-file=ARCHIVO escribe en ARCHIVO un mapa gráfico del uso del disco
it: -m, --map-file=FILE scrivi su FILE una mappa grafica dell'utilizzo del disco
zh_cn: -m, --map-file=FILE 将磁盘使用的图形映射写入 FILE

source: ~a: invalid sorting key~%
es: ~a: clave de ordenación no válida~%
it: ~a: chiave di ordinamento non valida~%

source: profile the on-disk size of packages
es: perfil del uso de disco de los paquetes
it: profila la dimensione su disco dei pacchetti
zh_cn: 分析软件包的磁盘大小

source: missing store item argument
es: falta el parámetro de elemento del almacén
it: manca un oggetto dello store come argomento
zh_cn: 缺少存储项参数

source: ~a: invalid argument (package name expected)
es: ~a: parámetro no válido (se esperaba un nombre de paquete)
it: ~a: argomento non valido (atteso un nome pacchetto)
zh_cn: ~a：无效参数（预期为软件包名称）

source: the DAG of packages, excluding implicit inputs
es: el GAD de paquetes, excluyendo entradas implícitas
it: il DAG dei pacchetti, esclusi gli input impliciti
zh_cn: 软件包的有向无环图（DAG），不包括隐式输入

source: the reverse DAG of packages
es: el GAD invertido de paquetes
it: il DAG inverso dei pacchetti
zh_cn: 软件包的反向有向无环图（DAG）

source: the DAG of packages, including implicit inputs
es: el GAD de paquetes, incluyendo entradas implícitas
it: il DAG dei pacchetti, inclusi gli input impliciti
zh_cn: 软件包的有向无环图（DAG），包括隐式输入

source: the DAG of packages and origins, including implicit inputs
es: el GAD de paquetes y orígenes, incluyendo entradas implícitas
it: il DAG dei pacchetti e delle origini, inclusi gli input impliciti
zh_cn: 软件包和来源的有向无环图（DAG），包括隐式输入

source: same as 'bag', but without the bootstrap nodes
es: igual que 'bag', pero sin los nodos del lanzamiento inicial
it: come 'bag', ma senza i nodi di bootstrap
zh_cn: 与 'bag' 相同，但不包括引导节点

source: the reverse DAG of packages, including implicit inputs
es: el GAD inverso de paquetes, incluyendo entradas implícitas
it: il DAG inverso dei pacchetti, inclusi gli input impliciti
zh_cn: 软件包的反向有向无环图（DAG），包括隐式输入

source: the DAG of derivations
es: el GAD de derivaciones
it: il DAG delle derivazioni
zh_cn: 派生的有向无环图（DAG）

source: unsupported argument for derivation graph
es: parámetro no implementado para el grafo de derivaciones
it: argomento non supportato per il grafo derivazioni
zh_cn: 不支持的派生图参数

source: unsupported argument for this type of graph
es: parámetro no implementado para este tipo de grafo
it: argomento non supportato per questo tipo di grafo
zh_cn: 不支持此类型图的参数

source: references for '~a' are not known~%
es: las referencias de '~a' no son conocidas~%
it: i riferimenti per '~a' sono sconosciuti~%
zh_cn: 未知 '~a' 的引用~%

source: the DAG of run-time dependencies (store references)
es: el GAD de dependencias en tiempo de ejecución (referencias al almacén)
it: il DAG delle dipendenze runtime (riferimenti allo store)
zh_cn: 运行时依赖的有向无环图（存储引用）

source: the DAG of referrers in the store
es: el GAD de referentes en el almacén
it: il DAG dei referenti nello store
zh_cn: 存储中引用者的有向无环图（DAG）
