Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: build of ~a failed
es: la construcción de ~a falló
it: build di ~a fallita
zh_cn: 构建 ~a 失败

source: This usually indicates a bug in one of the channels you are pulling from, or some incompatibility among them. You can check the build log and report the issue to the channel developers. The channels you are pulling from are: ~a.
es: Esto usualmente indica un defecto en uno de los canales desde donde está trayendo, o alguna incompatibilidad entre ellos. Puede comprobar el registro de construcción y reportar el problema al canal de los desarrolladores. Los canales están trayendo son: ~a.
it: Questo di solito indica un bug in uno dei canali da cui stai prelevando, o qualche incompatibilità tra di essi. Puoi controllare il log delle build e segnalare il problema agli sviluppatori del canale. I canali da cui stai prelevando sono: ~a.
zh_cn: 这通常表示您拉取的某个频道存在错误，或它们之间存在某种不兼容。您可以查看构建日志并向频道开发者报告此问题。 您拉取的频道是：~a。

source: Could not find build log for '~a'.
es: No se pudo encontrar el registro de construcción para '~a'.
it: Impossibile trovare il log di compilazione per '~a'.
zh_cn: 无法找到 '~a' 的构建日志。

source: View build log at '~a'.
es: Muestra el registro de construcción en '~a'.
it: Vedi il log di compilazione in '~a'.
zh_cn: 查看构建日志于 '~a'。

source: substituting ~a...
es: sustituyendo ~a...
it: sostituisco ~a...
zh_cn: 正在替换 ~a...

source: downloading from ~a ...
es: descargando de ~a ...
it: scarico da ~a ...
zh_cn: 正在从 ~a 下载...

source: substitution of ~a complete
es: sustitución de ~a completada
it: sostituzione di ~a completata
zh_cn: 替换 ~a 完成

source: substitution of ~a failed
es: sustitución de ~a fallida
it: sostituzione di ~a fallita
zh_cn: 替换 ~a 失败

source: ~a hash mismatch for ~a:
es: el hash ~a de ~a no corresponde:
it: l'hash ~a non corrisponde per ~a:
zh_cn: ~a 的哈希不匹配 ~a：

source: expected hash: ~a actual hash: ~a~%
es: hash esperado: ~a hash real: ~a~%
it: hash atteso: ~a hash reale: ~a~%
zh_cn: 预期哈希：~a 实际哈希： ~a~%

source: offloading build of ~a to '~a'
es: delegando la construcción de ~a a '~a'
it: offload della costruzione di ~a su '~a'
zh_cn: 将 ~a 的构建卸载到 '~a'

source: following redirection to `~a'...~%
es: siguiendo la redirección a «~a»...~%
it: seguo il reindirizzamento verso `~a'...~%
zh_cn: 以下重定向到 `~a`...~%

source: ~a: HTTP download failed: ~a (~s)
es: ~a: descarga HTTP fallida: ~a (~s)
it: ~a: download HTTP fallito: ~a (~s)

source: signature is not a valid s-expression
es: la firma no es una expresión-s válida
it: la firma non è un'espressione-s valida
zh_cn: 签名不是有效的 S 表达式

source: invalid signature
es: firma no válida
it: firma non valida
zh_cn: 无效签名

source: invalid hash
es: hash no válido
it: hash non valido
zh_cn: 无效哈希

source: unauthorized public key
es: clave pública no autorizada
it: chiave pubblica non autorizzata
zh_cn: 公钥未被授权

source: corrupt signature data
es: datos de firma corruptos
it: dati di firma corrotti
zh_cn: 签名数据损坏

source: corrupt file set archive
es: archivo de conjunto de archivos corrupto
it: archivio dell'insieme file corrotto

source: importing file or directory '~a'...~%
es: importando el archivo o directorio '~a'...~%
it: importo il file o la directory '~a'...~%
zh_cn: 正在导入文件或目录 '~a'...~%

source: found valid signature for '~a'~%
es: encontrada una firma válida para '~a'~%
it: trovata una firma valida per '~a'~%
zh_cn: 找到 '~a' 的有效签名~%

source: imported file lacks a signature
es: el archivo importado carece de firma
it: il file importato non ha una firma
zh_cn: 导入的文件缺少签名

source: invalid inter-file archive mark
es: marca de archivo entre-archivos no válida
it: contrassegno di archivio inter-file non valido
zh_cn: 无效的文件间归档标记

source: invalid narinfo hash: ~s
es: hash naroinfo no válido: ~s
it: hash narinfo non valido: ~s
zh_cn: 无法的 narinfo 哈希：~s

source: signature version must be a number: ~s~%
es: la versión de firma debe ser un número: ~s~%
it: la versione della firma deve essere un numero: ~s~%
zh_cn: 签名版本必须是数字：~s~%

source: unsupported signature version: ~a~%
es: versión de firma no implementada: ~a~%
it: versione firma non supportata: ~a~%
zh_cn: 不支持的签名版本：~a~%

source: signature is not a valid s-expression: ~s~%
es: la firma no es una expresión-s válida: ~s~%
it: la firma non è un' espressione-S valida: ~s~%
zh_cn: 签名不是有效的 S 表达式：~s~%

source: invalid format of the signature field: ~a~%
es: formato no válido del campo de la firma: ~a~%
it: formato non valido del campo firma: ~a~%
zh_cn: 签名字段格式无效：~a~%

source: channel dependency has an invalid introduction field
es: La dependencia del canal tiene un campo de introducción inválido
it: la dipendenza di canale ha un campo introduzione non valido
zh_cn: 频道依赖项具有无效的介绍字段

source: unsupported '.guix-channel' version
es: versión de '.guix-channel' no implementada
it: versione '.guix-channel' non supportata
zh_cn: 不支持的 '.guix-channel' 版本

source: invalid '.guix-channel' file
es: archivo '.guix-channel' no válido
it: file '.guix-channel' non valido

source: Authenticating channel '~a', commits ~a to ~a (~h new commit)...~%
es: Verificando canal '~a', revisiones de ~a a ~a (~h nueva revisión)...~%
it: Autentico il canale '~a', commit da ~a a ~a (~h nuovo commit)...~%
zh_cn: 正在验证频道 '~a' 从 ~a 到 ~a 的提交（~h 个新提交）...~%

source: channel '~a' lacks 'introduction' field but '.guix-authorizations' found
es: el canal '~a' carece de campo 'introduction' pero '.guix-authorizations' se ha encontrado
it: Il canale '~a' non ha il campo 'introduction' ma è stato trovato '.guix-authorizations'
zh_cn: 频道 '~a' 缺少 'introduction' 字段但发现 '.guix-authorizations'

source: channel '~a' lacks an introduction and cannot be authenticated~%
es: el canal '~a' carece de presentación y no puede ser verificado~%
it: il canale '~a' non ha un'introduzione e non può essere autenticato~%
zh_cn: 频道 '~a' 缺少介绍，无法验证~%

source: Add the missing introduction to your channels file to address the issue. Alternatively, you can pass @option{--disable-authentication}, at the risk of running unauthenticated and thus potentially malicious code.
es: Añada la presentación perdida en su archivo de canales para corregir la incidencia. De manera alternativa, puede proporcionar la opción @option{--disable-authentication}, con el riesgo de ejecutar código sin verificar y por lo tanto potencialmente malicioso.
it: Aggiungi l'introduzione mancante al tuo file dei canali per risolvere il problema. In alternativa, puoi passare @option{--disable-authentication} al rischio di far girare codice non autenticato, e perciò potenzialmente malevolo.
zh_cn: 向您的频道文件添加缺失的介绍以解决该问题。或者，您可以传递 @option{--disable-authentication}，但这样做有运行未经身份验证且可能是恶意代码的风险。

source: channel authentication disabled~%
es: verificación de canales desactivada~%
it: autenticazione canale disabilitata~%
zh_cn: 频道认证已禁用~%

source: aborting update of channel '~a' to commit ~a, which is not a descendant of ~a
es: abortando la actualización del canal '~a' a la revisión ~a, la cual no desciende de ~a
it: interruzione dell'aggiornamento del canale '~a' per eseguire il commit di ~a, che non è un discendente di ~a
zh_cn: 中止将频道 '~a' 更新到提交 ~a，因为它不是 ~a 的后代

source: This could indicate that the channel has been tampered with and is trying to force a roll-back, preventing you from getting the latest updates. If you think this is not the case, explicitly allow non-forward updates.
es: Esto puede indicar que el canal ha sido modificado y se intenta forzar volver a una versión anterior, lo que evitaría que obtuviese las últimas versiones. Si piensa que este no es su caso, permita explícitamente las actualizaciones no-continuas (non-forward).
it: Questo potrebbe indicare che il canale è stato manomesso e sta tentando di forzare un rollback, impedendoti di ricevere gli ultimi aggiornamenti. Se ritieni che non sia questo il caso, consenti esplicitamente gli aggiornamenti non inoltrati.
zh_cn: 这可能表明频道已被篡改，试图强制回滚，阻止您获取最新更新。如果您认为情况并非如此，请明确允许非前向更新。

source: Updating channel '~a' from Git repository at '~a'...~%
es: Actualizando el canal '~a' del repositorio Git en '~a'...~%
it: Aggiorno il canale '~a' dal repository Git '~a'...~%
zh_cn: 正在从 Git 仓库“~1@*~a”更新频道“~0@*~a” ...~%

source: pulled channel '~a' from a mirror of ~a, which might be stale~%
es: se obtuvo el canal '~a' desde el espejo de ~a, que puede estar obsoleto~%
it: ho estratto il canale '~a' da uno specchio di ~a, che potrebbe essere obsoleto~%
zh_cn: 从 ~a 频道的镜像 '~a' 拉取提交，该镜像可能已过时~%

source: 'guix' channel is lacking
es: falta el canal de guix
it: canale 'guix' mancante
zh_cn: 'guix' 频道缺失

source: Make sure your list of channels contains one channel named @code{guix} providing the core of Guix.
es: Asegúrese de que su lista de canales contiene un canal llamado @code{guix} que proporcione la base de Guix.
it: Assicurati che il tuo elenco di canali contenga un canale chiamato @code{guix} che fornisca il nucleo di Guix.
zh_cn: 确保您的频道列表中包含一个名为 @code{guix} 的频道，提供 Guix 的核心。

source: invalid channel news entry
es: entrada de las noticias del canal no válida
it: voce notizie di canale non valida
zh_cn: 无效的频道新闻条目

source: syntactically invalid channel news file
es: archivo de noticias del canal con sintáxis no válida
it: il file delle notizie canale ha una sintassi non valida
zh_cn: 语法无效的频道新闻文件

source: invalid channel news file
es: archivo de noticias del canal no válido
it: file notizie di canale non valido

source: ~s: invalid package license~%
es: ~s: licencia de paquete no válida~%
it: ~s: licenza pacchetto non valida~%

source: cannot emit manifests formatted as version ~a
es: no se puede emitir manifiesto formateados como versión ~a
it: impossibile emettere dei manifesti formattati come versione ~a
zh_cn: 无法生成格式为版本 ~a 的清单

source: invalid repeated entry in profile: ~s
es: no válido repitió apunte en perfil: ~s
it: voce ripetuta non valida nel profilo: ~s

source: unsupported manifest format
es: formato de manifiesto no disponible
it: formato manifesto non supportato
zh_cn: 不支持的清单格式

source: package ~a does not support ~a
es: el paquete ~a no admite ~a
it: il pacchetto ~a non supporta ~a

source: while creating directory `~a': ~a
es: durante la creación del directorio «~a»: ~a
it: durante la creazione della directory `~a': ~a

source: Please create the @file{~a} directory, with you as the owner.
es: Cree el directorio @file{~a} y asígnese su propiedad.
it: Crea la directory @file{~a}, di cui sei il proprietario.
zh_cn: 请创建 @file{~a} 目录，并将您设为所有者。

source: directory `~a' is not owned by you
es: usted no es la propietaria del directorio «~a»
it: la directory `~a' non è di tua proprietà
zh_cn: 目录 `~a' 不属于您所有

source: Please change the owner of @file{~a} to user ~s.
es: Asigne la propiedad de @file{~a} a la cuenta ~s.
it: Si prega di modificare il proprietario di @file{~a} con l'utente ~s.
zh_cn: 请将 @file{~a} 的所有者更改为用户 ~s。

source: invalid comment string
es: cadena de comentario no válido
it: stringa di commento non valida

source: unexpected end of file
es: final de archivo inesperado
it: fine del file inattesa
zh_cn: 文件意外结束

source: Did you forget a closing parenthesis?
es: ¿Olvidó un paréntesis de cierre?
it: Hai dimenticato una parentesi di chiusura?
zh_cn: 您是否忘记闭合某个开括号？

source: remote command '~{~a~^ ~}' failed with status ~a
es: comando remoto '~{~a~^ ~}' falló con estado ~a
it: comando remoto '~{~a~^ ~}' fallito con stato ~a
zh_cn: 远程命令 '~{~a~^ ~}' 以状态 ~a 失败

source: server at '~a' returned host key '~a' of type '~a' instead of '~a' of type '~a'~%
es: el servidor en '~a' devolvió clave de host '~a' de tipo '~a' en lugar de '~a' de tipo '~a'~%
it: il server in '~a' ha restituito la chiave host '~a' di tipo '~a' invece di '~a' di tipo '~a'~%
zh_cn: 服务器 '~a' 返回了主机密钥 '~a'，类型为 '~a'，而非类型为 '~a' 的 '~a'~%

source: failed to authenticate server at '~a': ~a
es: falló al autenticar el servidor en'~a': ~a
it: impossibile autenticare il server su '~a': ~a

source: timeout while connecting to SSH server at '~a'
es: tiempo agotado durante la conexión al servidor SSH en'~a'
it: timeout durante la connessione al server SSH a '~a'
zh_cn: 连接到 SSH 服务器 '~a' 超时

source: SSH authentication failed for '~a@~a': ~a~%
es: la autenticación SSH fallaba para '~a@~a': ~a~%
it: autenticazione SSH fallita per '~a@~a': ~a~%

source: SSH connection to '~a' port ~a failed: ~a~%
es: Conexión SSH a '~a' puerto ~a incorrecta: ~a~%
it: connessione SSH a '~a' sulla porta ~a fallita: ~a~%

source: failed to start 'guix repl' on '~a'
es: falló al iniciar 'guix repl' sobre '~a'
it: impossibile avviare 'guix repl' su '~a'

source: failed to connect over SSH to daemon at '~a', socket ~a
es: falló al conectar sobre SSH para daemon en '~a', enchufe ~a
it: impossibile connettersi tramite SSH al demone in '~a', socket ~a

source: sending ~a store item (~h MiB) to '~a'...~%
es: enviando ~a elemento del almacén (~h MiB) a '~a'...~%
it: invio di ~a store item (~h MiB) a '~a'...~%
zh_cn: 正在向 '~1@*~a' 发送存储项 (~0@*~h MiB)…~%

source: unknown error while sending files over SSH
es: error desconocido mientras se enviaban archivos sobre SSH
it: errore sconosciuto nell'inviare file via SSH
zh_cn: 通过 SSH 发送文件时发生未知错误

source: failed to connect to '~A' on remote host '~A': ~a
es: falló al conectar a '~A' sobre el host remoto '~A': ~a
it: impossibile connettersi a '~A' sull'host remoto '~A': ~a

source: no such item on remote host '~A':~{ ~a~}
es: no hay tal artículo en el host remoto '~A':~{ ~a~}
it: nessun elemento del genere sull'host remoto '~A':~{ ~a~}
zh_cn: 远程主机 '~A' 上无此项：~{ ~a~}

source: protocol error on remote host '~A': ~a
es: error de protocolo en el host remoto '~A': ~a
it: errore di protocollo sull'host remoto '~A': ~a
zh_cn: 远程主机 '~A' 上的协议错误：~a

source: failed to retrieve store items from '~a'
es: falló al recuperar artículos almacenados desde '~a'
it: impossibile recuperare gli oggetti dello store da '~a'

source: retrieving ~a store item from '~a'...~%
es: obteniendo ~a elemento del almacén desde '~a'...~%
it: recupero ~a oggetto dello store da '~a'...~%
zh_cn: 正在从 '~1@*~a' 获取存储项 ~0@*~a…~%

source: failed to start Guile on remote host '~A'
es: falló al iniciar Guile en el host remoto '~A'
it: impossibile avviare Guile sull'host remoto '~A'

source: Make sure @command{guile} can be found in @code{$PATH} on the remote host. Run @command{ssh ~A guile --version} to check.
es: Asegurar que @command{guile} puede ser encontrado en @code{$PATH} en el host remoto. Ejecutar @command{ssh ~A guile --version} para comprobar.
it: Assicurati che @command{guile} sia presente in @code{$PATH} sull'host remoto. Esegui @command{ssh ~A guile --version} per verificare.
zh_cn: 确保远程主机的 @code{$PATH} 中可以找到 @command{guile}。运行 @command{ssh ~A guile --version} 进行检查。

source: exception occurred on remote host '~A': ~s
es: excepción ocurrida en el host remoto '~A': ~s
it: eccezione sull'host remoto '~A': ~s
zh_cn: 远程主机 '~A' 上发生异常：~s

source: receiving objects
es: recibiendo objetos
it: ricevo gli oggetti
zh_cn: 接收对象

source: indexing objects
es: indexando objetos
it: indicizzo gli oggetti
zh_cn: 索引对象

source: ignoring invalid certificate for '~a'~%
es: se descarta certificado no válido para '~a'~%
it: ignoro il certificato non valido per '~a'~%
zh_cn: 忽略 '~a' 的非法证书~%

source: Git error: ~a~%
es: Error git: ~a~%
it: errore Git: ~a~%
zh_cn: Git 错误：~a~%

source: updating submodule '~a'...~%
es: actualizando el submódulo '~a'...~%
it: aggiorno il sub-modulo '~a'...~%
zh_cn: 正在更新子模块 '~a'...~%

source: revision ~a of ~a could not be fetched from Software Heritage~%
es: la revisión ~a de ~a no puede ser recuperada desde Software Heritage~%
it: la revisione ~a di ~a non può essere recuperata da Software Heritage~%
zh_cn: 无法从 Software Heritage 获取 ~a 的修订版本 ~a~%

source: compressing cached Git repository at '~a'...~%
es: comprimiendo repositorio Git cacheado en '~a'…~%
it: comprimo la copia cache del repository Git in '~a'...~%
zh_cn: 正在压缩缓存的 Git 仓库 '~a'...~%

source: cannot fetch commit ~a from ~a: ~a
es: no se puede obtener la revisión ~a desde ~a: ~a
it: impossibile recuperare il commit ~a da ~a: ~a
zh_cn: 无法从 ~a 获取提交 ~a：~a

source: cannot fetch branch '~a' from ~a: ~a
es: no se puede obtener la rama '~a' desde ~a: ~a
it: impossibile recuperare il branch '~a' da ~a: ~a
zh_cn: 无法从 ~a 获取分支 '~a'：~a

source: Git failure while fetching ~a: ~a
es: Git ha fallado al obtener ~a: ~a
it: Errore di Git durante il recupero di ~a: ~a

source: '~a' does not name a store item~%
es: '~a' no nombra un elemento del almacén~%
it: '~a' non nomina un oggetto dello store~%
zh_cn: '~a' 不是存储项的名称~%

source: ~a: host not found: ~a~%
es: ~a: máquina no encontrada: ~a~%
it: ~a: host non trovato: ~a~%

source: ~a: connection failed: ~a~%
es: ~a: la conexión ha fallado: ~a~%
it: ~a: connessione fallita: ~a~%

source: ~a: TLS connection failed: in ~a: ~a~%
es: ~a: conexión TLS incorrecta: en ~a: ~a~%
it: ~a: connessione TLS fallita: in ~a: ~a~%

source: ~s: unsupported server URI scheme~%
es: ~s: esquema de URI del servidor no implementado~%
it: ~s: schema URI del server non supportato~%
zh_cn: ~s：不支持的服务器 URI 方案~%

source: Your Guix daemon is severely outdated, and will soon cease to be able to download binary substitutes. To upgrade it, refer to the 'Upgrading Guix' section in the manual.~%
es: Su daemon Guix está muy fuera de fache, y pronto cesará de ser capaz de descargar sustituciones binarias. Para actualizarlo, vaya a la sección 'Actualizar Guix' en el manual.~%
it: Il tuo demone Guix è decisamente obsoleto e presto non sarà più in grado di scaricare i sostituti binari. Per aggiornarlo, consulta la sezione "Aggiornamento di Guix" nel manuale.~%
zh_cn: 您的 Guix 守护进程严重过时，且很快将无法下载二进制替代品。要升级它，请参阅手册中的“升级 Guix”部分。~%

source: '~a' is deprecated, use '~a' instead~%
es: '~a' está obsoleto, use '~a'~%
it: '~a' è deprecato, usa '~a' al suo posto~%
zh_cn: '~a' 已弃用，请改用 '~a'~%

source: '~a' is deprecated~%
es: '~a' está obsoleto~%
it: '~a' è deprecata~%
zh_cn: '~a' 已弃用~%

source: in '~a': deprecated 'derivation' calling convention used~%
es: en '~a': se usa una convención de llamada a 'derivation' obsoleta~%
it: in '~a': convenzione di chiamata a 'derivation' deprecata~%
zh_cn: 在 '~a' 中：使用了已弃用的 'derivation' 调用约定~%

source: Usage: guix archive [OPTION]... PACKAGE... Export/import one or more packages from/to the store.
es: Modo de empleo: guix archive [OPCIÓN]... PAQUETE... Exportar/importar uno o mas paquetes desde/a el almacen.
it: Utilizzo: guix archive [OPZIONE]... PACCHETTO... Esporta/importa uno o più pacchetti da/verso lo store.
zh_cn: 用法：guix archive [OPTION]... PACKAGE... 从存储中导出/导入一个或多个软件包。

source: --export export the specified files/packages to stdout
es: --export exporta los archivos/paquetes especificados a la salida estándar
it: --export esporta i file/pacchetti specificati su stdout
zh_cn: --export 将指定的文件/软件包导出到标准输出

source: -r, --recursive combined with '--export', include dependencies
es: -r, --recursive combinado con '--export', incluye dependencias
it: -r, --recursive combinata con '--export', include le dipendenze
zh_cn: -r, --recursive 与 '--export' 结合使用，包含依赖项

source: --import import from the archive passed on stdin
es: --import importa desde el archivo pasado en la entrada estándar
it: --import importa dall'archivio passato su stdin
zh_cn: --import 从标准输入传入的归档中导入

source: --missing print the files from stdin that are missing
es: --missing imprime los archivos de la entrada estada que están desaparecidos
it: --missing stampa i file da stdin che sono mancanti
zh_cn: --missing 打印标准输入中缺失的文件

source: -x, --extract=DIR extract the archive on stdin to DIR
es: -x, --extract=DIRECTORIO extrae el archivo desde la entrada estándar a DIRECTORIO
it: -x, --extract=DIR estrae l'archivio su stdin in DIR
zh_cn: -x, --extract=DIR 将标准输入中的归档提取到 DIR

source: -t, --list list the files in the archive on stdin
es: -t, --list lista los archivos en el archivo sobre la entrada estándar
it: -t, --list elenca i file nell'archivio su stdin

source: --generate-key[=PARAMETERS] generate a key pair with the given parameters
es: --generate-key[=PARÁMETROS] genera un par de claves con los parámetros dados
it: --generate-key[=PARAMETRI] genera una coppia di chiavi con i parametri dati
zh_cn: --generate-key[=PARAMETERS] 使用给定参数生成密钥对

source: --authorize authorize imports signed by the public key on stdin
es: --authorize autorizar las importaciones firmadas con la clave pública en la entrada estándar
it: --authorize autorizza le importazioni firmate dalla chiave pubblica su stdin
zh_cn: --authorize 授权由标准输入中的公钥签名的导入

source: invalid key generation parameters: ~a: ~a~%
es: parámetros de generación de claves no válidos: ~a: ~a~%
it: parametri per la generazione della chiave non validi: ~a: ~a~%
zh_cn: 无效的密钥生成参数：~a：~a~%

source: package `~a' has no source~%
es: el paquete '~a' no tiene fuentes~%
it: il pacchetto `~a' non ha sorgente~%

source: no arguments specified; creating an empty archive~%
es: no se especificaron argumentos; creando un archivo vacío~%
it: nessun argomento specificato; creo un archivio vuoto~%
zh_cn: 未指定参数；正在创建空归档~%

source: unable to export the given packages~%
es: incapaz de exportar los paquetes dados~%
it: impossibile esportare i pacchetti dati~%
zh_cn: 无法导出给定的软件包~%

source: key pair exists under '~a'; remove it first~%
es: el par de claves existe bajo '~a'; quitarlas primero~%
it: la coppia di chiavi esiste in '~a'; rimuoverla prima~%
zh_cn: 密钥对已存在于 '~a'；请先移除它~%

source: Please wait while gathering entropy to generate the key pair; this may take time...~%
es: Espere mientras se obtiene entropía para generar el par de claves; esto puede llevar un tiempo...~%
it: Attendi la raccolta di entropia per generare la coppia di chiavi; potrebbe richiedere del tempo...~%
zh_cn: 请稍候，正在收集熵以生成密钥对； 这可能需要一些时间...~%

source: key generation failed: ~a: ~a~%
es: falló la generación de clave: ~a: ~a~%
it: generazione della chiave fallita: ~a: ~a~%
zh_cn: 密钥生成失败：~a：~a~%

source: failed to read public key: ~a: ~a~%
es: no se pudo leer la clave pública: ~a: ~a~%
it: impossibile leggere la chiave pubblica: ~a: ~a~%

source: replacing symbolic link ~a with a regular file~%
es: reemplazando el enlace simbólico ~a con un archivo regular~%
it: sostituzione del collegamento simbolico ~a con un file normale~%
zh_cn: 用常规文件替换符号链接 ~a~%

source: On Guix System, add all @code{authorized-keys} to the @code{guix-service-type} service of your @code{operating-system} instead.
es: En el Sistema Guix, añadir todas las @code{authorized-keys} al servicio @code{guix-service-type} de su @code{operating-system} en su lugar.
it: Su Guix System, aggiungi invece tutte le @code{authorized-keys} al servizio @code{guix-service-type} del tuo @code{operating-system}.
zh_cn: 在 Guix 系统上，请将所有 @code{authorized-keys} 添加到您的 @code{operating-system} 的 @code{guix-service-type} 服务中。

source: s-expression does not denote a public key~%
es: s-expression no denota una clave pública~%
it: l'espressione-S non denota una chiave pubblica~%
zh_cn: S 表达式不表示公钥~%

source: manipulate, export, and import normalized archives (nars)
es: manipula, exporta, e importa archivadores normalizados (nars)
it: manipola, esporta e importa archivi normalizzati (nars)
zh_cn: 操作、导出和导入规范化归档（nars）

source: either '--export' or '--import' must be specified~%
es: se debe especificar '--export' o '--import'~%
it: devi specificare '--export' oppure '--import'~%
zh_cn: 必须指定 '--export' 或 '--import'~%

source: Usage: guix discover [OPTION]... Discover Guix related services using Avahi.
es: Modo de empleo: guix discover [OPCIÓN]... Descubrir servicios relacionados con Guix usando Avahi.
it: Utilizzo: guix discover [OPZIONE]... Scopri i servizi correlati a Guix utilizzando Avahi.
zh_cn: 用法：guix discover [OPTION]... 使用 Avahi 发现 Guix 相关服务。

source: -c, --cache=DIRECTORY cache discovery results in DIRECTORY
es: -c, --cache=DIRECTORIO resultados de cache descubierto en DIRECTORIO
it: -c, --cache=DIRECTORY conserva i risultati della ricerca in DIRECTORY
zh_cn: -c, --cache=目录 在目录中缓存发现结果
