Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: Usage: guix build [OPTION]... PACKAGE-OR-DERIVATION... Build the given PACKAGE-OR-DERIVATION and return their output paths.
es: Modo de empleo: guix build [OPCIÓN]... PAQUETE-O-DERIVACIÓN... Construye el PAQUETE-O-DERIVACIÓN proporcionado y devuelve sus rutas de salida.
it: Uso: guix build [OPZIONE]... PACCHETTO-O-DERIVAZIONE... Costruisce il PACCHETTO-O-DERIVAZIONE dato e restituisce i percorsi dei suoi output.
zh_cn: 用法：guix build [OPTION]... PACKAGE-OR-DERIVATION... 构建给定的 PACKAGE-OR-DERIVATION 并返回它们的输出路径。

source: -e, --expression=EXPR build the package or derivation EXPR evaluates to
es: -e, --expression=EXPR construye el paquete o la derivación a la que EXPR evalúa
it: -e, --expression=EXPR costruisce il pacchetto o la derivazione che risulta dal valutare EXPR
zh_cn: -e, --expression=EXPR 构建 EXPR 计算得到的包或派生物

source: -f, --file=FILE build the package or derivation that the code within FILE evaluates to
es: -f, --file=ARCHIVO construye el paquete o la derivación a la que el código en ARCHIVO evalúa
it: -f, --file=FILE costruisce il pacchetto o la derivazione che risulta dal valutare il codice contenuto in FILE
zh_cn: -f, --file=FILE 构建 FILE 中代码计算得到的包或派生物

source: -m, --manifest=FILE build the packages that the manifest given in FILE evaluates to
es: -m, --manifest=ARCHIVO construye los paquetes que a los que evalúa el manifiesto contenido en ARCHIVO
it: -m, --manifest=FILE costruisce i pacchetti che risultano dal valutare il manifesto fornito in FILE
zh_cn: -m, --manifest=FILE 构建 FILE 中给出的清单计算得到的包

source: -D, --development build the inputs of the following package
es: -D, --development construye las entradas del siguiente paquete
it: -D, --development costruisce gli input del pacchetto seguente

source: -P, --dependents[=N] build dependents of the following package, up to depth N
es: -P, --dependents[=N] construye dependencias del siguiente paquete hasta la profundidad N
it: -P, --dependents[=N] crea i dipendenti del seguente pacchetto, fino a profondità N
zh_cn: -P, --dependents[=N] 构建以下包的依赖者，深度最多为 N

source: -S, --source build the packages' source derivations
es: -S, --source construye las derivaciones de fuentes de los paquetes
it: -S, --source costruisce le derivazioni sorgente dei pacchetti
zh_cn: -S, --source 构建包的源派生物

source: --sources[=TYPE] build source derivations; TYPE may optionally be one of "package", "all" (default), or "transitive"
es: --sources[=TIPO] construye las derivaciones de fuentes; TIPO puede ser de manera opcional "package", "all" (predeterminado) o "transitive"
it: --sources[=TIPO] costruisce le derivazioni sorgente; TIPO può essere "package", "all" (il default), o "transitive"
zh_cn: --sources[=TYPE] 构建源派生物；TYPE 可选为 "package"、"all"（默认）或 "transitive"

source: -d, --derivations return the derivation paths of the given packages
es: -d, --derivations devuelve las rutas de las derivaciones de los paquetes proporcionados
it: -d, -derivations restituisce i percorsi delle derivazioni dei pacchetti dati
zh_cn: -d, --derivations 返回给定包的派生路径

source: --check rebuild items to check for non-determinism issues
es: --check reconstruye elementos para comprobar problemas de no-determinismo
it: --check ricostruisce oggetti per individuare problemi di non-determinismo
zh_cn: --check 重新构建项目以检查非确定性问题

source: --repair repair the specified items
es: --repair repara los elementos especificados
it: --repair ripara gli oggetti specificati
zh_cn: --repair 修复指定的项目

source: -r, --root=FILE make FILE a symlink to the result, and register it as a garbage collector root
es: -r, --root=ARCHIVO ARCHIVO se crea como un enlace simbólico al resultado, y se registra como una raíz del recolector de basura
it: -r, --root=FILE rende FILE un link simbolico al risultato, e lo registra tra le radici del garbage collector
zh_cn: -r, --root=FILE 将 FILE 设为结果的符号链接，并将其注册为垃圾收集器根

source: -v, --verbosity=LEVEL use the given verbosity LEVEL
es: -v, --verbosity=NIVEL usa el NIVEL de detalle proporcionado
it: -v, --verbosity=LIV usa il LIVello di verbosità indicato
zh_cn: -v, --verbosity=LEVEL 使用给定的详细级别 LEVEL

source: -q, --quiet do not show the build log
es: -q, --quiet no muestra el registro de construcción
it: -q, --quiet non mostra il log di compilazione
zh_cn: -q, --quiet 不显示构建日志

source: --log-file return the log file names for the given derivations
es: --log-file devuelve los nombres de los archivo de registros de las derivaciones proporcionadas
it: --log-file restituisce i nomi dei file di log per le derivazioni date
zh_cn: --log-file 返回给定派生物的日志文件名

source: -V, --version display version information and exit
es: -V, --version exhibe información de la versión y termina
it: -V, --version mostra le informazioni sulla versione ed esce
zh_cn: -V, --version 显示程序版本并退出

source: invalid argument: '~a' option argument: ~a, ~ must be one of 'package', 'all', or 'transitive'~%
es: parámetro no válido: parámetro de la opción '~a': ~a, ~ debe ser o bien 'package', o 'all' o 'transitive'~%
it: argomento non valido: '~a' argomento dell'opzione: ~a, ~ deve essere uno dei seguenti: "package", "all" o "transitive"~%
zh_cn: 无效参数：'~a' 选项参数：~a，~ 必须是 'package'、'all' 或 'transitive' 之一~%

source: ~s: not something we can build~%
es: ~s: no es algo que podamos construir~%
it: ~s: non è qualcosa che possiamo costruire~%
zh_cn: ~s：不是我们可以构建的东西~%

source: If you build from a file, make sure the last Scheme expression returns a package value. @code{define-public} defines a variable, but returns @code{#<unspecified>}. To fix this, add a Scheme expression at the end of the file that consists only of the package's variable name you defined, as in this example: @example (define-public my-package (package ...)) my-package @end example
es: Si realiza la construcción desde un archivo, asegúrese de que la última expresión Scheme devuelve un paquete como valor. @code{define-public} define una variable, pero devuelve @code{#<unspecified>} como valor. Para obtener el resultado esperado, añada una expresión Scheme al final del archivo que consista únicamente en el nombre de variable que haya definido, como en este ejemplo: @example (define-public mi-paquete (package ...)) mi-paquete @end example
it: Se costruisci da un file, assicurati che l'ultima espressione Scheme restituisca un valore pacchetto. @code{define-public} definisce una variabile, ma restituisce @code{#<unspecified>}. Per risolvere, aggiungi un'espressione Scheme in fondo al file che consiste solo nel nome della variabile del pacchetto che hai definito, come in questo esempio: @example (define-public mio-pacchetto (package ...)) mio-pacchetto @end example
zh_cn: 如果您从文件构建，确保最后一个 Scheme 表达式返回一个包值。@code{define-public} 定义一个变量，但返回 @code{#<unspecified>}。要解决此问题，请在文件末尾添加一个 Scheme 表达式，该表达式仅包含您定义的包变量名，如下例所示： @example (define-public my-package (package ...)) my-package @end example

source: If you build from a file, make sure the last Scheme expression returns a package, gexp, derivation or a list of such values.
es: Si realiza la construcción desde un archivo, asegúrese de que la última expresión Scheme devuelve un paquete, una expresión-G, una derivación o una lista de estos valores.
it: Se costruisci da un file, assicurati che l'ultima espressione Scheme restituisca un pacchetto, una gexp, una derivazione o un elenco di valori di questo tipo.
zh_cn: 如果您从文件构建，确保最后一个 Scheme 表达式返回一个包、G 表达式、派生物或这些值的列表。

source: file '~a' does not return a manifest
es: archivo '~a' no devuelve un manifiesto
it: il file '~a' non restituisce un manifesto

source: computing dependents of package ~a...~%
es: calcular dependencias de paquete ~a…~%
it: calcolo i dipendenti del pacchetto ~a...~%
zh_cn: 正在计算包 ~a 的依赖者...~%

source: package ~a does not support ~a~%
es: el paquete ~a no admite ~a~%
it: il pacchetto ~a non supporta ~a~%
zh_cn: 包 `~a' 不支援 `~a'~%

source: package '~a' has no source~%
es: el paquete '~a' no tiene fuentes~%
it: il pacchetto '~a' non ha la sorgente~%

source: no build log for '~a'~%
es: ningún registro de construcción para '~a'~%
it: nessun log di compilazione per '~a'~%
zh_cn: 没有 '~a' 的构建日志~%

source: build packages or derivations without installing them
es: construye paquetes o derivaciones sin instalarlas
it: costruisce pacchetti o derivazioni senza installarli
zh_cn: 构建包或派生物但不安装它们

source: no arguments specified, nothing to do~%
es: no hay argumentos especificados, nada que hacer ~%
it: nessun argomento specificato, niente da fare~%
zh_cn: 未指定参数，无事可做~%

source: could not determine current substitute URLs; using defaults~%
es: no pudo determinar sustituto actual de las URL; utilizando por defecto~%
it: non è stato possibile determinare gli URL sostitutivi correnti; utilizzo dei valori predefiniti~%
zh_cn: 无法确定当前替代 URL；使用默认值~%

source: invalid menu-entry: ~a
es: menú-apunte no válido: ~a
it: voce di menu non valida: ~a

source: Please chose only one of: @enumerate @item direct boot by specifying fields @code{linux}, @code{linux-arguments} and @code{linux-modules}, @item multiboot by specifying fields @code{multiboot-kernel}, @code{multiboot-arguments} and @code{multiboot-modules}, @item chain-loader by specifying field @code{chain-loader}. @end enumerate
es: Por favor elija uno de: @enumerate @item arranque directo por medio de especificar campos @code{linux}, @code{linux-arguments} y @code{linux-modules}, @item multi-arranque especificando campos @code{multiboot-kernel}, @code{multiboot-arguments} y @code{multiboot-modules}, @item chain-loader por campo despecificando @code{chain-loader}. @end enumerate
it: Scegli solo uno tra: @enumerate @item avvio diretto specificando i campi @code{linux}, @code{linux-arguments} e @code{linux-modules}, @item multiboot specificando i campi @code{multiboot-kernel}, @code{multiboot-arguments} e @code{multiboot-modules}, @item chain-loader specificando il campo @code{chain-loader}. @end enumerate
zh_cn: 请选择以下之一： @enumerate @item 通过指定字段 @code{linux}、@code{linux-arguments} 和 @code{linux-modules} 直接启动， @item 通过指定字段 @code{multiboot-kernel}、@code{multiboot-arguments} 和 @code{multiboot-modules} 多重启动， @item 通过指定字段 @code{chain-loader} 链式加载器。 @end enumerate

source: the 'target' field is deprecated, please use 'targets' instead~%
es: el campo 'target' está obsoleto, utilice en su lugar 'targets'.~%
it: il campo 'target' è deprecato, usa 'targets' al suo posto~%

source: ~a: no such bootloader~%
es: ~a: no hay tal cargador de arranque~%
it: ~a: bootloader non esistente~%
zh_cn: 找不到引导器：~a~%

source: Given swap priority ~a is negative, defaulting to 0.~%
es: Dada la prioridad de intercambio ~a es negativa, por defecto a 0.~%
it: Data la priorità di swap ~a è negativa, il valore predefinito è 0.~%
zh_cn: 给定的交换优先级 ~a 为负，默认为 0。~%

source: Limiting swap priority ~a to ~a.~%
es: Limitando prioridad de intercambio ~a a ~a. ~%
it: Limitazione della priorità di swap ~a a ~a.~%
zh_cn: 限制交换优先级 ~a 到 ~a。~%

source: ~a: compressor not found~%
es: ~a: compresor no encontrado~%
it: ~a: compressore non trovato~%
zh_cn: ~a: 找不到对应压缩器~%

source: could not find available substitutes at ~a~%
es: no se pudo encontrar sustitutos disponibles en ~a~%
it: impossibile trovare sostituti disponibili in ~a~%
zh_cn: 没有在 ~a 中找到可用替代品~%

source: unsupported CVE format: '~a'
es: formato CVE no soportado: '~a'
it: formato CVE non supportato: '~a'
zh_cn: 不支持的 CVE 格式：'~a'

source: unsupported CVE data version: '~a'
es: versión de datos CVE no soportado: '~a'
it: versione dei dati CVE non supportata: '~a'
zh_cn: 不支持的 CVE 数据版本：'~a'

source: warning:
es: aviso:
it: avviso:
zh_cn: 警告：

source: error:
it: errore:
zh_cn: 错误：

source: <unknown location>
es: <ubicación desconocida>
it: <posizione sconosciuta>

source: format string got ~a arguments, expected ~a~%
es: el formato de cadena obtuvo ~a argumentos, se esperaban ~a~%
it: la stringa di formato ha ricevuto ~a argomenti, ne attende ~a~%
zh_cn: 格式字符串应得 ~1@*~a 个参数，实得 ~0@*~a 个参数~%

source: file '~a' not found on load path
es: archivo '~a' no encontrado en la ruta de carga
it: file '~a' non trovato nel percorso di caricamento
zh_cn: 加载目录中找不到文件 '~a'

source: cannot access `~a': ~a~%
es: no se puede acceder a «~a»: ~a~%
it: impossibile accedere a `~a': ~a~%
zh_cn: 无法访问 `~a': ~a~%

source: commit ~a lacks a signature
es: ~a enviado carece de firma
it: il commit ~a non ha una firma
zh_cn: 提交 ~a 缺少签名

source: commit ~a has a ~a signature, which is not permitted
es: ~a enviado tiene una firma ~a que no está permitida
it: il commit ~a ha una firma ~a, che non è consentita
zh_cn: 提交 ~a 的签名 ~a 不合规

source: signature verification failed for commit ~a
es: falló la verificación de firma para el envío ~a
it: verifica della firma fallita per il commit ~a
zh_cn: 提交 ~a 的签名验证失败

source: could not authenticate commit ~a: key ~a is missing
es: no se podría autenticar el envío ~a: la clave ~a está desaparecida
it: impossibile autenticare il commit ~a: manca la chiave ~a
zh_cn: 无法认证提交 ~a：缺少密钥 ~a

source: commit ~a attempts to remove '.guix-authorizations' file
es: el envío ~a intenta quitar el archivo '.guix-authorizations'
it: il commit ~a tenta di rimuovere il file '.guix-authorizations'
zh_cn: 提交 ~a 试图移除 '.guix-authorizations' 文件

source: commit ~a not signed by an authorized key: ~a
es: el envío ~a no está firmado por una clave autorizada: ~a
it: il commit ~a non è firmato da una chiave autorizzata: ~a
zh_cn: 提交 ~a 未由授权密钥签名：~a

source: malformed ASCII-armored key in ~a (blob ~a)
it: chiave ASCII-armored non valida in ~a (blob ~a)
zh_cn: ~a (blob ~a) 中的 ASCII 形式密钥格式有误

source: initial commit ~a is signed by '~a' instead of '~a'
es: el envío inicial ~a está firmado por '~a' en lugar de '~a'
it: il commit iniziale ~a è firmato da '~a' invece che da '~a'
zh_cn: 初始提交 ~a 由 '~a' 签名，而非 '~a'

source: commit ~a is not a descendant of introductory commit ~a
es: commit ~a no es descendiente de commit introductorio ~a
it: il commit ~a non è discendente del commit di introduzione ~a
zh_cn: 提交 ~a 不是介绍性提交 ~a 的后继

source: cannot use interactive policy without TTY input
es: no se pudo utilizar normativa interactiva sin entrada TTY
it: non è possibile utilizzare la politica interattiva senza input TTY
zh_cn: 无法在无 TTY 输入的情况下使用交互策略

source: invalid key-download policy: ~a
es: normativa clave-descarga no válida: ~a
it: politica di download della chiave non valida: ~a

source: Would you like to add this key to keyring '~a'?~%
es: ¿Le gustaría añadir está clave al anillo '~a'?~%
it: Si desidera aggiungere questa chiave al portachiavi '~a'?~%
zh_cn: 您想将此密钥添加到密钥环 '~a' 吗？~%

source: ~a: unknown graph backend
es: ~a: backend grafo desconocido
it: ~a: backend per grafi sconosciuto
zh_cn: ~a：未知绘图后端

source: incorrect call to ‘modify-phases’
es: llamada incorrecta a ‘modify-phases’
it: chiamata a ‘modify-phases’ non corretta
zh_cn: 对‘modify-phases’的调用不正确

source: invalid phase clause
es: cláusula de fase no válida
it: clausola phase non valida
zh_cn: 无效阶段子句

source: name should be longer than a single character
es: el nombre debería ser mayor de un único carácter
it: il nome deve essere più lungo di un carattere
zh_cn: 名称应长于单个字符

source: name should use hyphens instead of underscores
es: el nombre debería contener guiones en lugar del guiones bajos
it: il nome deve usare trattini normali invece di trattini bassi
zh_cn: 名称中应使用连字符而非下划线

source: #:tests? must not be explicitly set to #t
es: #:tests? no debe estar establecido explícitamente a #t
it: #:tests? non deve essere impostato esplicitamente a #t
zh_cn: 不得显式设置 #:tests? 为 #t

source: '~0@*~a' should be set to '~1@*~a' instead of '~2@*~a'
es: '~0@*~a' sería fijado a '~1@*~a' en vez de '~2@*~a'
it: '~0@*~a' deve essere impostato a '~1@*~a' invece di '~2@*~a'
zh_cn: '~0@*~a' 应设置为 '~1@*~a'，而非 '~2@*~a'

source: description should not be empty
es: la descripción no debe estar vacía
it: la descrizione non deve essere vuota
zh_cn: 描述不应留空

source: Texinfo markup in description is invalid
es: el marcado Texinfo en la descripción no es válido
it: il markup Texinfo nella descrizione non è valido
zh_cn: 描述中的 Texinfo 标记无效

source: description should not contain ~ trademark sign '~a' at ~d
es: la descripción no debe contener ~ el símbolo '~a' de marca registrada en ~d
it: la descrizione non deve contenere ~ il simbolo di marchio registrato '~a' in ~d
zh_cn: 描述中不应包含 ~ 商标符号 '~a' 于 ~d 处

source: use @code or similar ornament instead of quotes
es: use @code u ornamentos similares en vez de comillas
it: usa @code o una decorazione simile al posto delle virgolette
zh_cn: 请使用 @code 或类似装饰代替引号

source: description should start with an upper-case letter or digit
es: la descripción debe empezar con una letra mayúscula o un dígito
it: la descrizione deve iniziare con una lettera maiuscola o una cifra
zh_cn: 描述应以大写字母或数字开头

source: sentences in description should be followed ~ by two spaces; possible infraction~p at ~{~a~^, ~}
es: las oraciones en descripción deben separarse ~ con dos espacios; posible infracción~p en ~{~a~^, ~}
it: le frasi nella descrizione devono essere seguite ~ da due spazi; possibile infrazione~p in ~{~a~^, ~}
zh_cn: 描述中的句子后应跟随 ~ 两个空格；可能的违规~p 于 ~{~a~^, ~}

source: description contains leading whitespace
es: la descripción contiene un espacio en blanco al inicio
it: la descrizione contiene spazi bianchi iniziali
zh_cn: 描述包含前导空白

source: description contains trailing whitespace
es: la descripción contiene espacios blancos finales
it: la descrizione contiene spazi bianchi finali
zh_cn: 描述包含尾随空白

source: invalid description: ~s
es: descripción no válida: ~s
it: descrizione non valida: ~s
zh_cn: 无效的描述：~s

source: '~a' should probably be a native input
es: probablemente '~a' debería ser una entrada nativa
it: '~a' probabilmente dovrebbe essere un input nativo
zh_cn: '~a' 可能应该是本地输入

source: '~a' should probably not be an input at all
es: probablemente '~a' no debería ser una entrada en absoluto
it: '~a' probabilmente non dovrebbe essere un input
zh_cn: '~a' 可能根本不应该是输入

source: '~a' should probably be switched for its minimal variant
it: '~a' andrebbe probabilmente cambiato con la sua variante minima
zh_cn: '~a' 可能应该改为其 -minimal 变体

source: label '~a' does not match package name '~a'
es: la etiqueta '~a' no coincide con el nombre del paquete '~a'
it: l'etichetta '~a' non corrisponde al nome pacchetto '~a'
zh_cn: 标签 '~a' 与包名 '~a' 不匹配

source: "bash-minimal" should be in 'inputs' when '~a' is used
es: "bash-minimal" deberia estar en 'inputs' cuando se usa '~a'
it: "bash-minimal" dovrebbe essere in 'inputs' quando viene usato '~a'
zh_cn: 使用 '~a' 时应在 'inputs' 中包含 "bash-minimal"

source: no period allowed at the end of the synopsis
es: no se permite un punto al final de la sinopsis
it: il punto non è consentito alla fine della sinossi
zh_cn: 摘要末尾不允许有句号

source: no article allowed at the beginning of the synopsis
es: no se permite un artículo al inicio de la sinopsis
it: non sono ammessi articoli all'inizio della sinossi
zh_cn: 摘要开头不允许有冠词

source: synopsis should be less than 80 characters long
es: la sinopsis debe tener menos de 80 caracteres
it: la sinossi deve essere inferiore a 80 caratteri
zh_cn: 简介应少于 80 个字符

source: synopsis should start with an upper-case letter or digit
es: la sinopsis debe empezar con una letra mayúscula o un dígito
it: la sinossi deve iniziare con una lettera o una cifra maiuscola
zh_cn: 简介应以大写字母或数字开头

source: synopsis should not start with the package name
es: la sinopsis no debe empezar con el nombre del paquete
it: la sinossi non deve iniziare con il nome del pacchetto
zh_cn: 简介不应以包名开头

source: Texinfo markup in synopsis is invalid
es: el marcado Texinfo de la sinopsis no es válido
it: il markup Texinfo nella sinossi non è valido
zh_cn: 简介中的 Texinfo 标记无效

source: synopsis contains trailing whitespace
es: la sinopsis contiene espacios blancos al final
it: la sinossi contiene spazi bianchi finali
zh_cn: 简介包含尾随空白

source: synopsis should not be empty
es: la sinopsis no debe estar vacía
it: la sinossi non deve essere vuota
zh_cn: 简介不能为空

source: invalid synopsis: ~s
es: sinopsis no válida: ~s
it: sinossi non valida: ~s

source: ~a: HTTP GET error for ~a: ~a (~s)~%
es: ~a: error HTTP GET para ~a: ~a (~s)~%
it: ~a: errore HTTP GET per ~a:~a (~s)~%
zh_cn: ~a：~a 的 HTTP GET 错误：~a (~s)~%

source: ~a: host lookup failure: ~a~%
es: ~a: fallo en la búsqueda de máquinas: ~a~%
it: ~a: errore di ricerca dell'host: ~a~%
zh_cn: ~a：主机查找失败：~a~%

source: ~a: TLS certificate error: ~a
es: ~a: error de certificado TLS: ~a
it: ~a: errore del certificato TLS: ~a
zh_cn: ~a：TLS 证书错误：~a

source: ~a: TLS error in '~a': ~a~%
es: ~a: error TLS en '~a': ~a~%
it: ~a: errore TLS in '~a': ~a~%

source: URI ~a returned suspiciously small file (~a bytes)
es: la URI ~a devolvió un archivo sospechosamente pequeño (~a bytes)
it: URI ~a ha restituito un file sospettosamente piccolo (~a byte)
zh_cn: URI ~a 返回了异常小的文件 (~a 字节)

source: permanent redirect from ~a to ~a
es: redirección permanente de ~a a ~a
it: reindirizzamento permanente da ~a a ~a
zh_cn: 从 ~a 到 ~a 的永久重定向

source: invalid permanent redirect from ~a
es: redirección permanente no válida de ~a
it: reindirizzamento permanente non valido da ~a

source: URI ~a not reachable: ~a (~s)
es: URI ~a no alcanzable: ~a (~s)
it: URI ~a non raggiungibile: ~a (~s)
zh_cn: URI ~a 无法访问：~a (~s)

source: URI ~a domain not found: ~a
es: dominio de URI ~a no encontrado: ~a
it: dominio di URI ~a non trovato: ~a
zh_cn: URI ~a 域名未找到：~a

source: URI ~a unreachable: ~a
es: URI ~a no alcanzable: ~a
it: URI ~a non raggiungibile: ~a
zh_cn: URI ~a 无法访问：~a

source: TLS certificate error: ~a
es: error en el certificado TLS: ~a
it: errore del certificato TLS: ~a
zh_cn: TLS 证书错误：~a

source: invalid value for home page
es: valor no válido en página Web del paquete
it: valore di homepage non valido
zh_cn: 无效主页

source: invalid home page URL: ~s
es: URL de la página Web del paquete no válida: ~s
it: URL della home page non valido: ~s
zh_cn: 无效的主页 URL：~s

source: file names of patches should start with the package name
es: los nombres de archivos de los parches deben empezar con el nombre del paquete
it: i nomi dei file delle patches devono iniziare con il nome del pacchetto
zh_cn: 补丁文件名应以包名开头

source: ~a: file name is too long, which may break 'make dist'
es: ~a: el nombre de archivo es demasiado largo, que puede romperse con 'make dist'
it: ~a: il nome del file è troppo lungo, il che potrebbe far fallire 'make dist'
zh_cn: ~a：文件名过长，可能导致 'make dist' 失败

source: ~a: empty patch
es: ~a: parche vacío
it: ~a: patch vuota
zh_cn: ~a：空补丁

source: ~a: patch lacks comment and upstream status
es: ~a: el parche carece de comentario y estado anterior
it: ~a: la patch manca di commenti e di stato upstream
zh_cn: ~a：补丁缺少注释和上游状态

source: proposed synopsis: ~s~%
es: sinopsis propuesta: ~s~%
it: sinossi proposta: ~s~%
zh_cn: 拟议的概要：~s~%

source: proposed description:~% "~a"~%
es: descripción propuesta:~% "~a"~%
it: descrizione proposta:~% "~a"~%
zh_cn: 建议的描述：~% "~a"~%

source: all the source URIs are unreachable:
es: ninguna URI de fuentes es alcanzable:
it: tutti gli URI di origine sono irraggiungibili:
zh_cn: 所有源 URI 均无法访问：

source: the source file name should contain the package name
es: el nombre de archivo de las fuentes debe contener el nombre del paquete
it: il nome del file sorgente deve contenere il nome del pacchetto
zh_cn: 源文件名应包含包名

source: the source URI should not be an autogenerated tarball
es: la URI de las fuentes no debe ser un archivador tar autogenerado
it: l'URI sorgente non deve essere un tarball autogenerato
zh_cn: 源 URI 不应为自动生成的 tar 包

source: URL should be '~a'
es: la URL debe ser '~a'
it: URL dovrebbe essere '~a'
zh_cn: URL 应为 '~a'

source: while accessing '~a'
es: mientras se accede '~a'
it: durante l'accesso a '~a'
zh_cn: 访问到 '~a'

source: the 'check' phase should respect #:tests?
es: la fase 'check' debería respetar #:tests?
it: la fase 'check' deve rispettare #:tests?
zh_cn: “check”阶段应遵守 #:tests?
