Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: unsupported argument field; bailing out~%
es: campo de argumento no soportado; rescatando~%
it: campo arguments non supportato; lascio perdere~%
zh_cn: 不支持的参数字段；正在退出~%

source: no definition location for package ~a~%
es: sin ubicación de definición para el paquete ~a~%
it: nessuna posizione della definizione per il pacchetto ~a~%
zh_cn: 包 ~a 没有定义位置~%

source: ~a: unknown styling~%
es: ~a: estilismo desconocido~%
it: ~a: styling sconosciuto~%

source: ~a: invalid input simplification policy~%
es: ~a: entrada de simplificación de política no válida~%
it: ~a: politica di semplificazione input non valida~%

source: Available styling rules:
es: Reglas de estilo disponibles:
it: Regole di stile disponibili:
zh_cn: 可用的样式规则：

source: - format: Format the given package definition(s)
es: - formato: el formato dado en la(s) definición(es) del paquete
it: - format: Formatta la definizione del pacchetto
zh_cn: - format: 格式化给定的包定义

source: - inputs: Rewrite package inputs to the “new style”
es: - inputs: reescribir las entradas del paquete al «estilo nuevo»
it: - inputs: Riscrive gli input del pacchetto nel “nuovo stile”
zh_cn: - inputs: 将包输入重写为“新样式”

source: - arguments: Rewrite package arguments to G-expressions
es: - arguments: Reescribir los argumentos de los paquetes en expresiones-G
it: - arguments: Riscrive gli argomenti del pacchetto usando espressioni-G
zh_cn: - arguments: 将包参数重写为 G 表达式

source: Usage: guix style [OPTION]... [PACKAGE]... Update package definitions to the latest style.
es: Modo de empleo: guix style [OPCIÓN]... [PAQUETE]... Actualiza las definiciones de paquete al último estilo.
it: Uso: guix style [OPZIONE]... [PACCHETTO]... Aggiorna le definizioni pacchetto all'ultimo stile.

source: -S, --styling=RULE apply RULE, a styling rule
es: -S, --styling=REGLA aplica REGLA, una regla de estilismo
it: -S, --styling=REGOLA applica la REGOLA di stile fornita
zh_cn: -S, --styling=RULE 应用 RULE，一条样式规则

source: -l, --list-stylings display the list of available style rules
es: -l, --list-stylings exhibe el listado de reglas de estilo disponibles
it: -l, --list-stylings mostra la lista delle regole di stile disponibili
zh_cn: -l, --list-stylings 显示可用样式规则列表

source: -n, --dry-run display files that would be edited but do nothing
es: -n, --dry-run muestra archivos que serían editados pero no hace nada
it: -n, --dry-run mostra i file che verrebbero modificati ma non fare nulla

source: --input-simplification=POLICY follow POLICY for package input simplification, one of 'silent', 'safe', or 'always'
es: --input-simplification=POLÍTICA sigue POLÍTICA para simplificación de entrada del paquete, una de 'silent', 'safe' o 'always'
it: --input-simplification=POLITICA segue POLITICA per la semplificazione degli input del pacchetto, una tra 'silent', 'safe', o 'always'
zh_cn: --input-simplification=POLICY 按 POLICY 进行包输入简化，取值为 'silent'、'safe' 或 'always'

source: -f, --whole-file format the entire contents of the given file(s)
es: -f, --whole-file formatea el contenido completo de los ficheros indicados
it: -f, --whole-file formatta l'intero contenuto del(i) file dato(i)
zh_cn: -f, --whole-file 格式化给定文件的全部内容

source: -A, --alphabetical-sort place the contents in alphabetical order as well
es: -A, --alphabetical-sort coloca el contenido también en orden alfabético
it: -A, --alphabetical-sort mette anche il contenuto in ordine alfabetico
zh_cn: -A, --alphabetical-sort 也按字母顺序排列内容

source: update the style of package definitions
es: actualiza el estilo de definiciones del paquete
it: aggiorna lo stile delle definizioni pacchetto
zh_cn: 更新软件包定义的样式

source: '--styling' option has no effect in whole-file mode~%
es: La opción '--styling' no tiene efecto en el modo de fichero completo~%
it: l'opzione '--styling' non ha effetto in modalità whole-file~%
zh_cn: '--styling' 选项在 whole-file 模式下无效~%

source: no files specified, nothing to do~%
es: no hay archivos especificados, nada que hacer~%
it: nessun file specificato, niente da fare~%
zh_cn: 未指定文件，无需操作~%

source: ;; Below is the list of packages that will show up in your ;; Home profile, under ~/.guix-home/profile.
es: ;; Abajo está la lista de paquetes que aparecerán en su ;; perfil de usuario, en ~/.guix-home/profile.
it: ;; Di seguito è riportato l'elenco dei pacchetti che verranno visualizzati nel tuo ;; profilo Home, in ~/.guix-home/profile.
zh_cn: ;; 以下是将显示在您的 ;; Home 配置文件 ~/.guix-home/profile 中的包列表。

source: ;; Below is the list of Home services. To search for available ;; services, run 'guix home search KEYWORD' in a terminal.
es: ;; Debajo está el listado de servicios personal. Para buscar los servicios ;; disponibles, ejecute 'guix home search PALABRA CLAVE' en un terminal.
it: ;; Di seguito è riportato l'elenco dei servizi Home. Per cercare i servizi ;; disponibili, eseguire 'guix home search PAROLACHIAVE' in un terminale.
zh_cn: ;; 以下是 Home 服务列表。要搜索可用服务， ;; 请在终端运行 'guix home search KEYWORD'。

source: ;; This "home-environment" file can be passed to 'guix home reconfigure' ;; to reproduce the content of your profile. This is "symbolic": it only ;; specifies package names. To reproduce the exact same profile, you also ;; need to capture the channels being used, as returned by "guix describe". ;; See the "Replicating Guix" section in the manual.
es: ;; Este archivo "home-environment" se puede pasar a 'guix home reconfigure' ;; para reproducir el contenido de su perfil. Esto es "simbólico": especifica ;; solo nombres de paquete. Para reproducir el mismo perfil exacto, también ;; necesita capturar los canales que están siendo usados, como son devueltos ;; por "guix describe". Consulte la sección "Replicación de Guix" en el manual.
it: ;; Questo file "home-environment" può essere passato a 'guix home reconfigure' ;; per riprodurre il contenuto del tuo profilo. È "simbolico": specifica ;; soltanto nomi pacchetto. Per riprodurre l'esatto identico profilo, devi ;; anche catturare i canali in uso, come ritornati eseguendo "guix describe". ;; Vedi la sezione "Replicating Guix" nel manuale.
zh_cn: ;; 此 "home-environment" 文件可传递给 'guix home reconfigure' ;; 以重现您的配置文件内容。这是“符号化”的：仅指定包名。 ;; 要重现完全相同的配置文件，还需要捕获所使用的频道， ;; 如 "guix describe" 返回的内容。详见手册中的“复制 Guix”部分。

source: Usage: guix home [OPTION ...] ACTION [ARG ...] [FILE] Build the home environment declared in FILE according to ACTION. Some ACTIONS support additional ARGS.
es: Modo de empleo: guix home [OPCIÓN ...] ACCIÓN [PARÁMETRO ...] [ARCHIVO] Construye el entorno personal declarado en ARCHIVO de acuerdo con ACCIÓN. Algunas ACCIONES permiten PARÁMETROS adicionales.
it: Uso: guix home [OPZIONE ...] AZIONE [ARG ...] [FILE] Crea l'ambiente home dichiarato in FILE secondo l'AZIONE. Alcune AZIONI supportano ARG aggiuntivi.
zh_cn: 用法：guix home [OPTION ...] ACTION [ARG ...] [FILE] 根据操作构建文件中声明的家环境。 某些操作支持额外参数。

source: search search for existing service types
es: search busca tipos de servicio existentes
it: search cerca fra i tipi di servizio esistenti
zh_cn: search 搜索现有的服务类型

source: edit edit the definition of an existing service type
es: edit edita la definición de un tipo de servicio existente
it: edit modifica la definizione di un tipo di servizio esistente
zh_cn: edit 编辑现有服务类型的定义

source: container run the home environment configuration in a container
es: container ejecuta la configuración del entorno personal en un contenedor
it: container esegue la configurazione dell'ambiente home in un contenitore
zh_cn: container 在容器中运行家环境配置

source: reconfigure switch to a new home environment configuration
es: reconfigure cambia a una nueva configuración de entorno home
it: reconfigure passa a una nuova configurazione dell'ambiente home
zh_cn: reconfigure 切换到新的家环境配置

source: roll-back switch to the previous home environment configuration
es: roll-back cambia a la configuración previa del entorno home
it: roll-back ripristina la configurazione precedente dell'ambiente home
zh_cn: roll-back 切换到之前的家环境配置

source: describe describe the current home environment
es: describe describe el entorno home actual
it: describe descrivi l'ambiente home corrente
zh_cn: describe 描述当前的家环境

source: list-generations list the home environment generations
es: list-generations lista las generaciones de entorno home
it: list-generations elenca le generazioni dell'ambiente home
zh_cn: list-generations 列出家环境的生成

source: switch-generation switch to an existing home environment configuration
es: switch-generation conmuta a una configuración de entorno home existente
it: switch-generation passa a una configurazione esistente dell'ambiente home
zh_cn: switch-generation 切换当前的家环境配置

source: delete-generations delete old home environment generations
es: delete-generations borra generaciones antiguas del entorno home
it: delete-generations elimina le vecchie generazioni dell'ambiente home
zh_cn: delete-generations 删除旧的家环境生成

source: build build the home environment without installing anything
es: build construye el entorno home sin instalar nada
it: build crea l'ambiente home senza installare nulla
zh_cn: build 构建家环境但不安装任何东西

source: import generates a home environment definition from dotfiles
es: import genera una definición de entorno home desde archivos de puntos
it: import genera una definizione dell'ambiente home dai dotfile
zh_cn: import 从点文件生成家环境定义

source: extension-graph emit the service extension graph
es: extension-graph emite el grafo de extensiones de servicios
it: extension-graph produce il grafo delle estensioni servizi
zh_cn: extension-graph 输出服务扩展图

source: shepherd-graph emit the graph of shepherd services
es: shepherd-graph emite el grafo de servicios de shepherd
it: shepherd-graph emette il grafo dei servizi shepherd
zh_cn: shepherd-graph 输出 shepherd 服务的图

source: -e, --expression=EXPR consider the home-environment EXPR evaluates to instead of reading FILE, when applicable
es: -e, --expression=EXPR considera evaluar EXPR del entorno home en lugar de leer ARCHIVO cuando es aplicable
it: -e, --expression=EXPR considera l'ambiente home a cui EXPR valuta invece di leggere FILE, quando applicabile
zh_cn: -e, --expression=EXPR 考虑家环境 EXPR 的计算结果 而不是读取文件，当适用时

source: -I, --list-installed[=REGEXP] for 'describe' or 'list-generations', list installed packages matching REGEXP
es: -I, --list-installed[=EXPREG] para 'describe' o 'list-generations', enumera paquetes instalados que coinciden con EXPREG
it: -I, --list-installed[=REGEXP] per 'describe' o 'list-generations', elenca i pacchetti installati che corrispondono a REGEXP
zh_cn: -I, --list-installed[=REGEXP] 对于“描述”或“列出生成”，列出匹配 REGEXP 的已安装包

source: '~a' does not contain a home environment for user '~a'~%
es: '~a' no contiene un entorno personal para el usuario '~a'~%
it: '~a' non contiene un ambiente home per l'utente '~a'~%

source: '~a' does not return a home environment~%
es: '~a' no devuelve un entorno home~%
it: '~a' non restituisce un ambiente home~%
zh_cn: '~a' 不返回家环境~%

source: '~a' populated with all the Home configuration files~%
es: '~a' poblado con todos los archivos de configuración Home~%
it: '~a' popolato con tutti i file di configurazione Home~%
zh_cn: '~a' 填充了所有家配置文件~%

source: Run @command{guix home reconfigure ~a/home-configuration.scm} to effectively deploy the home environment described by these files.
es: Ejecuta @command{guix home reconfigure ~a/home-configuration.scm} para desplegar efectivamente el entorno personal descrito por esos archivos.
it: Esegui @command{guix home reconfigure ~a/home-configuration.scm} per dispiegare a tutti gli effetti gli ambienti home descritti in questi file.
zh_cn: 运行 @command{guix home reconfigure ~a/home-configuration.scm} 以有效地 部署由这些文件描述的家环境。

source: no home environment generation, nothing to describe~%
es: ninguna generación del entorno home, nada que describir~%
it: nessuna generazione per l'ambiente home, niente da descrivere~%
zh_cn: 没有家环境生成，无内容可描述~%

source: build and deploy home environments
es: construir y desplegar entornos personal
it: costruisce e dispiega ambienti home
zh_cn: 构建并部署家环境

source: guix home: missing command name~%
es: guix home: falta el nombre del comando~%
it: guix home: nome comando mancante~%
zh_cn: guix home：缺少命令名称~%

source: Try 'guix home --help' for more information.~%
es: Pruebe 'guix home --help' para más información.~%
it: Prova 'guix home --help' per maggiori informazioni.~%

source: ~a: extraneous command~%
es: ~a: instrucción extraña~%
it: ~a: comando estraneo~%

source: cannot switch to home environment generation '~a'~%
es: no se pudo conmutar a la generación del entorno home'~a'~%
it: impossibile passare alla generazione dell'ambiente home '~a'~%

source: Usage: guix time-machine [OPTION] [-- COMMAND ARGS...] Execute COMMAND ARGS... in an older version of Guix. If COMMAND is not provided, print path to the time-machine profile.
es: Modo de empleo: guix time-machine [OPCIÓN] [-- COMANDO ARGUMENTOS...] Ejecuta COMANDO ARGUMENTOS... en una versión más antigua de Guix. Si COMANDO no se proporciona, declara ruta para el perfil de tiempo-máquina.
it: Uso: guix time-machine [OPZIONE] [-- COMANDO ARGOMENTI...] Esegue COMANDO ARGOMENTI... in una versione precedente di Guix. Se COMANDO non è fornito, stampa il percorso del profilo time-machine.
zh_cn: 用法：guix time-machine [OPTION] [-- COMMAND ARGS...] 在旧版本的 Guix 中执行命令参数。 如果未提供命令，则打印 time-machine 配置文件的路径。

source: --url=URL use the Git repository at URL
es: --url=URL descarga del repositorio Git en URL
it: --url=URL usa il repository Git all'URL indicato
zh_cn: --url=URL 使用 URL 处的 Git 仓库

source: --commit=COMMIT use the specified COMMIT
es: --commit=COMETIDO utiliza el COMETIDO especificado
it: --commit=COMMIT usa il COMMIT specificato
zh_cn: --commit=COMMIT 使用指定的 COMMIT

source: --branch=BRANCH use the tip of the specified BRANCH
es: --branch=RAMA usa la punta de la RAMA especificada
it: --branch=RAMO usa la punta del RAMO specificato
zh_cn: --branch=BRANCH 使用指定 BRANCH 的最新提交

source: cannot travel past commit `~a' from May 1st, 2019
es: no se puede perpetrar viaje más allá de `~a' desde 1 de mayo de 2019
it: impossibile viaggiare oltre il commit `~a' del 1 Maggio 2019
zh_cn: 无法穿越 2019 年 5 月 1 日的提交`~a'

source: run commands from a different revision
es: ejecuta comandos desde una revisión diferente
it: esegue comandi partendo da un'altra revisione
zh_cn: 从不同的修订版本运行命令

source: file '~a' does not exist~%
it: il file '~a' non esiste~%

source: Usage: guix import IMPORTER ARGS ... Run IMPORTER with ARGS.
es: Modo de empleo: guix import IMPORTADOR PARÁMETROS ... Ejecuta IMPORTADOR con PARÁMETROS.
it: Uso: guix import IMPORTATORE ARGS ... Esegue IMPORTATORE con ARGS.
zh_cn: 用法：guix import IMPORTER ARGS ... 使用参数运行 IMPORTER。

source: IMPORTER must be one of the importers listed below:
es: IMPORTADOR debe ser uno de los importadores mostrados a continuación:
it: IMPORTATORE deve essere uno dei seguenti:
zh_cn: IMPORTER 必须是以下列出的导入器之一：

source: -i, --insert=FILE insert packages into FILE alphabetically
it: -i, --insert=FILE inserisce i pacchetti in FILE in ordine alfabetico

source: '~a' import failed~%
es: importador '~a' falló~%
it: importazione di '~a' fallita~%
zh_cn: '~a' 导入失败~%

source: ~a: invalid importer~%
es: ~a: importador no válido~%
it: ~a: importatore non valido~%

source: import a package definition from an external repository
es: importación de definiciones de paquetes desde un repositorio externo
it: importa una definizione pacchetto da un repository esterno
zh_cn: 从外部仓库导入包定义

source: guix import: missing importer name~%
es: guix import: falta el nombre del importador~%
it: guix import: nome importatore mancante~%
zh_cn: guix import：缺少导入器名称~%

source: failed to download Git repository ~a: ~a~%
it: impossibile scaricare il repository Git ~a: ~a~%

source: This package lacks a description. Run "info '(guix) Synopses and Descriptions'" for more information.
es: A este paquete le falta una descripción. Ejecute "info '(guix.es) Sinopsis y descripciones'" para más información.
it: Questo pacchetto manca di una descrizione. Esegui "info '(guix) Synopses and Descriptions'" per maggiori informazioni.
zh_cn: 此包缺少描述。运行 "info '(guix) Synopses and Descriptions'" 获取更多信息。

source: This package lacks a synopsis. Run "info '(guix) Synopses and Descriptions'" for more information.
es: Este paquete carece de sinopsis. Ejecute "info '(guix.es) Sinopsis y descripciones'" para obtener más información.
it: Questo pacchetto manca di una sinossi. Esegui "info '(guix) Synopses and Descriptions'" per maggiori informazioni.
zh_cn: 此包缺少概要。运行 "info '(guix) Synopses and Descriptions'" 获取更多信息。

source: failed to parse ~a~%
es: no es capaz de interpretar ~a~%
it: analisi di ~a non riuscita~%

source: Updater for Composer packages
es: Actualizador para paquetes Composer
it: Aggiornatore per pacchetti Composer
zh_cn: Composer 包的更新器

source: Usage: guix import cpan PACKAGE-NAME Import and convert the CPAN package for PACKAGE-NAME.
es: Modo de empleo: guix import cpan NOMBRE-DE-PAQUETE Importa y convierte el paquete CPAN con NOMBRE-DE-PAQUETE.
it: Uso: guix import cpan NOME-PACCHETTO Importa e converte il pacchetto CPAN per NOME-PACCHETTO.
zh_cn: 用法：guix import cpan PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 CPAN 包。

source: -r, --recursive import missing packages recursively
es: -r, --recursive importa paquetes ausentes recursivamente
it: -r, --recursive importa i pacchetti mancanti ricorsivamente

source: failed to download meta-data for package '~a'~%
es: falló al descargar los metadatos para el paquete '~a'~%
it: impossibile scaricare metadati per il pacchetto '~a'~%
zh_cn: 下载包 '~a' 的元数据失败~%

source: too few arguments~%
es: muy pocos parámetros~%
it: troppo pochi argomenti~%
zh_cn: 太少参数~%

source: too many arguments~%
es: demasiados parámetros~%
it: troppi argomenti~%
zh_cn: 太多参数~%

source: ~a updater doesn't support updating to a specific version, sorry.
es: ~a actualizador no admite actualizar a una versión específica, lo siento.
it: L'aggiornatore ~a non permette la scelta di una versione specifica, mi dispiace.
zh_cn: ~a 更新器不支持更新到特定版本，抱歉。

source: input '~a' of ~a is in Perl core~%
es: entrada '~a' de ~a está en el núcleo Perl~%
it: input '~a' di ~a è in Perl core ~%
zh_cn: 输入 '~a' 的 ~a 是 Perl 核心~%

source: Updater for CPAN packages
es: Actualizador para paquetes CPAN
it: Aggiornatore dei pacchetti CPAN
zh_cn: CPAN 包的更新器

source: Usage: guix import cran PACKAGE-NAME Import and convert the CRAN package for PACKAGE-NAME.
es: Modo de empleo: guix import cran NOMBRE-PAQUETE Importa y convierte el paquete CRAN para NOMBRE-PAQUETE.
it: Uso: guix import cran NOME-PACCHETTO Importa e converti il pacchetto CRAN corrispondente a NOME-PACCHETTO.
zh_cn: 用法：guix import cran PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 CRAN 包。

source: -a, --archive=ARCHIVE specify the archive repository
es: -a, --archive=ARCHIVO especifica el repositorio de archivado
it: -a, --archive=ARCHIVIO specifica il repository dell'archivio
zh_cn: -a, --archive=ARCHIVE 指定归档仓库

source: -r, --recursive import packages recursively
es: -r, --recursive importa paquetes recursivamente
it: -r, --recursive importa pacchetti ricorsivamente
zh_cn: -r, --recursive 递归导入包

source: -s, --style=STYLE choose output style, either specification or variable
es: -s, --style=STYLE elige estilo de salida, bien especificación o variable
it: -s, --style=STILE scegli lo stile di output, con una specifica o una variabile
zh_cn: -s, --style=STYLE 选择输出样式，规格说明或变量

source: -p, --license-prefix=PREFIX add custom prefix to licenses
es: -p, --license-prefix=PREFIX añade prefijo personal para licencias
it: -p, --license-prefix=PREFISSO aggiunge un prefisso personalizzato alle licenze

source: failed to download description for package '~a'~%
es: no se pudo descargar la descripción para el paquete '~a'~%
it: impossibile scaricare la descrizione del pacchetto '~a'~%
zh_cn: 下载包 '~a' 的描述失败~%

source: failed to retrieve list of packages from ~a: ~a (~a)~%
es: fallo al recuperar la lista de paquetes desde ~a: ~a (~a)~%
it: impossibile recuperare la lista pacchetti da ~a: ~a (~a)~%

source: ~A: hg download failed~%
es: ~A: hg descarga fallida~%
it: ~A: download hg fallito~%

source: failed to retrieve package information from ~a: ~a (~a)~%
es: fallo al recuperar información del paquetes desde ~a: ~a (~a)~%
it: impossibile recuperare le informazioni pacchetto da ~a: ~a (~a)~%

source: ~a provides only the latest version of each package, sorry.
es: ~a solo proporciona la última versión de cada paquete, lo siento.
it: ~a fornisce solo l'ultima versione di ciascun pacchetto, mi dispiace.
zh_cn: ~a 仅提供每个包的最新版本，抱歉。

source: Updater for CRAN packages
es: Actualizador para paquetes CRAN
it: Aggiornatore dei pacchetti CRAN
zh_cn: CRAN 包的更新器

source: Updater for Bioconductor packages
es: Actualizador para paquetes Bioconductor
it: Aggiornatore dei pacchetti Bioconductor
zh_cn: Bioconductor 包的更新器

source: Usage: guix import crate PACKAGE-NAME Import and convert the crates.io package for PACKAGE-NAME.
es: Modo de empleo: guix import crate NOMBRE-DE-PAQUETE Importa y convierte el paquete crates.io con NOMBRE-DE-PAQUETE.
it: Uso: guix import crate NOME-PACCHETTO Importa e converte il pacchetto crates.io per NOME-PACCHETTO.
zh_cn: 用法：guix import crate PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 crates.io 包。

source: --allow-yanked allow importing yanked crates if no alternative satisfying the version requirement is found
es: --allow-yanked permite importar cajas retiradas si no alternativo satisface la versión requerida es encontrada
it: --allow-yanked permette l'importazione di crate ritirati (yanked) se non viene trovata nessuna alternativa che soddisfi il requisito di versione
zh_cn: --allow-yanked 如果找不到满足版本要求的替代品，允许导入被撤回的包

source: -f, --lockfile=FILE import dependencies from FILE, a 'Cargo.lock' file
it: -f, --lockfile=FILE importa le dipendenze da FILE, un file 'Cargo.lock'
zh_cn: -f, --lockfile=文件 从 <文件> 中导入依赖，<文件> 应为 'Cargo.lock' 文件

source: ~A: version ~a not found~%
es: ~A: versión ~a no encontrada~%
it: ~A: versione ~a non trovata~%

source: Updater for crates.io packages
es: Actualizador para paquetes crates.io
it: Aggiornatore per pacchetti crates.io
zh_cn: crates.io 包的更新器

source: Usage: guix import egg PACKAGE-NAME Import and convert the egg package for PACKAGE-NAME.
es: Modo de empleo: guix import egg NOMBRE-DE-PAQUETE Importa y convierte el paquete egg con NOMBRE-DE-PAQUETE.
it: Uso: guix import egg NOME-PACCHETTO Importa e converte il pacchetto egg per NOME-PACCHETTO.
zh_cn: 用法：guix import egg PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 egg 包。

source: Updater for CHICKEN egg packages
es: Actualizador para paquetes huevo CHICKEN
it: Aggiornatore dei pacchetti egg CHICKEN
zh_cn: CHICKEN egg 包的更新器

source: error downloading Elm package registry from ~a
es: error descargando registro de paquete Elm desde ~a
it: errore durante il download del registro dei pacchetti Elm da ~a
zh_cn: 从 ~a 下载 Elm 包注册表时出错

source: Usage: guix import elpa PACKAGE-NAME Import the latest package named PACKAGE-NAME from an ELPA repository.
es: Modo de empleo: guix import elpa NOMBRE-DE-PAQUETE Importa el último paquete llamado NOMBRE-DE-PAQUETE de un repositorio ELPA.
it: Uso: guix import elpa NOME-PACCHETTO Importa l'ultimo pacchetto con NOME-PACCHETTO dal repository ELPA.
zh_cn: 用法：guix import elpa PACKAGE-NAME 从 ELPA 仓库导入名为 PACKAGE-NAME 的最新包。

source: -a, --archive=ARCHIVE specify the archive repository
es: -a, --archive=ARCHIVO especifica el repositorio de archivado
it: -a, --archive=ARCHIVIO specifica il repository dell'archivio
zh_cn: -a, --archive=ARCHIVE 指定归档仓库

source: -l, --list-archives list ELPA repositories supported by the importer
es: -l, --list-archives lista repositorios ELPA mantenidos por el importador
it: -l, --list-archives elenca i repository ELPA supportati dall'importatore
zh_cn: -l, --list-archives 列出导入工具支持的 ELPA 仓库
