Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: --show=PACKAGE show details about PACKAGE
es: --show=PAQUETE muestra los detalles de PAQUETE
it: --show=PACCHETTO mostra i dettagli del PACCHETTO
zh_cn: --show=PACKAGE 显示 PACKAGE 的详细信息

source: upgrade regexp '~a' looks like a command-line option~%
es: la expresión regular de actualización '~a' parece una opción de línea de ordenes~%
it: la regexp di aggiornamento '~a' assomiglia a un'opzione della riga di comando~%
zh_cn: 升级正则表达式 '~a' 看起来像一个命令行选项~%

source: is this intended?~%
es: ¿es lo que deseaba?~%
it: è questo l'intento?~%
zh_cn: 这是有意的吗？~%

source: ~a: unsupported kind of search path~%
es: ~a: tipo de ruta de búsqueda no implementado~%
it: ~a: tipo di percorso di ricerca non supportato~%
zh_cn: ~a: 不支持的搜索路径类型~%

source: cannot install non-package object: ~s~%
es: no se puede instalar el objeto ya que no es un paquete: ~s~%
it: impossibile installare l'oggetto non-pacchetto: ~s~%
zh_cn: 无法安装非软件包对象：~s~%

source: ~a~@[@~a~]: package not found~%
es: ~a~@[@~a~]: paquete no encontrado~%
it: ~a~@[@~a~]: pacchetto non trovato~%

source: cannot switch to generation '~a'~%
es: no se pudo pasar a la generación '~a'~%
it: non posso passare alla generazione '~a'~%
zh_cn: 无法切换到代 '~a'~%

source: nothing to do~%
es: nada que hacer~%
it: niente da fare~%
zh_cn: 没有要做的事情~%

source: manage packages and profiles
es: gestiona paquetes y perfiles
it: gestisce pacchetti e profili
zh_cn: 管理软件包和配置文件

source: Usage: guix install [OPTION] PACKAGES... Install the given PACKAGES. This is an alias for 'guix package -i'.
es: Modo de empleo: guix install [OPCIÓN] PAQUETES... Instala los PAQUETES proporcionados. Es un alias de 'guix package -i'.
it: Uso: guix install [OPZIONE] PACCHETTI... Installa i PACCHETTI indicati. È un alias di 'guix package -i'.

source: install packages
es: instala paquetes
it: installa pacchetti
zh_cn: 安装软件包

source: Usage: guix remove [OPTION] PACKAGES... Remove the given PACKAGES. This is an alias for 'guix package -r'.
es: Modo de empleo: guix remove [OPCIÓN] PAQUETES... Elimina los PAQUETES proporcionados. Es un alias de 'guix package -r'.
it: Uso: guix remove [OPZIONE] PACCHETTI... Rimuove i PACCHETTI indicati. È un alias di 'guix package -r'.

source: remove installed packages
es: elimina paquetes instalados
it: rimuove pacchetti installati
zh_cn: 移除已安装的软件包

source: Usage: guix upgrade [OPTION] [REGEXP] Upgrade packages that match REGEXP. This is an alias for 'guix package -u'.
es: Modo de empleo: guix upgrade [OPCIÓN] [REGEXP] Actualiza los paquetes que correspondan con REGEXP. Es un alias de 'guix package -u'.
it: Uso: guix upgrade [OPZIONE] [REGEXP] Aggiorna i pacchetti che corrispondono a REGEXP. È un alias di "guix package -u".
zh_cn: 用法：guix upgrade [OPTION] [REGEXP] 升级匹配 REGEXP 的软件包。 这是 'guix package -u' 的别名。

source: upgrade packages to their latest version
es: actualiza paquetes a su última versión
it: aggiorna i pacchetti alla loro ultima versione
zh_cn: 将软件包升级到最新版本

source: Usage: guix search [OPTION] REGEXPS... Search for packages matching REGEXPS.
es: Modo de empleo: guix search [OPCIÓN] REGEXPS... Busca paquetes que correspondan con REGEXPS.
it: Uso: guix search [OPZIONE] REGEXPS... Cerca i pacchetti che corrispondono alle date REGEXPS.
zh_cn: 用法：guix search [OPTION] REGEXPS... 搜索匹配 REGEXPS 的软件包。

source: This is an alias for 'guix package -s'.
es: Es un alias de 'guix package -s'.
it: È un alias di 'guix package -s'.
zh_cn: 这是 'guix package -s' 的别名。

source: search for packages
es: busca paquetes
it: cerca pacchetti
zh_cn: 搜索软件包

source: missing arguments: no regular expressions to search for~%
es: faltan parámetros: no hay expresiones regulares para la búsqueda~%
it: argomenti mancanti: nessuna espressione regolare da cercare~%
zh_cn: 缺少参数：没有要搜索的正则表达式~%

source: Usage: guix show [OPTION] PACKAGE... Show details about PACKAGE.
es: Modo de empleo: guix show [OPCIÓN]... PAQUETE... Muestra detalles acerca de PAQUETE.
it: Uso: guix show [OPZIONE] PACCHETTO... Mostra i dettagli del PACCHETTO.
zh_cn: 用法：guix size [选项]... 软件包 报告 <软件包> 及其依赖的大小。

source: This is an alias for 'guix package --show='.
es: Es un alias de 'guix package --show='.
it: È un alias di "guix package --show=".
zh_cn: 这是 'guix package --show=' 的别名。

source: show information about packages
es: muestra información sobre los paquetes
it: mostra informazioni sui pacchetti
zh_cn: 显示有关软件包的信息

source: missing arguments: no package to show~%
es: faltan parámetros: no hay paquetes para mostrar~%
it: argomenti mancanti: nessun pacchetto da mostrare~%
zh_cn: 缺少参数：没有要显示的软件包~%

source: Usage: guix gc [OPTION]... PATHS... Invoke the garbage collector.
es: Modo de empleo: guix gc [OPCIÓN]... RUTAS... Invoca la recolección de basura.
it: Uso: guix gc [OPZIONE]... PERCORSI... Invoca il garbage collector.
zh_cn: 用法：guix gc [OPTION]... PATHS... 调用垃圾收集器。

source: -C, --collect-garbage[=MIN] collect at least MIN bytes of garbage
es: -C, --collect-garbage[=MIN] recolecta al menos MIN bytes de basura
it: -C, --collect-garbage[=MIN] raccoglie almeno MIN bytes di spazzatura
zh_cn: -C, --collect-garbage[=MIN] 收集至少 MIN 字节的垃圾

source: -F, --free-space=FREE attempt to reach FREE available space in the store
es: -F, --free-space=LIBRE intenta alcanzar un espacio disponible LIBRE en el almacén
it: -F, --free-space=FREE cerca di raggiungere il valore di spazio libero dato nell'archivio
zh_cn: -F, --free-space=FREE 尝试达到存储区中 FREE 的可用空间

source: -d, --delete-generations[=PATTERN] delete profile generations matching PATTERN
es: -d, --delete-generations[=PATRÓN] borra las generaciones del perfil que correspondan con el PATRÓN
it: -d, --delete-generations[=PATTERN] elimina le generazioni che corrispondono a PATTERN
zh_cn: -d, --delete-generations[=PATTERN] 删除匹配 PATTERN 的配置代

source: -D, --delete attempt to delete PATHS
es: -D, --delete intenta borrar las RUTAS
it: -D, --delete tenta di cancellare i PERCORSI dati
zh_cn: -D, --delete 尝试删除 PATHS

source: --list-roots list the user's garbage collector roots
es: --list-roots enumera las raíces del recolector de basura del usuario
it: --list-roots elenca le radici del garbage collector dell'utente
zh_cn: --list-roots 列出用户的垃圾收集器根目录

source: --list-busy list store items used by running processes
es: --list-busy enumera elementos del almacén en uso por procesos en ejecución
it: --list-busy elenca gli oggetti dello store usati da processi in esecuzione
zh_cn: --list-busy 列出正在运行的进程使用的存储项

source: --optimize optimize the store by deduplicating identical files
es: --optimize optimiza el almacén mediante la deduplicación de archivos idénticos
it: --optimize ottimizza l'archivio deduplicando i file identici
zh_cn: --optimize 通过去重相同文件优化存储区

source: --list-dead list dead paths
es: --list-dead enumera las rutas muertas
it: --list-dead elenca i percorsi morti
zh_cn: --list-dead 列出死路径

source: --list-live list live paths
es: --list-live enumera las rutas vivas
it: --list-live elenca i percorsi vivi
zh_cn: --list-live 列出活路径

source: --references list the references of PATHS
es: --references enumera las referencias de las RUTAS
it: --references elenca i riferimenti dei PERCORSI
zh_cn: --references 列出 PATHS 的引用

source: -R, --requisites list the requisites of PATHS
es: -R, --requisites enumera los requisitos de las RUTAS
it: -R, --requisites elenca i requisiti dei PERCORSI
zh_cn: -R, --requisites 列出 PATHS 的依赖项

source: --referrers list the referrers of PATHS
es: --referrers enumera quienes hacen referencia a las RUTAS
it: --referrers elenca i referenti dei PERCORSI
zh_cn: --referrers 列出 PATHS 的引用者

source: --derivers list the derivers of PATHS
es: --derivers enumera quienes derivan de las RUTAS
it: --derivers elenca i derivatori dei PERCORSI

source: --verify[=OPTS] verify the integrity of the store; OPTS is a comma-separated combination of 'repair' and 'contents'
es: --verify[=OPTS] verifica la integridad del almacén; OPTS es una combinación separada por comas de 'repair' y 'contents'
it: --verify[=OPTS] verifica l'integrità dello store; OPTS è una combinazione separata da virgola di 'repair' e 'contents'
zh_cn: --verify[=OPTS] 验证存储区的完整性；OPTS 是由 'repair' 和 'contents' 逗号分隔的组合

source: --list-failures list cached build failures
es: --list-failures enumera las construcciones fallidas en caché
it: --list-failures elenca le build fallite conservate
zh_cn: --list-failures 列出缓存的构建失败

source: --clear-failures remove PATHS from the set of cached failures
es: --clear-failures elimina RUTAS del conjunto de fallos en caché
it: --clear-failures rimuovi PERCORSI dall'insieme dei fallimenti conservati
zh_cn: --clear-failures 从缓存的失败集中移除 PATHS

source: --vacuum-database repack the sqlite database tracking the store using less space
es: --vacuum-database re-empaquete la base de datos sqlite de seguimiento del almacén utilizando menos espacio
it: --vacuum-database fai un repack del database sqlite che traccia lo store usando meno spazio
zh_cn: --vacuum-database 重新打包用于跟踪存储的 sqlite 数据库 以减少空间占用

source: ~a: invalid '--verify' option~%
es: ~a: opción '--verify' no válida~%
it: ~a: opzione ‘--verify’ non valida~%

source: invalid amount of storage: ~a~%
es: tamaño de almacenamiento no válido: ~a~%
it: quantità di memoria non valida: ~a~%
zh_cn: 无效的存储量：~a~%

source: '-d' as an alias for '--delete' is deprecated; use '-D'~%
es: '-d' como alias para '--delete' está obsoleto; use '-D'~%
it: ‘-d’ come alias per ‘--delete’ è deprecato; usa ‘-D’~%
zh_cn: '-d' 作为 '--delete' 的别名已弃用；请使用 '-D'~%

source: ~s does not denote a duration~%
es: ~s no denota una duración~%
it: ~s non indica una durata~%
zh_cn: ~s 不表示持续时间~%

source: invoke the garbage collector
es: invoca el recolector de basura
it: invoca il garbage collector
zh_cn: 调用垃圾回收器

source: already ~a available on ~a, nothing to do~%
es: ya hay ~a disponibles en ~a, nada que hacer~%
it: già ~a disponibili su ~a, niente da fare~%
zh_cn: 在 ~1@*~a 上已可用 ~0@*~a，无需操作~%

source: freeing ~a~%
it: libero ~a~%

source: extraneous arguments: ~{~a ~}~%
es: parámetros no esperados: ~{~a ~}~%
it: argomenti estranei: ~{~a ~}~%
zh_cn: 冗余参数：~{~a ~}~%

source: freed ~a~%
it: liberati ~a~%

source: Usage: guix git COMMAND ARGS... Operate on Git repositories.
es: Modo de empleo: guix git ORDEN PARÁMETROS... Opera en repositorios de Git.
it: Uso: guix git COMMAND ARGS... Opera su repository Git.
zh_cn: 用法：guix git COMMAND ARGS... 操作 Git 仓库。

source: The valid values for ACTION are:
es: Los valores permitidos para ACCIÓN son:
it: I valori validi per ACTION sono:
zh_cn: ACTION 的有效值为：

source: authenticate verify commit signatures and authorizations
es: authenticate verifica firmas de revisión y autorizaciones
it: authenticate verifica le firme dei commit e le autorizzazioni
zh_cn: authenticate 验证提交签名和授权

source: operate on Git repositories
es: operaciones sobre repositorios Git
it: opera su repository Git
zh_cn: 操作 Git 仓库

source: guix git: missing sub-command~%
es: guix git: falta la orden~%
it: guix git: sotto-comando mancante~%
zh_cn: guix git：缺少子命令~%

source: guix git: invalid sub-command~%
es: guix git: orden no válida~%
it: guix git: sotto-comando non valido~%
zh_cn: guix git：无效的子命令~%

source: unknown introductory commit and signer~%
es: desconoce introducción de commit y signer~%
it: commit di introduzione e autore firma sconosciuti~%
zh_cn: 未知的介绍提交和签名者~%

source: introduction and keyring recorded in repository configuration file~%
es: introducción y anillo registrado en el archivo de configuración del repositorio~%
it: introduzione e portachiavi registrati nel file di configurazione del repository~%
zh_cn: 介绍和密钥环已记录在仓库配置文件中~%

source: not overriding pre-existing hooks '~a' and '~a'~%
es: no sobrescribir puntos de enganche pre-existentes '~a' y '~a'~%
it: non salto gli hook preesistenti '~a' e '~a'~%
zh_cn: 不覆盖已存在的钩子 '~a' 和 '~a'~%

source: Consider running @command{guix git authenticate} from your pre-push and post-merge hooks so your repository is automatically authenticated before you push and when you pull updates.
es: Considera ejecutar @command{guix git authenticate} desde sus puntos de enganche pre-push y post-merge tal que su repositorio esté autenticado automáticamente antes de envíe y cuando obtenga actualizaciones.
it: Si consiglia di eseguire @command{guix git authenticate} dai vostri hook pre-push e post-merge in modo che il repository venga automaticamente autenticato prima del push e quando si effettua il pull degli aggiornamenti.
zh_cn: 请考虑在您的 pre-push 和 post-merge 钩子中运行 @command{guix git authenticate}， 以便在推送前和拉取更新时自动验证您的仓库。

source: installed hooks '~a' and '~a'~%
es: instalado puntos de enganche '~a' y '~a'~%
it: installati gli hook '~a' e '~a'~%

source: upgrading hook '~a'~%
es: actualizando el hook '~a'~%
it: aggiornamento hook '~a'~%

source: Signing statistics:~%
es: Estadísticas de firmas:~%
it: Statistiche sulle firme:~%
zh_cn: 签名统计：~%

source: Usage: guix git authenticate COMMIT SIGNER [OPTIONS...] Authenticate the given Git checkout using COMMIT/SIGNER as its introduction.
es: Modo de empleo: guix git authenticate REVISIÓN FIRMA [OPCIONES...] Identifica la revisión de Git proporcionada usando REVISIÓN/FIRMA como su presentación.
it: Uso: guix git authenticate COMMIT SIGNER [OPZIONI...] Autentica il checkout Git fornito usando COMMIT/SIGNER come introduzione.
zh_cn: 用法：guix git authenticate COMMIT SIGNER [OPTIONS...] 使用 COMMIT/SIGNER 作为介绍验证给定的 Git 签出。

source: -r, --repository=DIRECTORY open the Git repository at DIRECTORY
es: -r, --repository=DIRECTORIO abre el repositorio Git en DIRECTORIO
it: -r, --repository=DIRECTORY apre il repository Git in DIRECTORY

source: -k, --keyring=REFERENCE load keyring from REFERENCE, a Git branch
es: -k, --keyring=REFERENCIA carga el anillo de claves de REFERENCIA, una rama de Git
it: -k, --keyring=RIFERIMENTO carica il portachiavi da RIFERIMENTO, un branch Git
zh_cn: -k, --keyring=REFERENCE 从 REFERENCE（Git 分支）加载密钥环

source: --end=COMMIT authenticate revisions up to COMMIT
es: --end=COMMIT autentica revisiones hasta el COMMIT
it: --end=COMMIT autentica tutte le revisioni fino a COMMIT
zh_cn: --end=COMMIT 验证直到 COMMIT 的修订版本

source: --stats display commit signing statistics upon completion
es: --stats muestra estadísticas de revisiones tras finalizar
it: --stats mostra le statistiche sulle firme dei commit al termine
zh_cn: --stats 完成后显示提交签名统计

source: --cache-key=KEY cache authenticated commits under KEY
es: --cache-key=CLAVE almacena en caché las confirmaciones autenticadas por CLAVE
it: --cache-key=CHIAVE conserva i commit autenticati con questa CHIAVE
zh_cn: --cache-key=KEY 在 KEY 下缓存已验证的提交

source: --historical-authorizations=FILE read historical authorizations from FILE
es: --historical-authorizations=ARCHIVO lee el histórico de autorizaciones de ARCHIVO
it: --historical-authorizations=FILE legge le autorizzazioni storiche da FILE

source: ~a: invalid OpenPGP fingerprint~%
es: ~a: huella OpenPGP no válida~%
it: ~a: impronta OpenPGP non valida~%

source: ~a: wrong length for OpenPGP fingerprint~%
es: ~a: longitud incorrecta para huella OpenPGP~%
it: ~a: lunghezza errata per un'impronta OpenPGP~%
zh_cn: ~a：OpenPGP 指纹长度错误~%

source: Authenticating commits ~a to ~a (~h new commits)...~%
es: Verificando revisiones de ~a a ~a (~h nuevas revisiones)...~%
it: Autentico i commit da ~a a ~a (~h nuovi commit)...~%
zh_cn: 正在验证提交 ~a 到 ~a (~h 个新提交)...~%

source: wrong number of arguments; expected COMMIT and SIGNER~%
es: número de parámetros incorrecto; se esperaba REVISIÓN y FIRMA~%
it: numero di argomenti sbagliato; attesi COMMIT e SIGNER~%
zh_cn: 参数数量错误；预期为 COMMIT 和 SIGNER~%

source: current branch '~a' is the keyring branch; doing nothing~%
es: rama actual '~a' es la rama del anillo; no hace nada~%
it: il ramo corrente '~a' è il ramo del portachiavi; non fa nulla~%
zh_cn: 当前分支 '~a' 是密钥环分支；不执行任何操作~%

source: successfully authenticated commit ~a~%
es: efectuado autenticado correctamente de revisión ~a~%
it: autenticazione del commit ~a riuscita~%

source: Usage: guix hash [OPTION] FILE Return the cryptographic hash of FILE.
es: Modo de empleo: guix hash [OPCIÓN] ARCHIVO Devuelve el hash criptográfico de ARCHIVO.
it: Uso: guix hash [OPZIONE] FILE Restituisce l'hash crittografico di FILE.
zh_cn: 用法：guix hash [OPTION] FILE 返回 FILE 的加密哈希。

source: -x, --exclude-vcs exclude version control directories
es: -x, --exclude-vcs excluye directorios de control de versiones
it: -x, --exclude-vcs esclude le directory di controllo versione
zh_cn: -x, --exclude-vcs 排除版本控制目录

source: -S, --serializer=TYPE compute the hash on FILE according to TYPE serialization
es: -S, --serializer=TIPO calcula el hash sobre ARCHIVO de acuerdo a la serialización TIPO
it: -S, --serializer=TIPO calcola l'hash di FILE secondo la serializzazione TIPO
zh_cn: -S, --serializer=TYPE 根据 TYPE 序列化计算 FILE 的哈希

source: '--recursive' is deprecated, use '--serializer=nar' instead~%
es: '--recursive' está obsoleto, use en su lugar '--serializer=nar'~%
it: '--recursive' è deprecato, usa invece '--serializer=nar'~%

source: unsupported serializer type: ~a~%
es: tipo de serializador no soportado: ~a~%
it: tipo di serializzatore non supportato: ~a~%
zh_cn: 不支持的序列化类型：~a~%

source: compute the cryptographic hash of a file
es: cálculo del hash criptográfico de un archivo
it: calcola l'hash crittografico di un file
zh_cn: 计算文件的加密哈希

source: no arguments specified~%
es: no hay argumentos especificados~%
it: nessun argomento specificato~%

source: Usage: guix pull [OPTION]... Download and deploy the latest version of Guix.
es: Modo de empleo: guix pull [OPCIÓN]... Descarga y despliega la última versión de Guix.
it: Uso: guix pull [OPZIONE]... Scarica e dispiega l'ultima versione di Guix.
zh_cn: 用法：guix pull [OPTION]... 下载并部署最新版本的 Guix。

source: -C, --channels=FILE deploy the channels defined in FILE
es: -C, --channels=ARCHIVO despliega los canales definidos en ARCHIVO
it: -C, --channels=FILE dispiega i canali definiti in FILE
zh_cn: -C, --channels=FILE 部署 FILE 中定义的渠道

source: -q, --no-channel-files inhibit loading of user and system 'channels.scm'
es: -q, --no-channel-files inhibe la carga de usuario y sistema 'channels.scm'
it: -q, --no-channel-files inibisce il caricamento dei file 'channels.scm' utente e sistema
zh_cn: -q, --no-channel-files 阻止加载用户与系统的 'channels.scm' 文件

source: --url=URL download "guix" channel from the Git repository at URL
es: --url=URL descarga el canal "guix" desde el repositorio Git en URL
it: --url=URL scarica il canale "guix" dal repository Git all'indirizzo URL

source: --commit=COMMIT download the specified "guix" channel COMMIT
es: --commit=COMMIT descarga el canal "guix" especificado COMMIT
it: --commit=COMMIT scarica il COMMIT specificato del canale "guix"
zh_cn: --commit=COMMIT 下载指定的“guix”频道 COMMIT

source: --branch=BRANCH download the tip of the specified "guix" channel BRANCH
es: --branch=RAMA descarga la sugerencia del canal "guix" especificado BRANCH
it: --branch=BRANCH scarica la punta del BRANCH specificato del canale "guix"
zh_cn: --branch=BRANCH 下载指定的“guix”频道 BRANCH 的最新版本

source: --allow-downgrades allow downgrades to earlier channel revisions
es: --allow-downgrades permite la vuelta a revisiones del canal previas
it: --allow-downgrades permette di tornare a revisioni precedenti del canale
zh_cn: --allow-downgrades 允许降级到更早的频道修订版本

source: --disable-authentication disable channel authentication
es: --disable-authentication desactiva la verificación de canales
it: --disable-authentication disabilita l'autenticazione del canale
zh_cn: --disable-authentication 禁用频道认证

source: --no-check-certificate do not validate the certificate of HTTPS servers
es: --no-check-certificate no valida el certificado de los servidores HTTPS
it: --no-check-certificate non convalidare il certificato dei server HTTPS

source: -N, --news display news compared to the previous generation
es: -N, --news muestra novedades con respecto a la generación previa
it: -N, --news mostra le notizie rispetto alla generazione precedente
zh_cn: -N, --news 显示自上一代以来的新闻

source: --details show details when listing generations
es: --detalles muestra los detalles cuando lista las generaciones
it: --details mostra i dettagli quando elenca le generazioni
zh_cn: --details 列出代时显示详细信息

source: -p, --profile=PROFILE use PROFILE instead of ~/.config/guix/current
es: -p, --profile=PERFIL usa PERFIL en vez de ~/.config/guix/current
it: -p, --profile=PROFILO usa PROFILO invece di ~/.config/guix/current
zh_cn: -p, --profile=PROFILE 使用 PROFILE 替代 ~/.config/guix/current

source: --bootstrap use the bootstrap Guile to build the new Guix
es: --bootstrap usa la oreja Guile para construir la nueva versión de Guix
it: --bootstrap usa il Guile di bootstrap per costruire il nuovo Guix
zh_cn: --bootstrap 使用引导 Guile 构建新的 Guix

source: rolling back channel '~a' from ~a to ~a~%
es: en el canal '~a': volviendo desde ~a a ~a~%
it: riporto il canale '~a' da ~a a ~a~%
zh_cn: 正在将频道 '~a' 从 ~a 回滚到 ~a~%

source: moving channel '~a' from ~a to unrelated commit ~a~%
es: moviendo el canal '~a' desde ~a al commit ~a sin relación~%
it: muovo il canale '~a' da ~a al commit non collegato ~a~%
zh_cn: 正在将频道 '~a' 从 ~a 移动到无关的提交 ~a~%

source: New in this revision:
es: Nuevo en esta revisión:
it: Novità di questa revisione:
zh_cn: 此修订版本中的新增内容：

source: ~a at ~a~%
es: ~a desde ~a~%
it: ~a a ~a~%
zh_cn: ~a 于 ~a~%

source: News for channel '~a'~%
es: Noticias para el canal '~a'~%
it: Notizie per il canale '~a'~%
zh_cn: 频道 '~a' 的新闻~%

source: ~a new channel:~%
es: ~a canal nuevo:~%
it: ~a nuovo canale:~%
zh_cn: ~a 新频道：~%

source: ~a channel removed:~%
es: ~a canal eliminado:~%
it: ~a canale rimosso:~%
zh_cn: ~a 频道已移除：~%

source: no channel news since generation ~a~%
es: sin novedades de canal desde generación ~a~%
it: nessuna notizia sul canale dalla generazione ~a~%

source: Run @command{guix pull -l} to view the news for earlier generations.
es: Ejecute @command{guix pull -l} para ver los nuevos para generaciones más anteriores.
it: Esegui @command{guix pull -l} per vedere le notizie di generazioni precedenti.
zh_cn: 运行 @command{guix pull -l} 查看早期代的新闻。

source: profile ~a does not have a previous generation~%
es: el perfil ~a no tiene una generación previa~%
it: il profilo ~a non ha una generazione precedente~%
zh_cn: 配置文件 ~a 没有之前的代~%

source: Run @command{guix pull --news} to read all the news.
es: Ejecute @command{guix pull --news} para leer todas las noticias.
it: Esegui @command{guix pull --news} per leggere tutte le notizie.
zh_cn: 运行 @command{guix pull --news} 阅读所有新闻。

source: After setting @code{PATH}, run @command{hash guix} to make sure your shell refers to @file{~a}.
es: Tras establecer el valor de @code{PATH}, ejecute @command{hash guix} para asegurarsede que su shell hace referencia a @file{~a}.
it: Dopo aver impostato @code{PATH}, esegui @command{hash guix} per assicurarti che la tua shell si riferisca a @file{~a}.
zh_cn: 设置 @code{PATH} 后，运行 @command{hash guix} 以确保您的 shell 指向 @file{~a}。

source: Migrating profile generations to '~a'...~%
es: Migrando las generaciones del perfil a '~a'...~%
it: Migro le generazioni profilo su '~a'...~%
zh_cn: 正在迁移配置文件代到 '~a'...~%

source: while creating symlink '~a': ~a~%
es: durante la creación del enlace simbólico '~a': ~a~%
it: durante la creazione del link simbolico '~a': ~a~%

source: ~h new package: ~a~%
es: ~h paquete nuevo: ~a~%
it: ~h nuovo pacchetto: ~a~%
zh_cn: ~h 新软件包： ~a~%

source: ~h package upgraded: ~a~%
es: ~h paquete actualizado: ~a~%
it: ~h pacchetto aggiornato: ~a~%
zh_cn: 更新了 ~h 个包：~a~%

source: '~a' did not return a list of channels~%
es: '~a' no ha devuelto una lista de canales~%
it: '~a' non ha restituito una lista di canali~%
zh_cn: '~a' 未返回频道列表~%
