Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: -h, --help display this help and exit
es: -h, --help muestra este mensaje de ayuda y termina
it: -h, --help mostra questo aiuto ed esce

source: -V, --version display version information and exit
es: -V, --version muestra información de la versión y termina
it: -V, --version mostra informazioni sulla versione ed esce

source: discover Guix related services using Avahi
es: descubrir servicios relacionados con Guix usando Avahi
it: scopre servizi relativi a Guix usando Avahi
zh_cn: 使用 Avahi 发现 Guix 相关服务

source: Avahi daemon is not running, cannot auto-discover substitutes servers.~%
es: El daemon Avahi no está corriendo, no puede autodescubrir servidores de sustituciones.~%
it: Il demone Avahi non è in esecuzione, non è possibile rilevare automaticamente i server sostitutivi.~%
zh_cn: Avahi 守护进程未运行，无法自动发现替代服务器。~%

source: an Avahi error was raised by `~a': ~a~%
es: se planteó un error de Avahi por `~a': ~a~%
it: è stato generato un errore Avahi da `~a': ~a~%

source: Usage: guix shell [OPTION] PACKAGES... [-- COMMAND...] Build an environment that includes PACKAGES and execute COMMAND or an interactive shell in that environment.
es: Modo de empleo: guix environment [OPCIÓN]... PAQUETES... [-- COMANDO...] Construye un entorno que incluye PAQUETES y ejecuta COMANDO o un shell interactivo en ese entorno.
it: Uso: guix shell [OPZIONE] PACCHETTI... [-- COMANDO...] Costruisce un ambiente che include PACCHETTI, e lancia un COMANDO o una shell interattiva in quell'ambiente.
zh_cn: 用法：guix shell [OPTION] PACKAGES... [-- COMMAND...] 构建包含软件包的环境并执行命令或在该环境中启动交互式 shell。

source: -D, --development include the development inputs of the next package
es: -D, --development incluye las dependencias de desarrollo del siguiente paquete
it: -D, --development include gli input di sviluppo del pacchetto seguente

source: -f, --file=FILE add to the environment the package FILE evaluates to
es: -f, --file=ARCHIVO añade al entorno el paquete resultante al evaluar el ARCHIVO
it: -f, --file=FILE aggiunge all'ambiente il pacchetto che risulta dalla valutazione di FILE
zh_cn: -f, --file=FILE 将求值 FILE 得到的包添加到环境中

source: -q inhibit loading of 'guix.scm' and 'manifest.scm'
es: -q inhibe la carga de 'guix.scm' y 'manifest.scm'
it: -q inibisce il caricamento di 'guix.scm' e 'manifest.scm'

source: --rebuild-cache rebuild cached environment, if any
es: --rebuild-cache reconstruye el entorno almacenado en caché, si lo hay
it: --rebuild-cache ricostruisce l'ambiente dalla cache, se esiste
zh_cn: --rebuild-cache 重建缓存的环境（如果有）

source: --export-manifest print a manifest for the given options
es: --export-manifest declara un manifiesto para las opciones dadas
it: --export-manifest stampa un manifesto per le opzioni date
zh_cn: --export-manifest 打印给定选项的清单

source: -F, --emulate-fhs for containers, emulate the Filesystem Hierarchy Standard (FHS)
es: -F, --emulate-fhs para contenedores, emula el Estándar de Jerarquía del Sistema de Archivos (FHS)
it: -F, --emulate-fhs per i contenitori, emula il Filesystem Hierarchy Standard (FHS)
zh_cn: -F, --emulate-fhs 对容器模拟文件系统层次结构标准（FHS）

source: ignoring invalid file name: '~a'~%
es: ignorando nombre de archivo no válido: '~a'~%
it: ignoro nome file non valido: '~a'~%
zh_cn: 忽略非法文件名：'~a'~%

source: no packages specified; creating an empty environment~%
es: no se especificó ningún paquete; creando un entorno vacío~%
it: nessun pacchetto specificato; creo un ambiente vuoto~%
zh_cn: 未指定软件包；正在创建一个空环境~%

source: loading environment from '~a'...~%
es: cargando entorno desde '~a'...~%
it: carico l'ambiente da '~a'...~%
zh_cn: 正在从 '~a' 加载环境变量…~%

source: not loading '~a' because not authorized to do so~%
es: no se carga '~a' porque no está autorizado para hacerlo~%
it: non carica '~a' perché non autorizzato a farlo~%
zh_cn: 未加载 '~a'，因为未被授权~%

source: To allow automatic loading of @file{~a} when running @command{guix shell}, you must explicitly authorize its directory, like so: @example echo ~a >> ~a @end example
es: Para permitir la carga automática de @file{~a} cuando ejecuta @command{guix shell}, debe autorizar explícitamente su directorio, al igual que: @example echo ~a >> ~a @end example
it: Per consentire il caricamento automatico di @file{~a} quando si esegue @command{guix shell}, è necessario autorizzare esplicitamente la sua directory, in questo modo: @example echo ~a >> ~a @end example
zh_cn: 要允许在运行 @command{guix shell} 时自动加载 @file{~a}，您必须明确授权其目录，如下所示： @example echo ~a >> ~a @end example

source: ;; What follows is a "manifest" equivalent to the command line you gave. ;; You can store it in a file that you may then pass to any 'guix' command ;; that accepts a '--manifest' (or '-m') option.
es: ;; Lo que sigue es un "manifest" equivalente a la línea de comando que ;; introdujo. Puede almacenarlo dentro de un archivo que pudiese pasar a ;; cualquier comando 'guix' que acepte una opción '--manifest' (o -m).
it: ;; Quel che segue è un "manifesto" equivalente al comando che hai dato. ;; Puoi salvarlo in un file e potrai poi passarlo a qualsiasi comando 'guix' ;; che accetta l'opzione '--manifest' (o '-m').
zh_cn: ;; 以下是与您提供的命令行等效的“清单”。 ;; 您可以将其存储在文件中，然后传递给任何接受 '--manifest'（或 '-m'）选项的 'guix' 命令。

source: spawn one-off software environments
es: generar entornos de software únicos
it: genera ambienti software monouso
zh_cn: 生成一次性软件环境

source: Consider passing the @option{--check} option once to make sure your shell does not clobber environment variables.
es: Considere pasar la opción @option{--check} una vez que asegure que su shell no choque con las variables de entorno.
it: Valuta se passare l'opzione @option{--check} una volta per assicurarti che la tua shell non sovrascriva le variabili ambiente.
zh_cn: 考虑传递一次 @option{--check} 选项， 以确保您的 shell 不会覆盖环境变量。

source: -e, --expression=EXPR create environment for the package that EXPR evaluates to
es: -e, --expression=EXPR crea entorno para el paquete que EXPR evalúa
it: -e, --expression=EXPR crea l'ambiente per il pacchetto a cui EXPR valuta
zh_cn: -e, --expression=EXPR 为 EXPR 计算出的软件包创建环境

source: -m, --manifest=FILE create environment with the manifest from FILE
es: -m, --manifest=ARCHIVO crea un entorno con el manifiesto de ARCHIVO
it: -m, --manifest=FILE crea l'ambiente con il manifest da FILE
zh_cn: -m, --manifest=FILE 使用来自 FILE 的清单创建环境

source: -p, --profile=PATH create environment from profile at PATH
es: -p, --profile=RUTA crea un entorno desde el perfil en RUTA
it: -p, --profile=PERCORSO crea l'ambiente dal profilo in PERCORSO
zh_cn: -p, --profile=PATH 从 PATH 的配置文件创建环境

source: --check check if the shell clobbers environment variables
es: --check comprueba si el intérprete choca con las variables de entorno
it: --check controlla se la shell sovrascrive le variabili d'ambiente
zh_cn: --check 检查 shell 是否覆盖环境变量

source: --pure unset existing environment variables
es: --pure descarta las variables de entorno existentes
it: --pure toglie le variabili ambiente esistenti
zh_cn: --pure 取消设置现有环境变量

source: -E, --preserve=REGEXP preserve environment variables that match REGEXP
es: -E, --preserve=REGEXP reserva las variables de entorno que coinciden con REGEXP
it: -E, --preserve=REGEXP preserva le variabili d'ambiente che corrispondono a REGEXP
zh_cn: -E, --preserve=REGEXP 保留匹配 REGEXP 的环境变量

source: --search-paths display needed environment variable definitions
es: --search-paths muestra las definiciones de variables de entorno necearias
it: --search-paths mostra le definizioni delle variabili ambiente necessarie
zh_cn: --search-paths 显示所需的环境变量定义

source: -C, --container run command within an isolated container
es: -C, --container ejecuta la orden dentro de un contenedor aislado
it: -C, --container esegue il comando all'interno di un contenitore isolato
zh_cn: -C, --container 在隔离容器中运行命令

source: -N, --network allow containers to access the network
es: -N, --network permite a los contenedores acceder a la red
it: -N, --network permette ai contenitori di accedere alla rete
zh_cn: -N, --network 允许容器访问网络

source: -P, --link-profile link environment profile to ~/.guix-profile within an isolated container
es: -P, --link-profile enlaza el perfil de entorno a ~/.guix-profile dentro de un contenedor aislado
it: -P, --link-profile collega il profilo dell'ambiente a ~/.guix-profile all'interno di un contenitore isolato
zh_cn: -P, --link-profile 在隔离容器中将环境配置文件链接到 ~/.guix-profile

source: -W, --nesting make Guix available within the container
es: -W, --nesting hace Guix disponible dentro de contenedor
it: -W, --nesting rende Guix disponibile all'interno del contenitore

source: -u, --user=USER instead of copying the name and home of the current user into an isolated container, use the name USER with home directory /home/USER
es: -u, --user=USUARIO en lugar de copiar el nombre y la home del actual usuario en un contenedor aislado, usa el nombre USUARIO con el directorio home /home/USUARIO
it: -u, --user=UTENTE invece di copiare il nome e la home dell'utente corrente in un contenitore isolato, usa il nome UTENTE con directory home /home/UTENTE
zh_cn: -u, --user=USER 不复制当前用户的名称和主目录到隔离容器， 使用名称 USER 和主目录 /home/USER

source: --no-cwd do not share current working directory with an isolated container
es: --no-cwd no comparte el directorio de trabajo actual con un contenedor aislado
it: --no-cwd non condividere la directory di lavoro corrente con un contenitore isolato
zh_cn: --no-cwd 不与隔离容器共享当前工作目录

source: --writable-root make the container's root file system writable
es: --writable-root hace que el sistema de archivo raíz del contenedor sea escribible
it: --writable-root rendi scrivibile il file system root del container
zh_cn: --writable-root 使容器的根文件系统可写

source: --share=SPEC for containers, share writable host file system according to SPEC
es: --share=SPEC para contenedores, comparte el sistema de archivos anfitrión, con permiso de edición, de acuerdo con SPEC
it: --share=SPEC per i contenitori, condivide il file system dell'host scrivibile secondo SPEC
zh_cn: --share=SPEC 对于容器，根据 SPEC 共享可写的主机文件系统

source: --expose=SPEC for containers, expose read-only host file system according to SPEC
es: --expose=SPEC para contenedores, expone el sistema de archivos de sólo lectura del host de acuerdo con SPEC
it: --expose=SPEC per i contenitori, espone il file system dell'host in sola lettura secondo SPEC
zh_cn: --expose=SPEC 对于容器，根据 SPEC 暴露只读的主机文件系统

source: -S, --symlink=SPEC for containers, add symlinks to the profile according to SPEC, e.g. "/usr/bin/env=bin/env".
es: -S, --symlink=SPEC para contenedores, añade enlaces simbólicos al perfil de acuerdo a SPEC, por ejemplo "/usr/bin/env=bin/env".
it: -S, --symlink=SPEC per i contenitori, aggiunge collegamenti simbolici al profilo secondo SPEC, es. "/usr/bin/env=bin/env".
zh_cn: -S, --symlink=SPEC 对于容器，根据 SPEC 添加指向配置文件的符号链接， 例如 "/usr/bin/env=bin/env"。

source: --bootstrap use bootstrap binaries to build the environment
es: --bootstrap usa binarios bootstrap para construir el entorno
it: --bootstrap usa i binari di bootstrap per creare l'ambiente
zh_cn: --bootstrap 使用引导二进制文件构建环境

source: Usage: guix environment [OPTION]... PACKAGE... [-- COMMAND...] Build an environment that includes the dependencies of PACKAGE and execute COMMAND or an interactive shell in that environment.
es: Modo de empleo: guix environment [OPCIÓN]... PAQUETE... [-- COMANDO...] Construye un entorno que incluye las dependencias de PAQUETE y ejecuta COMANDO o un shell interactivo en ese entorno.
it: Utilizzo: guix environment [OPZIONE]... PACCHETTO... [-- COMANDO...] Costruisci un ambiente che include le dipendenze di PACCHETTO ed esegui COMANDO o una shell interattiva in quell'ambiente.
zh_cn: 用法：guix environment [OPTION]... PACKAGE... [-- COMMAND...] 构建一个包含包的依赖项的环境，并在该环境中执行命令或交互式 shell。

source: This command is deprecated in favor of 'guix shell'.
es: Este comando está obsoleto en favor de 'guix shell'.
it: Questo comando è deprecato a favore di 'guix shell'.
zh_cn: 此命令已被弃用，建议使用 'guix shell'。

source: -l, --load=FILE create environment for the package that the code within FILE evaluates to
es: -l, --load=ARCHIVO crea el entorno para el paquete que el código dentro de ARCHIVO evalúa
it: -l, --load=FILE crea l'ambiente per il pacchetto a cui il codice dentro FILE valuta
zh_cn: -l, --load=FILE 为代码所在的包创建环境， 代码在 FILE 中求值

source: --ad-hoc include all specified packages in the environment instead of only their inputs
es: --ad-hoc incluye todos los paquetes especificados en el entorno en lugar de sólo sus entradas
it: --ad-hoc include tutti i pacchetti specificati nell'ambiente invece dei soli loro input
zh_cn: --ad-hoc 在环境中包含所有指定的包，而不仅仅是它们的输入

source: '--inherit' is deprecated, use '--preserve' instead~%
es: '--inherit' está obsoleto, use en su lugar '--preserve'~%
it: '--inherit' è deprecata, usa '--preserve' al suo posto~%
zh_cn: '--inherit' 已被弃用，请改用 '--preserve'~%

source: could not add current Guix to the profile~%
es: no pudo añadir el Guix actual al perfil~%
it: impossibile aggiungere l'attuale Guix al profilo~%
zh_cn: 无法将当前 Guix 添加到配置文件~%

source: ~a: command not found~%
es: ~a: comando no encontrado~%
it: ~a: comando non trovato~%

source: checking the environment variables visible from shell '~a'...~%
es: comprobando las variables de entorno visibles desde el shell '~a'...~%
it: controllo delle variabili d'ambiente visibili dalla shell '~a'...~%
zh_cn: 检查从 shell '~a' 可见的环境变量...~%

source: failed to determine environment of shell '~a'~%
es: falló al determinar el entorno del shell '~a'~%
it: impossibile determinare l'ambiente della shell '~a'~%

source: variable '~a' is missing from shell environment~%
es: variable '~a' desaparecida del entorno de shell~%
it: la variabile '~a' è assente dall'ambiente shell~%
zh_cn: 变量 '~a' 在 shell 环境中缺失~%

source: variable '~a' has unexpected suffix '~a'~%
es: variable '~a' tiene un sufijo inesperado '~a'~%
it: la variabile '~a' ha un suffisso '~a' inaspettato~%

source: variable '~a' is clobbered: '~a'~%
es: variable '~a' está golpeada: '~a'~%
it: la variabile '~a' è sovrascritta: '~a'~%

source: 'GUIX_ENVIRONMENT' is missing from the shell environment~%
es: 'GUIX_ENVIRONMENT' desapareció del entorno de shell~%
it: 'GUIX_ENVIRONMENT' è assente dall'ambiente shell~%
zh_cn: 'GUIX_ENVIRONMENT' 在 shell 环境中缺失~%

source: 'GUIX_ENVIRONMENT' is set to '~a' instead of '~a'~%
es: 'GUIX_ENVIRONMENT' establecida a '~a' en lugar de '~a'~%
it: 'GUIX_ENVIRONMENT' è impostata a '~a' invece che a '~a'~%
zh_cn: 'GUIX_ENVIRONMENT' 被设置为 '~a' 而不是 '~a'~%

source: 'PS1' is the same in sub-shell~%
es: 'PS1' es el mismo en sub-shell~%
it: 'PS1' è lo stesso nella sub-shell~%
zh_cn: 'PS1' 在子 shell 中是相同的~%

source: Consider setting a different prompt for environment shells to make them distinguishable. If you are using Bash, you can do that by adding these lines to @file{~/.bashrc}: @example PS1='\u@@\h \w${GUIX_ENVIRONMENT:+ [env]}\$ ' @end example
es: Considere establecer un prompt diferente para el entorno de intérpretes para hacerlo distinguible. Si está usando Bash, puede hacerlo añadiendo estas líneas a @file{~/.bashrc}: @example PS1='\u@@\h \w${GUIX_ENVIRONMENT:+ [env]}\$ ' @end example
it: Considera l'impostazione di un prompt differente per le shell d'ambiente per renderle distinguibili. Se usi Bash, puoi farlo aggiungendo queste linee a @file{~/.bashrc}: @example PS1='\u@@\h \w${GUIX_ENVIRONMENT:+ [env]}\$ ' @end example
zh_cn: 考虑为环境 shell 设置不同的提示符，以使其可区分。 如果您使用 Bash，可以通过将以下行添加到 @file{~/.bashrc} 来实现： @example PS1='\u@@\h \w${GUIX_ENVIRONMENT:+ [env]}\$ ' @end example

source: One or more environment variables have a different value in the shell than the one we set. This means that you may find yourself running code in an environment different from the one you asked Guix to prepare. This usually indicates that your shell startup files are unexpectedly modifying those environment variables. For example, if you are using Bash, make sure that environment variables are set or modified in @file{~/.bash_profile} and @emph{not} in @file{~/.bashrc}. For more information on Bash startup files, run: @example info "(bash) Bash Startup Files" @end example Alternatively, you can avoid the problem by passing the @option{--container} or @option{-C} option. That will give you a fully isolated environment running in a "container", immune to the issue described above.
es: Una o mas de las variables de entorno tienen un valor diferente en el shell que el que establecimos. Esto significa que usted se puede encontrar ejecutando código en un entorno diferente al que pidió que Guix prepare. Esto normalmente indica que sus archivos de arranque de shell startup han modificado inesperadamente estas variables de entorno. Por ejemplo, si está usando Bash, asegure que las variables de entorno están fijadas o modificadas en @file{~/.bash_profile} y @emph{no} en @file{~/.bashrc}. Para más información sobre los archivos de arranque de Bash, ejecute: @example info "(bash) Bash Startup Files" @end example Alternativamente, puede evitar el problema pasando la opción @option{--container} o @option{-C}. Que le proporcionarán un entorno totalmente aislado corriendo en un "contenedor", inmune a la cuestión descrita arriba.
it: Una o più variabili ambiente presentano un valore diverso nella shell rispetto a quello che avevamo impostato. Significa che potresti ritrovarti a eseguire codice in un ambiente diverso da quello che avevi chiesto a Guix di preparare. Di solito significa che i tuoi script di avvio della shell modificano in modo inatteso queste variabili ambiente. Per esempio, se stai usando Bash, assicurati che le variabili vengano impostate o modificate in @file{~/.bash_profile} e @emph{non} in @file{~/.bashrc}. Per maggiori informazioni sui file di avvio di Bash, esegui: @example info "(bash) Bash Startup Files" @end example In alternativa, puoi aggirare il problema passando l'opzione @option{--container} o l'opzione @option{-C}. Ti daranno un ambiente completamente isolato che gira all'interno di un "contenitore", immune al problema descritto sopra.
zh_cn: 一个或多个环境变量在 shell 中的值与我们设置的不同。这意味着您可能会在一个与 Guix 准备的环境不同的环境中运行代码。 这通常表示您的 shell 启动文件意外地修改了这些环境变量。例如，如果您使用的是 Bash，确保环境变量是在 @file{~/.bash_profile} 中设置或修改，而 @emph{不是} 在 @file{~/.bashrc} 中。 欲了解有关 Bash 启动文件的更多信息，请运行： @example info "(bash) Bash Startup Files" @end example 另外，您可以通过传递 @option{--container} 或 @option{-C} 选项来避免此问题。这将为您提供一个完全隔离的环境，在一个“容器”中运行，免受上述问题的影响。

source: All is good! The shell gets correct environment variables.~%
es: ¡Todo está bien! El shell obtiene las variables de entorno correctas.~%
it: Tutto a posto! La shell riceve le variabili d'ambiente corrette.~%
zh_cn: 一切正常！shell 获取了正确的环境变量。~%

source: Did you mean '~a'?~%
es: ¿Quiso decir '~a'?~%
it: Intendevi '~a'?~%
zh_cn: 您是想说 '~a'?~%

source: cannot link profile: '~a' already exists within container~%
es: no puede enlazar el perfil: '~a' ya existe dentro del contenedor~%
it: impossibile collegare il profilo: '~a' esiste già all'interno del contenitore~%
zh_cn: 无法链接配置文件：'~a' 已在容器中存在~%

source: cannot create container: user namespaces unavailable
es: no puede crear contenedor: espacios de nombre de usuario no disponibles
it: impossibile creare il contenitore: spazi nomi utente non disponibili
zh_cn: 无法创建容器：用户命名空间不可用

source: is your kernel version < 3.10?
es: ¿es su versión de kernel < 3.10?
it: la versione del tuo kernel è < 3.10?
zh_cn: 您的内核版本是否 < 3.10?

source: cannot create container: unprivileged user cannot create user namespaces
es: no puede crear contenedor: un usuario sin privilegios no puede crear espacios de nombre de usuario
it: impossibile creare il container: l'utente senza privilegi non può creare namespace utente
zh_cn: 无法创建容器：无特权用户无法创建用户命名空间

source: please set /proc/sys/kernel/unprivileged_userns_clone to "1"
es: Establezca /proc/sys/kernel/unprivileged_userns_clone a "1"
it: per favore imposta /proc/sys/kernel/unprivileged_userns_clone a "1"
zh_cn: 请将 /proc/sys/kernel/unprivileged_userns_clone 设置为 "1"

source: cannot create container: /proc/self/setgroups does not exist
es: no puede crear contenedor: /proc/self/setgroups no existe
it: impossibile creare il contenitore: /proc/self/setgroups non esiste
zh_cn: 无法创建容器：/proc/self/setgroups 不存在

source: is your kernel version < 3.19?
es: ¿es su versión de kernel < 3.19?
it: la versione del tuo kernel è < 3.19?
zh_cn: 您的内核版本是否 < 3.19?

source: spawn one-off software environments (deprecated)
es: generar entornos de software únicos (obsoleto)
it: genera ambienti software monouso (deprecato)
zh_cn: 生成一次性软件环境（已弃用）

source: '--link-profile' cannot be used without '--container'~%
es: '--link-profile' no se puede usar sin '--container'~%
it: '--link-profile' non può essere usata senza '--container'~%
zh_cn: '--link-profile' 不能在没有 '--container' 的情况下使用~%

source: '--user' cannot be used without '--container'~%
es: '--user' no se puede usar sin '--container'~%
it: '--user' non può essere usata senza '--container'~%
zh_cn: '--user' 不能在没有 '--container' 的情况下使用~%

source: --no-cwd cannot be used without '--container'~%
es: --no-cwd no puede ser utilizado sin '--container'~%
it: --no-cwd non può essere usata senza '--container'~%
zh_cn: --no-cwd 不能在没有 '--container' 的情况下使用~%

source: '--writable-root' cannot be used without '--container'~%
es: '--writable-root' no puede ser utilizado sin '--container'~%
it: '--writable-root' non può essere usata senza '--container'~%
zh_cn: '--writable-root' 不能在没有 '--container' 的情况下使用~%

source: '--emulate-fhs' cannot be used without '--container'~%
es: '--emulate-fhs' no puede ser utilizado sin '--container'~%
it: '--emulate-fhs' non può essere usata senza '--container'~%
zh_cn: '--emulate-fhs' 不能在没有 '--container' 的情况下使用~%

source: '--nesting' cannot be used without '--container'~%
es: '--nesting' no puede ser utilizado sin '--container'~%
it: '--nesting' non può essere usata senza '--container'~%
zh_cn: '--nesting' 不能在没有 '--container' 的情况下使用~%

source: '--symlink' cannot be used without '--container'~%
es: '--symlink' no puede ser utilizado sin '--container'~%
it: '--symlink' non può essere usata senza '--container'~%
zh_cn: '--symlink' 不能在没有 '--container' 的情况下使用~%

source: '--profile' cannot be used with package options~%
es: '--profile' no se puede usar con opciones de paquete~%
it: '--profile' non può essere usata insieme a opzioni pacchetto~%
zh_cn: '--profile' 不能与包选项一起使用~%

source: '--check' is unnecessary when using '--container'; doing nothing~%
es: '--check' no es necesario cuando se utiliza '--container'; no hacer nada~%
it: '--check' non è necessario quando si usa '--container'; nessuna operazione in corso~%
zh_cn: '--check' 在使用 '--container' 时不必要；不执行任何操作~%

source: ~a: complex expression, bailing out~%
es: ~a: expresión compleja, rescatando~%
it: ~a: espressione complessa, lascio perdere~%

source: ~a: input label '~a' does not match package name, bailing out~%
es: ~a: etiqueta de entrada '~a' no coincide con nombre de paquete, rescatando~%
it: ~a: etichetta di input '~a' non corrisponde al nome del pacchetto, uscita~%
zh_cn: ~a: 输入标签 '~a' 与包名不匹配，正在退出~%

source: ~a: non-trivial input, bailing out~%
es: ~a: entrada no trivial, rescatando~%
it: ~a: input non banale, lascio perdere~%
zh_cn: ~a: 非单一输入，正在退出~%

source: ~a: input expression is too short~%
es: ~a: expresión de entrada demasiado corta~%
it: ~a: l'espressione dell'input è troppo corta~%

source: ~a: unsupported input style, bailing out~%
es: ~a: estilo de entrada no soportado, rescatando~%
it: ~a: stile dell'input non supportato, lascio perdere~%
zh_cn: ~a: 不支持的输入样式，正在退出~%

source: would be edited~%
es: seria editado~%
it: verrebbe modificato~%
zh_cn: 将被编辑~%

source: unsupported argument style; bailing out~%
es: argumento de estilo no soportado; rescatando~%
it: stile argumento non supportato; lascio perdere~%
zh_cn: 不支持的参数样式；正在退出~%
