Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: --without-tests=PACKAGE build PACKAGE without running its tests
es: --without-tests=PAQUETE construye PAQUETE sin ejecutar sus pruebas
it: --without-tests=PACCHETTO costruisce un PACCHETTO senza eseguire i suoi test

source: --help-transform list package transformation options not shown here
es: --help-transform enumera las opciones de transformación no mostradas aquí
it: --help-transform elenca opzioni per la trasformazione pacchetti non mostrate qui
zh_cn: --help-transform 列出此处未显示的软件包转换选项

source: transformation '~a' had no effect on ~a~%
es: la transformación '~a' no tuvo efecto en ~a~%
it: la trasformazione '~a' non ha effetto su ~a~%
zh_cn: 转换 '~a' 对 ~a 无效~%

source: failed to download detached signature from ~a~%
es: se produjo un fallo al descargar la firma separada de '~a'~%
it: impossibile scaricare la firma separata da ~a~%
zh_cn: 下载 ~a 的分离签名失败~%

source: signature verification failed for '~a' (key: ~a)~%
es: la verificación de la firma ha fallado para '~a' (clave: ~a)~%
it: verifica della firma fallita per '~a' (chiave: ~a)~%
zh_cn: ‘~a’的签名验证失败（密钥：~a）~%

source: missing public key ~a for '~a'~%
es: falta la clave pública ~a para '~a'~%
it: chiave pubblica ~a mancante per '~a'~%
zh_cn: 缺少‘~a’的公钥 ~a~%

source: failed to fetch source from '~a'
es: falló al recuperar la fuente desde '~a'
it: impossibile recuperare sorgente da '~a'

source: cannot download for this method: ~s
es: no se puede descargar con este método: ~s
it: impossibile scaricare per questo metodo: ~s
zh_cn: 此方法无法下载：~s

source: downgrading '~a' from ~a to ~a~%
es: degradando '~a' desde ~a hasta ~a~%
it: scegliendo ~a@~a da ~a~%

source: updater failed to find release ~a@~a~%
es: el actualizador ha fallado al encontrar publicación ~a@~a~%
it: l'aggiornatore non ha trovato la release ~a@~a~%

source: updater failed to determine available releases for ~a~%
es: actualizador incorrecto para determinar publicaciones disponibles para ~a~%
it: l'aggiornatore non è riuscito a determinare le release disponibili per ~a~%

source: ~a: '~a' field not found; leaving it unchanged~%
es: ~a: campo '~a' no encontrado; se abandona sin cargo~%
it: ~a: campo '~a' non trovato; lasciato invariato~%
zh_cn: ~a：未找到‘~a’字段；保持不变~%

source: ~a: expected '~a' value: ~s~%
es: ~a: esperaba valor '~a': ~s~%
it: ~a: valore '~a' atteso: ~s~%

source: ~a: no `version' field in source; skipping~%
es: ~a: no hay campo «version» en las fuentes; se omite~%
it: ~a: campo `version' mancante nella sorgente; salto~%
zh_cn: ~a：源中无 `version` 字段；跳过~%

source: ~a: could not locate source file
es: ~a: no se pudo encontrar el archivo de fuente
it: ~a: impossibile trovare il file sorgente
zh_cn: ~a：无法定位源文件

source: error: ~a: unbound variable
es: error: ~a: variable sin asignar
it: errore: ~a: variabile indefinita
zh_cn: 错误：~a：未绑定变量

source: entering debugger; type ',bt' for a backtrace
es: entrando en el depurador; teclee ',bt' para ver la pila de llamadas
it: ingresso nel debugger; digita ',bt' per un backtrace
zh_cn: 进入调试器；输入 ',bt' 查看回溯

source: hint:
es: consejo:
it: suggerimento:
zh_cn: 提示：

source: Did you forget a @code{use-modules} form?
es: ¿Se ha olvidado de usar una forma @code{use-modules}?
it: Hai dimenticato una dichiarazione @code{use-modules}?
zh_cn: 您是否忘记使用 @code{use-modules} 导入某库？

source: Did you forget @code{(use-modules ~a)}?
es: ¿Se ha olvidado de @code{(use-modules ~a)}?
it: Hai dimenticato @code{(use-modules ~a)}?
zh_cn: 您是否忘记使用 @code{(use-modules ~a)}？

source: File @file{~a} should probably start with: @example (define-module ~a) @end example
es: El archivo @file{~a} probablemente debería comenzar con: @example (define-module ~a) @end example
it: Il file @file{~a} dovrebbe probabilmente iniziare con: @example (define-module ~a) @end example
zh_cn: 文件 @file{~a} 可能应以以下内容开头： @example (define-module ~a) @end example

source: module name ~a does not match file name '~a'~%
es: el nombre de módulo ~a no corresponde con el nombre de archivo '~a'~%
it: il nome del modulo ~a non corrisponde al nome del file '~a'~%
zh_cn: 模块名 ~a 与文件名‘~a’不匹配~%

source: ~a: file is empty~%
es: ~a: el archivo está vacío~%
it: ~a: il file è vuoto~%
zh_cn: ~a: 空文件~%

source: failed to load '~a': ~a~%
es: no se pudo cargar '~a': ~a~%
it: impossibile caricare '~a': ~a~%
zh_cn: 加载‘~a’失败：~a~%

source: ~amissing closing parenthesis~%
es: ~afalta el paréntesis de cierre~%
it: ~aparentesi di chiusura mancante~%
zh_cn: ~a 缺少右括号~%

source: read error while loading '~a': ~a~%
es: leído error mientras se cargaba '~a': ~a~%
it: errore di lettura durante il caricamento di '~a': ~a~%

source: exception thrown: ~s~%
es: excepción lanzada: ~s~%
it: eccezione lanciata: ~s~%
zh_cn: 抛出异常：~s~%

source: failed to load '~a':~%
es: no se pudo cargar '~a':~%
it: impossibile caricare '~a':~%
zh_cn: 加载‘~a’失败：~%

source: failed to load '~a': exception thrown: ~s~%
es: no se pudo cargar '~a': excepción lanzada: ~s~%
it: impossibile caricare '~a': eccezione lanciata: ~s~%
zh_cn: 加载‘~a’失败：抛出异常：~s~%

source: Consider installing the @code{glibc-locales} package and defining @code{GUIX_LOCPATH}, along these lines: @example guix install glibc-locales export GUIX_LOCPATH="$HOME/.guix-profile/lib/locale" @end example See the "Application Setup" section in the manual, for more info.
es: Considere la instalación del paquete @code{glibc-locales} package y la definición de @code{GUIX_LOCPATH}, con estas líneas: @example guix install glibc-locales export GUIX_LOCPATH="$HOME/.guix-profile/lib/locale" @end example Vea, para más información, la sección "Ajuste de la Aplicación" en el manual.
it: Considera l'installazione del pacchetto @code{glibc-locales} e la definizione di @code{GUIX_LOCPATH}, in questo modo: @example guix install glibc-locales export GUIX_LOCPATH="$HOME/.guix-profile/lib/locale" @end example Consulta la sezione "Application Setup" nel manuale per maggiori informazioni.
zh_cn: 考虑安装 @code{glibc-locales} 软件包 并定义 @code{GUIX_LOCPATH}，如下所示： @example guix install glibc-locales export GUIX_LOCPATH="$HOME/.guix-profile/lib/locale" @end example 更多信息请参见手册中的“应用程序设置”部分。

source: the Guix authors
es: las autoras de Guix
it: gli autori di Guix
zh_cn: Guix 作者

source: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Licencia GPLv3+: GPL de GNU versión 3 o posterior <http://gnu.org/licenses/gpl.html> Esto es software libre: usted es libre para cambiarlo y redistribuirlo. No se proporciona NINGUNA GARANTÍA, en la medida en que la ley lo permita.
it: Licenza GPLv3+: GNU GPL versione 3 o successiva <http://gnu.org/licenses/gpl.html> Questo è software libero: sei libero di modificarlo e ridistribuirlo. NON VIENE FORNITA ALCUNA GARANZIA, nella misura consentita dalla legge.
zh_cn: 许可证：GPLv3+：GNU 通用公共许可证第 3 版或更新版本 <http://gnu.org/licenses/gpl.html>。 本软件是自由软件：您可以自由修改和重新发布它。 本软件不提供法律允许的范围内的任何保证。

source: Report bugs to: ~a.
es: Informe de errores a: ~a.
it: Segnala i bug a: ~a.
zh_cn: 报告程序缺陷到：~a。 报告简体中文翻译错误到：https://translate.codeberg.org/engage/guix/

source: ~a home page: <~a>
es: Página Web de ~a: <~a>
it: home page di ~a: <~a>
zh_cn: ~a 项目首页：<~a>

source: General help using Guix and GNU software: <~a>
es: Ayuda general para el uso de Guix y software de GNU: <~a>
it: Aiuto generale nell'uso di Guix e del software GNU: <~a>
zh_cn: 使用 Guix 和 GNU 软件的通用帮助：<~a>

source: https://guix.gnu.org/en/help/
es: https://guix.gnu.org/es/help/
it: https://guix.gnu.org/it/help/
zh_cn: https://guix.gnu.org/zh-CN/help/

source: '~a' is not a valid regular expression: ~a~%
es: '~a' no es una expresión regular válida: ~a~%
it: '~a' non è un'espressione regolare valida: ~a~%
zh_cn: ‘~a’不是有效的正则表达式：~a~%

source: ~a: invalid number~%
es: ~a: número no válido~%
it: ~a: numero non valido~%
zh_cn: ~a: 无效的数字~%

source: invalid number: ~a~%
es: número no válido: ~a~%
it: numero non valido: ~a~%
zh_cn: 无效的数字：~a~%

source: unknown unit: ~a~%
es: unidad desconocida: ~a~%
it: unità sconosciuta: ~a~%
zh_cn: 未知单位：~a~%

source: You cannot have two different versions or variants of @code{~a} in the same profile.
es: No puede tener dos versiones diferentes o variantes de @code{~a} en el mismo perfil.
it: Non puoi avere due versioni o varianti diverse di @code{~a} nello stesso profilo.
zh_cn: 您不能在同一配置文件中拥有两个不同版本 或变体的 @code{~a}。

source: Try upgrading both @code{~a} and @code{~a}, or remove one of them from the profile.
es: Intente actualizar @code{~a} y @code{~a}, o borre uno de ellos del perfil.
it: Prova ad aggiornare sia @code{~a} che @code{~a}, o rimuovi uno dei due dal profilo.
zh_cn: 尝试升级 @code{~a} 和 @code{~a}， 或从配置文件中移除其中一个。

source: ~a:~a:~a: package `~a' has an invalid input: ~s~%
es: ~a:~a:~a: el paquete «~a» tiene una entrada no válida: ~s~%
it: ~a:~a:~a: il pacchetto `~a' ha un input non valido: ~s~%
zh_cn: ~a:~a:~a: 软件包‘~a’有无效输入：~s~%

source: ~a: dependency cycle detected: ~a~{ -> ~a~}~%
es: ~a: ciclo de dependencia detectado: ~a~{ -> ~a~}~%
it: ~a: ciclo di dipendenze rilevato: ~a~{ -> ~a~}~%
zh_cn: ~a：检测到依赖循环： ~a~{ -> ~a~}~%

source: ~a: ~a: build system `~a' does not support cross builds~%
es: ~a: ~a: el sistema de construcción «~a» no permite la compilación cruzada~%
it: ~a: ~a: il sistema di build `~a' non supporta la cross-compilazione~%
zh_cn: ~a：~a：构建系统 `~a' 不支持交叉构建~%

source: ~a: ~a: does not support target `~a'~%
es: ~a: ~a: no admite destino `~a'~%
it: ~a: ~a: non supporta il target `~a'~%

source: the `~a' build system: does not support target `~a'~%
es: el sistema de construcción `~a': no admite destino `~a'~%
it: il sistema di build `~a' non supporta il target `~a'~%

source: ~s: invalid G-expression input~%
es: ~s: entrada de expresión-G no válida~%
it: ~s: espressione-G dell'input non valida~%

source: profile '~a' does not exist~%
es: el perfil '~a' no existe~%
it: il profilo '~a' non esiste~%
zh_cn: 配置文件 '~a' 不存在~%

source: generation ~a of profile '~a' does not exist~%
es: la generación ~a del perfil '~a' no existe~%
it: la generazione ~a del profilo '~a' non esiste~%
zh_cn: 配置文件 '~a' 的第 ~a 代不存在~%

source: package '~a~@[@~a~]~@[:~a~]' not found in profile~%
es: no se ha encontrado el paquete '~a~@[@~a~]~@[:~a~]' en el perfil~%
it: pacchetto '~a~@[@~a~]~@[:~a~]' non trovato nel profilo~%
zh_cn: 配置文件中未找到包 '~a~@[@~a~]~@[:~a~]'~%

source: ... propagated from ~a@~a~%
es: ... propagada desde ~a@~a~%
it: ... propagato da ~a@~a~%
zh_cn: ... 从 ~a@~a 传播~%

source: profile contains conflicting entries for ~a~a~%
es: el perfil contiene entradas en conflicto para ~a~a~%
it: il profilo contiene più voci in conflitto per ~a~a~%
zh_cn: 配置文件包含冲突的条目，针对 ~a~a~%

source: first entry: ~a@~a~a ~a~%
es: primera entrada: ~a@~a~a ~a~%
it: prima voce: ~a@~a~a ~a~%
zh_cn: 第一个条目：~a@~a~a ~a~%

source: second entry: ~a@~a~a ~a~%
es: segunda entrada: ~a@~a~a ~a~%
it: seconda voce: ~a@~a~a ~a~%
zh_cn: 第二个条目：~a@~a~a ~a~%

source: corrupt input while restoring '~a' from ~s~%
es: entrada corrupta durante la restauración de '~a' desde ~s~%
it: input corrotto durante il ripristino di '~a' da ~s~%
zh_cn: 恢复 '~a' 自 ~s 时输入损坏~%

source: corrupt input while restoring archive from ~s~%
es: entrada corrupta durante la restauración del archivo desde ~s~%
it: input corrotto durante il ripristinto dell'archivio da ~s~%
zh_cn: 从 ~s 恢复归档时输入损坏~%

source: failed to connect to `~a': ~a~%
es: no se pudo conectar a «~a»: ~a~%
it: impossibile connettersi a `~a': ~a~%
zh_cn: 连接到 `~a' 失败：~a~%

source: reference to invalid output '~a' of derivation '~a'~%
es: referencia a la salida '~a' no válida de la derivación '~a'~%
it: riferimento all'output non valido '~a' della derivazione '~a'~%
zh_cn: 引用派生 '~a' 的无效输出 '~a'~%

source: file '~a' could not be found in these directories:~{ ~a~}~%
es: el archivo '~a' no se ha podido encontrar en estos directorios:~{ ~a~}~%
it: impossibile trovare il file '~a' in queste directory:~{ ~a~}~%
zh_cn: 文件 '~a' 在以下目录中未找到：~{ ~a~}~%

source: program exited~@[ with non-zero exit status ~a~]~@[ terminated by signal ~a~]~@[ stopped by signal ~a~]: ~s~%
es: el programa finalizó~@[ con un estado de salida distinto a cero ~a~]~@[ abruptamente por una señal ~a~]~@[ detenido por señal ~a~]: ~s~%
it: il programma è uscito~@[ con codice uscita diverso da zero ~a~]~@[ terminato dal segnale ~a~]~@[ fermato dal segnale ~a~]: ~s~%
zh_cn: 程序退出~@[，退出状态非零 ~a~]~@[，被信号终止 ~a~]~@[，被信号停止 ~a~]：~s~%

source: failed to read expression ~s: ~s~%
es: no se pudo leer la expresión ~s: ~s~%
it: impossibile leggere l'espressione ~s: ~s~%
zh_cn: 读取表达式 ~s 失败：~s~%

source: failed to evaluate expression '~a':~%
es: no se pudo evaluar la expresión '~a':~%
it: impossibile valutare l'espressione '~a':~%
zh_cn: 计算表达式 '~a' 失败：~%

source: syntax error: ~a~%
es: error sintáctico: ~a~%
it: errore di sintassi: ~a~%
zh_cn: 语法错误：~a~%

source: expression ~s does not evaluate to a package~%
es: la expresión ~s no evalúa a un paquete~%
it: l'espressione ~s non si traduce in un pacchetto~%
zh_cn: 表达式 ~s 不计算为包~%

source: at least ~,1h MB needed but only ~,1h MB available in ~a~%
es: se necesita al menos ~,1h MB pero únicamente ~,1h MB está disponible en ~a~%
it: almeno ~,1h MB richiesti ma solo ~,1h MB disponibili in ~a~%
zh_cn: 至少需要 ~,1h MB，但 ~a 中仅有 ~,1h MB 可用~%

source: The following derivation would be built:~%
es: La siguiente derivación sería construida:~%
it: Verrebbe costruita questa derivazione:~%
zh_cn: 将构建以下派生：~%

source: ~:[~,1h MB would be downloaded:~%~;~]
es: ~:[Se descargarían ~,1h MB:~%~;~]
it: ~:[~,1h MB verrebbero scaricati:~%~;~]
zh_cn: ~:[将下载 ~,1h MB：~%~;~]

source: ~:[The following file would be downloaded:~%~;~]
es: ~:[Se descargaría el siguiente archivo:~%~;~]
it: ~:[Il seguente file verrebbe scaricato:~%~;~]
zh_cn: ~:[将下载以下文件：~%~;~]

source: ~:[The following graft would be made:~%~{ ~a~%~}~;~]
es: ~:[Se realizaría el siguiente injerto:~%~{ ~a~%~}~;~]
it: ~:[Il seguente innesto verrebbe fatto:~%~{ ~a~%~}~;~]
zh_cn: ~:[将进行以下嫁接：~%~{ ~a~%~}~;~]

source: ~:[The following profile hook would be built:~%~{ ~a~%~}~;~]
es: ~:[Se construiría la siguiente extensión del perfil:~%~{ ~a~%~}~;~]
it: ~:[Il seguente hook di profilo verrebbe costruito:~%~{ ~a~%~}~;~]
zh_cn: ~:[将构建以下配置文件钩子：~%~{ ~a~%~}~;~]

source: ~:[~,1h MB would be downloaded~%~;~]
es: ~:[Se descargarían ~,1h MB~%~;~]
it: ~:[~,1h MB verrebbero scaricati~%~;~]
zh_cn: ~:[将下载 ~,1h MB~%~;~]

source: ~:[~h item would be downloaded~%~;~]
es: ~:[Se descargaría ~h elemento~%~;~]
it: ~:[~h oggetto verrebbe scaricato~%~;~]
zh_cn: ~:[将下载 ~h 项~%~;~]

source: The following derivation will be built:~%
es: Se construiría la siguiente derivación:~%
it: Sarà costruita questa derivazione:~%
zh_cn: 将构建以下派生：~%

source: ~:[~,1h MB will be downloaded:~%~;~]
es: ~:[Se descargarán ~,1h MB:~%~;~]
it: ~:[~,1h MB saranno scaricati:~%~;~]
zh_cn: ~:[将下载 ~,1h MB：~%~;~]

source: ~:[The following file will be downloaded:~%~;~]
es: ~:[El archivo siguiente será descargado:~%~;~]
it: ~:[Il seguente file sarà scaricato:~%~;~]
zh_cn: ~:[将下载以下文件：~%~;~]

source: ~:[The following graft will be made:~%~{ ~a~%~}~;~]
es: ~:[Se realizará el siguiente injerto:~%~{ ~a~%~}~;~]
it: ~:[Il seguente innesto sarà fatto:~%~{ ~a~%~}~;~]
zh_cn: ~:[将进行以下嫁接：~%~{ ~a~%~}~;~]

source: ~:[The following profile hook will be built:~%~{ ~a~%~}~;~]
es: ~:[Se construirá la siguiente extensión del perfil:~%~{ ~a~%~}~;~]
it: ~:[Il seguente hook di profilo sarà costruito:~%~{ ~a~%~}~;~]
zh_cn: ~:[将构建以下配置文件钩子：~%~{ ~a~%~}~;~]

source: ~:[~,1h MB will be downloaded~%~;~]
es: ~:[Se descargarán ~,1h MB~%~;~]
it: ~:[~,1h MB saranno scaricati~%~;~]
zh_cn: ~:[将下载 ~,1h MB~%~;~]

source: ~:[~h item will be downloaded~%~;~]
es: ~:[Se descargará ~h elemento~%~;~]
it: ~:[~h oggetto sarà scaricato~%~;~]
zh_cn: ~:[将下载 ~h 项~%~;~]

source: (dependencies or package changed)
es: (las dependencias o el paquete han cambiado)
it: (dipendenze o pacchetto cambiati)
zh_cn: (依赖项或包已更改)

source: The following package would be removed:~%~{~a~%~}~%
es: Se eliminaría el siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente verrebbe rimosso:~%~{~a~%~}~%
zh_cn: 将移除以下包：~%~{~a~%~}~%

source: The following package will be removed:~%~{~a~%~}~%
es: Se eliminará el siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente sarà rimosso:~%~{~a~%~}~%
zh_cn: 将移除以下包：~%~{~a~%~}~%

source: The following package would be downgraded:~%~{~a~%~}~%
es: Se pasaría a una versión previa del siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente verrebbe retrocesso:~%~{~a~%~}~%
zh_cn: 将降级以下包：~%~{~a~%~}~%

source: The following package will be downgraded:~%~{~a~%~}~%
es: Se pasará a una versión previa del siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente sarà retrocesso:~%~{~a~%~}~%
zh_cn: 将降级以下包：~%~{~a~%~}~%

source: The following package would be upgraded:~%~{~a~%~}~%
es: Se actualizaría el siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente verrebbe aggiornato:~%~{~a~%~}~%
zh_cn: 将升级以下包：~%~{~a~%~}~%

source: The following package will be upgraded:~%~{~a~%~}~%
es: Se actualizará el siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente sarà aggiornato:~%~{~a~%~}~%
zh_cn: 将升级以下包：~%~{~a~%~}~%

source: The following package would be installed:~%~{~a~%~}~%
es: Se instalaría el siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente verrebbe installato:~%~{~a~%~}~%
zh_cn: 将安装以下包：~%~{~a~%~}~%

source: The following package will be installed:~%~{~a~%~}~%
es: Se instalará el siguiente paquete:~%~{~a~%~}~%
it: Il pacchetto seguente sarà installato:~%~{~a~%~}~%
zh_cn: 将安装以下包：~%~{~a~%~}~%

source: ~a: invalid Texinfo markup~%
es: ~a: margen de Texinfo no válido~%
it: ~a: markup Texinfo non valido~%

source: executable programs and scripts
es: programas y guiones ejecutables
it: programmi e script eseguibili
zh_cn: 可执行程序和脚本

source: debug information
es: información de depuración
it: informazioni per il debug
zh_cn: 调试信息

source: shared libraries
es: bibliotecas compartidas
it: librerie condivise
zh_cn: 共享库

source: static libraries
es: bibliotecas estáticas
it: librerie statiche
zh_cn: 静态库

source: everything else
es: todo lo demás
it: tutto il resto
zh_cn: 其他所有

source: [description missing]
es: [descripción ausente]
it: [descrizione mancante]
zh_cn: [描述缺失]

source: everything
es: todo
it: tutto
zh_cn: 所有

source: invalid syntax: ~a~%
es: sintaxis inválida: ~a~%
it: sintassi non valida: ~a~%
zh_cn: 无效语法：~a~%

source: Generation ~a ~a
es: Generación ~a ~a
it: Generazione ~a ~a
zh_cn: 第 ~a 代 ~a

source: ~b ~d ~Y ~T
es: ~d ~b ~Y ~T
it: ~d ~b ~Y ~T

source: ~a (current)~%
es: ~a (actual)~%
it: ~a (corrente)~%
zh_cn: ~a (当前)~%

source: cannot lock profile ~a: ~a~%
es: no se puede bloquear el perfil ~a: ~a~%
it: impossibile bloccare il profilo ~a: ~a~%

source: profile ~a is locked by another process~%
es: el perfil '~a' está bloqueado por otro proceso~%
it: il profilo ~a è bloccato da un altro processo~%
zh_cn: 配置文件 ~a 被另一个进程锁定~%

source: switched from generation ~a to ~a~%
es: se pasó de la generación ~a a la ~a~%
it: passati dalla generazione ~a alla ~a~%
zh_cn: 已从第 ~a 代切换到第 ~a 代~%

source: deleting ~a~%
es: borrando ~a~%
it: elimino ~a~%
zh_cn: 正删除 ~a~%

source: Try `guix --help' for more information.~%
es: Pruebe «guix --help» para obtener más información.~%
it: Prova `guix --help' per più informazioni.~%
zh_cn: 请尝试“guix --help”，以获取更多信息。~%

source: Usage: guix OPTION | COMMAND ARGS... Run COMMAND with ARGS, if given.
es: Modo de empleo: guix OPCIÓN | ARGUMENTOS DE COMANDO... Ejecuta COMANDO con ARGUMENTOS, si se dan.
it: Uso: guix OPZIONE | COMANDO ARGOMENTI... Esegui COMANDO con ARGOMENTI, se dati.
zh_cn: 用法：guix OPTION | COMMAND ARGS... 运行命令及其参数（如果有）。

source: -h, --help display this helpful text again and exit
es: -h, --help muestra este texto de ayuda otra vez y sale
it: -h, --help mostra di nuovo questo aiuto ed esce
zh_cn: -h, --help 再次显示此帮助信息并退出

source: -V, --version display version and copyright information and exit
es: -V, --version muestra información de la versión y del copyright y sale
it: -V, --version mostra informazioni su versione e copyright ed esce
zh_cn: -V, --version 显示版本和版权信息并退出

source: COMMAND must be one of the sub-commands listed below:
es: ORDEN debe ser una de las enumeradas a continuación:
it: COMANDO deve essere uno dei sottocomandi elencati di seguito:
zh_cn: 命令必须是以下子命令之一：

source: guix: ~a: command not found~%
es: guix: ~a: orden no encontrada~%
it: guix: ~a: comando non trovato~%
zh_cn: guix：~a：未找到命令~%

source: guix: missing command name~%
es: guix: falta el nombre de la orden~%
it: guix: nome comando mancante~%
zh_cn: guix：缺少命令名称~%

source: guix: unrecognized option '~a'~%
es: guix: opción '~a' no reconocida~%
it: guix: opzione '~a' non riconosciuta~%
zh_cn: guix: 无法识别的选项“~a”~%

source: '~a' phase
es: fase '~a'
it: fase '~a'
zh_cn: '~a' 阶段

source: building directory of Info manuals...
es: construyendo el directorio de manuales Info...
it: costruisco la directory dei manuali Info...
zh_cn: 正在构建 Info 手册目录...

source: building GHC package cache...
es: construyendo caché de paquetes GHC...
it: costruisco la cache dei pacchetti GHC...
zh_cn: 正在构建 GHC 包缓存...

source: building CA certificate bundle...
es: construyendo empaquetado de certificados de CA...
it: costruisco la raccolta dei certificati CA...
zh_cn: 正在构建 CA 证书包...

source: listing Emacs sub-directories...
es: listar los subdirectorios Emacs...
it: elenco le sub-directory Emacs...
zh_cn: 正在列出 Emacs 子目录...

source: generating GdkPixbuf loaders cache...
es: generando cache de cargadores GdkPixbuf...
it: genero la cache dei loader GdkPixbuf...
zh_cn: 正在生成 GdkPixbuf 加载器缓存...

source: generating GLib schema cache...
es: generando la caché de esquemas de GLib...
it: genero la cache degli schema GLib...
zh_cn: 正在生成 GLib 模式缓存...

source: creating GTK+ icon theme cache...
es: creando la caché de temas de iconos de GTK+...
it: creo la cache dei temi icone GTK+...
zh_cn: 正在创建 GTK+ 图标主题缓存...

source: building cache files for GTK+ input methods...
es: construyendo los archivos de caché para los métodos de entrada de GTK+...
it: costruisco la cache di file dei metodi di input GTK+...
zh_cn: 正在构建 GTK+ 输入法缓存文件...

source: building XDG desktop file cache...
es: construyendo la caché de archivos desktop XDG...
it: creo la cache dei file desktop XDG...
zh_cn: 正在构建 XDG 桌面文件缓存...

source: building XDG MIME database...
es: construyendo la base de datos MIME XDG...
it: costruisco il database MIME XDG...
zh_cn: 正在构建 XDG MIME 数据库...

source: building fonts directory...
es: construyendo el directorio de tipografías...
it: costruisco la directory dei font...
zh_cn: 正在构建字体目录...

source: building TeX Live font maps...
es: compilando mapas fuente TeX Live ...
it: costruisco le mappe font di TeX Live...
zh_cn: 正在构建 TeX Live 字体映射...

source: building database for manual pages...
es: construyendo la base de datos de páginas de manual...
it: creo il database delle pagine di manuale...
zh_cn: 正在构建手册页数据库...

source: building package cache...
es: construyendo caché de paquetes...
it: costruisco la cache dei pacchetti...
zh_cn: 正在构建包缓存...

source: applying ~a graft for ~a ...
es: injertando ~a paquete en ~a ...
it: applico ~a innesto per ~a ...
zh_cn: 正在为 ~a 应用嫁接到 ~a ...

source: building profile with ~a package...
es: construyendo perfil con ~a paquete...
it: costruisco il profilo con ~a pacchetto...
zh_cn: 正在使用 ~a 包构建配置文件...

source: running profile hook of type '~a'...
es: ejecutando la extensión del perfil del tipo '~a'...
it: eseguo hook profilo di tipo '~a'...
zh_cn: 正在运行类型为 '~a' 的配置文件钩子...

source: building ~a...
es: construyendo ~a...
it: costruisco ~a...
zh_cn: 正在构建 ~a...

source: successfully built ~a
es: ~a construido satisfactoriamente
it: costruzione di ~a riuscita
zh_cn: 成功构建 ~a

source: The following build is still in progress:~%~{ ~a~%~}~%
es: La siguiente construcción sigue llevandose a cabo:~%~{ ~a~%~}~%
it: La seguente build è ancora in corso:~%~{ ~a~%~}~%
zh_cn: 以下构建仍在进行中：~%~{ ~a~%~}~%
