Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: use the specified compression type for build logs
es: usa el tipo de compresión especificado para los registros de construcción
it: usa il tipo di compressione specificato per i log delle compilazioni
zh_cn: 对构建日志使用指定的压缩类型

source: use substitute servers discovered on the local network
es: usar los servidores sustitutos descubiertos en la red local
it: usa dei server di sostituti trovati nella rete locale
zh_cn: 使用本地网络中发现的替代服务器

source: disable automatic file "deduplication" in the store
es: desactiva la "deduplicación" automática de archivos en el almacén
it: disabilita "deduplicazione" automatica dei file nello store
zh_cn: 禁用自动删除 store 中的重复文件（deduplication）功能

source: impersonate Linux 2.6
es: aparenta Linux 2.6
it: impersona Linux 2.6
zh_cn: 模拟 Linux 2.6

source: tell whether the GC must keep outputs of live derivations
es: determina si la recolección de basura debe mantener las salidas de las derivaciones vivas
it: specifica se il GC deve conservare gli output di derivazioni attive

source: tell whether the GC must keep derivations corresponding to live outputs
es: determina si la recolección de basura debe mantener derivaciones correspondientes a salidas vivas
it: specifica se il GC deve conservare derivazioni che corrispondono a output attivi
zh_cn: 告知垃圾收集器 (GC) 是否必须保留与活动输出相对应的派生

source: listen for connections on SOCKET
es: escucha conexiones en SOCKET
it: resta in ascolto per connessioni su SOCKET
zh_cn: 侦听 <套接字> 上的链接

source: produce debugging output
es: produce salida de depuración
it: produce un output di debug
zh_cn: 生成调试输出

source: do not allow fixed-output chroot builds to access the host loopback
es: No permita que las construcciones chroot de salida fija accedan al bucle invertido del host
it: non consentire alle build chroot con output fisso di accedere al loopback dell'host
zh_cn: 禁止固定输出的 chroot 构建访问主机回环接口

source: socket-activated with %1% socket
es: socket-activado con %1% socket
it: socket-attivato con %1% socket
zh_cn: 通过 %1% 套接字激活

source: Locale
es: Lugar
zh_cn: 区域设置

source: Dump
es: Volcado
zh_cn: 转储

source: Layout
es: Distribución del teclado
zh_cn: 布局

source: OK
es: Aceptar
zh_cn: 确定

source: Ok
es: Aceptar
zh_cn: 确定

source: Password
es: Contraseña
zh_cn: 密码

source: commit ~a~%
es: revisión ~a~%
zh_cn: 提交 ~a~%

source: branch: ~a~%
es: rama: ~a~%
zh_cn: 分支：~a~%

source: commit: ~a~%
es: revisión: ~a~%
zh_cn: 提交：~a~%

source: bootloader: ~a~%
es: cargador de arranque: ~a~%
zh_cn: 引导加载程序：~a~%

source: kernel: ~a~%
es: núcleo: ~a~%
zh_cn: 内核：~a~%

source: repository: ~a~%
es: repositorio: ~a~%
zh_cn: 仓库：~a~%

source: branch: ~a~%
es: rama: ~a~%
zh_cn: 分支：~a~%

source: commit: ~a~%
es: revisión: ~a~%
zh_cn: 提交：~a~%

source: branch: ~a~%
es: rama: ~a~%
zh_cn: 分支：~a~%

source: commit: ~a~%
es: revisión: ~a~%
zh_cn: 提交：~a~%

source: Kernel
zh_cn: 内核

source: DIR
zh_cn: 目录

source: URLS
zh_cn: 网址

source: SOCKET
zh_cn: 套接字
