Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: -h, --help display this help and exit
es: -h, --help muestra este mensaje de ayuda y termina
it: -h, --help mostra questo aiuto ed esce
zh_cn: -h, --help 显示这份说明并退出

source: -r, --recursive generate package expressions for all Emacs packages that are not yet in Guix
es: -r, --recursive genera expresiones de paquete para todos los paquetes Emacs que no estén todavía en Guix
it: -r, --recursive genera espressioni pacchetto per tutti i pacchetti Emacs che non sono ancora in Guix
zh_cn: -r, --recursive 为所有尚未在 Guix 中的 Emacs 包生成包表达式

source: -V, --version display version information and exit
es: -V, --version muestra información de la versión y termina
it: -V, --version mostra informazioni sulla versione ed esce
zh_cn: -V, --version 显示程序版本并退出

source: The following archives are supported:
es: Son admitidos los siguientes archivadores:
it: I seguenti archivi sono supportati:

source: The argument to --archive should be one of these symbols, e.g. gnu (the default).
es: El argumento para --archive sería uno de estos símbolos, p.ej. gnu (el predet.).
it: L'argomento di --archive dovrebbe essere uno di questi simboli, ad es. gnu (il predefinito).
zh_cn: --archive 的参数应为以下符号之一，例如默认的 gnu。

source: this importer does not consider the version~%
es: este importador no considera la versión~%
it: questo importatore non tiene conto della versione~%
zh_cn: 此导入程序不考虑版本~%

source: ~A: currently not supported~%
es: ~A: no soportado actualmente~%
it: ~A: attualmente non supportato~%
zh_cn: ~A: 当前不支持~%

source: ~A: download failed~%
es: ~A: descarga fallida~%
it: ~A: download fallito~%

source: unsupported MELPA fetcher: ~a, falling back to unstable MELPA source~%
es: captador MELPA no soportado: ~a, cayendo a una fuente MELPA inestable~%
it: fetcher MELPA non supportato: ~a, ripiego su fonte MELPA instabile~%
zh_cn: 不支持的 MELPA 获取器：~a，回退到不稳定的 MELPA 源~%

source: Updater for ELPA packages
es: Actualizador para paquetes ELPA
it: Aggiornatore dei pacchetti ELPA
zh_cn: ELPA 包的更新器

source: Usage: guix import gem PACKAGE-NAME[@VERSION] Import and convert the RubyGems package for PACKAGE-NAME. Optionally, a version can be specified after the at-sign (@) character.
es: Modo de empleo: guix import gem PAQUETE-NOMBRE[@VERSIÓN] Importa y convierte el paquete RubyGems para PAQUETE-NOMBRE. Opcionalmente, una versión puede ser especificada tras el carácter arroba (@).
it: Uso: guix import gem NOME-PACCHETTO[@VERSIONE] Importa e converte il pacchetto RubyGems per NOME-PACCHETTO. Opzionalmente, una versione può essere specificata dopo il carattere chiocciola (@).
zh_cn: 用法：guix import gem PACKAGE-NAME[@VERSION] 导入并 转换 PACKAGE-NAME 的 RubyGems 包。可选地，可以在@符号后指定版本。

source: -r, --recursive generate package expressions for all Gem packages that are not yet in Guix
es: -r, --recursive genera expresiones de paquete para todos los paquetes Gem que no estén todavía en Guix
it: -r, --recursive genera espressioni di pacchetto per tutti i pacchetti Gem che non sono ancora in Guix
zh_cn: -r, --recursive 为所有尚未在 Guix 中的 Gem 包生成包表达式

source: no valid tags found
es: no se encuentran etiquetas válidas
it: nessun tag valido trovato
zh_cn: 未找到有效标签

source: no tags were found
es: no se encontraron etiquetas
it: nessun tag trovato
zh_cn: 未找到标签

source: ~a for ~a~%
es: ~a para ~a~%
it: ~a per ~a~%

source: failed to fetch Git repository for ~a~%
es: fallo al recuperar el repositorio de Git para ~a~%
it: impossibile recuperare il repository Git di ~a~%

source: Updater for packages hosted on Git repositories
es: Actualizador para paquetes alojados en repositorios Git
it: Aggiornatore dei pacchetti ospitati in repository Git
zh_cn: 托管在 Git 仓库上的包的更新器

source: GitHub HTTP response lacks 'X-RateLimit-Reset' header~%
es: La respuesta HTTP de GitHub carece de una cabecera 'X-RateLimit-Reset'~%
it: la risposta HTTP di GitHub non contiene l'header 'X-RateLimit-Reset'~%
zh_cn: GitHub HTTP 响应缺少 'X-RateLimit-Reset' 头~%

source: ~a is unreachable (~a)~%
es: ~a es inalcanzable (~a)~%
it: ~a è irraggiungibile (~a)~%
zh_cn: ~a 无法访问 (~a)~%

source: GitHub rate limit exceeded; disallowing requests for ~a seconds~%
es: El límite de intensidad de descarga de GitHub ha sido superado; las peticiones serán rechazadas durante ~a segundos~%
it: limite di velocità di GitHub superato; richieste non permesse per ~a secondi~%
zh_cn: GitHub 速率限制已超出；禁止请求 ~a 秒~%

source: You can raise the rate limit by setting the @env{GUIX_GITHUB_TOKEN} environment variable to a token obtained from @url{https://github.com/settings/tokens} with your GitHub account. Alternatively, you can wait until your rate limit is reset, or use the @code{generic-git} updater instead.
es: Puedes aumentar el límite de intensidad asignando el valor de la variable de entorno @env{GUIX_GITHUB_TOKEN} a un token obtenido usando tu cuenta de GitHub y visitando @url{https://github.com/settings/tokens}. O puedes esperar a que tu límite de intensidad se restablezca, o utilizar el actualizador de @code{generic-git}.
it: Puoi aumentare il limite di velocità impostando nella variabile d'ambiente @env{GUIX_GITHUB_TOKEN} un token ottenuto da @url{https://github.com/settings/tokens} con il tuo account GitHub. In alternativa, puoi aspettare che il limite di velocità sia ripristinato, oppure usare l'aggiornatore @code{generic-git}.
zh_cn: 您可以通过设置 @env{GUIX_GITHUB_TOKEN} 环境变量为从 @url{https://github.com/settings/tokens} 获取的令牌来提高速率限制。 或者，您可以等待直到您的速率限制被重置，或使用 @code{generic-git} 更新器。

source: Updater for GitHub packages
es: Actualizador para paquetes GitHub
it: Aggiornatore dei pacchetti GitHub
zh_cn: GitHub 包的更新器

source: failed to download from '~a': ~a (~s)~%
es: no se pudo descargar desde '~a': ~a (~s)~%
it: impossibile scaricare da '~a': ~a (~s)~%

source: Updater for GNOME packages
es: Actualizador para paquetes GNOME
it: Aggiornatore per pacchetti GNOME
zh_cn: GNOME 包的更新器

source: Usage: guix import gnu [OPTION...] PACKAGE Return a package declaration template for PACKAGE, a GNU package.
es: Modo de empleo: guix import gnu [OPCIÓN...] PAQUETE Devuelve una plantilla de declaración de paquete para PAQUETE, un paquete GNU.
it: Uso: guix import gnu [OPZIONE...] PACCHETTO Restituisce un modello di dichiarazione di pacchetto per PACCHETTO, un pacchetto GNU.

source: --key-download=POLICY handle missing OpenPGP keys according to POLICY: 'auto' (default), 'always', 'never', and 'interactive'
es: --key-download=POLÍTICA gestiona las claves OpenPGP perdidas según POLÍTICA 'auto' (por defecto), 'always', 'never' e 'interactive'
it: --key-download=POLITICA gestisce le chiavi OpenPGP mancanti secondo POLITICA: 'auto' (predefinito), 'always', 'never', e 'interactive'
zh_cn: --key-download=POLICY 根据 POLICY 处理缺失的 OpenPGP 密钥： 'auto'（默认）、'always'、'never'和 'interactive'

source: unsupported policy: ~a~%
es: política no soportada: ~a~%
it: politica non supportata: ~a~%
zh_cn: 不支持的策略：~a~%

source: no GNU package found for ~a
es: no se encontró paquete GNU para ~a
it: nessun pacchetto GNU trovato per ~a

source: failed to determine latest release of GNU ~a
es: fallo al determinar la última versión de GNU ~a
it: impossibile determinare l'ultima versione rilasciata di GNU ~a
zh_cn: 无法确定 GNU ~a 的最新版本

source: Usage: guix import go PACKAGE-PATH[@VERSION] Import and convert the Go module for PACKAGE-PATH. Optionally, a version can be specified after the arobas (@) character.
es: Modo de empleo: guix import go RUTA-PAQUETE[@VERSIÓN] Importa y convierte el módulo Go para RUTA-PAQUETE. Opcionalmente, se puede especificar una versión después del carácter arroba (@).
it: Uso: guix import go PERCORSO-PACCHETTO[@VERSIONE] Importa e converte il modulo Go per PERCORSO-PACCHETTO. Opzionalmente, una versione può essere specificata dopo il carattere chiocciola (@).
zh_cn: 用法：guix import go PACKAGE-PATH[@VERSION] 导入并转换 PACKAGE-PATH 的 Go 模块。可选地，可以在@符号后指定版本。

source: -r, --recursive generate package expressions for all Go modules that are not yet in Guix
es: -r, --recursive genera expresiones de paquete para todos los módulos Go que no están todavía en Guix
it: -r, --recursive genera espressioni pacchetto per tutti i moduli Go che non sono ancora in Guix
zh_cn: -r, --recursive 为所有尚未在 Guix 中的 Go 模块生成包表达式

source: -p, --goproxy=GOPROXY specify which goproxy server to use
es: -p, --goproxy=GOPROXY especifica el servidor goproxy a usar
it: -p, --goproxy=GOPROXY specifica quale server goproxy usare
zh_cn: -p, --goproxy=GOPROXY 指定使用哪个 goproxy 服务器

source: --pin-versions use the exact versions of a module's dependencies
es: --pin-versions utiliza la versión exacta de las dependencias de un módulo
it: --pin-versions usa le versioni esatte delle dipendenze di un modulo
zh_cn: --pin-versions 使用模块依赖的精确版本

source: failed to download meta-data for module '~a'.~%
es: incapaz de descargar los metadatos para el módulo '~a'.~%
it: impossibile scaricare i meta-dati per il modulo '~a'.~%

source: Empty list of versions on proxy ~a for package '~a'. Using latest.~%
es: Listado vacío de versiones en proxy ~a para paquete '~a'. Utilizando la más última.~%
it: Elenco vuoto di versioni sul proxy ~a per il pacchetto '~a'. Utilizzo l'ultima.~%
zh_cn: 代理 ~a 上的包 '~a' 的版本列表为空。使用最新版本。~%

source: No versions available for '~a' on proxy ~a.
es: Ninguna versión disponible para '~a' en proxy ~a.
it: Nessuna versione disponibile per '~a' sul proxy ~a.
zh_cn: 代理 ~a 上的 '~a' 没有可用版本。

source: Unable to determine repository root of '~a'. Guessing '~a'.~%
es: No fue capaz de determinar la raíz del repositorio de '~a'. Adivinando '~a'.~%
it: Impossibile determinare la radice del repository di '~a'. Provo con '~a'.~%

source: no <meta/> element in result when accessing module path '~a' using go-get
es: ningún elemento <meta/> dentro del resultado cuando accede ruta de módulo '~a' utilizando go-get
it: nessun elemento <meta/> nel risultato accedendo al percorso del modulo '~a' usando go-get
zh_cn: 访问模块路径 '~a' 时结果中没有 <meta/> 元素，使用 go-get

source: unable to parse <meta/> when accessing module path '~a' using go-get
es: no es capaz de interpretar <meta/> cuando accede ruta de módulo '~a' utilizando go-get
it: impossibile analizzare <meta/> accedendo al percorso del modulo '~a' usando go-get
zh_cn: 访问模块路径 '~a' 时无法解析 <meta/>，使用 go-get

source: unsupported vcs type '~a' for package '~a'
es: tipo vcs no soportado '~a' para paquete '~a'
it: tipo vcs '~a' non supportato per il pacchetto '~a'
zh_cn: 不支持的 vcs 类型 '~a' 用于包 '~a'

source: version ~a of ~a is not available~%
es: versión ~a de ~a no está disponible~%
it: la versione ~a di ~a non è disponibile~%

source: Pick one of the following available versions:~{ ~a~}.
es: Elija una de las siguientes versiones disponibles:~{ ~a~}.
it: Scegli una delle versioni disponibili seguenti:~{ ~a~}.
zh_cn: 请选择以下可用版本之一：~{ ~a~}。

source: Importing package ~s...~%
es: Importando paquete ~s…~%
it: Importo il pacchetto ~s...~%

source: Failed to import package ~s. reason: ~s could not be fetched: HTTP error ~a (~s). This package and its dependencies won't be imported.~%
es: Fallo al importar paquete ~s. razón: ~s no se pudo recuperar: error HTTP ~a (~s). Este paquete y sus dependencias no se importarán.~%
it: Impossibile importare il pacchetto ~s. ragione: ~s non è recuperabile: errore HTTP ~a (~s). Questo pacchetto e le sue dipendenze non saranno importate.~%
zh_cn: 导入包 ~s 失败。 原因：无法获取 ~s：HTTP 错误 ~a (~s)。 此包及其依赖项将不会被导入。~%

source: Failed to import package ~s. reason: ~a This package and its dependencies won't be imported.~%
es: Fallo al importar paquete ~s. razón: ~a Este paquete y sus dependencias no se importarán.~%
it: Impossibile importare il pacchetto ~s. ragione: ~a Questo pacchetto e le sue dipendenze non saranno importate.~%

source: Usage: guix import hackage PACKAGE-NAME Import and convert the Hackage package for PACKAGE-NAME. If PACKAGE-NAME includes a suffix constituted by a at-sign followed by a numerical version (as used with Guix packages), then a definition for the specified version of the package will be generated. If no version suffix is specified, then the generated package definition will correspond to the latest available version.
es: Modo de empleo: guix import hackage NOMBRE-PAQUETE Importa y convierte el paquete Hackage para NOMBRE-PAQUETE. Si NOMBRE-PAQUETE incluye un sufijo constituido por un signo arroba seguido de un número de versión (como se usa con los paquetes Guix), después será generada una definición para la versión especificada del paquete. Si no se especifica sufijo de versión, entonces la definición del paquete generada corresponderá con la última versión disponible.
it: Uso: guix import hackage NOME-PACCHETTO Importa e converti il pacchetto Hackage che corrisponde a NOME-PACCHETTO. Se NOME-PACCHETTO include un suffisso costituito da una chiocciola seguita da una versione numerica (come si usa nei pacchetti Guix), allora verrà generata una definizione per la versione specificata del pacchetto. Se nessun suffisso versione è specificato, la definizione generata corrisponderà all'ultima versione disponibile.
zh_cn: 用法：guix import hackage PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 Hackage 包。如果 PACKAGE-NAME 包含由 @ 符号后跟数字版本组成的后缀（如 Guix 包中使用），则将生成指定版本的包定义。 如果未指定版本后缀，则生成的包定义将对应于最新可用版本。

source: -e ALIST, --cabal-environment=ALIST specify environment for Cabal evaluation
es: -e ALIST, --cabal-environment=ALIST específica el entorno para una evaluación Cabal
it: -e ALIST, --cabal-environment=ALIST specifica l'ambiente per la valutazione Cabal
zh_cn: -e ALIST, --cabal-environment=ALIST 指定 Cabal 求值环境

source: -h, --help display this help and exit
es: -h, --help muestra este mensaje de ayuda y termina
it: -h, --help mostra questo aiuto ed esce

source: -r, --recursive import packages recursively
es: -r, --recursive importa paquetes recursivamente
it: -r, --recursive importa pacchetti ricorsivamente

source: -s, --stdin read from standard input
es: -s, --stdin lee desde la entrada estándar
it: -s, --stdin leggi dall'input standard

source: -t, --no-test-dependencies don't include test-only dependencies
es: -t, --no-test-dependencies no incluye las dependencias de sólo prueba
it: -t, --no-test-dependencies non include le dipendenze dedicate ai test
zh_cn: -t, --no-test-dependencies 不包含仅用于测试的依赖项

source: -V, --version display version information and exit
es: -V, --version muestra información de la versión y sale
it: -V, --version mostra informazioni sulla versione ed esce

source: failed to import cabal file from standard input~%
es: fallo al importar el archivo cabal desde la entrada estándar~%
it: fallita l'importazione del file cabal dall'input standard~%
zh_cn: 从标准输入导入 cabal 文件失败~%

source: failed to download cabal file for package '~a'~%
es: fallo al descargar el archivo cabal para el paquete '~a'~%
it: fallito il download del file cabal per il pacchetto '~a'~%
zh_cn: 下载包 '~a' 的 cabal 文件失败~%

source: Usage: guix import hexpm PACKAGE-NAME Import and convert the hex.pm package for PACKAGE-NAME.
es: Modo de empleo: guix import hexpm NOMBRE-DE-PAQUETE Importa y convierte el paquete hex.pm para NOMBRE-DE-PAQUETE.
it: Uso: guix import hexpm NOME-PACCHETTO Importa e converti il pacchetto hex.pm corrispondente a NOME-PACCHETTO.
zh_cn: 用法：guix import hexpm PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 hex.pm 包。

source: Usage: guix import json PACKAGE-FILE Import and convert the JSON package definition in PACKAGE-FILE.
es: Modo de empleo: guix import json ARCHIVO-PAQUETE Importa y convierte la definición del paquete JSON en ARCHIVO-PAQUETE.
it: Uso: guix import json FILE-PACCHETTO Importa e converte la definizione del pacchetto JSON in FILE-PACCHETTO.
zh_cn: 用法：guix import json PACKAGE-FILE 导入并转换 PACKAGE-FILE 中的 JSON 包定义。

source: invalid JSON in file '~a'~%
es: JSON no válido en archivo '~a'~%
it: JSON non valido nel file '~a'~%

source: failed to access '~a': ~a~%
es: incorrecto al acceder '~a': ~a~%
it: impossibile accedere a '~a': ~a~%

source: Usage: guix import npm-binary PACKAGE-NAME [VERSION] Import and convert the npm package PACKAGE-NAME using the `node-build-system' (but without building the package from source).
es: Modo de empleo: guix import npm-binary NOMBRE-PAQUETE [VERSIÓN] Importa y convierte paquete npm NOMBRE-PAQUETE utilizando el `node-build-system' (pero sin construir el paquete desde la fuente).
it: Uso: guix import npm-binary NOME-PACCHETTO [VERSIONE] Importa e converte il pacchetto npm NOME-PACCHETTO usando il `node-build-system' (ma senza compilare il pacchetto dal sorgente).
zh_cn: 用法：guix import npm-binary PACKAGE-NAME [VERSION] 使用 `node-build-system` 导入并转换 npm 包 PACKAGE-NAME（但不从源码构建包）。

source: failed to download meta-data for package '~a@~a'~%
es: incorrecto al descargar metadatos para el paquete '~a@~a'~%
it: impossibile scaricare i metadati del pacchetto '~a@~a'~%

source: '~a' is not a valid URI~%
es: '~a' no es una URI válida~%
it: '~a' non è un URI valido~%

source: opam: package '~a' not found~%
es: opam: paquete '~a' no encontrado~%
it: opam: pacchetto '~a' non trovato~%

source: Updater for OPAM packages
es: Actualizador para paquetes OPAM
it: Aggiornatore dei pacchetti OPAM
zh_cn: OPAM 包的更新器

source: Usage: guix import opam PACKAGE-NAME Import and convert the opam package for PACKAGE-NAME.
es: Modo de empleo: guix import opam NOMBRE-DE-PAQUETE Importa y convierte el paquete opam para NOMBRE-DE-PAQUETE.
it: Uso: guix import opam NOME-PACCHETTO Importa e converte il pacchetto opam per NOME-PACCHETTO.
zh_cn: 用法：guix import opam PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 opam 包。

source: --repo=REPOSITORY import packages from REPOSITORY (name, URL, or file name); can be used more than once
es: --repo=REPOSITORIO importar paquetes del REPOSITORIO (nombre, URL o nombre de fichero); puede utilizarse más de una vez
it: --repo=REPOSITORY importa pacchetti da REPOSITORY (nome, URL, o nome file); può essere usato più volte

source: Usage: guix import pypi PACKAGE-NAME Import and convert the PyPI package for PACKAGE-NAME.
es: Modo de empleo: guix import pypi NOMBRE-DE-PAQUETE Importa y convierte el paquete PyPI para NOMBRE-DE-PAQUETE.
it: Uso: guix import pypi NOME-PACCHETTO Importa e converte il pacchetto PyPI per NOME-PACCHETTO.
zh_cn: 用法：guix import pypi PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 PyPI 包。

source: Could not extract requirement name in spec:
es: No se pudo extraer el nombre del requisito en la especificación:
it: Impossibile estrarre il nome del requisito nella spec:
zh_cn: 无法从规范中提取需求名称：

source: parse-requires.txt reached an unexpected condition on line ~a~%
es: parse-requires.txt alcanzó una condición inesperada en la línea ~a~%
it: parse-requires.txt ha raggiunto una condizione inaspettata alla linea ~a~%
zh_cn: parse-requires.txt 在第 ~a 行遇到意外情况~%

source: Failed to extract file: ~a from wheel.~%
es: Fallo al extraer archivo: ~a de la rueda.~%
it: Impossibile estrarre il file: ~a dalla wheel.~%

source: Cannot guess requirements from pyproject.toml file, because it does not exist.~%
es: No se pueden averiguar los requisitos del fichero pyproject.toml ya que no existe.~%
it: Impossibile indovinare i requisiti dal file pyproject.toml, perché non esiste.~%
zh_cn: 无法从 pyproject.toml 文件猜测需求，因为该文件不存在。~%

source: Cannot guess requirements from source archive: no requires.txt file found.~%
es: No puede adivinar los requisitos del archivo fuente: no se encuentra archivo requires.txt.~%
it: Impossibile indovinare i requisiti dall'archivio sorgenti: file requires.txt non trovato.~%
zh_cn: 无法从源代码归档猜测需求：未找到 requires.txt 文件。~%

source: Unsupported archive format; cannot determine package dependencies from source archive: ~a~%
es: Formato de archivo no soportado; no puede determinar las dependencias del paquete desde el archivo fuente: ~a~%
it: Formato archivio non supportato; impossibile determinare le dipendenze del pacchetto dall'archivio sorgenti: ~a~%
zh_cn: 不支持的归档格式；无法从源代码归档确定包依赖：~a~%

source: project name ~a does not appear verbatim in the PyPI URI~%
es: el nombre de proyecto ~a no aparece literal en la PyPI URI~%
it: il nome progetto ~a non appare testualmente nell'URI PyPI~%
zh_cn: 项目名称 ~a 未在 PyPI URI 中逐字出现~%

source: The PyPI URI is: @url{~a}. You should review the pypi-uri declaration in the generated package. You may need to replace ~s with a substring of the PyPI URI that identifies the package.
es: La PyPI URI es: @url{~a}. Debería revisar la declaración de pypi-uri en el paquete generado. Puede que necesite reemplazar ~s con una subcadena de la PyPI URI que identifique el paquete.
it: L'URI di PyPI è: @url{~a}. Dovresti controllare la dichiarazione pypi-uri nel pacchetto generato. Potresti dover sostituire ~s con una sottostringa dell'URI PyPI che identifica il pacchetto.
zh_cn: PyPI URI 是：@url{~a}。您应检查生成包中的 pypi-uri 声明。您可能需要用 PyPI URI 的子字符串替换 ~s 来标识该包。

source: no source release for pypi package ~a ~a~%
es: sin versión de fuente para el paquete pypi ~a ~a~%
it: nessuna release sorgenti per il pacchetto pypi ~a ~a~%
zh_cn: pypi 包 ~a ~a 没有源代码发布~%

source: This indicates that the package is available on PyPI, but only as a "wheel" containing binaries, not source. To build it from source, refer to the upstream repository at @uref{~a}.
es: Esto indica que el paquete está disponible en PyPI, pero solo como "wheel" conteniendo binarios, no la fuente. Para compilar desde la fuente, vaya al repositorio superior en @uref{~a}.
it: Questo indica che il pacchetto è disponibile su PyPI, ma solo come "wheel" contenente i binari e non i sorgenti. Per compilarlo dal sorgente, fai riferimento al repository upstream su @uref{~a}.
zh_cn: 这表明该包在 PyPI 上可用，但仅作为包含二进制文件的“wheel”，而非源码。要从源码构建，请参考上游仓库 @uref{~a}。

source: Updater for PyPI packages
es: Actualizador para paquetes PyPI
it: Aggiornatore dei pacchetti PyPI
zh_cn: PyPI 包的更新器

source: Usage: guix import stackage PACKAGE-NAME Import and convert the LTS Stackage package for PACKAGE-NAME.
es: Modo de empleo: guix import stackage NOMBRE-DE-PAQUETE Importa y convierte el paquete LTS Stackage para NOMBRE-DE-PAQUETE.
it: Uso: guix import stackage NOME-PACCHETTO Importa e converte il pacchetto LTS Stackage per NOME-PACCHETTO.
zh_cn: 用法：guix import stackage PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 LTS Stackage 包。

source: -l VERSION, --lts-version=VERSION specify the LTS version to use
es: -l VERSION, --lts-version=VERSION especifica la versión LTS a usar
it: -l VERSIONE, --lts-version=VERSIONE specifica la versione LTS da usare
zh_cn: -l VERSION, --lts-version=VERSION 指定要使用的 LTS 版本

source: LTS release version not found: ~a
es: Versión de publicación de LTS no encontrada: ~a
it: Versione della release LTS non trovata: ~a
zh_cn: 未找到 LTS 发布版本：~a

source: ~a: Stackage package not found
es: ~a: paquete Stackage no encontrado
it: ~a: pacchetto Stackage non trovato

source: Updater for Stackage LTS packages
es: Actualizador de paquetes Stackage LTS
it: Aggiornatore per pacchetti LTS Stackage
zh_cn: Stackage LTS 包的更新器

source: Usage: guix import texlive PACKAGE-NAME Import and convert the Texlive package for PACKAGE-NAME.
es: Modo de empleo: guix import texlive NOMBRE-DE-PAQUETE Importa y convierte el paquete Texlive para NOMBRE-DE-PAQUETE.
it: Uso: guix import texlive NOME-PACCHETTO Importa e converte il pacchetto Texlive per NOME-PACCHETTO.
zh_cn: 用法：guix import texlive PACKAGE-NAME 导入并转换 PACKAGE-NAME 的 Texlive 包。

source: failed to run command: '~a'
es: incorrecto el ejecutar instrucción: '~a'
it: impossibile eseguire il comando: '~a'

source: Updater for TeX Live packages
es: Actualizador de paquetes TeX Live
it: Aggiornatore dei pacchetti TeX Live
zh_cn: TeX Live 包的更新器

source: The 'system' field is deprecated, please use 'systems' instead.~%
es: El campo 'system' es obsoleto, use en su lugar 'systems'.~%
it: Il campo 'system' è deprecato, per favore usa 'systems' invece.~%
zh_cn: 'system' 字段已弃用，请改用 'systems'。~%
