Repository: Millak/guix
Catalog: po/guix/*.po
Languages: es, it, zh_cn

source: Return a service that extends PAM with entries using @code{pam_kwallet5.so}, unlocking the user's login keyring when they log in or setting its password with @command{passwd}.
es: Devuelve un servicio, que extiende PAM con apuntes utilizando @code{pam_kwallet5.so}, desbloqueando un anillo de acceso de usuario cuando accede o establezca su contraseña con @command{passwd}.
it: Restituisce un servizio che estende PAM con voci usando @code{pam_kwallet5.so}, sbloccando il portachiavi di accesso di un utente quando effettua l'accesso o impostandone la password con il comando {passwd}.
zh_cn: 返回一个使用 @code{pam_kwallet5.so} 条目扩展 PAM 的服务，在用户登录时解锁其登录密钥环或使用 @command{passwd} 设置其密码。

source: Run the KDE Plasma desktop environment.
es: Ejecuta el entorno de escritorio KDE Plasma.
it: Lancia l'ambiente desktop KDE Plasma.
zh_cn: 运行 KDE Plasma 桌面环境。

source: Return a service that runs inputattach on a device and dispatches events from it.
es: Devuelve un servicio que ejecuta inputattach en un dispositivo y despacha eventos desde este.
it: Restituisce un servizio che esegue inputattach su un dispositivo e invia eventi da esso.
zh_cn: 返回一个在设备上运行 inputattach 并分发其事件的服务。

source: seatd: '~a' is not a valid group~%
es: seatd: '~a' no es un grupo válido~%
it: seatd: '~a' non è un gruppo valido~%
zh_cn: seatd: '~a' 为无效的用户组~%

source: Seat management takes care of mediating access to shared devices (graphics, input), without requiring the applications needing access to be root.
es: Gestión de asiento toma en cuanta acceso medio para unidades compartidas (gráficos, entrada) sin requerir las aplicaciones necesitando acceso para ser root.
it: La gestione dei posti si occupa di mediare l'accesso ai dispositivi condivisi (grafica, input), senza richiedere che le applicazioni che necessitano di accesso siano root.
zh_cn: 座位管理负责调解对共享设备（图形、输入）的访问，无需访问应用程序为 root 权限。

source: Run containerd container runtime.
es: Ejecute contenedor contenido en tiempo de ejecución.
it: Lancia il runtime contenitore di containerd.
zh_cn: 运行 containerd 容器运行时。

source: Provide capability to run Docker application bundles in Docker containers.
es: Proporciona capacidad para ejecutar empaquetados de aplicaciones Docker en contenedores Docker.
it: Fornisce la capacità di eseguire bundle di applicazioni Docker nei contenitori Docker.
zh_cn: 提供在 Docker 容器中运行 Docker 应用程序包的能力。

source: Install the Singularity application bundle tool.
es: Instala la herramienta para empaquetar aplicaciones Singularity.
it: Installa lo strumento bundle dell'applicazione Singularity.
zh_cn: 安装 Singularity 应用程序包工具。

source: 'oci-container-service-type' is deprecated, use 'oci-service-type' instead~%
it: 'oci-container-service-type' è obsoleto, utilizzare invece 'oci-service-type'~%

source: This service allows the management of OCI containers as Shepherd services.
es: Este servicio permite la gestión de contenedores OCI como servicios Shepherd.
it: Questo servizio consente la gestione dei container OCI come servizi Shepherd.
zh_cn: 此服务允许将 OCI 容器作为 Shepherd 服务进行管理。

source: salt value must be a string of ~d characters
es: valor de sal debe ser una cadena de ~d caracteres
it: il valore salt deve essere una stringa di ~d caratteri
zh_cn: salt 值必须是长度为 ~d 的字符串

source: Service transmission-daemon has been asked to reload its settings file.
es: El servicio transmission-daemon ha sido solicitado para recargar su archivo de parámetros.
it: È stato chiesto al servizio transmission-daemon di ricaricare il suo file di impostazioni.
zh_cn: 服务 transmission-daemon 已被请求重新加载其设置文件。

source: Service transmission-daemon is not running.
es: El servicio transmission-daemon no está en ejecución.
it: Il servizio transmission-daemon non sta girando.
zh_cn: 服务 transmission-daemon 未运行。

source: Share files using the BitTorrent protocol.
es: Archivos compartidos utilizando protocolo BitTorrent.
it: Condivide file usando il protocollo BitTorrent.
zh_cn: 使用 BitTorrent 协议共享文件。

source: duplicate greeter configurations: ~a~%
es: duplica configuraciones recepcionistas: ~a~%
it: configurazioni di benvenuto duplicate: ~a~%
zh_cn: 重复的登陆管理器配置文件：~a~%

source: no greeter configured for seat greeter sessions: ~a~%
es: ningún recepcionista configurado para sesiones de recepcionista de asiento: ~a~%
it: nessun greeter configurato per le sessioni di benvenuto dei posti: ~a~%
zh_cn: 座位 greeter 会话未配置 greeter：~a~%

source: Run @code{lightdm}, the LightDM graphical login manager.
es: Ejecute @code{lightdm}, el gestor gráfico LightDM de acceso.
it: Lancia @code{lightdm}, il gestore di login grafico LightDM.
zh_cn: 运行 @code{lightdm}，LightDM 图形登录管理器。

source: Run @command{earlyoom}, a daemon that quickly responds to @acronym{OOM, out-of-memory} conditions by terminating relevant processes.
es: Ejecute @command{earlyoom}, un daemon que responda rápidamente a condiciones fuera-de-memoria por terminación de procesos relevantes.
it: Esegui @command{earlyoom}, un demone che risponde rapidamente alle condizioni di @acronym{OOM, out-of-memory} terminando i processi rilevanti.
zh_cn: 运行 @command{earlyoom}，一个通过终止相关进程快速响应 @acronym{OOM, out-of-memory} 条件的守护进程。

source: Discard unused blocks from file systems.
es: Descarta bloques inutilizados desde el sistema de archivos.
it: Scarta i blocchi non usati dai file system.
zh_cn: 丢弃文件系统中未使用的块。

source: Load kernel modules.
es: Cargar módulos del kernel.
it: Carica moduli del kernel.
zh_cn: 加载内核模块。

source: Run the file system cache daemon @command{cachefilesd}, which relies on the Linux @code{cachefiles} module.
es: Ejecute el daemon @command{cachefilesd} de caché del sistema de archivos, el cual confía en el módulo @code{cachefiles} de Linux.
it: Esegui il demone della cache del file system @command{cachefilesd}, che si basa sul modulo Linux @code{cachefiles}.
zh_cn: 运行文件系统缓存守护进程 @command{cachefilesd}，依赖于 Linux @code{cachefiles} 模块。

source: Run @command{rasdaemon}, the RAS monitor
es: Ejecuta @command{rasdaemon}, el monitor RAS
it: Lancia @command{rasdaemon}, il monitore RAS
zh_cn: 运行 @command{rasdaemon}，RAS 监控器

source: using -1 for zram priority is deprecated~%
es: utilizar -1 para prioridad zram está obsoleto~%
it: l'uso di -1 come priorità zram è deprecato~%

source: Use #f or leave as default instead (@pxref{Linux Services}).
es: Utilice #f o déjelo como predeterminado en vez de (vea @ref{Servicios de Linux}).
it: Utilizzare #f oppure lasciare il valore predefinito (@pxref{Linux Services}).
zh_cn: 使用 #f 或保持默认（参见 @pxref{Linux Services}）。

source: Creates a zram swap device.
es: Crea un dispositivo de intercambio zram.
it: Crea un device di swap zram.
zh_cn: 创建一个 zram 交换设备。

source: Share or expose a file name under a different name.
it: Condividere o esporre un nome file con un nome diverso.
zh_cn: 以不同的文件名暴露或共享原文件。

source: Run @command{darkstat} to serve network traffic statistics reports over HTTP.
es: Ejecute @command{darkstat} para estadísticas de tráfico de red del servidor informe sobre HTTP.
it: Esegui @command{darkstat} per fornire report sulle statistiche del traffico di rete tramite HTTP.
zh_cn: 运行 @command{darkstat}，通过 HTTP 提供网络流量统计报告。

source: Run @command{node_exporter} to serve hardware and OS metrics to Prometheus.
es: Ejecute @command{node_exporter} para hardware de servidor y métricas del SO para Prometheus.
it: Esegui @command{node_exporter} per fornire metriche hardware e OS a Prometheus.
zh_cn: 运行 @command{node_exporter}，向 Prometheus 提供硬件和操作系统指标。

source: vnStat network-traffic monitor service.
es: Servicio vnStat para monitor del tráfico de red.
it: Servizio di monitoraggio del traffico di rete vnStat.
zh_cn: vnStat 网络流量监控服务。

source: Run the Zabbix server, a high-performance monitoring system that can collect data about machines from a variety of sources and provide the results in a Web interface.
es: Ejecute el servidor Zabbix, un sistema de monitorización de gran rendimiento que puede recolectar datos sobre máquinas desde una variedad de orígenes y proporciona los resultados en un interfaz Web.
it: Esegui il server Zabbix, un sistema di monitoraggio ad alte prestazioni che può raccogliere dati sulle macchine da una varietà di fonti e fornire i risultati in un'interfaccia Web.
zh_cn: 运行 Zabbix 服务器，一个高性能监控系统，可以从多种来源收集机器数据并通过 Web 界面提供结果。

source: Run the Zabbix agent, @command{zabbix_agentd}, which gathers information about the running system for the Zabbix monitoring server.
es: Ejecute el agente Zabbix, @command{zabbix_agent}, el cual obtiene información sobre el sistema en ejecución para el servidor de monitorización Zabbix.
it: Esegui l'agente Zabbix, @command{zabbix_agentd}, che raccoglie informazioni sul sistema in esecuzione per il server di monitoraggio Zabbix.
zh_cn: 运行 Zabbix 代理 @command{zabbix_agentd}，该代理收集有关运行系统的信息，以供 Zabbix 监控服务器使用。

source: ~a:~a:~a: ~a: Consider using @code{db-secret-file} instead of @code{db-password} for better security.
es: ~a:~a:~a: ~a: Considere utilizar @code{db-secret-file} en vez de @code{db-password} para una mejor seguridad.
it: ~a:~a:~a: ~a: Considera di usare @code{db-secret-file} invece di @code{db-password} per una maggiore sicurezza.
zh_cn: ~a:~a:~a: ~a: 考虑使用 @code{db-secret-file} 代替 @code{db-password} 以提高安全性。

source: Run the zabbix-front-end web interface, which allows users to interact with Zabbix server.
es: Ejecute el interfaz web de zabbix-front-end, el cual permite a los usuarios interactuar con el servidor Zabbix.
it: Esegui l'interfaccia web zabbix-front-end, che consente agli utenti di interagire con il server Zabbix.
zh_cn: 运行 zabbix-front-end 网络界面，允许用户与 Zabbix 服务器进行交互。

source: Add a list of known Facebook hosts to @file{/etc/hosts}
es: Añada un listado de equipos Facebook conocidos a @file{/etc/hosts}
it: Aggiunge una lista di host Facebook conosciuti in @file{/etc/hosts}
zh_cn: 将已知的 Facebook 主机列表添加到 @file{/etc/hosts}

source: 'dhcp-client' service now expects a 'dhcp-client-configuration' record~%
es: Servicio 'dhcp-client' ahora espera un registro de 'dhcp-client-configuration'~%
it: Il servizio 'dhcp-client' ora si aspetta un record 'dhcp-client-configuration'~%
zh_cn: 'dhcp-client' 服务现在期望一个 'dhcp-client-configuration' 记录~%

source: The value associated with instances of @code{dhcp-client-service-type} must now be a @code{dhcp-client-configuration} record instead of a package. Please adjust your configuration accordingly.
es: El valor asociado de instancias de @code{dhcp-client-service-type} ahora debe ser un registro de @code{dhcp-client-configuration} en vez de un paquete. Ajuste su configuración respectivamente.
it: Il valore associato alle istanze di @code{dhcp-client-service-type} deve ora essere un record @code{dhcp-client-configuration} invece di un pacchetto. Adatta la tua configurazione di conseguenza per favore.
zh_cn: 与 @code{dhcp-client-service-type} 实例关联的值现在必须是 @code{dhcp-client-configuration} 记录，而不是一个软件包。请相应地调整您的配置。

source: Run @command{dhcp}, a Dynamic Host Configuration Protocol (DHCP) client, on all the non-loopback network interfaces. This services is deprecated as ISC's DHCP client reached its end-of-life.
es: Ejecute @command{dhcp}, un cliente del Protocolo de configuración dinámica de host (DHCP), en todas las interfaces de red que no sean de bucle invertido. Este servicio está obsoleto como cliente DHCP de ISC alcanzado su final de vida.
it: Esegue @command{dhcp}, un client per Dynamic Host Configuration Protocol (DHCP), su tutte le interfacce di rete che non siano loopback. Questo servizio è deprecato in quanto il client DHCP di ISC ha raggiunto la fine del suo ciclo di vita.
zh_cn: 在所有非回环网络接口上配置 @command{dhcp}，一个动态主机配置协议 (DHCP) 客户端。 该服务已弃用，因ISC的DHCP客户端已达到其生命周期终止。

source: Run a DHCP (Dynamic Host Configuration Protocol) daemon. The daemon is responsible for allocating IP addresses to its client.
es: Ejecutar un servicio DHCP (Dynamic Host Configuration Protocol). El proceso es responsable de asignar direcciones IP a sus clientes.
it: Esegue un demone DHCP (Dynamic Host Configuration Protocol). Il demone è responsabile dell'assegnazione di indirizzi IP ai suoi client.
zh_cn: 运行 DHCP（动态主机配置协议）守护进程。该守护进程负责为其客户端分配 IP 地址。

source: Run the dhcpcd daemon.
es: Ejecute el daemon dhcpcd.
it: Eseguire il demone dhcpcd.
zh_cn: 运行 dhcpcd 守护进程。

source: Run the @command{ntpd}, the Network Time Protocol (NTP) daemon of the @uref{http://www.ntp.org, Network Time Foundation}. The daemon will keep the system clock synchronized with that of the given servers.
es: Ejecuta el @command{ntpd}, el daemon Network Time Protocol (NTP) del @uref{http://www.ntp.org, Network Time Foundation}. El daemon conservará el reloj del sistema sincronizado con ese de los servidores dados.
it: Esegue @command{ntpd}, il demone NTP (Network Time Protocol) di @uref{http://www.ntp.org, Network Time Foundation}. Il demone manterrà l'orologio del sistema sincronizzato con quello dei server indicati.
zh_cn: 运行 @command{ntpd}，网络时间协议 (NTP) 守护进程，来自 @uref{http://www.ntp.org, 网络时间基金会}。该守护进程将保持系统时钟与给定服务器的时钟同步。

source: Run the @command{ntpd}, the Network Time Protocol (NTP) daemon, as implemented by @uref{http://www.openntpd.org, OpenNTPD}. The daemon will keep the system clock synchronized with that of the given servers.
es: Ejecute @command{ntpd}, el dæmon del protocolo de tiempo en red (NTP), implementado por @uref{http://www.openntpd.org, OpenNTPD}. El dæmon mantendrá el reloj del sistema sincronizado con el de los servidores proporcionados.
it: Esegue @command{ntpd}, il demone Network Time Protocol (NTP) come implementato da @uref{http://www.openntpd.org, OpenNTPD}. Il demone manterrà l'orologio del sistema sincronizzato con quello dei server indicati.
zh_cn: 运行 @command{ntpd}，网络时间协议 (NTP) 守护进程，由 @uref{http://www.openntpd.org, OpenNTPD} 实现。该守护进程将保持系统时钟与给定服务器的时钟同步。

source: Start @command{inetd}, the @dfn{Internet superserver}. It is responsible for listening on Internet sockets and spawning the corresponding services on demand.
es: Inicia @command{inetd}, el @dfn{superservidor de Internet}. Es responsable de extraer un listado en los sockets de Internet y desplegar los servicios que correspondan en la demanda.
it: Avvia @command{inetd}, il @dfn{super server Internet}. È responsabile di ascoltare i socket Internet e di lanciare i servizi corrispondenti su richiesta.
zh_cn: 启动 @command{inetd}，@dfn{Internet superserver}。它负责监听互联网套接字并按需生成相应的服务。

source: Run the OpenDHT @command{dhtnode} command that allows participating in the distributed hash table based OpenDHT network. The service can be configured to act as a proxy to the distributed network, which can be useful for portable devices where minimizing energy consumption is paramount. OpenDHT was originally based on Kademlia and adapted for applications in communication. It is used by Jami, for example.
es: Ejecuta la instrucción @command{dhtnode} de OpenDHT que permite participar dentro de la tabla hash distribuida basada en la red OpenDHT. El servicio puede ser configurado para actuar como un proxy para la red distribuida, la cual puede ser útil para dispositivos portátiles donde minimiza consumo de energía es supremo. OpenDHT originalmente estaba basado en Kademlia y adaptado para aplicaciones en comunicación. Es utilizado por Jami, por ejemplo.
it: Esegue il comando OpenDHT @command{dhtnode} che permette di partecipare alla rete OpenDHT basata su tabelle hash distribuite. Il servizio può essere configurato per agire come un proxy della rete distribuita, il che può essere utile per i dispositivi portatili in cui la minimizzazione del consumo di energia è fondamentale. OpenDHT è basato in origine su Kademlia ed è stato adattato per applicazioni di comunicazione. È utilizzato, ad esempio, da Jami.
zh_cn: 运行 OpenDHT @command{dhtnode} 命令，允许参与基于分布式哈希表的 OpenDHT 网络。该服务可以配置为充当分布式网络的代理，这对于需要最小化能耗的便携设备非常有用。OpenDHT 最初基于 Kademlia，并适用于通信应用。例如，Jami 就使用了它。

source: Run the @uref{https://torproject.org, Tor} anonymous networking daemon.
es: Ejecute el daemon @uref{https://torproject.org, Tor} para red anónima.
it: Esegue il demone @uref{https://torproject.org, Tor} per la creazione di reti anonime.
zh_cn: 运行 @uref{https://torproject.org, Tor} 匿名网络守护进程。

source: the 'iwd?' field is deprecated, please use 'shepherd-requirement' field instead~%
es: el campo 'iwd?' está obsoleto, por favor use el campo 'shepherd-requirement' en su lugar~%
it: il campo 'iwd?' è deprecato, per favore usa 'shepherd-requirement' al suo posto~%
zh_cn: 'iwd?' 字段已被弃用，请改用 'shepherd-requirement' 字段~%

source: Run @uref{https://wiki.gnome.org/Projects/NetworkManager, NetworkManager}, a network management daemon that aims to simplify wired and wireless networking.
es: Ejecute @uref{https://wiki.gnome.org/Projects/NetworkManager, NetworkManager}, un daemon de gestión de red que intenta simplificar redes cableadas o sin cableado.
it: Esegue @uref{https://wiki.gnome.org/Projects/NetworkManager, NetworkManager}, un demone di gestione della rete che ha lo scopo di semplificare l'uso di reti wireless e cablate.
zh_cn: 运行 @uref{https://wiki.gnome.org/Projects/NetworkManager, NetworkManager}，一个旨在简化有线和无线网络管理的网络管理守护进程。

source: Run @url{https://01.org/connman,Connman}, a network connection manager.
es: Ejecute @url{https://01.org/connman,Connman}, un administrador de conexiones de redes.
it: Esegue @url{https://01.org/connman,Connman}, un gestore di connessioni di rete.
zh_cn: 运行 @url{https://01.org/connman,Connman}，一个网络连接管理器。

source: Run @uref{https://wiki.gnome.org/Projects/ModemManager, ModemManager}, a modem management daemon that aims to simplify dialup networking.
es: Ejecute @uref{https://wiki.gnome.org/Projects/ModemManager, ModemManager}, un daemon de gestión de módem que intenta simplificar redes de llamadas telefónicas por red.
it: Esegue @uref{https://wiki.gnome.org/Projects/ModemManager, ModemManager}, un demone di gestione del modem che ha lo scopo di semplificare l'accesso di rete in dialup.
zh_cn: 运行 @uref{https://wiki.gnome.org/Projects/ModemManager, ModemManager}，一个旨在简化拨号网络的调制解调器管理守护进程。

source: Run @uref{http://www.draisberghof.de/usb_modeswitch/, USB_ModeSwitch}, a mode switching tool for controlling USB devices with multiple @dfn{modes}. When plugged in for the first time many USB devices (primarily high-speed WAN modems) act like a flash storage containing installers for Windows drivers. USB_ModeSwitch replays the sequence the Windows drivers would send to switch their mode from storage to modem (or whatever the thing is supposed to do).
es: Ejecute @uref{http://www.draisberghof.de/usb_modeswitch/, USB_ModeSwitch}, una herramienta de cambio de modo para controlar dispositivos USB con múltiples @dfn{modos}. Cunado conecte por primera vez muchos dispositivos USB (primariamente módems WAN de alta velocidad) actúan como un almacén flash conteniendo instaladores para controladores de dispositivo de Windows. USB_ModeSwitch recoloca la secuencia the de controladores de Windows enviarían para seleccionar su modo para almacén a módem (o lo que sea la cosa se supone para hacer).
it: Esegue @uref{http://www.draisberghof.de/usb_modeswitch/, USB_ModeSwitch}, uno strumento di commutazione di modalità per il controllo di dispositivi USB con più @dfn{modes}. Quando vengono collegati per la prima volta, molti dispositivi USB (soprattutto modem WAN ad alta velocità) si comportano come una memoria flash contenente installatori per driver di Windows. USB_ModeSwitch riproduce la sequenza che i driver di Windows invierebbero per passare dalla modalità di memorizzazione a quella modem (o qualunque altra prevista per il dispositivo).
zh_cn: 运行 @uref{http://www.draisberghof.de/usb_modeswitch/, USB_ModeSwitch}，一个用于控制具有多种 @dfn{modes} 的 USB 设备的模式切换工具。许多 USB 设备（主要是高速 WAN 调制解调器）首次插入时表现得像包含 Windows 驱动程序安装程序的闪存存储。USB_ModeSwitch 会重放 Windows 驱动程序发送的序列，将其模式从存储切换到调制解调器（或设备应执行的其他模式）。

source: the 'requirement' field is deprecated, please use 'shepherd-requirement' field instead~%
es: el campo 'requirement' está obsoleto, utilice el campo 'shepherd-requirement' en su lugar~%
it: il campo 'requirement' è deprecato, per favore usa 'shepherd-requirement' al suo posto~%
zh_cn: 'requirement' 字段已被弃用，请改用 'shepherd-requirement' 字段~%

source: Run the WPA Supplicant daemon, a service that implements authentication, key negotiation and more for wireless networks.
es: Ejecute el daemon WPA Supplicant, un servicio que implementa autenticación, negociación de clave y más para red sin cable.
it: Esegue il demone WPA Supplicant, un servizio che implementa l'autenticazione, la negoziazione delle chiavi e altro ancora per le reti wireless.
zh_cn: 运行 WPA Supplicant 守护进程，一个实现无线网络认证、密钥协商等功能的服务。

source: Run the iNet Wireless Daemon, @url{https://iwd.wiki.kernel.org/,iwd}, a network connection manager.
es: Ejecute el Demonio iNet sin cable, @url{https://iwd.wiki.kernel.org/,iwd}, un administrador de conexiones de red.
it: Esegue iNet Wireless Daemon, @url{https://iwd.wiki.kernel.org/,iwd}, un gestore di connessioni di rete.
zh_cn: 运行 iNet 无线网络守护进程， @url{https://iwd.wiki.kernel.org/,iwd}，一款网络连接管理器。

source: Run the @uref{https://w1.fi/hostapd/, hostapd} daemon for Wi-Fi access points and authentication servers.
es: Ejecute el daemon @uref{https://w1.fi/hostapd/, hostapd} para puntos de acceso Wi-Fi y servidores de autenticación.
it: Esegue il demone @uref{https://w1.fi/hostapd/, hostapd} per i punti di accesso Wi-Fi e i server di autenticazione.
zh_cn: 运行 @uref{https://w1.fi/hostapd/, hostapd} 守护进程，用于 Wi-Fi 接入点和认证服务器。

source: Run hostapd to simulate WiFi connectivity.
es: Ejecute hostapd para simular conectividad Wi-Fi.
it: Esegue hostapd per simulare la connettività WiFi.
zh_cn: 运行 hostapd 以模拟 WiFi 连接。

source: Run @uref{http://www.openvswitch.org, Open vSwitch}, a multilayer virtual switch designed to enable massive network automation through programmatic extension.
es: Ejecute @uref{http://www.openvswitch.org, Open vSwitch}, un switch virtual de multicapa diseñado para activar automatización de red masiva a través de extensión programable.
it: Esegue @uref{http://www.openvswitch.org, Open vSwitch}, uno switch virtuale multilayer progettato per consentire un'automazione di rete massiccia attraverso l'estensione programmatica.
zh_cn: 运行 @uref{http://www.openvswitch.org, Open vSwitch}，一个多层虚拟交换机，旨在通过程序扩展实现大规模网络自动化。

source: Run @command{iptables-restore}, setting up the specified rules.
es: Ejecute @command{iptables-restore}, configurando las reglas especificadas.
it: Esegue @command{iptables-restore}, impostando le regole specificate.
zh_cn: 运行 @command{iptables-restore}，设置指定的规则。

source: Run @command{nft}, setting up the specified ruleset.
es: Ejecute @command{nft}, configurando el conjunto de reglas especificadas.
it: Esegue @command{nft}, impostando il set di regole specificato.
zh_cn: 运行 @command{nft}，设置指定的规则集。

source: Run @url{https://pagekite.net/,PageKite}, a tunneling solution to make local servers publicly accessible on the web, even behind NATs and firewalls.
es: Ejecute @url{https://pagekite.net/,PageKite}, una solución de túnel para hacer que los servidores locales sean públicamente accesibles en la web, incluso detrás de los NAT y cortafuegos.
it: Esegue @url{https://pagekite.net/,PageKite}, una soluzione di tunneling per rendere server locali pubblicamente accessibili sul web, anche dietro NAT e firewall.
zh_cn: 运行 @url{https://pagekite.net/,PageKite}，一种隧道解决方案，使本地服务器即使在 NAT 和防火墙后也能公开访问网络。

source: Connect to the Yggdrasil mesh network. See @command{yggdrasil -genconf} for config options.
es: Conecte a la red mesh Yggdrasil. Consulte @command{yggdrasil -genconf} para opciones de configuración.
it: Connette alla rete mesh Yggdrasil. Vedi @command{yggdrasil -genconf} per le opzioni di configurazione.
zh_cn: 连接到 Yggdrasil 网状网络。有关配置选项，请参见 @command{yggdrasil -genconf}。
