Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: @command{audio-to-midi} converts audio files to multichannel MIDI files. It accomplishes this by performing FFTs on all channels of the audio data at user-specified time steps. It then separates the resulting frequency analysis into equivalence classes which correspond to the twelve tone scale; the volume of each class being the average volume of its constituent frequencies. This data is then formatted to MIDI and written to disk.
it: @command{audio-to-midi} converte i file audio in file MIDI multicanale. Questo risultato viene ottenuto eseguendo delle FFT su tutti i canali dei dati audio a intervalli di tempo specificati dall'utente. Separa quindi l'analisi di frequenza risultante in classi di equivalenza che corrispondono alla scala dodecafonica; il volume di ogni classe è il volume medio delle sue frequenze costituenti. Questi dati vengono quindi formattati in MIDI e scritti su disco.

source: Library to simplify use of LV2 plugins in applications
it: Libreria per semplificare l'uso dei plugin LV2 nelle applicazioni

source: Lilv is a C library to make the use of LV2 plugins as simple as possible for applications. Lilv is the successor to SLV2, rewritten to be significantly faster and have minimal dependencies.
it: Lilv è una libreria C per rendere l'uso dei plugin LV2 il più semplice possibile per le applicazioni. Lilv è il successore di SLV2, riscritto per essere significativamente più veloce e avere dipendenze minime.

source: LV2 audio plugin specification
it: Specifica dei plugin audio LV2

source: LV2 is an open specification for audio plugins and host applications. At its core, LV2 is a simple stable interface, accompanied by extensions which add functionality to support the needs of increasingly powerful audio software.
it: LV2 è una specifica aperta per plugin audio e applicazioni host. Al suo nucleo, LV2 è un'interfaccia semplice e stabile, accompagnata da estensioni che aggiungono funzionalità per supportare le esigenze di software audio sempre più potenti.

source: Turtle to C header conversion utility for LV2 plugins
it: Utilità di conversione da Turtle a intestazione C per plugin LV2

source: This package provides a conversion utility for LV2 Plugin developers to generate C headers from Turtle files.
it: Questo pacchetto fornisce un'utilità di conversione per gli sviluppatori di plugin LV2 per generare intestazioni C da file Turtle.

source: LV2 port of the mda Piano plugin
it: Port LV2 del plugin mda Piano

source: An LV2 port of the mda Piano VSTi.
it: Un port LV2 del VSTi mda Piano.

source: LV2 port of the mda EPiano plugin
it: Port LV2 del plugin mda EPiano

source: An LV2 port of the mda EPiano VSTi.
it: Un port LV2 del VSTi mda EPiano.

source: C++ libraries for LV2 plugins
it: Librerie C++ per plugin LV2

source: The LV2 Toolkit (LVTK) contains libraries that wrap the LV2 C API and extensions into easy to use C++ classes. It is the successor of lv2-c++-tools.
it: Il LV2 Toolkit (LVTK) contiene librerie che avvolgono l'API C di LV2 e le sue estensioni in classi C++ facili da usare. È il successore di lv2-c++-tools.

source: 3D audio API
it: API audio 3D

source: OpenAL provides capabilities for playing audio in a virtual 3D environment. Distance attenuation, doppler shift, and directional sound emitters are among the features handled by the API. More advanced effects, including air absorption, occlusion, and environmental reverb, are available through the EFX extension. It also facilitates streaming audio, multi-channel buffers, and audio capture.
it: OpenAL fornisce funzionalità per la riproduzione di audio in un ambiente virtuale 3D. L'attenuazione della distanza, l'effetto Doppler e gli emettitori sonori direzionali sono tra le caratteristiche gestite dall'API. Effetti più avanzati, tra cui l'assorbimento dell'aria, l'occlusione e il riverbero ambientale, sono disponibili attraverso l'estensione EFX. Facilita anche lo streaming audio, i buffer multicanale e la cattura audio.

source: Free implementation of OpenAL's ALUT standard
it: Implementazione libera dello standard ALUT di OpenAL
sv: Fri implementation av OpenAL:s ALUT-standard

source: freealut is the OpenAL Utility Toolkit.
it: freealut è il toolkit di utilità di OpenAL.

source: OpenAL utility library
it: Libreria di utilità OpenAL

source: ALURE is a utility library to help manage common tasks with OpenAL applications. This includes device enumeration and initialization, file loading, and streaming.
it: ALURE è una libreria di utilità per aiutare a gestire compiti comuni con le applicazioni OpenAL. Questo include l'enumerazione e l'inizializzazione dei dispositivi, il caricamento dei file e lo streaming.

source: PulseAudio or PipeWire volume notification
it: Notifica del volume di PulseAudio o PipeWire

source: The pa-notify daemon sends notifications about the current volume level of PulseAudio or PipeWire using libnotify.
it: Il daemon pa-notify invia notifiche sul livello di volume corrente di PulseAudio o PipeWire utilizzando libnotify.

source: Modular patch bay for audio and MIDI systems
it: Patch bay modulare per sistemi audio e MIDI

source: Patchage is a modular patch bay for audio and MIDI systems based on JACK and ALSA.
it: Patchage è una patch bay modulare per sistemi audio e MIDI basata su JACK e ALSA.

source: Portable C audio library
it: Libreria audio C portatile
sv: Ljudbibliotek för Portable C

source: The Portable C Audio Library (pcaudiolib) provides a C@tie{}API to different audio devices such as ALSA or PulseAudio.
it: La Portable C Audio Library (pcaudiolib) fornisce un'API C per diversi dispositivi audio come ALSA o PulseAudio.

source: Jack server control application
it: Applicazione di controllo del server Jack

source: Control a Jack server. Allows you to plug various sources into various outputs and to start, stop and configure jackd
it: Controlla un server Jack. Consente di collegare varie sorgenti a varie uscite e di avviare, arrestare e configurare jackd

source: Stereo audio recorder for JACK
it: Registratore audio stereo per JACK

source: QJackRcd is a simple graphical stereo recorder for JACK supporting silence processing for automatic pause, file splitting, and background file post-processing.
it: QJackRcd è un semplice registratore stereo grafico per JACK che supporta l'elaborazione del silenzio per la pausa automatica, la divisione dei file e la post-elaborazione dei file in background.

source: Synthesis engine and programming language
it: Motore di sintesi e linguaggio di programmazione

source: SuperCollider is a synthesis engine (@code{scsynth} or @code{supernova}) and programming language (@code{sclang}). It can be used for experimenting with sound synthesis and algorithmic composition. SuperCollider requires jackd to be installed in your user profile and your user must be allowed to access the realtime features of the kernel. Search for "realtime" in the index of the Guix manual to learn how to achieve this using Guix System.
it: SuperCollider è un motore di sintesi (@code{scsynth} o @code{supernova}) e un linguaggio di programmazione (@code{sclang}). Può essere utilizzato per sperimentare la sintesi sonora e la composizione algoritmica. SuperCollider richiede che jackd sia installato nel profilo utente e che l'utente sia autorizzato ad accedere alle funzionalità in tempo reale del kernel. Cerca "realtime" nell'indice del manuale di Guix per imparare come ottenere questo risultato utilizzando il sistema Guix.

source: Broadcast streaming library with IDJC extensions
it: Libreria di streaming broadcast con estensioni IDJC

source: This package provides libshout plus IDJC extensions.
it: Questo pacchetto fornisce libshout più le estensioni IDJC.

source: Low-level CD/DVD dumper
it: Dumper a basso livello di CD/DVD

source: @command{redumper} is a low-level byte perfect CD disc dumper. It supports incremental dumps, advanced SCSI/C2 repair, intelligent audio CD offset detection, among other features. @command{redumper} is also a general purpose DVD/HD-DVD/Blu-ray disc dumper.
it: @command{redumper} è un dumper di dischi CD a basso livello, byte-perfect. Supporta dump incrementali, riparazione avanzata SCSI/C2, rilevamento intelligente dell'offset dei CD audio, tra le altre caratteristiche. @command{redumper} è anche un dumper generico per dischi DVD/HD-DVD/Blu-ray.

source: Sampling rate conversion and filter design utilities
it: Utilità di conversione della frequenza di campionamento e progettazione di filtri

source: This package contains the @command{resample} and @command{windowfilter} command line utilities. The @command{resample} command allows changing the sampling rate of a sound file, while the @command{windowfilter} command allows designing Finite Impulse Response (FIR) filters using the so-called @emph{window method}.
it: Questo pacchetto contiene le utilità da riga di comando @command{resample} e @command{windowfilter}. Il comando @command{resample} consente di modificare la frequenza di campionamento di un file audio, mentre il comando @command{windowfilter} consente di progettare filtri a Risposta all'Impulso Finita (FIR) utilizzando il cosiddetto @emph{metodo delle finestre}.

source: Audio time-stretching and pitch-shifting library
it: Libreria di time-stretching e pitch-shifting audio

source: Rubber Band is a library and utility program that permits changing the tempo and pitch of an audio recording independently of one another.
it: Rubber Band è una libreria e un programma di utilità che consente di modificare il tempo e l'intonazione di una registrazione audio indipendentemente l'uno dall'altro.

source: Cross-platform MIDI library for C++
it: Libreria MIDI multipiattaforma per C++

source: RtMidi is a set of C++ classes (RtMidiIn, RtMidiOut, and API specific classes) that provide a common cross-platform API for realtime MIDI input/output.
it: RtMidi è un insieme di classi C++ (RtMidiIn, RtMidiOut e classi specifiche API) che forniscono un'API comune multipiattaforma per l'input/output MIDI in tempo reale.

source: Library for serialising LV2 atoms to/from RDF
it: Libreria per la serializzazione di atomi LV2 da/verso RDF

source: Sratom is a library for serialising LV2 atoms to/from RDF, particularly the Turtle syntax.
it: Sratom è una libreria per la serializzazione di atomi LV2 da/verso RDF, in particolare la sintassi Turtle.

source: Library for loading and wrapping LV2 plugin UIs
it: Libreria per il caricamento e l'incapsulamento di interfacce utente di plugin LV2

source: Suil is a lightweight C library for loading and wrapping LV2 plugin UIs. Suil makes it possible to load a UI of a toolkit in a host using another toolkit. The API is designed such that hosts do not need to explicitly support specific toolkits – if Suil supports a particular toolkit, then UIs in that toolkit will work in all hosts that use Suil automatically. Suil currently supports every combination of Gtk, Qt, and X11.
it: Suil è una libreria C leggera per il caricamento e l'incapsulamento di interfacce utente di plugin LV2. Suil rende possibile caricare un'interfaccia utente di un toolkit in un host che utilizza un altro toolkit. L'API è progettata in modo che gli host non debbano supportare esplicitamente toolkit specifici: se Suil supporta un particolare toolkit, le interfacce utente in quel toolkit funzioneranno automaticamente in tutti gli host che utilizzano Suil. Suil supporta attualmente ogni combinazione di Gtk, Qt e X11.

source: Library implementing the EBU R 128 loudness standard
it: Libreria che implementa lo standard di loudness EBU R 128

source: @code{libebur128} is a C library that implements the EBU R 128 standard for loudness normalisation.
it: @code{libebur128} è una libreria C che implementa lo standard EBU R 128 per la normalizzazione del loudness.

source: Software synthesizer for playing MIDI files
it: Sintetizzatore software per la riproduzione di file MIDI

source: TiMidity++ is a software synthesizer. It can play MIDI files by converting them into PCM waveform data; give it a MIDI data along with digital instrument data files, then it synthesizes them in real-time, and plays. It can not only play sounds, but also can save the generated waveforms into hard disks as various audio file formats.
it: TiMidity++ è un sintetizzatore software. Può riprodurre file MIDI convertendoli in dati di forma d'onda PCM; fornendogli dati MIDI insieme a file di dati di strumenti digitali, li sintetizza in tempo reale e li riproduce. Può non solo riprodurre suoni, ma anche salvare le forme d'onda generate su disco rigido in vari formati di file audio.

source: Modular and extensible audio processing system
it: Sistema di elaborazione audio modulare ed estensibile

source: Vamp is an audio processing plugin system for plugins that extract descriptive information from audio data — typically referred to as audio analysis plugins or audio feature extraction plugins.
it: Vamp è un sistema di plugin per l'elaborazione audio per plugin che estraggono informazioni descrittive dai dati audio, tipicamente indicati come plugin di analisi audio o plugin di estrazione di caratteristiche audio.

source: Library for time stretching and pitch scaling of audio
it: Libreria per il time-stretching e il pitch-scaling dell'audio

source: SBSMS (Subband Sinusoidal Modeling Synthesis) is software for time stretching and pitch scaling of audio. This package contains the library.
it: SBSMS (Subband Sinusoidal Modeling Synthesis) è un software per il time-stretching e il pitch-scaling dell'audio. Questo pacchetto contiene la libreria.

source: Musical key detection for digital audio
it: Rilevamento della tonalità musicale per l'audio digitale

source: @code{libkeyfinder} is a small C++11 library for estimating the musical key of digital audio.
it: @code{libkeyfinder} è una piccola libreria C++11 per la stima della tonalità musicale dell'audio digitale.

source: Hybrid lossless audio codec
it: Codec audio lossless ibrido

source: WavPack is an audio compression format with lossless, lossy and hybrid compression modes. This package contains command-line programs and library to encode and decode wavpack files.
it: WavPack è un formato di compressione audio con modalità di compressione lossless, lossy e ibrida. Questo pacchetto contiene programmi da riga di comando e libreria per codificare e decodificare file wavpack.

source: Low-level audio mixer pipeline library
it: Libreria di pipeline per mixer audio a basso livello

source: Libmixed is a library for real-time audio processing pipelines for use in audio/video/games. It can serve as a base architecture for complex DSP systems.
it: Libmixed è una libreria per pipeline di elaborazione audio in tempo reale da utilizzare in applicazioni audio/video/giochi. Può servire come architettura di base per sistemi DSP complessi.

source: Mod file playing library
it: Libreria per la riproduzione di file mod

source: Libmodplug renders mod music files as raw audio data, for playing or conversion. mod, .s3m, .it, .xm, and a number of lesser-known formats are supported. Optional features include high-quality resampling, bass expansion, surround and reverb.
it: Libmodplug esegue il rendering dei file musicali mod come dati audio grezzi, per la riproduzione o la conversione. Sono supportati i formati mod, .s3m, .it, .xm e un numero di formati meno noti. Le funzionalità opzionali includono ricampionamento di alta qualità, espansione dei bassi, surround e riverbero.

source: Module player library
it: Libreria lettore di moduli musicali

source: Libxmp is a library that renders module files to PCM data. It supports over 90 mainstream and obscure module formats including Protracker (MOD), Scream Tracker 3 (S3M), Fast Tracker II (XM), and Impulse Tracker (IT).
it: Libxmp è una libreria che esegue il rendering dei file modulo in dati PCM. Supporta oltre 90 formati di moduli musicali tradizionali e oscuri, tra cui Protracker (MOD), Scream Tracker 3 (S3M), Fast Tracker II (XM) e Impulse Tracker (IT).

source: Extended module player
it: Lettore di moduli esteso

source: Xmp is a portable module player that plays over 90 mainstream and obscure module formats, including Protracker MOD, Fasttracker II XM, Scream Tracker 3 S3M and Impulse Tracker IT files.
it: Xmp è un lettore di moduli portatile che riproduce oltre 90 formati di moduli tradizionali e oscuri, inclusi i file Protracker MOD, Fasttracker II XM, Scream Tracker 3 S3M e Impulse Tracker IT.

source: Audio processing library for changing tempo, pitch and playback rate
it: Libreria di elaborazione audio per modificare tempo, intonazione e velocità di riproduzione

source: SoundTouch is an audio processing library for changing the tempo, pitch and playback rates of audio streams or audio files. It is intended for application developers writing sound processing tools that require tempo/pitch control functionality, or just for playing around with the sound effects.
it: SoundTouch è una libreria di elaborazione audio per modificare il tempo, l'intonazione e la velocità di riproduzione di flussi audio o file audio. È destinata agli sviluppatori di applicazioni che scrivono strumenti di elaborazione del suono che richiedono funzionalità di controllo di tempo/intonazione, o semplicemente per divertirsi con gli effetti sonori.

source: Sound processing utility
it: Utilità di elaborazione del suono

source: SoX (Sound eXchange) is a command line utility that can convert various formats of computer audio files to other formats. It can also apply various effects to these sound files, and, as an added bonus, SoX can play and record audio files.
it: SoX (Sound eXchange) è un'utilità da riga di comando che può convertire vari formati di file audio per computer in altri formati. Può anche applicare vari effetti a questi file audio e, come bonus aggiuntivo, SoX può riprodurre e registrare file audio.

source: One-dimensional sample-rate conversion library
it: Libreria di conversione della frequenza di campionamento unidimensionale

source: The SoX Resampler library (libsoxr) performs one-dimensional sample-rate conversion. It may be used, for example, to resample PCM-encoded audio.
it: La libreria SoX Resampler (libsoxr) esegue la conversione della frequenza di campionamento unidimensionale. Può essere utilizzata, ad esempio, per ricampionare l'audio codificato in PCM.

source: MPEG Audio Layer 2 (MP2) encoder
it: Codificatore MPEG Audio Layer 2 (MP2)

source: TwoLAME is an optimised MPEG Audio Layer 2 (MP2) encoder based on tooLAME by Mike Cheng, which in turn is based upon the ISO dist10 code and portions of LAME.
it: TwoLAME è un codificatore MPEG Audio Layer 2 (MP2) ottimizzato basato su tooLAME di Mike Cheng, che a sua volta è basato sul codice ISO dist10 e su parti di LAME.

source: Audio I/O library
it: Libreria di I/O audio

source: PortAudio is a portable C/C++ audio I/O library providing a simple API to record and/or play sound using a callback function or a blocking read/write interface.
it: PortAudio è una libreria di I/O audio portatile C/C++ che fornisce una semplice API per registrare e/o riprodurre suoni utilizzando una funzione di callback o un'interfaccia di lettura/scrittura bloccante.

source: Graphical user interface for FluidSynth
it: Interfaccia utente grafica per FluidSynth

source: Qsynth is a GUI front-end application for the FluidSynth SoundFont synthesizer written in C++.
it: Qsynth è un'applicazione front-end GUI per il sintetizzatore FluidSynth SoundFont scritta in C++.

source: Networked audio system
it: Sistema audio in rete

source: RSound allows you to send audio from an application and transfer it directly to a different computer on your LAN network. It is an audio daemon with a much different focus than most other audio daemons.
it: RSound consente di inviare l'audio da un'applicazione e di trasferirlo direttamente a un altro computer sulla propria rete LAN. È un demone audio con un focus molto diverso dalla maggior parte degli altri demoni audio.

source: JACK audio frequency analyzer and display
it: Analizzatore e display della frequenza audio JACK

source: XJackFreak is an audio analysis and equalizing tool for the Jack Audio Connection Kit. It can display the FFT of any input, modify it and output the result.
it: XJackFreak è uno strumento di analisi e equalizzazione audio per il Jack Audio Connection Kit. Può visualizzare la FFT di qualsiasi input, modificarla e restituire il risultato in output.

source: Fast, partitioned convolution engine library
it: Libreria motore di convoluzione partizionata veloce

source: Zita convolver is a C++ library providing a real-time convolution engine.
it: Zita convolver è una libreria C++ che fornisce un motore di convoluzione in tempo reale.

source: C++ library for resampling audio signals
it: Libreria C++ per il ricampionamento di segnali audio

source: Libzita-resampler is a C++ library for resampling audio signals. It is designed to be used within a real-time processing context, to be fast, and to provide high-quality sample rate conversion.
it: Libzita-resampler è una libreria C++ per il ricampionamento di segnali audio. È progettata per essere utilizzata in un contesto di elaborazione in tempo reale, per essere veloce e per fornire una conversione della frequenza di campionamento di alta qualità.

source: Zita-alsa-pcmi is a C++ wrapper around the ALSA API. It provides easy access to ALSA PCM devices, taking care of the many functions required to open, initialise and use a hw: device in mmap mode, and providing floating point audio data.
it: Zita-alsa-pcmi è un wrapper C++ attorno all'API ALSA. Fornisce un facile accesso ai dispositivi ALSA PCM, occupandosi delle numerose funzioni richieste per aprire, inizializzare e utilizzare un dispositivo hw: in modalità mmap e fornendo dati audio in virgola mobile.

source: Cue and toc file parsers and utilities
it: Parser e utilità per file cue e toc

source: Cuetools is a set of programs that are useful for manipulating and using CUE sheet (cue) files and Table of Contents (toc) files. CUE and TOC files are a way to represent the layout of a data or audio CD in a machine-readable ASCII format.
it: Cuetools è un insieme di programmi utili per la manipolazione e l'utilizzo di file CUE sheet (cue) e file di sommario (toc). I file CUE e TOC sono un modo per rappresentare il layout di un CD dati o audio in un formato ASCII leggibile da una macchina.

source: Analyze MPEG layer I/II/III files
it: Analizza file MPEG layer I/II/III

source: mp3guessenc is a command line utility that tries to detect the encoder used for an MPEG Layer III (MP3) file, as well as scan any MPEG audio file (any layer) and print a lot of useful information.
it: mp3guessenc è un'utilità da riga di comando che tenta di rilevare il codificatore utilizzato per un file MPEG Layer III (MP3), nonché di scansionare qualsiasi file audio MPEG (qualsiasi livello) e di stampare molte informazioni utili.

source: WAVE audio data processing tool
it: Strumento di elaborazione dati audio WAVE

source: shntool is a multi-purpose WAVE data processing and reporting utility. File formats are abstracted from its core, so it can process any file that contains WAVE data, compressed or not---provided there exists a format module to handle that particular file type. It can also generate CUE files, and use them split WAVE data into multiple files.
it: shntool è un'utilità multiuso per l'elaborazione e la segnalazione di dati WAVE. I formati di file sono astratti dal suo nucleo, quindi può elaborare qualsiasi file che contenga dati WAVE, compressi o meno, a condizione che esista un modulo di formato per gestire quel particolare tipo di file. Può anche generare file CUE e utilizzarli per dividere i dati WAVE in più file.

source: DTS Coherent Acoustics decoder
it: Decodificatore DTS Coherent Acoustics
