Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: Odio SACD is a command-line application which takes a Super Audio CD source and extracts a 24-bit high resolution WAV file. It handles both DST and DSD streams.
it: Odio SACD è un'applicazione da riga di comando che prende una sorgente Super Audio CD ed estrae un file WAV ad alta risoluzione a 24 bit. Gestisce sia flussi DST che DSD.

source: PipeWire graph manager
it: Gestore di grafi PipeWire

source: qpwgraph is a graph manager dedicated to PipeWire, using the Qt C++ framework. It provides a visual interface to audio and video connections managed by PipeWire.
it: qpwgraph è un gestore di grafi dedicato a PipeWire, che utilizza il framework Qt C++. Fornisce un'interfaccia visiva per le connessioni audio e video gestite da PipeWire.

source: Audio session manager
it: Gestore di sessione audio

source: RaySession is a session manager for audio programs such as Ardour, Carla, QTractor, Guitarix, Patroneo, Jack Mixer, etc. The principle is to load together audio programs, then be able to save or close all documents together. Its main purpose is to manage NSM compatible programs, but it also helps for other programs. It offers a patchbay for visualizing and editing connections.
it: RaySession è un gestore di sessioni per programmi audio come Ardour, Carla, QTractor, Guitarix, Patroneo, Jack Mixer, ecc. Il principio è quello di caricare insieme i programmi audio, per poi poter salvare o chiudere tutti i documenti insieme. Il suo scopo principale è quello di gestire programmi compatibili con NSM, ma aiuta anche per altri programmi. Offre una patchbay per visualizzare e modificare le connessioni.

source: Record audio streams to your hard drive
it: Registra flussi audio sul tuo disco rigido
sv: Spela in ljudströmmar till din hårddisk

source: Streamripper records shoutcast-compatible streams. For shoutcast style streams it finds the “meta data” or track separation data, and uses that as a marker for where the track should be separated.
it: Streamripper registra flussi compatibili con shoutcast. Per i flussi in stile shoutcast, trova i "meta dati" o i dati di separazione delle tracce e li usa come marcatore per separare le tracce.

source: Cross-platform audio library
it: Libreria audio multipiattaforma

source: Cubeb is Mozilla's cross-platform audio library.
it: Cubeb è la libreria audio multipiattaforma di Mozilla.

source: Command line CD ripper and encoder
it: Ripper e codificatore CD da riga di comando

source: cyanrip is a command line tool for ripping CDs. It uses MusicBrainz to name and tag each track, and to download and embed cover art. cyanrip supports encoding tracks to multiple formats in parallel and automatically verifies checksums.
it: cyanrip è uno strumento da riga di comando per estrarre tracce da CD. Utilizza MusicBrainz per nominare ed etichettare ogni traccia, e per scaricare e incorporare la copertina. cyanrip supporta la codifica delle tracce in più formati in parallelo e verifica automaticamente i checksum.

source: Realtime Audio effects interface for Pipewire
it: Interfaccia per effetti audio in tempo reale per Pipewire

source: EasyEffects is an advanced audio manipulation tool providing a graphical user interface to apply various effects and filters to audio streams using Pipewire. Effects can be applied in real time to audio inputs or outputs such as a microphone to reduce noise or apply many other effects including: @itemize @item Auto gain @item Bass enhancer @item Bass loudness @item Compressor @item Convolver @item Crossfeed @item Crystalizer @item De-esser @item Delay @item Echo Canceller @item Equalizer @item Exciter @item Filter (low-pass, high-pass, band-pass and band-reject modes) @item Gate @item Limiter @item Loudness @item Maximizer @item Multiband compressor @item Multiband gate @item Noise reduction @item Pitch @item Reverberation @item Speech Processor @item Stereo tools @end itemize
it: EasyEffects è uno strumento avanzato di manipolazione audio che fornisce un'interfaccia grafica per applicare vari effetti e filtri ai flussi audio utilizzando Pipewire. Gli effetti possono essere applicati in tempo reale agli ingressi o alle uscite audio, come un microfono, per ridurre il rumore o applicare molti altri effetti, tra cui: @itemize @item Guadagno automatico @item Potenziatore di bassi @item Volume dei bassi @item Compressore @item Convolutore @item Crossfeed @item Crystalizer @item De-esser @item Delay @item Cancellatore di eco @item Equalizzatore @item Exciter @item Filtro (modalità passa-basso, passa-alto, passa-banda e elimina-banda) @item Gate @item Limiter @item Loudness @item Massimizzatore @item Compressore multibanda @item Gate multibanda @item Riduzione del rumore @item Pitch @item Riverbero @item Processore vocale @item Strumenti stereo @end itemize

source: Encrypted backup using rsync algorithm
it: Backup crittografato usando l'algoritmo rsync

source: Duplicity backs up directories by producing encrypted tar-format volumes and uploading them to a remote or local file server. Because duplicity uses librsync, the incremental archives are space efficient and only record the parts of files that have changed since the last backup. Because duplicity uses GnuPG to encrypt and/or sign these archives, they will be safe from spying and/or modification by the server.
it: Duplicity esegue il backup di directory producendo volumi in formato tar crittografati e caricandoli su un server di file remoto o locale. Poiché duplicity utilizza librsync, gli archivi incrementali sono efficienti in termini di spazio e registrano solo le parti dei file che sono cambiate dall'ultimo backup. Poiché duplicity utilizza GnuPG per crittografare e/o firmare questi archivi, saranno al sicuro da spionaggio e/o modifica da parte del server.

source: File verification and repair tools
it: Strumenti di verifica e riparazione file

source: Par2cmdline uses Reed-Solomon error-correcting codes to generate and verify PAR2 recovery files. These files can be distributed alongside the source files or stored together with back-ups to protect against transmission errors or @dfn{bit rot}, the degradation of storage media over time. Unlike a simple checksum, PAR2 doesn't merely detect errors: as long as the damage isn't too extensive (and smaller than the size of the recovery file), it can even repair them.
it: Par2cmdline utilizza i codici di correzione degli errori di Reed-Solomon per generare e verificare i file di ripristino PAR2. Questi file possono essere distribuiti insieme ai file sorgente o archiviati insieme ai backup per proteggersi da errori di trasmissione o dal @dfn{bit rot}, il degrado dei supporti di memorizzazione nel tempo. A differenza di un semplice checksum, PAR2 non si limita a rilevare gli errori: finché il danno non è troppo esteso (e più piccolo della dimensione del file di ripristino), può anche ripararli.

source: Simple incremental backup tool
it: Semplice strumento di backup incrementale

source: Hdup2 is a backup utility, its aim is to make backup really simple. The backup scheduling is done by means of a cron job. It supports an include/exclude mechanism, remote backups, encrypted backups and split backups (called chunks) to allow easy burning to CD/DVD.
it: Hdup2 è un'utilità di backup, il suo scopo è rendere il backup veramente semplice. La pianificazione del backup viene eseguita tramite un cron job. Supporta un meccanismo di inclusione/esclusione, backup remoti, backup crittografati e backup divisi (chiamati chunk) per consentire una facile masterizzazione su CD/DVD.

source: Multi-format archive and compression library
it: Libreria di archiviazione e compressione multiformato

source: Libarchive provides a flexible interface for reading and writing archives in various formats such as tar and cpio. Libarchive also supports reading and writing archives compressed using various compression filters such as gzip and bzip2. The library is inherently stream-oriented; readers serially iterate through the archive, writers serially add things to the archive. In particular, note that there is currently no built-in support for random access nor for in-place modification. This package provides the @command{bsdcat}, @command{bsdcpio} and @command{bsdtar} commands.
it: Libarchive fornisce un'interfaccia flessibile per la lettura e la scrittura di archivi in vari formati come tar e cpio. Libarchive supporta anche la lettura e la scrittura di archivi compressi utilizzando vari filtri di compressione come gzip e bzip2. La libreria è intrinsecamente orientata al flusso; i lettori iterano serialmente attraverso l'archivio, gli scrittori aggiungono serialmente elementi all'archivio. In particolare, si noti che attualmente non esiste un supporto integrato per l'accesso casuale né per la modifica in loco. Questo pacchetto fornisce i comandi @command{bsdcat}, @command{bsdcpio} e @command{bsdtar}.

source: Provide a list of files to backup
it: Fornisce un elenco di file di cui eseguire il backup

source: Rdup is a utility inspired by rsync and the plan9 way of doing backups. Rdup itself does not backup anything, it only print a list of absolute file names to standard output. Auxiliary scripts are needed that act on this list and implement the backup strategy.
it: Rdup è un'utilità ispirata a rsync e al modo in cui plan9 esegue i backup. Rdup stesso non esegue alcun backup, stampa solo un elenco di nomi di file assoluti sull'output standard. Sono necessari script ausiliari che agiscono su questo elenco e implementano la strategia di backup.

source: Efficient backups using parity snapshots across disk arrays
it: Backup efficienti utilizzando snapshot di parità su array di dischi

source: SnapRAID backs up files stored across multiple storage devices, such as disk arrays, in an efficient way reminiscent of its namesake @acronym{RAID, Redundant Array of Independent Disks} level 4. Instead of creating a complete copy of the data like classic backups do, it saves space by calculating one or more sets of parity information that's a fraction of the size. Each parity set is stored on an additional device the size of the largest single storage volume, and protects against the loss of any one device, up to a total of six. If more devices fail than there are parity sets, (only) the files they contained are lost, not the entire array. Data corruption by unreliable devices can also be detected and repaired. SnapRAID is distinct from actual RAID in that it operates on files and creates distinct snapshots only when run. It mainly targets large collections of big files that rarely change, like home media centers. One disadvantage is that @emph{all} data not in the latest snapshot may be lost if one device fails. An advantage is that accidentally deleted files can be recovered, which is not the case with RAID. It's also more flexible than true RAID: devices can have different sizes and more can be added without disturbing others. Devices that are not in use can remain fully idle, saving power and producing less noise.
fi: SnapRAID varmuuskopioi useille tallennuslaitteille, kuten levyryhmille, tallennetut tiedostot tehokkaalla tavalla, joka muistuttaa kaimansa @acronym{RAID, Redundant Array of Independent Disks} tasoa 4. Sen sijaan, että luodaan täydellinen kopio tiedoista, kuten perinteiset varmuuskopiot tekevät, se säästää tilaa laskemalla yhden tai useamman pariteettitiedon joukon, joka on murto-osa koosta. Jokainen pariteettijoukko tallennetaan lisälaitteeseen, joka on suurimman yksittäisen tallennustilan kokoinen, ja se suojaa minkä tahansa laitteen katoamiselta, yhteensä enintään kuusi. Jos useampi laite epäonnistuu kuin on pariteettijoukkoja, (vain) niiden sisältämät tiedostot menetetään, ei koko joukko. Epäluotettavien laitteiden aiheuttamat tietojen korruptio voidaan myös havaita ja korjata. SnapRAID eroaa varsinaisesta RAIDista siinä, että se toimii tiedostoilla ja luo erilliset tilannevedokset vain ajettaessa. Se kohdistuu pääasiassa suuriin tiedostokokoelmiin, jotka muuttuvat harvoin, kuten kotimediakeskukset. Yksi haittapuoli on, että @emph{all} -tiedot, jotka eivät ole viimeisimmässä tilannekuvassa, voivat kadota, jos jokin laite epäonnistuu. Etuna on, että vahingossa poistetut tiedostot voidaan palauttaa, mikä ei oleRAIDin tapauksessa. Se on myös joustavampi kuin todellinen RAID: Laitteet voivat olla erikokoisia ja niitä voidaan lisätä muita häiritsemättä. Laitteet, jotka eivät ole käytössä, voivat jäädä täysin käyttämättä, mikä säästää virtaa ja tuottaa vähemmän melua.
it: SnapRAID esegue il backup dei file archiviati su più dispositivi di archiviazione, come gli array di dischi, in modo efficiente che ricorda il suo omonimo @acronym{RAID, Redundant Array of Independent Disks} livello 4. Invece di creare una copia completa dei dati come fanno i backup classici, risparmia spazio calcolando uno o più set di informazioni di parità che sono una frazione della dimensione. Ogni set di parità viene archiviato su un dispositivo aggiuntivo delle dimensioni del più grande volume di archiviazione singolo e protegge dalla perdita di un qualsiasi dispositivo, fino a un totale di sei. Se si guastano più dispositivi di quanti sono i set di parità, (solo) i file che contenevano vengono persi, non l'intero array. La corruzione dei dati da parte di dispositivi inaffidabili può anche essere rilevata e riparata. SnapRAID è distinto dal RAID effettivo in quanto opera sui file e crea snapshot distinti solo quando viene eseguito. Si rivolge principalmente a grandi collezioni di file di grandi dimensioni che cambiano raramente, come i centri multimediali domestici. Uno svantaggio è che @emph{all} i dati non presenti nell'ultimo snapshot possono essere persi se un dispositivo si guasta. Un vantaggio è che i file eliminati accidentalmente possono essere recuperati, cosa che non accade con il RAID. È anche più flessibile del vero RAID: i dispositivi possono avere dimensioni diverse e se ne possono aggiungere altri senza disturbare gli altri. I dispositivi non in uso possono rimanere completamente inattivi, risparmiando energia e producendo meno rumore.

source: Tar-compatible archiver
it: Archiviatore compatibile con tar
sv: Tar-kompatibel arkiverare

source: Btar is a tar-compatible archiver which allows arbitrary compression and ciphering, redundancy, differential backup, indexed extraction, multicore compression, input and output serialisation, and tolerance to partial archive errors.
it: Btar è un archiviatore compatibile con tar che consente compressione e cifratura arbitrarie, ridondanza, backup differenziale, estrazione indicizzata, compressione multicore, serializzazione di input e output e tolleranza agli errori parziali dell'archivio.

source: Local/remote mirroring+incremental backup
it: Mirroring locale/remoto+backup incrementale

source: Rdiff-backup backs up one directory to another, possibly over a network. The target directory ends up a copy of the source directory, but extra reverse diffs are stored in a special subdirectory of that target directory, so you can still recover files lost some time ago. The idea is to combine the best features of a mirror and an incremental backup. Rdiff-backup also preserves subdirectories, hard links, dev files, permissions, uid/gid ownership, modification times, extended attributes, acls, and resource forks. Also, rdiff-backup can operate in a bandwidth efficient manner over a pipe, like rsync. Thus you can use rdiff-backup and ssh to securely back a hard drive up to a remote location, and only the differences will be transmitted. Finally, rdiff-backup is easy to use and settings have sensible defaults.
it: Rdiff-backup esegue il backup di una directory in un'altra, eventualmente su una rete. La directory di destinazione finisce per essere una copia della directory sorgente, ma vengono archiviati diff inversi extra in una sottodirectory speciale di quella directory di destinazione, in modo da poter ancora recuperare file persi da qualche tempo. L'idea è quella di combinare le migliori caratteristiche di un mirror e di un backup incrementale. Rdiff-backup conserva anche sottodirectory, hard link, file di dispositivo, permessi, proprietà uid/gid, tempi di modifica, attributi estesi, acl e resource fork. Inoltre, rdiff-backup può operare in modo efficiente in termini di larghezza di banda su una pipe, come rsync. Pertanto, è possibile utilizzare rdiff-backup e ssh per eseguire il backup sicuro di un disco rigido su una posizione remota, e verranno trasmesse solo le differenze. Infine, rdiff-backup è facile da usare e le impostazioni hanno valori predefiniti sensati.

source: Deduplicating snapshot backup utility based on rsync
it: Utilità di backup snapshot con deduplicazione basata su rsync

source: rsnapshot is a file system snapshot utility based on rsync. rsnapshot makes it easy to make periodic snapshots of local machines, and remote machines over SSH. To reduce the disk space required for each backup, rsnapshot uses hard links to deduplicate identical files.
it: rsnapshot è un'utilità di snapshot del file system basata su rsync. rsnapshot rende facile creare snapshot periodici di macchine locali e macchine remote tramite SSH. Per ridurre lo spazio su disco richiesto per ogni backup, rsnapshot utilizza gli hard link per deduplicare i file identici.

source: Deduplicated, encrypted, authenticated and compressed backups
it: Backup deduplicati, crittografati, autenticati e compressi

source: Borg is a deduplicating backup program. Optionally, it supports compression and authenticated encryption. The main goal of Borg is to provide an efficient and secure way to backup data. The data deduplication technique used makes Borg suitable for daily backups since only changes are stored. The authenticated encryption technique makes it suitable for storing backups on untrusted computers.
it: Borg è un programma di backup con deduplicazione. Facoltativamente, supporta la compressione e la crittografia autenticata. L'obiettivo principale di Borg è fornire un modo efficiente e sicuro per eseguire il backup dei dati. La tecnica di deduplicazione dei dati utilizzata rende Borg adatto per i backup giornalieri, poiché vengono memorizzate solo le modifiche. La tecnica di crittografia autenticata lo rende adatto per l'archiviazione di backup su computer non affidabili.

source: WIM file manipulation library and utilities
it: Libreria e utilità per la manipolazione di file WIM

source: wimlib is a C library and set of command-line utilities for creating, modifying, extracting, and mounting archives in the Windows Imaging Format (@dfn{WIM files}). It can capture and apply WIMs directly from and to NTFS volumes using @code{ntfs-3g}, preserving NTFS-specific attributes.
it: wimlib è una libreria C e un insieme di utilità da riga di comando per creare, modificare, estrarre e montare archivi nel formato Windows Imaging (@dfn{file WIM}). Può catturare e applicare WIM direttamente da e verso volumi NTFS utilizzando @code{ntfs-3g}, preservando gli attributi specifici di NTFS.

source: Fast, disk based, rotating network backup system
it: Sistema di backup di rete veloce, basato su disco, a rotazione

source: With dirvish you can maintain a set of complete images of your file systems with unattended creation and expiration. A dirvish backup vault is like a time machine for your data.
it: Con dirvish puoi mantenere un set di immagini complete dei tuoi file system con creazione e scadenza non supervisionate. Un vault di backup dirvish è come una macchina del tempo per i tuoi dati.

source: Backup program with multiple revisions, encryption and more
it: Programma di backup con più revisioni, crittografia e altro

source: Restic is a program that does backups right and was designed with the following principles in mind: @itemize @item Easy: Doing backups should be a frictionless process, otherwise you might be tempted to skip it. Restic should be easy to configure and use, so that, in the event of a data loss, you can just restore it. Likewise, restoring data should not be complicated. @item Fast: Backing up your data with restic should only be limited by your network or hard disk bandwidth so that you can backup your files every day. Nobody does backups if it takes too much time. Restoring backups should only transfer data that is needed for the files that are to be restored, so that this process is also fast. @item Verifiable: Much more important than backup is restore, so restic enables you to easily verify that all data can be restored. @item Secure: Restic uses cryptography to guarantee confidentiality and integrity of your data. The location the backup data is stored is assumed not to be a trusted environment (e.g. a shared space where others like system administrators are able to access your backups). Restic is built to secure your data against such attackers. @item Efficient: With the growth of data, additional snapshots should only take the storage of the actual increment. Even more, duplicate data should be de-duplicated before it is actually written to the storage back end to save precious backup space. @end itemize
it: Restic è un programma che esegue i backup correttamente ed è stato progettato con i seguenti principi in mente: @itemize @item Facile: Fare i backup dovrebbe essere un processo senza attriti, altrimenti potresti essere tentato di saltarlo. Restic dovrebbe essere facile da configurare e usare, in modo che, in caso di perdita di dati, tu possa semplicemente ripristinarli. Allo stesso modo, il ripristino dei dati non dovrebbe essere complicato. @item Veloce: Il backup dei tuoi dati con restic dovrebbe essere limitato solo dalla tua larghezza di banda di rete o del disco rigido, in modo da poter eseguire il backup dei tuoi file ogni giorno. Nessuno fa i backup se ci vuole troppo tempo. Il ripristino dei backup dovrebbe trasferire solo i dati necessari per i file da ripristinare, in modo che anche questo processo sia veloce. @item Verificabile: Molto più importante del backup è il ripristino, quindi restic ti consente di verificare facilmente che tutti i dati possano essere ripristinati. @item Sicuro: Restic utilizza la crittografia per garantire la riservatezza e l'integrità dei tuoi dati. Si presume che la posizione in cui vengono archiviati i dati di backup non sia un ambiente affidabile (ad esempio, uno spazio condiviso in cui altri, come gli amministratori di sistema, sono in grado di accedere ai tuoi backup). Restic è costruito per proteggere i tuoi dati da tali aggressori. @item Efficiente: Con la crescita dei dati, gli snapshot aggiuntivi dovrebbero occupare solo lo spazio dell'incremento effettivo. Inoltre, i dati duplicati dovrebbero essere deduplicati prima che vengano effettivamente scritti nel backend di archiviazione per risparmiare prezioso spazio di backup. @end itemize

source: Restic REST server
it: Server REST di Restic

source: The Restic REST server is a high performance HTTP server that implements restic's REST backend API. It provides a secure and efficient way to backup data remotely, using the restic backup client and a @code{rest:} URL.
it: Il server REST di Restic è un server HTTP ad alte prestazioni che implementa l'API backend REST di restic. Fornisce un modo sicuro ed efficiente per eseguire il backup dei dati in remoto, utilizzando il client di backup restic e un URL @code{rest:}.

source: Versatile deduplicating backup tool
it: Versatile strumento di backup con deduplicazione
