Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: ZBackup is a globally-deduplicating backup tool, based on the ideas found in Rsync. Feed a large @file{.tar} into it, and it will store duplicate regions of it only once, then compress and optionally encrypt the result. Feed another @file{.tar} file, and it will also re-use any data found in any previous backups. This way only new changes are stored, and as long as the files are not very different, the amount of storage required is very low. Any of the backup files stored previously can be read back in full at any time. The program is format-agnostic, so you can feed virtually any files to it.
it: ZBackup è uno strumento di backup con deduplicazione globale, basato sulle idee trovate in Rsync. Fornendogli un grande file @file{.tar}, memorizzerà le regioni duplicate una sola volta, quindi comprimerà e facoltativamente crittograferà il risultato. Fornendogli un altro file @file{.tar}, riutilizzerà anche qualsiasi dato trovato in qualsiasi backup precedente. In questo modo vengono memorizzate solo le nuove modifiche, e finché i file non sono molto diversi, la quantità di spazio di archiviazione richiesta è molto bassa. Qualsiasi dei file di backup memorizzati in precedenza può essere riletto per intero in qualsiasi momento. Il programma è indipendente dal formato, quindi puoi fornirgli praticamente qualsiasi file.

source: Ext2/3/4 file system dump/restore utilities
it: Utilità di dump/ripristino del file system Ext2/3/4

source: Dump examines files in a file system, determines which ones need to be backed up, and copies those files to a specified disk, tape or other storage medium. Subsequent incremental backups can then be layered on top of the full backup. The restore command performs the inverse function of dump; it can restore a full backup of a file system. Single files and directory subtrees may also be restored from full or partial backups in interactive mode.
it: Dump esamina i file in un file system, determina quali devono essere sottoposti a backup e copia quei file su un disco, nastro o altro supporto di archiviazione specificato. I backup incrementali successivi possono quindi essere stratificati sopra il backup completo. Il comando di ripristino esegue la funzione inversa di dump; può ripristinare un backup completo di un file system. Singoli file e sottoalberi di directory possono anche essere ripristinati da backup completi o parziali in modalità interattiva.

source: Backup tool for Btrfs subvolumes
it: Strumento di backup per i sottovolumi Btrfs

source: Btrbk is a backup tool for Btrfs subvolumes, taking advantage of Btrfs specific capabilities to create atomic snapshots and transfer them incrementally to your backup locations. The source and target locations are specified in a config file, which allows easily configuring simple scenarios like e.g. a @i{laptop with locally attached backup disks}, as well as more complex ones, e.g. a @i{server receiving backups from several hosts via SSH, with different retention policy}. It has features such as: @itemize @item atomic snapshots @item incremental backups @item flexible retention policy @item backups to multiple destinations @item transfer via SSH @item resume backups (for removable and mobile devices) @item archive to offline storage @item encrypted backups to non-btrfs storage @item wildcard subvolumes (useful for Docker and LXC containers) @item transaction log @item comprehensive list and statistics output @item resolve and trace Btrfs parent-child and received-from relationships @item list file changes between backups @item calculate accurate disk space usage based on block regions. @end itemize Btrbk is designed to run as a cron job for triggering periodic snapshots and backups, as well as from the command line (e.g. for instantly creating additional snapshots).
it: Btrbk è uno strumento di backup per i sottovolumi Btrfs, che sfrutta le capacità specifiche di Btrfs per creare snapshot atomici e trasferirli in modo incrementale nelle posizioni di backup. Le posizioni di origine e di destinazione sono specificate in un file di configurazione, che consente di configurare facilmente scenari semplici come, ad esempio, un @i{portatile con dischi di backup collegati localmente}, così come scenari più complessi, ad esempio un @i{server che riceve backup da più host tramite SSH, con diverse politiche di conservazione}. Ha funzionalità come: @itemize @item snapshot atomici @item backup incrementali @item politica di conservazione flessibile @item backup su più destinazioni @item trasferimento tramite SSH @item ripresa dei backup (per dispositivi rimovibili e mobili) @item archivio su archiviazione offline @item backup crittografati su archiviazione non-btrfs @item sottovolumi con caratteri jolly (utili per i container Docker e LXC) @item log delle transazioni @item elenco completo e output di statistiche @item risoluzione e tracciamento delle relazioni padre-figlio e received-from di Btrfs @item elenco delle modifiche ai file tra i backup @item calcolo accurato dell'utilizzo dello spazio su disco basato sulle regioni dei blocchi. @end itemize Btrbk è progettato per essere eseguito come un cron job per attivare snapshot e backup periodici, nonché dalla riga di comando (ad esempio, per creare istantaneamente snapshot aggiuntivi).

source: Differential backup and restore
it: Backup e ripristino differenziale

source: Burp is a network backup and restore program. It attempts to reduce network traffic and the amount of space that is used by each backup.
it: Burp è un programma di backup e ripristino di rete. Tenta di ridurre il traffico di rete e la quantità di spazio utilizzata da ogni backup.

source: Software archive disassembler
it: Disassemblatore di archivi software

source: Disarchive can disassemble software archives into data and metadata. The goal is to create a small amount of metadata that can be used to recreate a software archive bit-for-bit from the original files. For example, a software archive made using tar and Gzip will need to describe the order of files in the tarball and the compression parameters used by Gzip.
it: Disarchive può disassemblare archivi software in dati e metadati. L'obiettivo è creare una piccola quantità di metadati che possa essere utilizzata per ricreare un archivio software bit per bit dai file originali. Ad esempio, un archivio software creato utilizzando tar e Gzip dovrà descrivere l'ordine dei file nel tarball e i parametri di compressione utilizzati da Gzip.

source: Simple, configuration-driven backup software
it: Software di backup semplice, guidato dalla configurazione

source: borgmatic is simple, configuration-driven backup software for servers and workstations. Protect your files with client-side encryption. Backup your databases too. Monitor it all with integrated third-party services. borgmatic is powered by borg.
it: borgmatic è un software di backup semplice e basato sulla configurazione per server e workstation. Proteggi i tuoi file con la crittografia lato client. Esegui il backup anche dei tuoi database. Monitora tutto con servizi di terze parti integrati. borgmatic è basato su borg.

source: Graphical backup client based on BorgBackup
it: Client di backup grafico basato su BorgBackup

source: Vorta is a graphical backup client based on the Borg backup tool. It supports the use of remote backup repositories. It can perform scheduled backups, and has a graphical tool for browsing and extracting the Borg archives.
it: Vorta è un client di backup grafico basato sullo strumento di backup Borg. Supporta l'uso di repository di backup remoti. Può eseguire backup pianificati e dispone di uno strumento grafico per sfogliare ed estrarre gli archivi Borg.

source: GTK frontend for rsync
it: Frontend GTK per rsync

source: Grsync is a simple graphical interface using GTK for the @command{rsync} command line program. It currently supports only a limited set of the most important rsync features, but can be used effectively for local directory synchronization.
it: Grsync è una semplice interfaccia grafica che utilizza GTK per il programma da riga di comando @command{rsync}. Attualmente supporta solo un insieme limitato delle più importanti funzionalità di rsync, ma può essere utilizzato efficacemente per la sincronizzazione di directory locali.

source: Example GNU package
de: GNU-Beispielpaket
it: Esempio di pacchetto GNU

source: GNU Hello prints the message "Hello, world!" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.
de: GNU Hello gibt die Meldung »Hello, world!« aus und beendet sich dann. Es dient als ein Beispiel für die Standardwege zur Erzeugung von GNU-Code. Als solches unterstützt es Befehlszeilenargumente, mehrere Sprachen usw.
it: GNU Hello stampa il messaggio "Hello, world!" e poi esce. Serve come esempio delle pratiche di codifica standard di GNU. Come tale, supporta argomenti da riga di comando, più lingue e così via.
nl: GNU Hello drukt het bericht ‘Hallo, wereld!’ af en houdt er dan mee op. Het dient als voorbeeld van de gebruikelijke conventies in GNU code. Het ondersteunt bijvoorbeeld opdrachtlijnargumenten, is vertaald naar meerdere talen en heeft ook andere wenselijke eigenschappen.

source: Print lines matching a pattern
de: Zeilen zurückgeben, die auf ein Muster passen
it: Stampa le righe che corrispondono a un modello

source: grep is a tool for finding text inside files. Text is found by matching a pattern provided by the user in one or many files. The pattern may be provided as a basic or extended regular expression, or as fixed strings. By default, the matching text is simply printed to the screen, however the output can be greatly customized to include, for example, line numbers. GNU grep offers many extensions over the standard utility, including, for example, recursive directory searching.
de: Grep ist ein Werkzeug zum Finden von Text in Dateien. Textteile werden durch Vergleichen anhand eines vom Benutzer angegebenen Musters in einer oder mehreren Dateien gesucht. Das Muster kann als einfacher oder erweiterter regulärer Ausdruck oder auch als einfache Zeichenkette angegeben werden. In der Voreinstellung wird der Suchtreffer auf dem Bildschirm ausgegeben, aber die Ausgabe kann auf vielfältige Weise angepasst werden, um beispiels- weise Zeilennummern mitanzuzeigen. GNU Grep bietet viele Erweiterungen im Vergleich zum Standardwerkzeug, zum Beispiel die rekursive Suche in Verzeichnisstrukturen.
it: grep è uno strumento per trovare testo all'interno dei file. Il testo viene trovato facendo corrispondere un modello fornito dall'utente in uno o più file. Il modello può essere fornito come espressione regolare di base o estesa, o come stringhe fisse. Per impostazione predefinita, il testo corrispondente viene semplicemente stampato sullo schermo, tuttavia l'output può essere ampiamente personalizzato per includere, ad esempio, i numeri di riga. GNU grep offre molte estensioni rispetto all'utilità standard, inclusa, ad esempio, la ricerca ricorsiva nelle directory.

source: Stream editor
de: Datenstromeditor
it: Editor di flusso
sv: Strömredigerare

source: Sed is a non-interactive, text stream editor. It receives a text input from a file or from standard input and it then applies a series of text editing commands to the stream and prints its output to standard output. It is often used for substituting text patterns in a stream. The GNU implementation offers several extensions over the standard utility.
de: Sed ist ein nicht-interaktiver Editor für Text-Datenströme. Er empfängt eine Texteingabe aus einer Datei oder der Standardeingabe und wendet eine Reihe von Textbearbeitungsbefehlen darauf an. Das Ergebnis wird in der Standardausgabe ausgegeben. Er wird häufig zum Ersetzen von Textmustern in einem Datenstrom verwendet. Die GNU-Implementierung bietet gegenüber dem Standardwerkzeug diverse Erweiterungen.
it: Sed è un editor di flusso di testo non interattivo. Riceve un input di testo da un file o dall'input standard e quindi applica una serie di comandi di modifica del testo al flusso e stampa il suo output sull'output standard. Viene spesso utilizzato per sostituire modelli di testo in un flusso. L'implementazione di GNU offre diverse estensioni rispetto all'utilità standard.

source: Managing tar archives
de: Tar-Archive verwalten
it: Gestione di archivi tar

source: Tar provides the ability to create tar archives, as well as the ability to extract, update or list files in an existing archive. It is useful for combining many files into one larger file, while maintaining directory structure and file information such as permissions and creation/modification dates. GNU tar offers many extensions over the standard utility.
de: Tar ermöglicht Ihnen das Erstellen oder Entpacken von Tar-Archiven sowie die Aktualisierung oder Auflistung von Dateien eines existierenden Archivs. Es dient zum Zusammenfassen mehrerer Dateien in einer einzigen Datei, wobei die Verzeichnisstruktur und Dateiinformationen wie Erstellungs- und Änderungszeitpunkte sowie Zugriffsrechte erhalten bleiben. GNU Tar bietet viele Erweiterungen über die Fähigkeiten des Standardwerkzeugs hinaus.
it: Tar offre la possibilità di creare archivi tar, nonché di estrarre, aggiornare o elencare i file in un archivio esistente. È utile per combinare molti file in un unico file più grande, mantenendo la struttura delle directory e le informazioni sui file come i permessi e le date di creazione/modifica. GNU tar offre molte estensioni rispetto all'utilità standard.

source: Apply differences to originals, with optional backups
de: Unterschiede auf Originaldateien anwenden, mit optionaler Datensicherung
it: Applica le differenze agli originali, con backup opzionali

source: Patch is a program that applies changes to files based on differences laid out as by the program "diff". The changes may be applied to one or more files depending on the contents of the diff file. It accepts several different diff formats. It may also be used to revert previously applied differences.
de: Patch ist ein Programm, das Änderungen auf Dateien anwendet, die durch das Programm @command{diff} erzeugt wurden. Die Änderungen können auf eine oder mehrere Dateien angewandt werden, abhängig vom Inhalt der Diff-Datei. Es akzeptiert verschiedene Diff-Formate. Es kann auch dazu genutzt werden, frühere Anwendungen von Diff-Dateien rückgängig zu machen.
it: Patch è un programma che applica modifiche ai file basandosi sulle differenze definite dal programma "diff". Le modifiche possono essere applicate a uno o più file a seconda del contenuto del file diff. Accetta diversi formati di diff. Può anche essere utilizzato per annullare le differenze applicate in precedenza.

source: Comparing and merging files
de: Dateien vergleichen und zusammenführen
it: Confronto e unione di file

source: GNU Diffutils is a package containing tools for finding the differences between files. The "diff" command is used to show how two files differ, while "cmp" shows the offsets and line numbers where they differ. "diff3" allows you to compare three files. Finally, "sdiff" offers an interactive means to merge two files.
de: Das Paket GNU Diffutils enthält Werkzeuge zum Finden von Unterschieden zwischen Dateien. Der Befehl »diff« wird dazu verwendet, zwei Dateien zu vergleichen, um die Unterschiede kenntlich zu machen, während »cmp« anhand von Position und Zeilennummern zeigt, wo genau die Unterschiede liegen. Weiterhin bietet »sdiff« eine Möglichkeit, zwei Dateien interaktiv zusammenzuführen.
it: GNU Diffutils è un pacchetto che contiene strumenti per trovare le differenze tra i file. Il comando "diff" viene utilizzato per mostrare come due file differiscono, mentre "cmp" mostra gli offset e i numeri di riga in cui differiscono. "diff3" consente di confrontare tre file. Infine, "sdiff" offre un mezzo interattivo per unire due file.

source: Operating on files matching given criteria
de: Dateien verarbeiten, die zu gegebenen Kriterien passen
it: Operare su file che corrispondono a criteri dati

source: Findutils supplies the basic file directory searching utilities of the GNU system. It consists of two primary searching utilities: "find" recursively searches for files in a directory according to given criteria and "locate" lists files in a database that match a query. Two auxiliary tools are included: "updatedb" updates the file name database and "xargs" may be used to apply commands with arbitrarily long arguments.
de: Das Paket Findutils stellt im GNU-System die grundlegenden Werkzeuge zum Suchen in Verzeichnissen bereit. Zwei primäre Suchwerkzeuge sind enthalten: »find« sucht anhand angegebener Kriterien rekursiv nach Dateien in Verzeichnissen und »locate« listet Dateien in einer Datenbank auf, die einer Abfrage entsprechen. Zwei Hilfswerkzeuge sind außerdem enthalten: »updatedb« aktualisiert die Dateinamendatenbank und »xargs« dient dazu, Befehle mit willkürlich langen Argumenten anzuwenden.
it: Findutils fornisce le utilità di ricerca di base nelle directory di file del sistema GNU. Consiste in due principali utilità di ricerca: "find" cerca ricorsivamente i file in una directory secondo criteri dati e "locate" elenca i file in un database che corrispondono a una query. Sono inclusi due strumenti ausiliari: "updatedb" aggiorna il database dei nomi dei file e "xargs" può essere utilizzato per applicare comandi con argomenti di lunghezza arbitraria.

source: Core GNU utilities (file, text, shell)
de: GNU-Kernprogramme (Datei, Text, Shell)
it: Utilità GNU di base (file, testo, shell)

source: GNU Coreutils package includes all of the basic command-line tools that are expected in a POSIX system, excluding shell. This package is the union of the GNU fileutils, sh-utils, and textutils packages. Most of these tools offer extended functionality beyond that which is outlined in the POSIX standard.
de: Das Paket GNU Coreutils enthält alle grundlegenden Befehlszeilenwerkzeuge, die Sie in einem POSIX-System erwarten, bis auf eine Shell. Das Paket stellt die Vereinigung von GNUs fileutils mit Bearbeitungsfunktionen für Dateien, sh-utils und textutils dar. Die meisten dieser Werkzeuge bieten im Vergleich zu den in POSIX festgelegten Standards erweiterte Funktionalität.
it: Il pacchetto GNU Coreutils include tutti gli strumenti da riga di comando di base che ci si aspetta in un sistema POSIX, esclusa la shell. Questo pacchetto è l'unione dei pacchetti GNU fileutils, sh-utils e textutils. La maggior parte di questi strumenti offre funzionalità estese oltre a quelle descritte nello standard POSIX.
nl: GNU Coreutils bevat elk basis opdrachtlijngereedschap dat verwacht wordt op een POSIX-systeem, behalve de shell. Dit pakket is de unie van de GNU fileutils-, sh-utils- en textutils-pakketten. De meeste van deze gereedschappen bieden meer functies aan dan gevraagd door de POSIX-standaard.

source: Remake files automatically
de: Automatische Neuerzeugung von Dateien
it: Ricostruisce i file automaticamente

source: Make is a program that is used to control the production of executables or other files from their source files. The process is controlled from a Makefile, in which the developer specifies how each file is generated from its source. It has powerful dependency resolution and the ability to determine when files have to be regenerated after their sources change. GNU make offers many powerful extensions over the standard utility.
de: Make ist ein Programm, das zur Steuerung der Erstellung von ausführbaren oder anderen Dateien aus deren Quelldateien verwendet wird. Der Prozess wird über ein »Makefile« gesteuert, in welchem der Entwickler angibt, auf welche Weise jede der Dateien aus den Quellen erzeugt werden soll. Das Programm verfügt über eine leistungsfähige Abhängigkeitsauflösung und die Fähigkeit, zu bestimmen, wann eine Datei neu erstellt werden muss, wenn sich deren Quellen geändert hat. GNU Make bietet mächtige Erweiterungen über die Fähigkeiten des Standardwerkzeugs hinaus.
it: Make è un programma utilizzato per controllare la produzione di eseguibili o altri file dai loro file sorgente. Il processo è controllato da un Makefile, in cui lo sviluppatore specifica come ogni file viene generato dalla sua sorgente. Ha una potente risoluzione delle dipendenze e la capacità di determinare quando i file devono essere rigenerati dopo la modifica delle loro sorgenti. GNU make offre molte potenti estensioni rispetto all'utilità standard.

source: Binary utilities: bfd gas gprof ld
de: Binär-Dienstprogramme: bfd gas gprof ld
it: Utilità binarie: bfd gas gprof ld

source: GNU Binutils is a collection of tools for working with binary files. Perhaps the most notable are "ld", a linker, and "as", an assembler. Other tools include programs to display binary profiling information, list the strings in a binary file, and utilities for working with archives. The "bfd" library for working with executable and object formats is also included.
de: Die GNU Binutils sind eine Werkzeugsammlung zum Arbeiten mit Binärdateien. Die erwähnenswertesten sind »ld«, ein Binder (Linker), und »as«, ein Assembler. Weitere enthaltene Werkzeuge zeigen Profiling-Informationen an, listen die Zeichenketten in einer Binärdatei auf oder dienen der Arbeit mit Archiven. Die »bfd«-Bibliothek zum Arbeiten mit ausführbaren oder Objektformaten ist ebenfalls enthalten.
it: GNU Binutils è una raccolta di strumenti per lavorare con i file binari. I più noti sono "ld", un linker, e "as", un assembler. Altri strumenti includono programmi per visualizzare informazioni di profilazione binaria, elencare le stringhe in un file binario e utilità per lavorare con gli archivi. È inclusa anche la libreria "bfd" per lavorare con formati eseguibili e oggetto.

source: The linker wrapper
de: Der Linker-Wrapper
it: Il wrapper del linker

source: The linker wrapper (or @code{ld-wrapper}) wraps the linker to add any missing @code{-rpath} flags, and to detect any misuse of libraries outside of the store.
it: Il wrapper del linker (o @code{ld-wrapper}) avvolge il linker per aggiungere qualsiasi flag @code{-rpath} mancante e per rilevare qualsiasi uso improprio di librerie esterne allo store.

source: The GNU C Library
de: Die GNU-C-Bibliothek
it: La libreria GNU C

source: Any Unix-like operating system needs a C library: the library which defines the "system calls" and other basic facilities such as open, malloc, printf, exit... The GNU C library is used as the C library in the GNU system and most systems with the Linux kernel.
de: Jedes Unix-ähnliche Betriebssystem braucht eine C-Bibliothek: Dies ist die Bibliothek, welche die »Systemaufrufe« und andere Grundfunktionen wie »open«, »malloc«, »printf«, »exit« usw. definiert. Die GNU-C-Bibliothek wird als die C-Bibliothek im GNU-System sowie den meisten Systemen mit dem Linux-Kernel verwendet.
it: Qualsiasi sistema operativo di tipo Unix necessita di una libreria C: la libreria che definisce le "chiamate di sistema" e altre funzionalità di base come open, malloc, printf, exit... La libreria GNU C è utilizzata come libreria C nel sistema GNU e nella maggior parte dei sistemi con il kernel Linux.

source: All the locales supported by the GNU C Library
it: Tutte le localizzazioni supportate dalla libreria GNU C
