Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: Dcadec is a DTS Coherent Acoustics surround sound decoder with support for HD extensions.
it: Dcadec è un decodificatore audio surround DTS Coherent Acoustics con supporto per estensioni HD.

source: Digital room correction
it: Correzione acustica digitale della stanza

source: DRC is a program used to generate correction filters for acoustic compensation of HiFi and audio systems in general, including listening room compensation. DRC generates just the FIR correction filters, which can be used with a real time or offline convolver to provide real time or offline correction. DRC doesn't provide convolution features, and provides only some simplified, although really accurate, measuring tools.
it: DRC è un programma utilizzato per generare filtri di correzione per la compensazione acustica di sistemi HiFi e audio in generale, inclusa la compensazione della stanza d'ascolto. DRC genera solo i filtri di correzione FIR, che possono essere utilizzati con un convolutore in tempo reale o offline per fornire una correzione in tempo reale o offline. DRC non fornisce funzionalità di convoluzione e fornisce solo alcuni strumenti di misurazione semplificati, sebbene molto accurati.

source: Tool to adjust loudness of media files
it: Strumento per regolare il volume dei file multimediali

source: BS1770GAIN is a loudness scanner compliant with ITU-R BS.1770 and its flavors EBU R128, ATSC A/85, and ReplayGain 2.0. It helps normalizing the loudness of audio and video files to the same level.
it: BS1770GAIN è uno scanner di volume conforme a ITU-R BS.1770 e alle sue varianti EBU R128, ATSC A/85 e ReplayGain 2.0. Aiuta a normalizzare il volume dei file audio e video allo stesso livello.

source: Fast audio loudness scanner & tagger
it: Scanner e tagger veloce per il volume audio

source: r128gain is a multi platform command line tool to scan your audio files and tag them with loudness metadata (ReplayGain v2 or Opus R128 gain format), to allow playback of several tracks or albums at a similar loudness level. r128gain can also be used as a Python module from other Python projects to scan and/or tag audio files.
it: r128gain è uno strumento da riga di comando multipiattaforma per scansionare i file audio e etichettarli con metadati di volume (formato ReplayGain v2 o Opus R128 gain), per consentire la riproduzione di più tracce o album a un livello di volume simile. r128gain può anche essere utilizzato come modulo Python da altri progetti Python per scansionare e/o etichettare i file audio.

source: Lightweight audio filtering library
it: Libreria leggera per il filtraggio audio

source: An easy to use audio filtering library made from webrtc code, used in @code{libtoxcore}.
it: Una libreria di filtraggio audio facile da usare, creata dal codice di webrtc e utilizzata in @code{libtoxcore}.

source: GSM 06.10 lossy speech compression library
it: Libreria di compressione vocale con perdita GSM 06.10

source: This C library provides an encoder and a decoder for the GSM 06.10 RPE-LTP lossy speech compression algorithm.
it: Questa libreria C fornisce un codificatore e un decodificatore per l'algoritmo di compressione vocale con perdita GSM 06.10 RPE-LTP.

source: ALSA wrappers for Python
it: Wrapper ALSA per Python

source: This package contains wrappers for accessing the ALSA API from Python. It is currently fairly complete for PCM devices, and has some support for mixers.
it: Questo pacchetto contiene wrapper per accedere all'API ALSA da Python. Attualmente è abbastanza completo per i dispositivi PCM e ha un certo supporto per i mixer.

source: LDAC Bluetooth encoder and ABR library
it: Codificatore Bluetooth LDAC e libreria ABR

source: This package provides an encoder for the LDAC high-resolution Bluetooth audio streaming codec for streaming at up to 990 kbps at 24 bit/96 kHz.
it: Questo pacchetto fornisce un codificatore per il codec di streaming audio Bluetooth ad alta risoluzione LDAC per lo streaming fino a 990 kbps a 24 bit/96 kHz.

source: Bluetooth ALSA backend
it: Backend ALSA per Bluetooth

source: This project is a rebirth of a direct integration between Bluez and ALSA. Since Bluez >= 5, the built-in integration has been removed in favor of 3rd party audio applications. From now on, Bluez acts as a middleware between an audio application, which implements Bluetooth audio profile, and a Bluetooth audio device. BlueALSA registers all known Bluetooth audio profiles in Bluez, so in theory every Bluetooth device (with audio capabilities) can be connected. In order to access the audio stream, one has to connect to the ALSA PCM device called @code{bluealsa}. The device is based on the ALSA software PCM plugin.
it: Questo progetto è una rinascita di un'integrazione diretta tra Bluez e ALSA. Da Bluez >= 5, l'integrazione integrata è stata rimossa a favore di applicazioni audio di terze parti. D'ora in poi, Bluez funge da middleware tra un'applicazione audio, che implementa il profilo audio Bluetooth, e un dispositivo audio Bluetooth. BlueALSA registra tutti i profili audio Bluetooth noti in Bluez, quindi in teoria ogni dispositivo Bluetooth (con funzionalità audio) può essere collegato. Per accedere al flusso audio, è necessario collegarsi al dispositivo ALSA PCM chiamato @code{bluealsa}. Il dispositivo si basa sul plugin PCM software di ALSA.

source: Sound editor
de: Datenstromeditor
it: Editor di suoni
sv: Ljudredigerare

source: Snd is a sound editor modelled loosely after Emacs. It can be customized and extended using either the s7 Scheme implementation (included in the Snd sources), Ruby, or Forth.
it: Snd è un editor di suoni modellato liberamente su Emacs. Può essere personalizzato ed esteso utilizzando l'implementazione Scheme s7 (inclusa nei sorgenti di Snd), Ruby o Forth.

source: LV2 plugin for broadband noise reduction
it: Plugin LV2 per la riduzione del rumore a banda larga

source: Speech denoise LV2 plugin based on Xiph's RNNoise library
it: Plugin LV2 di rimozione del rumore vocale basato sulla libreria RNNoise di Xiph

source: RNNoise is a library that uses deep learning to apply noise suppression to audio sources with voice presence. This package provides an LV2 audio plugin.
it: RNNoise è una libreria che utilizza il deep learning per applicare la soppressione del rumore alle sorgenti audio con presenza di voce. Questo pacchetto fornisce un plugin audio LV2.

source: Command-line audio visualizer
it: Visualizzatore audio da riga di comando

source: @code{cli-visualizer} displays fast-Fourier transforms (FFTs) of the sound being played, as well as other graphical representations.
it: @code{cli-visualizer} mostra le trasformate di Fourier veloci (FFT) del suono in riproduzione, oltre ad altre rappresentazioni grafiche.

source: Console audio visualizer for ALSA, MPD, and PulseAudio
it: Visualizzatore audio da console per ALSA, MPD e PulseAudio

source: C.A.V.A. is a bar audio spectrum visualizer for the terminal using ALSA, MPD, PulseAudio, or a FIFO buffer as its input.
it: C.A.V.A. è un visualizzatore di spettro audio a barre per il terminale che utilizza ALSA, MPD, PulseAudio o un buffer FIFO come input.

source: Pro-quality GM soundfont
it: Soundfont GM di qualità professionale

source: Fluid-3 is Frank Wen's pro-quality GM soundfont.
it: Fluid-3 è il soundfont GM di qualità professionale di Frank Wen.

source: Fraunhofer FDK AAC library
it: Libreria AAC Fraunhofer FDK

source: FDK is a library for encoding and decoding Advanced Audio Coding (AAC) format audio, developed by Fraunhofer IIS, and included as part of Android. It supports several Audio Object Types including MPEG-2 and MPEG-4 AAC LC, HE-AAC (AAC LC + SBR), HE-AACv2 (LC + SBR + PS) as well AAC-LD (low delay) and AAC-ELD (enhanced low delay) for real-time communication. The encoding library supports sample rates up to 96 kHz and up to eight channels (7.1 surround).
it: FDK è una libreria per la codifica e la decodifica di audio in formato Advanced Audio Coding (AAC), sviluppata da Fraunhofer IIS e inclusa in Android. Supporta diversi tipi di oggetti audio, tra cui MPEG-2 e MPEG-4 AAC LC, HE-AAC (AAC LC + SBR), HE-AACv2 (LC + SBR + PS), nonché AAC-LD (basso ritardo) e AAC-ELD (basso ritardo migliorato) per la comunicazione in tempo reale. La libreria di codifica supporta frequenze di campionamento fino a 96 kHz e fino a otto canali (surround 7.1).

source: Command-line AAC encoder
it: Codificatore AAC da riga di comando

source: This package provides a command-line AAC-encoder.
it: Questo pacchetto fornisce un codificatore AAC da riga di comando.
sv: Det här paketet tillhandahåller en AAC-kodare för kommandoraden.

source: aptX codec library
it: Libreria codec aptX

source: libfreeaptx is an implementation of the Audio Processing Technology codecs aptX and aptX HD, mainly intended for use with an A2DP bluetooth profile.
it: libfreeaptx è un'implementazione dei codec aptX e aptX HD della Audio Processing Technology, principalmente destinata all'uso con un profilo bluetooth A2DP.

source: Audio editing and playback for OpenShot
it: Editing e riproduzione audio per OpenShot

source: OpenShot Audio Library (libopenshot-audio) allows high-quality editing and playback of audio, and is based on the JUCE library.
it: OpenShot Audio Library (libopenshot-audio) consente l'editing e la riproduzione di audio di alta qualità e si basa sulla libreria JUCE.

source: XAudio reimplementation
it: Reimplementazione di XAudio
sv: Återimplementering av XAudio

source: FAudio is an XAudio reimplementation that focuses solely on developing fully accurate DirectX Audio runtime libraries.
it: FAudio è una reimplementazione di XAudio che si concentra esclusivamente sullo sviluppo di librerie di runtime DirectX Audio pienamente accurate.

source: Binaural beat synthesizer
de: Synthesizer für binaurale Beats
it: Sintetizzatore di battiti binaurali

source: Gnaural is a programmable auditory binaural beat synthesizer intended to be used for brainwave entrainment. Gnaural supports creation of binaural beat tracks of different frequencies and exporting of tracks into different audio formats. Gnaural can also be linked over the internet with other Gnaural instances, allowing synchronous sessions between many users.
it: Gnaural è un sintetizzatore di battiti binaurali uditivi programmabile, destinato ad essere utilizzato per l'entrainment delle onde cerebrali. Gnaural supporta la creazione di tracce di battiti binaurali di diverse frequenze e l'esportazione di tracce in diversi formati audio. Gnaural può anche essere collegato via internet con altre istanze di Gnaural, consentendo sessioni sincrone tra molti utenti.

source: Live audio streamer
it: Streamer audio dal vivo

source: DarkIce is a live audio streamer. It takes audio input from a sound card, encodes it into Ogg Vorbis and/or mp3, and sends the audio stream to one or more IceCast and/or ShoutCast servers.
it: DarkIce è uno streamer audio dal vivo. Prende l'input audio da una scheda audio, lo codifica in Ogg Vorbis e/o mp3 e invia il flusso audio a uno o più server IceCast e/o ShoutCast.

source: Encode or decode Linear/Longitudinal Time Code (LTC) audio
it: Codifica o decodifica audio Linear/Longitudinal Time Code (LTC)

source: Libltc is a POSIX-C Library for handling @dfn{Linear/Longitudinal Time Code} (LTC) data.
it: Libltc è una libreria POSIX-C per la gestione dei dati @dfn{Linear/Longitudinal Time Code} (LTC).

source: TTA lossless audio encoder
it: Codificatore audio lossless TTA

source: TTA performs lossless compression on multichannel 8,16 and 24 bits data of the Wav audio files. Being lossless means that no data- quality is lost in the compression - when uncompressed, the data will be identical to the original. The compression ratios of TTA depend on the type of music file being compressed, but the compression size will generally range between 30% - 70% of the original. TTA format supports both of ID3v1/v2 and APEv2 tags.
it: TTA esegue una compressione senza perdita su dati multicanale a 8, 16 e 24 bit di file audio Wav. Essere senza perdita significa che nessuna qualità dei dati viene persa nella compressione - quando decompresso, il dato sarà identico all'originale. I rapporti di compressione di TTA dipendono dal tipo di file musicale compresso, ma la dimensione della compressione varierà generalmente tra il 30% e il 70% dell'originale. Il formato TTA supporta sia i tag ID3v1/v2 che APEv2.

source: C library for real-time audio input and output
it: Libreria C per l'input e l'output audio in tempo reale

source: @code{libsoundio} is a C library providing audio input and output. The API is suitable for real-time software such as digital audio workstations as well as consumer software such as music players.
it: @code{libsoundio} è una libreria C che fornisce input e output audio. L'API è adatta per software in tempo reale come le workstation audio digitali, così come per software di consumo come i lettori musicali.

source: Redkite is a small GUI toolkit developed in C++17 and inspired from other well known GUI toolkits such as Qt and GTK. It is minimal on purpose and is intended to be statically linked to applications, therefore satisfying any requirements they may have to be self contained, as is the case with audio plugins.
it: Redkite è un piccolo toolkit GUI sviluppato in C++17 e ispirato ad altri noti toolkit GUI come Qt e GTK. È volutamente minimale e destinato ad essere collegato staticamente alle applicazioni, soddisfacendo così qualsiasi requisito di autonomia, come nel caso dei plugin audio.

source: Audio plugin host
it: Host per plugin audio

source: Carla is a modular audio plugin host, with features like transport control, automation of parameters via MIDI CC and remote control over OSC. Carla currently supports LADSPA (including LRDF), DSSI, LV2, VST2, and VST3 plugin formats, plus SF2 and SFZ file support. It uses JACK as the default and preferred audio driver but also supports native drivers like ALSA.
it: Carla è un host di plugin audio modulare, con funzionalità come il controllo del trasporto, l'automazione dei parametri tramite MIDI CC e il controllo remoto su OSC. Carla supporta attualmente i formati di plugin LADSPA (incluso LRDF), DSSI, LV2, VST2 e VST3, oltre al supporto per file SF2 e SFZ. Utilizza JACK come driver audio predefinito e preferito, ma supporta anche driver nativi come ALSA.

source: Multitrack audio processing
it: Elaborazione audio multitraccia

source: Ecasound is a software package designed for multitrack audio processing. It can be used for simple tasks like audio playback, recording and format conversions, as well as for multitrack effect processing, mixing, recording and signal recycling. Ecasound supports a wide range of audio inputs, outputs and effect algorithms. Effects and audio objects can be combined in various ways, and their parameters can be controlled by operator objects like oscillators and MIDI-CCs. A versatile console mode user-interface is included in the package.
it: Ecasound è un pacchetto software progettato per l'elaborazione audio multitraccia. Può essere utilizzato per compiti semplici come la riproduzione audio, la registrazione e le conversioni di formato, così come per l'elaborazione di effetti multitraccia, il mixaggio, la registrazione e il riciclo del segnale. Ecasound supporta un'ampia gamma di ingressi, uscite e algoritmi di effetti audio. Effetti e oggetti audio possono essere combinati in vari modi, e i loro parametri possono essere controllati da oggetti operatore come oscillatori e MIDI-CC. Nel pacchetto è inclusa un'interfaccia utente versatile in modalità console.

source: Library for reading and resampling audio files
it: Libreria per la lettura e il ricampionamento di file audio

source: libaudec is a wrapper library over ffmpeg, sndfile and libsamplerate for reading and resampling audio files, based on Robin Gareus' @code{audio_decoder} code.
it: libaudec è una libreria wrapper su ffmpeg, sndfile e libsamplerate per la lettura e il ricampionamento di file audio, basata sul codice @code{audio_decoder} di Robin Gareus.

source: LV2 plugin lint tool
it: Strumento di lint per plugin LV2

source: lv2lint is an LV2 lint-like tool that checks whether a given plugin and its UI(s) match up with the provided metadata and adhere to well-known best practices.
it: lv2lint è uno strumento simile a lint per LV2 che controlla se un dato plugin e le sue interfacce utente corrispondono ai metadati forniti e aderiscono alle migliori pratiche conosciute.

source: Documentation generator for LV2 plugins
it: Generatore di documentazione per plugin LV2

source: lv2toweb allows the user to create an xhtml page with information about the given LV2 plugin, provided that the plugin and its UI(s) match up with the provided metadata and adhere to well-known best practices.
it: lv2toweb permette all'utente di creare una pagina xhtml con informazioni su un dato plugin LV2, a condizione che il plugin e le sue interfacce utente corrispondano ai metadati forniti e aderiscano alle migliori pratiche conosciute.

source: GUI toolkit for LV2 plugins
it: Toolkit GUI per plugin LV2

source: ZToolkit (Ztk) is a cross-platform GUI toolkit heavily inspired by GTK. It handles events and low level drawing on behalf of the user and provides a high-level API for managing the UI and custom widgets. ZToolkit is written in C and was created to be used for building audio plugin UIs, where the dependencies often need to be kept to a minimum.
it: ZToolkit (Ztk) è un toolkit GUI multipiattaforma fortemente ispirato a GTK. Gestisce eventi e disegno a basso livello per conto dell'utente e fornisce un'API di alto livello per la gestione dell'interfaccia utente e dei widget personalizzati. ZToolkit è scritto in C ed è stato creato per essere utilizzato nella costruzione di interfacce utente di plugin audio, dove spesso è necessario ridurre al minimo le dipendenze.

source: ZToolkit with SVG support
it: ZToolkit con supporto SVG

source: Instrument file software library
it: Libreria software per file di strumenti

source: libInstPatch is a library for processing digital sample based MIDI instrument "patch" files. The types of files libInstPatch supports are used for creating instrument sounds for wavetable synthesis. libInstPatch provides an object framework (based on GObject) to load patch files, which can then be edited, converted, compressed and saved.
it: libInstPatch è una libreria per l'elaborazione di file "patch" di strumenti MIDI basati su campioni digitali. I tipi di file supportati da libInstPatch sono utilizzati per creare suoni di strumenti per la sintesi wavetable. libInstPatch fornisce un framework di oggetti (basato su GObject) per caricare i file patch, che possono poi essere modificati, convertiti, compressi e salvati.

source: Digital signal processing library
de: Bibliothek für digitale Signalverarbeitung
it: Libreria di elaborazione del segnale digitale

source: The LSP DSP library provides a set of functions that perform SIMD-optimized computing on several hardware architectures. All functions currently operate on IEEE-754 single-precision floating-point numbers.
it: La libreria LSP DSP fornisce un insieme di funzioni che eseguono calcoli ottimizzati SIMD su diverse architetture hardware. Tutte le funzioni operano attualmente su numeri in virgola mobile a precisione singola IEEE-754.

source: Speech codec
it: Codec vocale
sv: Tal-kodek

source: Codec 2 is a speech codec designed for communications quality speech between 700 and 3200 bit/s. The main application is low bandwidth HF/VHF digital radio.
it: Codec 2 è un codec vocale progettato per la qualità vocale nelle comunicazioni tra 700 e 3200 bit/s. L'applicazione principale è la radio digitale a bassa larghezza di banda HF/VHF.

source: P25 Phase 1 and ProVoice vocoder
it: Vocoder P25 Fase 1 e ProVoice

source: The mbelib library provides support for the 7200x4400 bit/s codec used in P25 Phase 1, the 7100x4400 bit/s codec used in ProVoice and the @emph{Half Rate} 3600x2250 bit/s vocoder used in various radio systems.
it: La libreria mbelib fornisce supporto per il codec a 7200x4400 bit/s utilizzato in P25 Fase 1, il codec a 7100x4400 bit/s utilizzato in ProVoice e il vocoder @emph{Half Rate} a 3600x2250 bit/s utilizzato in vari sistemi radio.

source: Synchronize musical beat, tempo, and phase across multiple applications
it: Sincronizza battito musicale, tempo e fase tra più applicazioni

source: Ableton Link is a C++ library that synchronizes musical beat, tempo, and phase across multiple applications running on one or more devices. Applications on devices connected to a local network discover each other automatically and form a musical session in which each participant can perform independently: anyone can start or stop while still staying in time.
it: Ableton Link è una libreria C++ che sincronizza il battito musicale, il tempo e la fase tra più applicazioni in esecuzione su uno o più dispositivi. Le applicazioni sui dispositivi connessi a una rete locale si scoprono automaticamente e formano una sessione musicale in cui ogni partecipante può esibirsi indipendentemente: chiunque può avviare o arrestare pur rimanendo a tempo.

source: Audio streaming tool
it: Strumento di streaming audio

source: Butt is a tool to stream audio to a ShoutCast or Icecast server.
it: Butt è uno strumento per lo streaming audio verso un server ShoutCast o Icecast.

source: Signal generation tools
it: Strumenti di generazione di segnali

source: siggen is a set of tools for imitating a laboratory signal generator, generating audio signals out of Linux's /dev/dsp audio device. There is support for mono and/or stereo and 8 or 16 bit samples.
it: siggen è un insieme di strumenti per imitare un generatore di segnali da laboratorio, generando segnali audio dal dispositivo audio /dev/dsp di Linux. C'è supporto per mono e/o stereo e campioni a 8 o 16 bit.

source: Python wrapper around SoX
it: Wrapper Python per SoX

source: Efficient signal resampling
it: Ricampionamento efficiente del segnale

source: @code{python-resampy} implements the band-limited sinc interpolation method for sampling rate conversion as described by Julius O. Smith at the @url{https://ccrma.stanford.edu/~jos/resample/, Digital Audio Resampling Home Page}.
it: @code{python-resampy} implementa il metodo di interpolazione sinc a banda limitata per la conversione della frequenza di campionamento come descritto da Julius O. Smith nella @url{https://ccrma.stanford.edu/~jos/resample/, Home Page del Ricampionamento Audio Digitale}.

source: Python module for audio and music processing
it: Modulo Python per l'elaborazione di audio e musica

source: @code{librosa} is a python package for music and audio analysis. It provides the building blocks necessary to create music information retrieval systems.
it: @code{librosa} è un pacchetto python per l'analisi di musica e audio. Fornisce i blocchi di costruzione necessari per creare sistemi di recupero delle informazioni musicali.

source: Audio plug-in pack for LV2
it: Pacchetto di plug-in audio per LV2

source: MDA-LV2 is an LV2 port of the MDA plugins. It includes effects and a few instrument plugins.
it: MDA-LV2 è un port LV2 dei plugin MDA. Include effetti e alcuni plugin di strumenti.

source: Library for decoding Super Audio CDs (SACD)
it: Libreria per la decodifica di Super Audio CD (SACD)

source: The Odio SACD shared library is a decoding engine which takes a Super Audio CD source and extracts a 24-bit high resolution WAV file. It handles both DST and DSD streams.
it: La libreria condivisa Odio SACD è un motore di decodifica che prende una sorgente Super Audio CD ed estrae un file WAV ad alta risoluzione a 24 bit. Gestisce sia flussi DST che DSD.

source: Rip Super Audio CDs (SACD)
it: Estrai Super Audio CD (SACD)
