Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: Word processing program
ar: برنامج معالجة نصوص
de: Textverarbeitungsprogramm
fi: Tekstinkäsittelyohjelma
it: Programma di elaborazione testi
nl: Woordenverwerkingsprogramma
sk: Program na spracovanie textu
sv: Ordbehandlingsprogram

source: AbiWord is a word processing program. It is rapidly becoming a state of the art word processor, with lots of features useful for your daily work, personal needs, or for just some good old typing fun.
ar: AbiWord هو برنامج لمعالجة النصوص. إنه يتحول بسرعة يتحول بسرعة إلى معالج نصوص متطور، مع الكثير من الميزات المفيدة في لعملك اليومي، أو لاحتياجاتك الشخصية، أو لمجرد الاستمتاع بالكتابة.
de: AbiWord entwickelt sich schnell zu einem Textverarbeitungsprogramm auf dem Stand der Technik, mit zahlreichen Funktionalitäten, die nützlich sind für Ihre tägliche Arbeit, privaten Gebrauch oder schlicht für die Freude am Tippen.
it: AbiWord è un programma di elaborazione testi. Sta rapidamente diventando un elaboratore di testi all'avanguardia, con tantissime funzionalità utili per il tuo lavoro quotidiano, le tue esigenze personali o anche solo per divertirti con la cara vecchia tastiera.
nl: AbiWord is een modern tekstverwerkingsprogramma. Het heeft functies geschikt voor dagelijks werk, persoonlijke doeleinden en schrijfplezier.
sk: AbiWord slúži na úpravu textu. Rýchlo sa stáva odporúčaným textovým procesorom s množstvom funkcií užitočných pre vašu každodennú prácu, osobné potreby či jednoducho radosť z písania.
tr: AbiWord bir sözcük işleme uygulamasıdır. O; günlük işleriniz, kişisel ihtiyaçlarınız veya sadece eski güzel yazma eğlenceniz için yararlı birçok özelliği ile hızla son teknoloji bir kelime işlemcisi haline geliyor.

source: Spell checker
de: Rechtschreibprüfung
it: Controllo ortografico
sv: Stavningskontroll
tr: Yazım denetleyicisi

source: Aspell is a spell-checker which can be used either as a library or as a standalone program. Notable features of Aspell include its full support of documents written in the UTF-8 encoding and its ability to use multiple dictionaries, including personal ones.
ar: Aspell مدقق إملائي يمكن استخدامه إما كمكتبة أو برنامج مستقل. تتضمن الميزات البارزة في Aspell دعمه الكامل للمستندات المكتوبة بترميز UTF-8 وقدرته على استخدام قواميس متعددة، بما في ذلك الشخصية منها.
de: Aspell ist ein Programm zur Rechtschreibprüfung, das entweder als eine Programmbibliothek oder als eigenständiges Programm benutzt werden kann. Nennenswerte Funktionalitäten von Aspell sind unter anderem seine vollständige Unterstützung für mit der UTF-8-Kodierung geschriebene Dokumente und seine Fähigkeit, mehrere Wörterbücher zu benutzen, einschließlich eigener Wörterbücher.
it: Aspell è un correttore ortografico che può essere utilizzato sia come libreria che come programma autonomo. Le caratteristiche degne di nota di Aspell includono il suo pieno supporto di documenti scritti nella codifica UTF-8 e la sua capacità di utilizzare più dizionari, compresi quelli personali.
nl: Aspell is een spellingscontroleur die gebruikt worden als bibliotheek of als programma. Aspell ondersteunt onder meer documenten geschreven in UTF-8 volledig en de mogelijkheid meerdere woordenboeken te gebruiken, inclusief persoonlijke woordenboeken.
sk: Aspell je nástroj na kontrolu pravopisu, ktorý je možno použiť ako knižnicu alebo ako samostatný program. Aspell ponúka predovšetkým plnú podporu dokumentov s kódovaním UTF-8 a možnosť požiť viaceré slovníky vrátane vašich osobných slovníkov.
tr: Aspell hem kütüphane hem de uygulama olarak kullanılabilen bir yazım kontrolcüsüdür. UTF-8 kodlaması ve çoklu kütüphane desteği önemli özellikleri arasındadır, özel olanlar da dahil.

source: This package provides a dictionary for the GNU Aspell spell checker.
ar: توفر هذه الحزمة قاموساً لمدقق GNU Aspell الإملائي.
de: Dieses Paket bietet ein Wörterbuch für das GNU-Aspell-Rechtschreibprüfprogramm.
fi: Tämä paketti sisältää sanakirjan GNU Aspell oikolukua varten.
it: Questo pacchetto fornisce un dizionario per il correttore ortografico GNU Aspell.
nl: Dit pakket stelt een woordenboek ter beschikking voor de spellingscontroleur GNU Aspell.
sk: Tento balík poskytuje slovník pre nástroj na kontrolu pravopisu GNU Aspell.
sv: Det här paketet tillhandahåller en ordbok för stavningskontrollprogrammet GNU Aspell.
tr: Bu paket, GNU Aspell yazım kontrolcüsü için bir sözlük sağlar.

source: Interactive spell-checking tool for Unix
ar: أداة التدقيق الإملائي التفاعلية لنظام التشغيل Unix
de: Interaktives Rechtschreibprüfprogramm für Unix
it: Strumento di controllo ortografico interattivo per Unix
sv: Interaktivt stavningskontrollverktyg för Unix

source: Ispell is an interactive spell-checking tool supporting many European languages.
ar: أداة تفاعلية للتدقيق الإملائي تدعم العديد من اللغات الأوروبية.
de: Ispell ist ein interaktives Rechtschreibprüfprogramm für viele europäische Sprachen.
it: Ispell è uno strumento interattivo di controllo ortografico che supporta molte lingue europee.
nl: Ispell is een interactieve spellingscontroleur die vele Europese talen ondersteunt.
sk: Ispell je interaktívny nástroj na kontrolu pravopisu s podporou pre mnohé európske jazyky.
sv: Ispell är ett interaktivt stavningskontrollverktyg som stödjer många europeiska språk.
tr: Ispell, Avrupa dillerini de destekleyen interaktif bir yazım kontrolcüsüdür.

source: Embedded Audio Acceleration
de: Eingebettete Audio-Beschleunigung
it: Accelerazione audio incorporata
sv: Inbäddad ljudacceleration
tr: Gömülü Ses Hızlandırma

source: OpenSLES is a royalty-free, cross-platform, hardware-accelerated audio API tuned for embedded systems. It provides a standardized, high-performance, low-latency method to access audio functionality for developers of native applications on embedded mobile multimedia devices, enabling straightforward cross-platform deployment of hardware and software audio capabilities, reducing implementation effort, and promoting the market for advanced audio.
de: OpenSLES ist eine lizenzfreie, plattformunabhängige Audio-Programmierschnittstelle, die auf eingebettete Systeme zugeschnitten ist. Es bietet Entwicklern von nativen Programmen auf eingebetteten Mobil- und Mediengeräten eine standardisierte, performante Methode mit niedriger Latenz, um auf Audio-Funktionen zuzugreifen. Dies ermöglicht es, unkompliziert plattformübergreifende Hardware- und Software-Tonfunktionen auszurollen, und dadurch den Markt für hoch entwickelte Audiosoftware voranzutreiben.
it: OpenSLES è un'API audio multipiattaforma, royalty-free e accelerata tramite hardware, ottimizzata per sistemi embedded. Fornisce un metodo standardizzato, ad alte prestazioni e a bassa latenza per accedere alle funzionalità audio per gli sviluppatori di applicazioni native su dispositivi multimediali mobili embedded, consentendo un'implementazione multipiattaforma semplice e intuitiva delle funzionalità audio hardware e software, riducendo lo sforzo di implementazione e promuovendo il mercato dell'audio avanzato.
sk: OpenSLES je bezplatné, viacplatformové, hardvérovo urýchlené API pre vstavané systémy. Vývojárom pôvodných aplikácií pre vnorené prenosné multimediálne zariadenia poskytuje štandardizovaný, vysokovýkonný spôsob prístupu k zvukovým funkciám s nízkym oneskorením. Umožňuje priame krížové nasadenie hardvérových a softvérových zvukových možností pričom znižuje zložitosť implementácie a pomáha propagovať trh súčasných zvukových riešení.

source: Software Synthesizer
it: Sintetizzatore software
sv: Programvarusyntesizer
tr: Yazılım Sentezleyici

source: WildMIDI is a simple software midi player which has a core softsynth library that can be used with other applications.
de: WildMIDI ist ein einfacher softwaregestützter Midi-Spieler mit einer softsynth-Bibliothek die von anderen Anwendungen genutzt werden kann.
it: WildMIDI è un semplice lettore MIDI software dotato di una libreria softsynth di base che può essere utilizzata con altre applicazioni.

source: Measure the roundtrip time of MIDI messages
de: Umlaufzeit von MIDI-Nachrichten messen
it: Misura il tempo di andata e ritorno dei messaggi MIDI

source: @code{alsa-midi-latency-test} measures the roundtrip time of a MIDI message in the alsa subsystem of the Linux kernel using a high precision timer. It calculates the worst case roundtrip time of all sent MIDI messages and displays a histogram of the roundtrip time jitter.
de: @code{alsa-midi-latency-test} misst die Umlaufzeit einer MIDI-Nachricht im ALSA-Subsystem des Linux-Kernels mit einem hoch präzisen Timer. Es bestimmt die schlechteste Umlaufzeit aller versandten MIDI-Nachrichten und zeigt ein Histogramm des Jitter der Umlaufzeit an.
it: @code{alsa-midi-latency-test} misura il tempo di andata e ritorno di un messaggio MIDI nel sottosistema ALSA del kernel Linux utilizzando un timer ad alta precisione. Calcola il tempo di andata e ritorno nel caso peggiore di tutti i messaggi MIDI inviati e visualizza un istogramma del jitter del tempo di andata e ritorno.

source: WebRTC's Audio Processing Library
de: Audioverarbeitungsbibliothek von WebRTC
it: Libreria di elaborazione audio di WebRTC
sv: WebRTC:s ljudbehandlingsbibliotek
tr: WebRTC'nin Ses İşleme Kitaplığı

source: WebRTC-Audio-Processing library based on Google's implementation of WebRTC.
de: WebRTC-Audioverarbeitungsbibliothek basierend auf Googles Implementierung von WebRTC.
it: Libreria di elaborazione audio WebRTC basata sull'implementazione di WebRTC da parte di Google.
nl: Bibliotheek voor WebRTC audioverwerking gebaseerd op Google's implementatie van WebRTC.
sk: Zvuk spracovávajúca knižnica WebRTC založená na implementácii WebRTC od Googlu.
tr: Google'ın temel aldığı WebRTC-Ses İşleme kitaplığı WebRTC'nin uygulanması.

source: VisualOn AAC Encoder
de: VisualOn AAC-Kodierer
it: Codificatore AAC VisualOn
sv: VisualOn AAC-kodare
tr: VisualOn AAC Kodlayıcı

source: VO-AACENC is the VisualOn implementation of Advanced Audio Coding (AAC) encoder.
de: VO-AACENC ist die VisualOn-Implementierung eines Advanced Audio Coding (AAC)-Kodierers.
it: VO-AACENC è l'implementazione VisualOn del codificatore Advanced Audio Coding (AAC).
nl: VO-AACENC is VisualOn's implementatie van de audiocodering Advanced Audio Coding (AAC).
sk: VO-AACENC je VisualOn implementácia kódovača Advanced Audio Coding (AAC).
tr: VO-AACENC, Advanced Audio'nun VisualOn uygulamasıdır Kodlama (AAC) kodlayıcı.

source: ALSA interfacing library
de: ALSA-Schnittstellenbibliothek
it: Libreria di interfaccia ALSA
tr: ALSA arabirim kitaplığı

source: TinyALSA is a small library to interface with ALSA in the Linux kernel.
de: TinyALSA ist eine schlanke Bibliothek, um ALSA im Linux-Kernel anzusteuern.
it: TinyALSA è una piccola libreria per interfacciarsi con ALSA nel kernel Linux.
nl: TinyALSA is een bibliotheekje voor te interageren met ALSA in de Linux-kernel.
sk: TinyALSA je malá knižnica poskytujúca rozhranie s ALSOU v Linuxovom jadre.
tr: TinyALSA, ALSA ile arabirim oluşturmak için küçük bir kitaplıktır. Linux çekirdeği.

source: Frequency modulation synthesizer plugin
it: Plugin sintetizzatore a modulazione di frequenza

source: fmsynth is an LV2 plugin which implements an @dfn{FM} (Frequency Modulation) synthesizer. Unlike most FM synth implementations in software, this FM synthesizer does not aim to emulate or replicate a particular synth (like DX7) or FM chip.
it: fmsynth è un plugin LV2 che implementa un sintetizzatore a @dfn{FM} (modulazione di frequenza). A differenza della maggior parte delle implementazioni di sintetizzatori FM in software, questo sintetizzatore FM non mira a emulare o replicare un particolare sintetizzatore (come il DX7) o chip FM.

source: Video game music file playback library
de: Bibliothek zum Abspielen von Videospiel-Musikdateien
it: Libreria di riproduzione di file musicali di videogiochi
tr: Video oyunu müzik dosyası oynatma kitaplığı

source: Game-music-emu is a collection of video game music file emulators that support the following formats and systems: @table @code @item AY ZX Spectrum/Asmtrad CPC @item GBS Nintendo Game Boy @item GYM Sega Genesis/Mega Drive @item HES NEC TurboGrafx-16/PC Engine @item KSS MSX Home Computer/other Z80 systems (doesn't support FM sound) @item NSF/NSFE Nintendo NES/Famicom (with VRC 6, Namco 106, and FME-7 sound) @item SAP Atari systems using POKEY sound chip @item SPC Super Nintendo/Super Famicom @item VGM/VGZ Sega Master System/Mark III, Sega Genesis/Mega Drive, BBC Micro @end table
de: Game-music-emu ist eine Ansammlung von Videospielmusik-Emulatoren, welche die folgenden Formate unterstützen: @table @code @item AY ZX Spectrum/Asmtrad CPC @item GBS Nintendo Game Boy @item GYM Sega Genesis/Mega Drive @item HES NEC TurboGrafx-16/PC Engine @item KSS MSX Home Computer/andere Z80-Systeme (keine Unterstützung für FM-Ton) @item NSF/NSFE Nintendo NES/Famicom (mit VRC 6-, Namco 106-, und FME-7-Ton) @item SAP Atari-Systeme mit POKEY-Soundchip @item SPC Super Nintendo/Super Famicom @item VGM/VGZ Sega Master System/Mark III, Sega Genesis/Mega Drive, BBC Micro @end table
it: Game-music-emu è una collezione di emulatori di file musicali di videogiochi che supporta i seguenti formati e sistemi: @table @code @item AY ZX Spectrum/Asmtrad CPC @item GBS Nintendo Game Boy @item GYM Sega Genesis/Mega Drive @item HES NEC TurboGrafx-16/PC Engine @item KSS MSX Home Computer/altri sistemi Z80 (non supporta l'audio FM) @item NSF/NSFE Nintendo NES/Famicom (con audio VRC 6, Namco 106 e FME-7) @item SAP Sistemi Atari che utilizzano il chip audio POKEY @item SPC Super Nintendo/Super Famicom @item VGM/VGZ Sega Master System/Mark III, Sega Genesis/Mega Drive, BBC Micro @end table
sk: Game-music-emu je zbierka emulátorov hudby z videohier s podporou nasledovných formátov a systémov: @table @code @item AY ZX Spectrum/Asmtrad CPC @item GBS Nintendo Game Boy @item GYM Sega Genesis/Mega Drive @item HES NEC TurboGrafx-16/PC Engine @item KSS MSX Home Computer/iné Z80 systémy (nepodporuje FM zvuk) @item NSF/NSFE Nintendo NES/Famicom (so zvukom VRC 6, Namco 106, a FME-7) @item SAP Atari systémy so zvukovým čipom POKEY @item SPC Super Nintendo/Super Famicom @item VGM/VGZ Sega Master System/Mark III, Sega Genesis/Mega Drive, BBC Micro @end table

source: Audio tracking library
de: Tontracking-Bibliothek
it: Libreria di tracciamento audio
tr: Ses takip kütüphanesi

source: LibOpenMPT is a cross-platform C++ and C module playback library. It is based on the player code of the Open ModPlug Tracker project.
de: LibOpenMPT ist eine plattformunabhängige C- und C++-Bibliothek zum Abspielen von Modulen. Sie basiert auf dem Abspielcode des Open ModPlug Tracker-Projekts.
it: LibOpenMPT è una libreria multipiattaforma per la riproduzione di moduli C++ e C. Si basa sul codice del player del progetto Open ModPlug Tracker.
sk: LibOpenMPT je viacplatformová knižnica modulov prehrávania zapísaná v C++ a C. Je založená na zdrojovom kóde prehrávača z projektu Open ModPlug Tracker.

source: Open Fingerprint Architecture
it: Architettura aperta delle impronte digitali
tr: Açık Parmak İzi Mimarisi

source: LibOFA is an audio fingerprint library, created and provided by MusicIP.
de: LibOFA ist eine Bibliothek zum Fingerprinting von Ton, von MusicIP verfasst und bereitgestellt.
it: LibOFA è una libreria di impronte digitali audio, creata e fornita da MusicIP.
sk: LibOFA je knižnica zvukových odtlačkov, ktorú vytvoril a poskytuje MusicIP.

source: MIDI to WAVE converter library
de: Konvertierungsbibliothek von MIDI zu WAVE
it: Libreria di conversione da MIDI a WAVE
tr: MIDI'den WAVE'ye dönüştürücü kütüphanesi

source: LibTiMidity is a MIDI to WAVE converter library that uses Gravis Ultrasound-compatible patch files to generate digital audio data from General MIDI files.
de: LibTiMidity ist eine Bibliothek, die MIDI nach WAVE konvertiert. Sie nutzt mit Gravis Ultrasound kompatible Patch-Dateien, um General MIDI-Dateien in digitale Tondaten umzuwandeln.
it: LibTiMidity è una libreria di conversione da MIDI a WAVE che utilizza file patch compatibili con Gravis Ultrasound per generare dati audio digitali da file General MIDI.
sk: LibTiMidity je knižnica na prevod súborov MIDI na WAVE, ktorá na vytváranie digitálneho zvuku zo súborov General MIDI využíva opravné súbory kompatibilné s Gravis Ultrasound.
tr: LibTiMidity, MIDI'den WAVE'e dönüştürücü kitaplığıdır. General MIDI dosyalarından dijital ses verileri üretmek için Gravis Ultrason uyumlu yama dosyalarıdır.

source: Adaptive Multi Rate Codec
it: Codec multifrequenza adattivo
tr: Uyarlanabilir Çoklu Hız Codec'i

source: VO-AMR is a library of VisualOn implementation of Adaptive Multi Rate Narrowband and Wideband (AMR-NB and AMR-WB) speech codec.
de: VO-AMR ist die Bibliothek der VisualOn-Implementierung des Adaptive Multi Rate-Schmalband und -Breitband (AMR-NB und AMR-WB) Sprachcodecs.
it: VO-AMR è una libreria di implementazione VisualOn del codec vocale Adaptive Multi Rate Narrowband and Wideband (AMR-NB e AMR-WB).
tr: VO-AMR, VisualOn uygulamasının bir kütüphanesidir. Uyarlanabilir Çok Hızlı Dar Bant ve Geniş Bant (AMR-NB ve AMR-WB) konuşma codeci.

source: OpenCore-AMR is a library of OpenCORE Framework implementation of Adaptive Multi Rate Narrowband and Wideband (AMR-NB and AMR-WB) speech codec.
it: OpenCore-AMR è una libreria di OpenCORE Framework che implementa il codec vocale Adaptive Multi Rate Narrowband e Wideband (AMR-NB e AMR-WB).
tr: OpenCore-AMR, OpenCORE Framework'ün bir kütüphanesidir. Uyarlanabilir Çok Hızlı Dar Bant ve Geniş Bant uygulaması (AMR-NB ve AMR-WB) konuşma codeci.

source: Realtime modular synthesizer and effect processor
de: Echtzeitfähiger modularer Synthesizer und Effektverarbeiter
it: Sintetizzatore modulare in tempo reale e processore di effetti
tr: Gerçek zamanlı modüler sentezleyici ve efekt işlemcisi

source: AlsaModularSynth is a digital implementation of a classical analog modular synthesizer system. It uses virtual control voltages to control the parameters of the modules. The control voltages which control the frequency e.g. of the VCO (Voltage Controlled Oscillator) and VCF (Voltage Controlled Filter) modules follow the convention of 1V / Octave.
de: AlsaModularSynth ist eine digitale Implementierung eines klassischen analogen modularen Synthesizersystems. Es benutzt virtuelle Steuerungsspannungen, um die Modulparameter zu steuern. Die Steuerungsspannungen, die die Frequenz z.B. der Module VCO (Voltage Controlled Oscillator, spannungsgesteuerter Oszillator) und VCF (Voltage Controlled Filter, spannungsgesteuertes Filter) steuern, folgen der Konvention von 1V pro Oktave.
it: AlsaModularSynth è un'implementazione digitale di un classico sistema di sintetizzatore modulare analogico. Utilizza tensioni di controllo virtuali per controllare i parametri dei moduli. Le tensioni di controllo che controllano la frequenza, ad esempio dei moduli VCO (Voltage Controlled Oscillator) e VCF (Voltage Controlled Filter), seguono la convenzione di 1 V/ottava.
tr: AlsaModularSynth, klasik bir analogun dijital uygulamasıdır. modüler sentezleyici sistemi. kontrol etmek için sanal kontrol voltajlarını kullanır. modüllerin parametreleri. Frekansı kontrol eden kontrol voltajları Örneğin. VCO (Voltaj Kontrollü Osilatör) ve VCF (Voltaj Kontrollü Osilatör) Filtre) modülleri 1V / Octave konvansiyonunu takip eder.

source: Library for audio labelling
de: Programmbibliothek für Audio-Labelling
it: Libreria per l'etichettatura audio
tr: Ses etiketleme için kitaplık

source: aubio is a tool designed for the extraction of annotations from audio signals. Its features include segmenting a sound file before each of its attacks, performing pitch detection, tapping the beat and producing MIDI streams from live audio.
de: aubio ist ein Werkzeug für die Extraktion von Annotationen aus Audio-Signalen. Zu seinen Funktionalitäten gehört die Segmentierung einer Ton-Datei vor jeder Anschwellung, Tonhöhenbestimmung, Beat-Extraktion und das Erstellen von MIDI-Strömen aus Live-Audio.
it: aubio è uno strumento progettato per l'estrazione di annotazioni dai segnali audio. Le sue funzionalità includono la segmentazione di un file audio prima di ogni attacco, il rilevamento del pitch, il tapping del beat e la produzione di flussi MIDI da audio live.
tr: aubio, sesten ek açıklamaların çıkarılması için tasarlanmış bir araçtır sinyaller. Özellikleri, bir ses dosyasını her bir dosyadan önce bölümlere ayırmayı içerir. saldırılar, perde algılama gerçekleştirme, vuruşa dokunma ve canlı sesten MIDI akışları üretme.

source: Audio processing program with an interactive mode
it: Programma di elaborazione audio con modalità interattiva
tr: İnteraktif moda sahip ses işleme programı

source: dsp is an audio processing program with an interactive mode.
it: dsp è un programma di elaborazione audio con modalità interattiva.
sv: dsp är ett ljudbehandlingsprogram med ett interaktivt läge.
tr: dsp, interaktif moda sahip bir ses işleme programıdır.

source: C++ library of functions for DSP and Music Informatics purposes
it: Libreria C++ di funzioni per scopi DSP e di informatica musicale
tr: DSP ve Müzik Bilişimi amaçlarına yönelik C++ işlev kitaplığı

source: QM-DSP is a C++ library of functions for DSP and Music Informatics purposes developed at Queen Mary, University of London.
it: QM-DSP è una libreria C++ di funzioni per DSP e informatica musicale , sviluppata presso la Queen Mary University of London.

source: Audio effect processor for PipeWire and PulseAudio clients
it: Processore di effetti audio per i client PipeWire e PulseAudio
