Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: Lziprecover is a data recovery tool and decompressor for files in the lzip compressed data format (.lz). It can test the integrity of lzip files, extract data from damaged ones, and repair most files with small errors (up to one single-byte error per member) entirely. Lziprecover is not a replacement for regular backups, but a last line of defence when even the backups are corrupt. It can recover files by merging the good parts of two or more damaged copies, such as can be easily produced by running @command{ddrescue} on a failing device. This package also includes @command{unzcrash}, a tool to test the robustness of decompressors when faced with corrupted input.
it: Lziprecover è uno strumento di recupero dati e un decompressore per file nel formato di dati compressi lzip (.lz). Può testare l'integrità dei file lzip, estrarre dati da quelli danneggiati e riparare completamente la maggior parte dei file con piccoli errori (fino a un errore di un singolo byte per membro). Lziprecover non è un sostituto dei backup regolari, ma un'ultima linea di difesa quando anche i backup sono corrotti. Può recuperare i file unendo le parti buone di due o più copie danneggiate, come quelle che possono essere facilmente prodotte eseguendo @command{ddrescue} su un dispositivo guasto. Questo pacchetto include anche @command{unzcrash}, uno strumento per testare la robustezza dei decompressori di fronte a input corrotti.

source: Archives in shell scripts, uuencode/uudecode
it: Archivi in script di shell, uuencode/uudecode

source: GNU sharutils is a package for creating and manipulating shell archives that can be readily emailed. A shell archive is a file that can be processed by a Bourne-type shell to unpack the original collection of files. This package is mostly for compatibility and historical interest.
it: GNU sharutils è un pacchetto per la creazione e la manipolazione di archivi di shell che possono essere facilmente inviati via email. Un archivio di shell è un file che può essere elaborato da una shell di tipo Bourne per decomprimere la collezione originale di file. Questo pacchetto è principalmente per compatibilità e interesse storico.

source: Library for SoundFont decompression
it: Libreria per la decompressione di SoundFont

source: SfArkLib is a C++ library for decompressing SoundFont files compressed with the sfArk algorithm.
it: SfArkLib è una libreria C++ per decomprimere i file SoundFont compressi con l'algoritmo sfArk.

source: Zip manipulation library
it: Libreria di manipolazione Zip

source: @code{minizip-ng} is a zip manipulation library written in C, forked from the zip manipulation library found in the zlib distribution.
it: @code{minizip-ng} è una libreria di manipolazione di file zip scritta in C, derivata dalla libreria di manipolazione di file zip trovata nella distribuzione di zlib.

source: Basic sfArk decompressor
it: Decompressore sfArk di base

source: SfArk extractor converts SoundFonts in the compressed legacy sfArk file format to the uncompressed sf2 format.
it: L'estrattore SfArk converte i SoundFont nel formato di file sfArk compresso legacy nel formato sf2 non compresso.

source: Compress and decompress 3D geometric meshes and point clouds
it: Comprime e decomprimi mesh geometriche 3D e nuvole di punti

source: Draco is a library for compressing and decompressing 3D geometric meshes and point clouds. It is intended to improve the storage and transmission of 3D graphics.
it: Draco è una libreria per comprimere e decomprimere mesh geometriche 3D e nuvole di punti. Ha lo scopo di migliorare l'archiviazione e la trasmissione di grafica 3D.

source: Compression tools for some formats used by Microsoft
it: Strumenti di compressione per alcuni formati utilizzati da Microsoft

source: The purpose of libmspack is to provide both compression and decompression of some loosely related file formats used by Microsoft.
it: Lo scopo di libmspack è fornire sia la compressione che la decompressione di alcuni formati di file correlati in modo lasco utilizzati da Microsoft.

source: Compression algorithm focused on speed
it: Algoritmo di compressione focalizzato sulla velocità

source: LZ4 is a lossless compression algorithm, providing compression speed at 400 MB/s per core (0.16 Bytes/cycle). It also features an extremely fast decoder, with speed in multiple GB/s per core (0.71 Bytes/cycle). A high compression derivative, called LZ4_HC, is also provided. It trades CPU time for compression ratio.
it: LZ4 è un algoritmo di compressione senza perdita, che fornisce una velocità di compressione di 400 MB/s per core (0,16 Byte/ciclo). Dispone anche di un decoder estremamente veloce, con una velocità di più GB/s per core (0,71 Byte/ciclo). Viene fornita anche una derivata ad alta compressione, chiamata LZ4_HC. Scambia il tempo della CPU per il rapporto di compressione.

source: Tools to create and extract squashfs file systems
it: Strumenti per creare ed estrarre file system squashfs

source: Squashfs is a highly compressed read-only file system for Linux. It compresses files, inodes, and directories with one of several compressors. All blocks are packed to minimize the data overhead, and block sizes of between 4K and 1M are supported. It is intended to be used for archival use, for live media, and for embedded systems where low overhead is needed. This package allows you to create and extract such file systems.
it: Squashfs è un file system di sola lettura altamente compresso per Linux. Comprime file, inode e directory con uno di diversi compressori. Tutti i blocchi sono impacchettati per minimizzare il sovraccarico dei dati e sono supportate dimensioni dei blocchi tra 4K e 1M. È destinato all'uso archivistico, per i media live e per i sistemi embedded in cui è richiesto un basso sovraccarico. Questo pacchetto consente di creare ed estrarre tali file system.

source: Squashfs is a highly compressed read-only file system for Linux. It compresses files, inodes, and directories with one of several compressors. All blocks are packed to minimize the data overhead, and block sizes of between 4K and 1M are supported. It is intended to be used for archival use, for live media, and for embedded systems where low overhead is needed. The squashfs-tools-ng package offers alternative tooling to create and extract such file systems. It is not based on the older squashfs-tools package and its tools have different names: @enumerate @item @command{gensquashfs} produces SquashFS images from a directory or @command{gen_init_cpio}-like file listings and can generate SELinux labels. @item @command{rdsquashfs} inspects and unpacks SquashFS images. @item @command{sqfs2tar} and @command{tar2sqfs} convert between SquashFS and tarballs. @item @command{sqfsdiff} compares the contents of two SquashFS images. @end enumerate These commands are largely command-line wrappers around the included @code{libsquashfs} library that intends to make SquashFS available to other applications as an embeddable, extensible archive format. Both the library and tools operate deterministically: same input will produce byte-for-byte identical output.
it: Squashfs è un file system di sola lettura altamente compresso per Linux. Comprime file, inode e directory con uno di diversi compressori. Tutti i blocchi sono impacchettati per minimizzare il sovraccarico dei dati e sono supportate dimensioni dei blocchi tra 4K e 1M. È destinato all'uso archivistico, per i media live e per i sistemi embedded in cui è richiesto un basso sovraccarico. Il pacchetto squashfs-tools-ng offre strumenti alternativi per creare ed estrarre tali file system. Non è basato sul pacchetto più vecchio squashfs-tools e i suoi strumenti hanno nomi diversi: @enumerate @item @command{gensquashfs} produce immagini SquashFS da una directory o da elenchi di file simili a @command{gen_init_cpio} e può generare etichette SELinux. @item @command{rdsquashfs} ispeziona e decomprime le immagini SquashFS. @item @command{sqfs2tar} e @command{tar2sqfs} convertono tra SquashFS e tarball. @item @command{sqfsdiff} confronta il contenuto di due immagini SquashFS. @end enumerate Questi comandi sono in gran parte wrapper da riga di comando per la libreria @code{libsquashfs} inclusa, che intende rendere SquashFS disponibile ad altre applicazioni come un formato di archivio incorporabile ed estensibile. Sia la libreria che gli strumenti operano in modo deterministico: lo stesso input produrrà un output identico byte per byte.

source: Parallel implementation of gzip
it: Implementazione parallela di gzip

source: This package provides a parallel implementation of gzip that exploits multiple processors and multiple cores when compressing data.
it: Questo pacchetto fornisce un'implementazione parallela di gzip che sfrutta più processori e più core durante la compressione dei dati.

source: Parallel indexing implementation of LZMA
it: Implementazione parallela di indicizzazione di LZMA

source: The existing XZ Utils provide great compression in the .xz file format, but they produce just one big block of compressed data. Pixz instead produces a collection of smaller blocks which makes random access to the original data possible and can compress in parallel. This is especially useful for large tarballs.
it: Le utilità XZ esistenti forniscono un'ottima compressione nel formato di file .xz, ma producono un solo grande blocco di dati compressi. Pixz invece produce una raccolta di blocchi più piccoli che rende possibile l'accesso casuale ai dati originali e può comprimere in parallelo. Ciò è particolarmente utile per i grandi tarball.

source: Tool to unpack Cabinet archives
it: Strumento per decomprimere archivi Cabinet

source: Extracts files out of Microsoft Cabinet (.cab) archives
it: Estrae i file dagli archivi Cabinet (.cab) di Microsoft

source: Library for reading and writing Jcat files
it: Libreria per la lettura e la scrittura di file Jcat

source: This library allows reading and writing gzip-compressed JSON catalog files, which can be used to store GPG, PKCS-7 and SHA-256 checksums for each file.
it: Questa libreria consente di leggere e scrivere file di catalogo JSON compressi con gzip, che possono essere utilizzati per archiviare i checksum GPG, PKCS-7 e SHA-256 per ogni file.

source: Delta encoder for binary files
it: Codificatore delta per file binari

source: xdelta encodes only the differences between two binary files using the VCDIFF algorithm and patch file format described in RFC 3284. It can also be used to apply such patches. xdelta is similar to @command{diff} and @command{patch}, but is not limited to plain text and does not generate human-readable output.
it: xdelta codifica solo le differenze tra due file binari utilizzando l'algoritmo VCDIFF e il formato di file di patch descritto in RFC 3284. Può anche essere utilizzato per applicare tali patch. xdelta è simile a @command{diff} e @command{patch}, ma non è limitato al testo semplice e non genera output leggibile dall'uomo.

source: Large file compressor with a very high compression ratio
it: Compressore per file di grandi dimensioni con un rapporto di compressione molto elevato

source: lrzip is a compression utility that uses long-range redundancy reduction to improve the subsequent compression ratio of larger files. It can then further compress the result with the ZPAQ or LZMA algorithms for maximum compression, or LZO for maximum speed. This choice between size or speed allows for either better compression than even LZMA can provide, or a higher speed than gzip while compressing as well as bzip2.
it: lrzip è un'utilità di compressione che utilizza la riduzione della ridondanza a lungo raggio per migliorare il successivo rapporto di compressione di file più grandi. Può quindi comprimere ulteriormente il risultato con gli algoritmi ZPAQ o LZMA per la massima compressione, o LZO per la massima velocità. Questa scelta tra dimensione o velocità consente una compressione migliore di quella che può fornire anche LZMA, o una velocità superiore a gzip pur comprimendo bene quanto bzip2.

source: Fast compressor/decompressor
it: Compressore/decompressore veloce
sv: Snabb kompressor/dekompressor

source: Snappy is a compression/decompression library. It does not aim for maximum compression, or compatibility with any other compression library; instead, it aims for very high speeds and reasonable compression. For instance, compared to the fastest mode of zlib, Snappy is an order of magnitude faster for most inputs, but the resulting compressed files are anywhere from 20% to 100% bigger.
it: Snappy è una libreria di compressione/decompressione. Non mira alla massima compressione o alla compatibilità con altre librerie di compressione; mira invece a velocità molto elevate e a una compressione ragionevole. Ad esempio, rispetto alla modalità più veloce di zlib, Snappy è un ordine di grandezza più veloce per la maggior parte degli input, ma i file compressi risultanti sono più grandi dal 20% al 100%.

source: Command-line file archiver with high compression ratio
it: Archiviatore di file da riga di comando con alto rapporto di compressione

source: p7zip is a command-line port of 7-Zip, a file archiver that handles the 7z format which features very high compression ratios.
it: p7zip è un port da riga di comando di 7-Zip, un archiviatore di file che gestisce il formato 7z, caratterizzato da rapporti di compressione molto elevati.

source: Compressed C++ iostream
it: iostream C++ compresso

source: gzstream is a small library for providing zlib functionality in a C++ iostream.
it: gzstream è una piccola libreria per fornire la funzionalità di zlib in un iostream C++.

source: Very good, but slow, deflate or zlib compression
it: Compressione deflate o zlib molto buona, ma lenta

source: Zopfli Compression Algorithm is a compression library programmed in C to perform very good, but slow, deflate or zlib compression. ZopfliCompress supports the deflate, gzip and zlib output formats. This library can only compress, not decompress; existing zlib or deflate libraries can decompress the data.
it: L'algoritmo di compressione Zopfli è una libreria di compressione programmata in C per eseguire una compressione deflate o zlib molto buona, ma lenta. ZopfliCompress supporta i formati di output deflate, gzip e zlib. Questa libreria può solo comprimere, non decomprimere; le librerie zlib o deflate esistenti possono decomprimere i dati.

source: Incremental journaling archiver
it: Archiviatore incrementale con journaling

source: ZPAQ is a command-line archiver for realistic situations with many duplicate and already compressed files. It backs up only those files modified since the last update. All previous versions remain untouched and can be independently recovered. Identical files are only stored once (known as @dfn{de-duplication}). Archives can also be encrypted. ZPAQ is intended to back up user data, not entire operating systems. It ignores owner and group IDs, ACLs, extended attributes, or special file types like devices, sockets, or named pipes. It does not follow or restore symbolic links or junctions, and always follows hard links.
it: ZPAQ è un archiviatore da riga di comando per situazioni realistiche con molti file duplicati e già compressi. Esegue il backup solo dei file modificati dall'ultimo aggiornamento. Tutte le versioni precedenti rimangono intatte e possono essere recuperate indipendentemente. I file identici vengono memorizzati una sola volta (noto come @dfn{de-duplication}). Gli archivi possono anche essere crittografati. ZPAQ è destinato al backup dei dati dell'utente, non di interi sistemi operativi. Ignora gli ID di proprietario e gruppo, le ACL, gli attributi estesi o i tipi di file speciali come dispositivi, socket o pipe nominate. Non segue né ripristina collegamenti simbolici o giunzioni e segue sempre i collegamenti fisici.

source: Extract CAB files from InstallShield installers
it: Estrai file CAB dagli installatori di InstallShield

source: @command{unshield} is a tool and library for extracting @file{.cab} archives from InstallShield installers.
it: @command{unshield} è uno strumento e una libreria per estrarre archivi @file{.cab} dagli installatori di InstallShield.

source: Zstandard real-time compression algorithm
it: Algoritmo di compressione in tempo reale Zstandard

source: Zstandard (@command{zstd}) is a lossless compression algorithm that combines very fast operation with a compression ratio comparable to that of zlib. In most scenarios, both compression and decompression can be performed in ‘real time’. The compressor can be configured to provide the most suitable trade-off between compression ratio and speed, without affecting decompression speed.
it: Zstandard (@command{zstd}) è un algoritmo di compressione senza perdita che combina un funzionamento molto veloce con un rapporto di compressione paragonabile a quello di zlib. Nella maggior parte degli scenari, sia la compressione che la decompressione possono essere eseguite in 'tempo reale'. Il compressore può essere configurato per fornire il compromesso più adatto tra rapporto di compressione e velocità, senza influire sulla velocità di decompressione.

source: Threaded implementation of the Zstandard compression algorithm
it: Implementazione multithread dell'algoritmo di compressione Zstandard

source: Parallel Zstandard (PZstandard or @command{pzstd}) is a multi-threaded implementation of the @uref{http://zstd.net/, Zstandard compression algorithm}. It is fully compatible with the original Zstandard file format and command-line interface, and can be used as a drop-in replacement. Compression is distributed over multiple processor cores to improve performance, as is the decompression of data compressed in this manner. Data compressed by other implementations will only be decompressed by two threads: one performing the actual decompression, the other input and output.
it: Parallel Zstandard (PZstandard o @command{pzstd}) è un'implementazione multithread dell'@uref{http://zstd.net/, algoritmo di compressione Zstandard}. È completamente compatibile con il formato di file e l'interfaccia a riga di comando originali di Zstandard e può essere utilizzato come sostituto diretto. La compressione è distribuita su più core del processore per migliorare le prestazioni, così come la decompressione dei dati compressi in questo modo. I dati compressi da altre implementazioni verranno decompressi solo da due thread: uno che esegue la decompressione effettiva, l'altro l'input e l'output.

source: Compression and file packing utility
de: Dateien vergleichen und in Archive bündeln
it: Utilità di compressione e imballaggio di file

source: Zip is a compression and file packaging/archive utility. Zip is useful for packaging a set of files for distribution, for archiving files, and for saving disk space by temporarily compressing unused files or directories. Zip puts one or more compressed files into a single ZIP archive, along with information about the files (name, path, date, time of last modification, protection, and check information to verify file integrity). An entire directory structure can be packed into a ZIP archive with a single command. Zip has one compression method (deflation) and can also store files without compression. Zip automatically chooses the better of the two for each file. Compression ratios of 2:1 to 3:1 are common for text files.
it: Zip è un'utilità di compressione e imballaggio/archivio di file. Zip è utile per imballare un insieme di file per la distribuzione, per archiviare file e per risparmiare spazio su disco comprimendo temporaneamente file o directory non utilizzati. Zip inserisce uno o più file compressi in un unico archivio ZIP, insieme alle informazioni sui file (nome, percorso, data, ora dell'ultima modifica, protezione e informazioni di controllo per verificare l'integrità del file). Un'intera struttura di directory può essere impacchettata in un archivio ZIP con un unico comando. Zip ha un metodo di compressione (deflazione) e può anche memorizzare file senza compressione. Zip sceglie automaticamente il migliore dei due per ogni file. Rapporti di compressione da 2:1 a 3:1 sono comuni per i file di testo.

source: Decompression and file extraction utility
it: Utilità di decompressione ed estrazione di file

source: CA certificates from Mozilla
it: Certificati CA da Mozilla

source: This package provides certificates for Certification Authorities (CA) taken from the NSS package and thus ultimately from the Mozilla project.
it: Questo pacchetto fornisce i certificati per le Autorità di Certificazione (CA) presi dal pacchetto NSS e quindi, in ultima analisi, dal progetto Mozilla.

source: This package provides a tiny system info utility.
sv: Det här paketet tillhandahåller ett pyttelitet verktyg för systeminformation.

source: This package provides a simple, configurable system information tool.
sv: Det här paketet tillhandahåller ett enkelt och konfigurerbart systeminformationsverktyg.

source: This package provides @code{udev} bindings for Python.
sv: Det här paketet tillhandahåller @code{udev}-bindningar till Python.

source: This package provides Python bindings for the Littlewood-Richardson Calculator.
sv: Det här paketet tillhandahåller Python-bindningar för Littlewood-Richardson -kalkylatorn.

source: This package provides an implementation of APL in Java, extended from Dyalog APL.
sv: Det här paketet tillhandahåller en implementering av APL i Java, förlängt från Dyalog APL.

source: This package provides ASDF schemas for validating FITS tags.
sv: Det här paketet tillhandahåller ASDF-scheman för bekräftelse av FITS-taggar.

source: This package provides HEALPix to the Astropy project.
sv: Det här paketet tillhandahåller HEALPix till Astropy-projektet.

source: Python read-only implementation of the @code{EventIO} file format.
sv: Python-implementation endast med läsrättigheter av filformatet @code{EventIO}.

source: This package provides a cython-optimized implementations of empirical dust exitinction laws found in the literature.
sv: Detta paket tillhandahåller cython-optimerade implementationer av empiriska damm utrotningslagar som hittas i litteraturen.

source: This package implements a functionality to match sky on image mosaic.
sv: Detta paket implementerar en funktion för att matcha himlen på en bildmosaik.

source: This package provides a tooling for solar X-ray spectroscopy based on SunPy.
sv: Detta paket tillhandahåller verktyg för solröntgenspektroskopi baserat på SunPy.

source: This package provides a Python package for reading raw fcs files
sv: Det här paketet tillhandahåller ett Python-paket för läsning av råa fcs-filer

source: Implementation of the Smith-Waterman algorithm.
sv: Implementation av Smith-Waterman-algoritmen.

source: This package provides a pytest plugin for generating NUnit3 test result XML output
sv: Det här paketet tillhandahåller ett pytest-insticksprogram för att generera testresultat av XML-utmatningen för NUnit3

source: Tools for writing macros.
sv: Verktyg för att skriva makros.

source: URL parser
sv: URL-tolkare

source: Aster Models
sv: Aster-modeller

source: R package providing subset of Boost headers
sv: R-paket som tillhandahåller en delmängd av Boost-rubriker

source: Miscellaneous functions for probability theory
sv: Diverse funktioner för sannolikhetsteori

source: Signal processing
sv: Signalbehandling

source: Climate tools
sv: Klimatverktyg

source: Survival analysis
sv: Överlevnadsanalys

source: Miscellaneous functions for SciViews
sv: Diverse funktioner för SciViews

source: Clustering
sv: Klusterbildning

source: Key-value database
sv: Databasens nyckelvärde

source: Trivial database
sv: Ordinär databas

source: Memory scanner
sv: Minneskannare
