Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: This package provides a LADSPA plugin for a four-band parametric equalizer. Each section has an active/bypass switch, frequency, bandwidth and gain controls. There is also a global bypass switch and gain control. The 2nd order resonant filters are implemented using a Mitra-Regalia style lattice filter, which is stable even while parameters are being changed. All switches and controls are internally smoothed, so they can be used @code{live} without any clicks or zipper noises. This makes this plugin suitable for use in systems that allow automation of plugin control ports, such as Ardour, or for stage use.
de: Dieses Paket bietet ein LADSPA-Plugin für einen Vierband-Parametrischen-Equalizer. Jeder Teil hat einen Active-/Bypass-Umschalter sowie eine Frequenz-, Bandbreiten- und Verstärkungssteuerung. Es gibt auch einen globalen Bypass-Umschalter und Verstärkungssteuerung. Die resonanten Filter 2. Ordnung sind mit Hilfe eines Mitra-Regalia-artigen Lattice-Filters implementiert, welcher stabil ist, selbst wenn Parameter geändert werden. Alle Umschalter und Steuerungen werden intern geglättet, damit sie @i{live} ohne Klick- oder Reißgeräusche benutzt werden können. Dadurch ist das Plugin in Systemen wie z.B. Ardour, die die Automatisierung von Plugin-Steuerungs-Ports ermöglichen, oder auf Bühnen nutzbar.
it: Questo pacchetto fornisce un plugin LADSPA per un equalizzatore parametrico a quattro bande. Ogni sezione ha un interruttore attivo/bypass, controlli di frequenza, larghezza di banda e guadagno. C'è anche un interruttore di bypass globale e un controllo del guadagno. I filtri risonanti di 2° ordine sono implementati utilizzando un filtro a reticolo in stile Mitra-Regalia, che è stabile anche durante la modifica dei parametri. Tutti gli interruttori e i controlli sono smussati internamente, quindi possono essere utilizzati @code{live} senza scatti o rumori. Questo rende questo plugin adatto per l'uso in sistemi che consentono l'automazione delle porte di controllo dei plugin, come Ardour, o per l'uso sul palco.

source: LADSPA stereo width plugin
de: LADSPA-Stereobreiten-Plugin
it: Plugin LADSPA per l'ampiezza stereo
tr: LADSPA stereo genişlik eklentisi

source: This package provides a LADSPA plugin to manipulate the stereo width of audio signals.
de: Dieses Paket bietet ein LADSPA-Plugin, um die Stereobreite von Audiosignalen zu ändern.
it: Questo pacchetto fornisce un plugin LADSPA per manipolare l'ampiezza stereo dei segnali audio.
tr: Bu paket, ses sinyallerinin stereo genişliğini değiştirmek için bir LADSPA eklentisi sağlar.

source: LADSPA plugin for synthesizer oscillators
de: LADSPA-Plugin für Synthesizer-Oszillatoren
it: Plugin LADSPA per oscillatori di sintetizzatori

source: The @code{blvco} LADSPA plugin provides three anti-aliased oscillators: @enumerate @item Pulse-VCO, a dirac pulse oscillator with flat amplitude spectrum @item Saw-VCO, a sawtooth oscillator with 1/F amplitude spectrum @item Rec-VCO, a square / rectangle oscillator @end enumerate All oscillators are low-pass filtered to provide waveforms similar to the output of analog synthesizers such as the Moog Voyager.
de: Das @code{blvco}-LADSPA-Plugin bietet drei Oszillatoren mit Antialiasing: @enumerate @item Pulse-VCO, ein Dirac-Puls-Oszillator mit flachem Amplitudenspektrum @item Saw-VCO, einen Sägezahn-Oszillator mit 1/F-Amplitudenspektrum @item Rec-VCO, einen Quadrat-/Rechtecksoszillator @end enumerate Alle Oszillatoren sind tiefpassgefiltert, um Wellenformen ähnlich der Ausgabe von Analog-Synthesizern wie dem Moog Voyager zu bieten.
it: Il plugin LADSPA @code{blvco} fornisce tre oscillatori anti-aliasing: @enumerate @item Pulse-VCO, un oscillatore a impulsi di Dirac con spettro di ampiezza piatto @item Saw-VCO, un oscillatore a dente di sega con spettro di ampiezza 1/F @item Rec-VCO, un oscillatore a onda quadra/rettangolare @end enumerate Tutti gli oscillatori sono filtrati passa-basso per fornire forme d'onda simili all'output dei sintetizzatori analogici come il Moog Voyager.

source: LADSPA Autowah effect plugin
de: LADSPA-Autowah-Effekt-Plugin
it: Plugin effetto Autowah LADSPA

source: This package provides a LADSPA plugin for a Wah effect with envelope follower.
de: Dieses Paket bietet ein LADSPA-Plugin für einen Wah-Effekt mit Envelope-Follower.
it: Questo pacchetto fornisce un plugin LADSPA per un effetto Wah con envelope follower.

source: LADSPA stereo reverb plugin
de: LADSPA-Stereo-Nachhall-Plugin
it: Plugin di riverbero stereo LADSPA

source: This package provides a LADSPA plugin for a stereo reverb effect.
de: Dieses Paket bietet ein LADSPA-Plugin für einen Stereo-Nachhall-Effekt.
it: Questo pacchetto fornisce un plugin LADSPA per un effetto di riverbero stereo.
tr: Bu paket, stereo yankı efekti için bir LADSPA eklentisi sağlar.

source: SoundFont synthesizer
it: Sintetizzatore SoundFont
sv: Syntesizern SoundFont

source: FluidSynth is a real-time software synthesizer based on the SoundFont 2 specifications. FluidSynth reads and handles MIDI events from the MIDI input device. It is the software analogue of a MIDI synthesizer. FluidSynth can also play midifiles using a Soundfont.
de: FluidSynth ist ein Echtzeit-Software-Synthesizer basierend auf den SoundFont-2-Spezifikationen. FluidSynth liest und behandelt MIDI-Ereignisse von dem MIDI-Eingabegerät. Es ist das Software-Analogon eines MIDI-Synthesizers. FluidSynth kann auch Midifiles unter Benutzung eines Soundfonts abspielen.
it: FluidSynth è un sintetizzatore software in tempo reale basato sulle specifiche SoundFont 2. FluidSynth legge e gestisce gli eventi MIDI provenienti dal dispositivo di input MIDI. È l'analogo software di un sintetizzatore MIDI. FluidSynth può anche riprodurre file MIDI utilizzando un Soundfont.

source: MPEG-4 and MPEG-2 AAC decoder
de: MPEG-4- und MPEG-2-AAC-Decoder
it: Decodificatore AAC MPEG-4 e MPEG-2

source: FAAD2 is an MPEG-4 and MPEG-2 AAC decoder supporting LC, Main, LTP, SBR, -PS, and DAB+.
de: FAAD2 ist ein MPEG-4- und MPEG-2-AAC-Decoder, der LC, Main, LTP, SBR, PS und DAB+ unterstützt.
it: FAAD2 è un decodificatore AAC MPEG-4 e MPEG-2 che supporta LC, Main, LTP, SBR, -PS e DAB+.

source: Signal processing language
de: Signalverarbeitungssprache
it: Linguaggio di elaborazione del segnale

source: Faust is a programming language for realtime audio signal processing.
de: Faust ist eine Programmiersprache für Echtzeit-Audiosignalverarbeitung.
it: Faust è un linguaggio di programmazione per l'elaborazione di segnali audio in tempo reale.

source: GUS compatible patches for MIDI players
de: GUS-kompatible Patches für MIDI-Abspieler
it: Patch compatibili con GUS per lettori MIDI

source: FreePats is a project to create a free and open set of GUS compatible patches that can be used with softsynths such as Timidity and WildMidi.
de: FreePats ist ein Projekt, eine freie und offene Sammlung von GUS-kompatiblen Patches zu erstellen, die mit Softsynths wie Timidity und WildMidi benutzt werden können.
it: FreePats è un progetto per creare un set libero e aperto di patch compatibili con GUS che possono essere utilizzate con softsynth come Timidity e WildMidi.

source: General MIDI sound set
it: Set di suoni General MIDI

source: FreePats is a project to create a free (as in free software) collection of digital instruments for music production. This sound bank is a partial release of the General MIDI sound set.
it: FreePats è un progetto per creare una collezione libera (nel senso di software libero) di strumenti digitali per la produzione musicale. Questo banco di suoni è una versione parziale del set di suoni General MIDI.

source: Virtual guitar amplifier
de: Virtueller Gitarrenverstärker
it: Amplificatore per chitarra virtuale
sv: Virtuell gitarrförstärkare

source: Guitarix is a virtual guitar amplifier running JACK. Guitarix takes the signal from your guitar as a mono-signal from your sound card. The input is processed by a main amp and a rack-section. Both can be routed separately and deliver a processed stereo-signal via JACK. You may fill the rack with effects from more than 25 built-in modules including stuff from a simple noise gate to modulation effects like flanger, phaser or auto-wah.
de: Guitarix ist ein virtueller Gitarrenverstärker für JACK. Guitarix nimmt das Signal von Ihrer Gitarre als ein Monosignal Ihrer Soundkarte entgegen. Die Eingabe wird von einem Hauptverstärker und einer Rack-Section verarbeitet. Beide können separat geroutet werden und liefern ein verarbeitetes Stereo-Signal via JACK. Sie können das Rack mit Effekten aus mehr als 25 eingebauten Modulen füllen. Die Auswahl reicht von einfachen Noise-Gates bis hin zu Modulationseffekten wie Flanger, Phaser oder Auto-Wah.
it: Guitarix è un amplificatore per chitarra virtuale che funziona con JACK. Guitarix prende il segnale dalla tua chitarra come un segnale mono dalla tua scheda audio. L'input viene elaborato da un amplificatore principale e da una sezione rack. Entrambi possono essere instradati separatamente e fornire un segnale stereo elaborato tramite JACK. Puoi riempire il rack con effetti da più di 25 moduli integrati, tra cui elementi che vanno da un semplice noise gate a effetti di modulazione come flanger, phaser o auto-wah.

source: Audio effects processor
de: Audioeffektverarbeiter
it: Processore di effetti audio

source: Rakarrack is a richly featured multi-effects processor emulating a guitar effects pedalboard. Effects include compressor, expander, noise gate, equalizers, exciter, flangers, chorus, various delay and reverb effects, distortion modules and many more. Most of the effects engine is built from modules found in the excellent software synthesizer ZynAddSubFX. Presets and user interface are optimized for guitar, but Rakarrack processes signals in stereo while it does not apply internal band-limiting filtering, and thus is well suited to all musical instruments and vocals.
de: Rakarrack ist ein Multi-Effekt-Verarbeitungsprogramm mit reichhaltigen Funktionalitäten, welches ein Gitarreneffekte-Pedalboard emuliert. Effekte sind unter anderem Kompressor, Expander, Noise-Gate, Equalizer, Exciter, Flanger, Chorus, verschiedene Verzögerungs- und Nachhall-Effekte, Verzerrungsmodule und vieles mehr. Der Großteil der Effekt-Engine setzt sich zusammen aus Modulen, die im exzellenten Software-Synthesizer ZynAddSubFX zu finden sind. Voreinstellungen und Benutzerschnittstelle sind optimiert für die Gitarre, aber Rakarrack verarbeitet Signale in Stereo, während es keine interne bandbegrenzende Filterung durchführt, und ist daher für alle Musikinstrumente und Vocals gut geeignet.
it: Rakarrack è un processore multi-effetto ricco di funzionalità che emula una pedaliera per chitarra. Gli effetti includono compressore, espansore, noise gate, equalizzatori, exciter, flanger, chorus, vari effetti di delay e riverbero, moduli di distorsione e molti altri. La maggior parte del motore degli effetti è costruita da moduli trovati nell'eccellente sintetizzatore software ZynAddSubFX. I preset e l'interfaccia utente sono ottimizzati per la chitarra, ma Rakarrack elabora i segnali in stereo senza applicare un filtraggio interno di limitazione di banda, ed è quindi adatto a tutti gli strumenti musicali e alle voci.

source: LV2 convolution reverb
de: LV2-Faltungs-Nachhall
it: Riverbero a convoluzione LV2

source: IR is a low-latency, real-time, high performance signal convolver especially for creating reverb effects. It supports impulse responses with 1, 2 or 4 channels, in any soundfile format supported by libsndfile.
de: IR ist ein Programm für Signalfaltungen mit niedriger Latenz, in Echtzeit und mit hoher Leistung besonders zum Generieren von Nachhall-Effekten. Es unterstützt Impulsantworten mit 1, 2 oder 4 Kanälen in einem beliebigen Tondateienformat, das von libsndfile unterstützt wird.
it: IR è un convolutore di segnali a bassa latenza, in tempo reale e ad alte prestazioni, specialmente per la creazione di effetti di riverbero. Supporta risposte all'impulso con 1, 2 o 4 canali, in qualsiasi formato di file audio supportato da libsndfile.

source: JACK audio connection kit
de: JACK-Audioverbindungs-Kit
it: Kit di connessione audio JACK

source: JACK is a low-latency audio server. It can connect a number of different applications to an audio device, as well as allowing them to share audio between themselves. JACK is different from other audio server efforts in that it has been designed from the ground up to be suitable for professional audio work. This means that it focuses on two key areas: synchronous execution of all clients, and low latency operation.
de: JACK ist ein Audio-Server mit niedriger Latenz. Er kann eine Reihe verschiedener Anwendungen mit einem Audiogerät verbinden und ihnen zudem ermöglichen, untereinander Audio auszutauschen. JACK unterscheidet sich von anderen Audioservern darin, dass JACK von Anfang an für professionelle Audio-Arbeiten entwickelt wurde. Das bedeutet, dass JACK den Fokus auf zwei Schlüsselbereiche legt: synchrone Ausführung aller Clients und niedrige Latenz.
it: JACK è un server audio a bassa latenza. Può connettere un numero di applicazioni diverse a un dispositivo audio, oltre a consentire loro di condividere l'audio tra di loro. JACK è diverso da altri sforzi di server audio in quanto è stato progettato da zero per essere adatto al lavoro audio professionale. Ciò significa che si concentra su due aree chiave: l'esecuzione sincrona di tutti i client e il funzionamento a bassa latenza.

source: Tools for JACK connections
it: Strumenti per le connessioni JACK

source: This package provides tools for managing JACK connections and testing or configuring the JACK session. Tools include @code{jack_lsp}, @code{jack_connect}, and @code{jack_transport}.
it: Questo pacchetto fornisce strumenti per la gestione delle connessioni JACK e per il test o la configurazione della sessione JACK. Gli strumenti includono @code{jack_lsp}, @code{jack_connect} e @code{jack_transport}.

source: Multi-machine audio system for network music performance
it: Sistema audio multi-macchina per performance musicali in rete

source: JackTrip is a multi-machine audio system used for network music performance over the Internet. It supports any number of channels (as many as the computer/network can handle) of bidirectional, high quality, uncompressed audio signal streaming.
it: JackTrip è un sistema audio multi-macchina utilizzato per le performance musicali in rete su Internet. Supporta un numero qualsiasi di canali (tanti quanti il computer/rete può gestire) di streaming audio bidirezionale, di alta qualità e non compresso.

source: JACK Mixer: A multi-channel audio mixer for the JACK Audio Connection Kit
it: JACK Mixer: un mixer audio multicanale per il JACK Audio Connection Kit

source: The jack_mixer is a GTK+ JACK audio mixer app with a look & handling similar to hardware mixing desks. It has lot of useful features, apart from being able to mix multiple JACK audio streams.
it: jack_mixer è un'applicazione di mixaggio audio JACK con interfaccia GTK+, dall'aspetto e dalla gestione simili a quelli delle console di mixaggio hardware. Ha molte funzioni utili, oltre alla capacità di mixare più flussi audio JACK.

source: Simple LV2 host for JACK
de: Einfacher LV2-Host für JACK
it: Semplice host LV2 per JACK

source: Jalv is a simple but fully featured LV2 host for JACK. It runs LV2 plugins and exposes their ports as JACK ports, essentially making any LV2 plugin function as a JACK application.
de: Jalv ist ein einfacher, aber voll funktionsfähiger LV2-Host für JACK. Er führt LV2-Plugins aus und stellt ihre Ports als JACK-Ports zur Verfügung, wodurch quasi jede LV2-Plugin-Funktion zu einer JACK-Anwendung wird.
it: Jalv è un host LV2 semplice ma completo per JACK. Esegue i plugin LV2 e ne espone le porte come porte JACK, rendendo essenzialmente ogni plugin LV2 funzionante come un'applicazione JACK.

source: LADSPA is a standard that allows software audio processors and effects to be plugged into a wide range of audio synthesis and recording packages.
de: LADSPA ist ein Standard, der es Software-Audioverarbeitungsprogrammen und Effekten ermöglicht, in einer großen Spanne von Audiosynthese- und -aufnahmeprogrammen eingesetzt zu werden.
it: LADSPA è uno standard che consente di inserire processori ed effetti audio software in un'ampia gamma di pacchetti di sintesi e registrazione audio.

source: Bauer stereophonic-to-binaural DSP
it: DSP da stereofonico a binaurale Bauer

source: The Bauer stereophonic-to-binaural DSP (bs2b) library and plugins is designed to improve headphone listening of stereo audio records. Recommended for headphone prolonged listening to disable superstereo fatigue without essential distortions.
it: La libreria e i plugin DSP da stereofonico a binaurale Bauer (bs2b) sono progettati per migliorare l'ascolto in cuffia di registrazioni audio stereo. Consigliato per l'ascolto prolungato in cuffia per disabilitare l'affaticamento superstereo senza distorsioni essenziali.

source: Bauer stereophonic-to-binaural DSP - LADSPA plugin
it: DSP da stereofonico a binaurale Bauer - plugin LADSPA

source: The Bauer stereophonic-to-binaural DSP (bs2b) library and plugins is designed to improve headphone listening of stereo audio records. Recommended for headphone prolonged listening to disable superstereo fatigue without essential distortions. This package contains a LADSPA plugin for use with applications that support them (e.g. PulseAudio).
it: La libreria e i plugin DSP da stereofonico a binaurale Bauer (bs2b) sono progettati per migliorare l'ascolto in cuffia di registrazioni audio stereo. Consigliato per l'ascolto prolungato in cuffia per disabilitare l'affaticamento superstereo senza distorsioni essenziali. Questo pacchetto contiene un plugin LADSPA da utilizzare con applicazioni che lo supportano (ad es. PulseAudio).

source: Implementation of the Open Sound Control protocol
it: Implementazione del protocollo Open Sound Control
sv: Implementation av protokollet Open Sound Control

source: liblo is a lightweight library that provides an easy to use implementation of the Open Sound Control (@dfn{OSC}) protocol.
it: liblo è una libreria leggera che fornisce un'implementazione facile da usare del protocollo Open Sound Control (@dfn{OSC}).
sv: liblo är ett resurssnålt bibliotek som tillhandahåller en lättanvänd implementation av protokollet Open Sound Control (@dfn{OSC}).

source: Common API for real-time audio I/O
it: API comune per I/O audio in tempo reale

source: RtAudio is a set of C++ classes that provides a common API for real-time audio input/output. It was designed with the following objectives: @itemize @item object-oriented C++ design @item simple, common API across all supported platforms @item only one source and one header file for easy inclusion in programming projects @item allow simultaneous multi-api support @item support dynamic connection of devices @item provide extensive audio device parameter control @item allow audio device capability probing @item automatic internal conversion for data format, channel number compensation, (de)interleaving, and byte-swapping @end itemize
it: RtAudio è un set di classi C++ che fornisce un'API comune per l'input/output audio in tempo reale. È stato progettato con i seguenti obiettivi: @itemize @item design orientato agli oggetti in C++ @item API semplice e comune su tutte le piattaforme supportate @item un solo file sorgente e un solo file di intestazione per una facile inclusione nei progetti di programmazione @item consentire il supporto multi-API simultaneo @item supportare la connessione dinamica dei dispositivi @item fornire un controllo esteso dei parametri dei dispositivi audio @item consentire il sondaggio delle capacità dei dispositivi audio @item conversione interna automatica per formato dati, compensazione del numero di canali, (de)interlacciamento e inversione dei byte @end itemize

source: JACK Audio Connection Kit (JACK) client for Python
it: Client per Python di JACK Audio Connection Kit (JACK)

source: This package provides a JACK Audio Connection Kit (JACK) client for Python. This variant uses the compatibility JACK implementation provided by Pipewire.
it: Questo pacchetto fornisce un client JACK Audio Connection Kit (JACK) per Python. Questa variante utilizza l'implementazione di compatibilità JACK fornita da Pipewire.

source: Bindings for PortAudio v19
it: Binding per PortAudio v19

source: This package provides bindings for PortAudio v19, the cross-platform audio input/output stream library.
it: Questo pacchetto fornisce i binding per PortAudio v19, la libreria multipiattaforma per lo streaming di input/output audio.

source: Python bindings for mixer-like controls in PulseAudio
it: Binding Python per controlli simili a mixer in PulseAudio

source: This package provides a Python high-level interface and ctypes-based bindings for PulseAudio (libpulse), to use in simple synchronous code. This wrapper is mostly for mixer-like controls and introspection-related operations, as opposed to e.g. submitting sound samples to play and player-like clients.
it: Questo pacchetto fornisce un'interfaccia di alto livello Python e binding basati su ctypes per PulseAudio (libpulse), da utilizzare in semplice codice sincrono. Questo wrapper è principalmente per controlli simili a mixer e operazioni relative all'introspezione, in contrapposizione ad esempio all'invio di campioni sonori da riprodurre e a client simili a lettori.

source: Python bindings for liblo
it: Binding Python per liblo
sv: Python-bindningar för liblo

source: Pyliblo is a Python wrapper for the liblo Open Sound Control (OSC) library. It supports almost the complete functionality of liblo, allowing you to send and receive OSC messages using a nice and simple Python API. Also included are the command line utilities @code{send_osc} and @code{dump_osc}.
it: Pyliblo è un wrapper Python per la libreria liblo Open Sound Control (OSC). Supporta quasi tutte le funzionalità di liblo, consentendo di inviare e ricevere messaggi OSC utilizzando un'API Python piacevole e semplice. Sono inclusi anche gli strumenti da riga di comando @code{send_osc} e @code{dump_osc}.

source: Python bindings for libsndfile
it: Binding Python per libsndfile
sv: Python-bindningar för libsndfile

source: This package provides python bindings for libsndfile based on CFFI and NumPy.
it: Questo pacchetto fornisce binding Python per libsndfile basati su CFFI e NumPy.

source: High quality, one-dimensional sample-rate conversion library
it: Libreria di conversione della frequenza di campionamento unidimensionale di alta qualità

source: Python-SoXR is a Python wrapper of libsoxr, a high quality, one-dimensional sample-rate conversion library.
it: Python-SoXR è un wrapper Python di libsoxr, una libreria di conversione della frequenza di campionamento unidimensionale di alta qualità.

source: Python MIDI API
it: API MIDI per Python

source: This package provides a python API to read and write MIDI files.
it: Questo pacchetto fornisce un'API Python per leggere e scrivere file MIDI.
sv: Det här paketet tillhandahåller en python-API för att läsa och skriva MIDI-filer.

source: Convert audio to multichannel MIDI
it: Converte l'audio in MIDI multicanale
sv: Konvertera ljud till multikanal-MIDI
