Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: GNU Mcron is a complete replacement for Vixie cron. It is used to run tasks on a schedule, such as every hour or every Monday. Mcron is written in Guile, so its configuration can be written in Scheme; the original cron format is also supported.
de: GNU Mcron ist ein vollständiger Ersatz für Vixie cron. Es wird dazu verwendet, Aufgaben nach Plan ausführen zu lassen, zum Beispiel jede Stunde oder jeden Montag. Mcron ist in Guile geschrieben, so dass dessen Konfiguration in Scheme verwaltet werden kann. Das originale Cron-Format wird ebenfalls unterstützt.

source: Scheme implementation intended especially for extensions
de: Scheme-Implementierung, die speziell für Erweiterungen gedacht ist

source: JSON module for Guile
de: JSON-Modul für Guile

source: Guile bindings for libgit2
de: Guile-Anbindungen für libgit2

source: Guile bindings to zlib
de: Guile-Anbindungen für zlib

source: Guile bindings to lzlib
de: Guile-Anbindungen für lzlib

source: This package provides a dictionary for the Hunspell spell-checking library.
de: Dieses Paket bietet ein Wörterbuch für die Hunspell-Rechtschreibbibliothek.

source: Hunspell dictionary for Polish
de: Hunspell-Wörterbuch für Polnisch

source: Hunspell dictionary for German (de_DE)
de: Hunspell-Wörterbuch für Deutsch (de_DE)

source: Hunspell dictionary for English
de: Hunspell-Wörterbuch für Englisch

source: Hunspell dictionary for Australian English
de: Hunspell-Wörterbuch für Australisches Englisch

source: Hunspell dictionary for Canadian English
de: Hunspell-Wörterbuch für Kanadisches Englisch

source: Hunspell dictionary for British English, with -ise endings
de: Hunspell-Wörterbuch für Britisches Englisch mit -ise-Endungen

source: Hunspell dictionary for British English, with -ize endings
de: Hunspell-Wörterbuch für Britisches Englisch mit -ize-Endungen

source: Hunspell dictionary for United States English
de: Hunspell-Wörterbuch für US-Amerikanisches Englisch

source: Python bindings for Caja components
de: Python-Anbindungen für Caja-Komponenten

source: This package provides Python bindings to Caja, a file manager for the MATE desktop.
de: Dieses Paket bietet Python-Anbindungen an Caja, einem Dateimanager für den MATE-Desktop.

source: Collection of network utilities
de: Sammlung von Netzwerkwerkzeugen

source: eSpeak is a software speech synthesizer for English and other languages. eSpeak uses a "formant synthesis" method. This allows many languages to be provided in a small size. The speech is clear, and can be used at high speeds, but is not as natural or smooth as larger synthesizers which are based on human speech recordings.
de: eSpeak ist ein Software-Sprachsynthesizer für Englisch und andere Sprachen. eSpeak benutzt eine „Formantensynthese“-Methode. Dies ermöglicht es, viele Sprachen auf wenig Speicherplatz zu unterstützen. Die Sprache ist klar und kann mit hohen Geschwindigkeiten benutzt werden, ist jedoch nicht so natürlich oder glatt wie bei größeren Synthesizern, die auf Aufnahmen menschlicher Sprache basieren.

source: Collection of Varnish modules
de: Sammlung von Varnish-Modulen

source: Manage virtual machines
de: Virtuelle Maschinen verwalten
fi: Hallitse virtuaalikoneita

source: Python bindings for Vagrant
de: Python-Anbindungen für Vagrant

source: This package provides a userspace daemon for the Nintendo Joy-Con controllers.
nl: Dit pakket bevat een daimon voor het gebruiken van Nintendo Joy-Con-afstandsbedieningen.
sk: Tento balík poskytuje démon používateľského prostredia pre ovládače Nintendo Joy-Con.

source: OpenTTD is a game in which you transport goods and passengers by land, water and air. It is a re-implementation of Transport Tycoon Deluxe with many enhancements including multiplayer mode, internationalization support, conditional orders and the ability to clone, autoreplace and autoupdate vehicles. This package only includes the game engine. When you start it you will be prompted to download a graphics set.
nl: OpenTTD is een spel waarin je goederen en passagiers transporteer over land, water en lucht. Het is een herimplementatie van Transport Tycoon Deluxe met vele verbeteringen zoals multiplayer modus, regionalisatieondersteuning, voorwaardelijke opdrachten en de mogelijkheid voortuigen te klonen, automatisch te vervangen en te updaten. Dit pakket bevat enkel de spelmotor. Wanneer je het start, zal er je gevraagd worden een grafisch thema te downloaden.

source: This package provides a C++ interface to the libxml2 XML parser library.
nl: Dit pakket voorziet een C++ interface voor libxml2's XML-parser.
sk: Tento balík poskytuje C++ rozhranie pre knižnicu na vyhodnocovanie XML jazyka libxml2.

source: This package provides a graphical file manager.
nl: Dit pakket bevat een grafische bestandsbeheerder.
sk: Tento balík poskytuje správcu súborov s grafickým používateľským rozhraním.

source: Scheme 48 is an implementation of Scheme based on a byte-code interpreter and is designed to be used as a testbed for experiments in implementation techniques and as an expository tool.
nl: Scheme 48 is een implementatie van Scheme gebaseerd op een bytecodeinterpreteur. Het dient als testlaboratorium voor te experimenteren met implementatietechnieken en om mee te exposeren.

source: Guile is the GNU Ubiquitous Intelligent Language for Extensions, the official extension language of the GNU system. It is an implementation of the Scheme language which can be easily embedded in other applications to provide a convenient means of extending the functionality of the application without requiring the source code to be rewritten.
nl: Guile (GNU Ubiquitous Intelligent Language for Extensions) is de officiële uitbreidigstaal van het GNU-systeem. Het is een implementatie van de taal Scheme dat eenvoudig ingebed kan worden in andere toepassingen om een praktische manier aan te bieden voor het uitbreiden van de functionaliteit van een toepassing, zonder te vereisen dat de hele broncode herschreven moet worden.

source: This package provides Guile bindings for zlib, a lossless data-compression library. The bindings are written in pure Scheme by using Guile's foreign function interface.
nl: Dit pakket voorziet Guilebindsels voor zlib, een bibliotheek voor verliesloze datacompressie. De bindsels zijn geschreven in puur Scheme door gebruik te maken van Guile's ‘foreign function interface’.

source: This package provides a GNU Guile interface to the zstd (``zstandard'') compression library.
nl: Dit pakket voorziet een GNU Guile-interface voor de zstd-compressiebibliotheek (‘zstandard’).

source: The Guix Data Service stores data about GNU Guix, and provides this through a web interface. It supports listening to the guix-commits mailing list to find out about new revisions, then loads the data from these in to a PostgreSQL database.
nl: De Guix Data Service slaat data over GNU Guix op en stelt deze ter beschikking via een webtoepassing. Het ondersteunt luisteren naar de ‘guix-commits’ mailinglijst om uit te vogelen wat de nieuwste aanpassingen zijn en deze data dan in te laden in een PostgreSQL-database.

source: Braille TTY
sk: Braillov TTY

source: SQL database server
fi: MySQL-tietokantapalvelin

source: Database independent interface for Perl
fi: Tietokannasta riippumaton käyttöliittymä Perlille

source: Console front-end to the GNU debugger
fi: Konsolin etupää GNU-viankorjausohjelmalle

source: Graphical front-end for GDB and other debuggers
fi: Graafinen etupää GDB:lle ja muille viankorjausohjelmille

source: High-speed arctic racing game based on Tux Racer
fi: Nopea arktinen ajopeli, joka perustuu Tux Raceriin

source: Bluefish is an editor aimed at programmers and web developers, with many options to write web sites, scripts and other code. Bluefish supports many programming and markup languages.
fi: Bluefish on ohjelmoijille ja web-kehittäjille tarkoitettu muokkain, jossa on monia vaihtoehtoja verkkosivustojen, skriptien ja muun koodin kirjoittamiseen. Bluefish tukee monia ohjelmointi- ja merkintäkieliä.

source: This package provides a library and a command line interface to the variable facility of UEFI boot firmware.
fi: Tämä paketti tarjoaa kirjaston ja komentorivikäyttöliittymän UEFI-käynnistyslaiteohjelmiston muuttujatoimintoon.

source: The package defines a @code{tabular*}-like environment, @code{tabulary}, taking a "total width" argument as well as the column specifications. The environment uses column types @code{L}, @code{C}, @code{R} and @code{J} for variable width columns (@code{\raggedright}, @code{\centering}, @code{\raggedleft}, and normally justified). In contrast to @code{tabularx}'s @code{X} columns, the width of each column is weighted according to the natural width of the widest cell in the column.
fi: Paketti määrittelee @code{tabular*}-tyyppisen ympäristön, @code{tabulary}, joka ottaa "total width"-argumentin sekä sarakemääritykset. Ympäristö käyttää saraketyyppejä @code{L}, @code{C}, @code{R} ja @code{J} muuttuvaleveisille sarakkeille (@code{\raggedright}, @code{\centering}, @code{ \raggedleft} ja normaalisti tasattu). Toisin kuin @code{tabularx}:n @code{X}-sarakkeissa, jokaisen sarakkeen leveys painotetaan sarakkeen leveimmän solun luonnollisen leveyden mukaan.

source: Nload is a console application which monitors network traffic and bandwidth usage in real time. It visualizes the in- and outgoing traffic using two graphs, and provides additional info like total amount of transferred data and min/max network usage.
fi: Nload on konsolisovellus, joka valvoo verkkoliikennettä ja kaistanleveyden käyttöä reaaliajassa. Se visualisoi saapuvan ja lähtevän liikenteen kahdella kaaviolla ja tarjoaa lisätietoa, kuten siirretyn tiedon kokonaismäärän verkon vähimmäis- ja enimmäiskäytön.

source: Internet services daemon
fi: Internet-palvelujen demoni

source: Siege is a multi-threaded HTTP/FTP load tester and benchmarking utility. It can stress test a single URL with a user defined number of simulated users, or it can read many URLs into memory and stress them simultaneously. The program reports the total number of hits recorded, bytes transferred, response time, concurrency, and return status.
fi: Siege on monisäikeinen HTTP/FTP-kuormitustestaaja ja vertailuapuohjelma. Se voi testata stressin suhteen yksittäisen URL-osoitteen käyttäjän määrittämän määrän simuloituja käyttäjiä tai se voi lukea useita URL-osoitteita muistiin ja stressiä niitä samanaikaisesti. Ohjelma raportoi tallennettujen osumien kokonaismäärän, siirretyt tavut, vasteajan, samanaikaisuuden ja palautuksen tilan.

source: Opus is a totally open, royalty-free, highly versatile audio codec. Opus is unmatched for interactive speech and music transmission over the Internet, but is also intended for storage and streaming applications. It is standardized by the Internet Engineering Task Force (IETF) as RFC 6716 which incorporated technology from Skype's SILK codec and Xiph.Org's CELT codec.
fi: Opus on täysin avoin, rojaltivapaa, erittäin monipuolinen ääni-koodekki. Opus on vertaansa vailla vuorovaikutteiseen puheen ja musiikin siirtoon Internetin välityksellä, mutta se on tarkoitettu myös tallennus- ja suoratoistosovelluksiin. Internet Engineering Task Force (IETF) on standardoinut sen RFC 6716:ksi, joka sisälsi Skypen SILK-koodekin ja Xiph.Orgin CELT-koodekin teknologiaa.

source: abduco provides session management i.e. it allows programs to be run independently from their controlling terminal. That is, programs can be detached---run in the background---and then later reattached.
ar: abduco يوفر إدارة الحصص، بمعنى أنه يسمح للبرامج بالعمل بصفة مستقلة عن الواجهة الطرفية المتحكمة. بعبارة أخرى، يمكن للبرامج أن تفصل، تعمل في الخلفية، ثم توصل لاحقا.

source: GNOME 2048 provides a 2D grid for playing 2048, a single-player sliding tile puzzle game. The objective of the game is to merge together adjacent tiles of the same number until the sum of 2048 is achieved in one tile.
ar: توفر جنوم 2048 شبكة ثنائية الأبعاد للعب 2048، وهي لعبة ألغاز البلاط المنزلق للاعب واحد. الهدف من اللعبة هو دمج مربعات متجاورة من نفس الرقم حتى يتم تحقيق مجموع 2048 في بلاطة واحدة.

source: @command{iptables} is the user-space command line program used to configure the Linux 2.4.x and later IPv4 packet filtering ruleset (@dfn{firewall}), including @dfn{NAT} (Network Address Translation). This package also includes @command{ip6tables}, which is used to configure the IPv6 packet filter. Both commands are targeted at system administrators.
ar: @command{iptables} هو برنامج سطر الأوامر في مساحة المستخدم لتهيئة مجموعة قواعد تصفية حزم نظام لينكس 2.4.x والإصدارات الأحدث من IPv4 (@dfn{firewall})، بما في ذلك @dfn{NAT} (ترجمة عناوين الشبكة). تتضمن هذه الحزمة أيضًا الأمر @command{ip6tables}، الذي يُستخدم لتكوين عامل تصفية حزم IPv6. يستهدف كلا الأمرين مسؤولي الأنظمة.

source: Entirely free browser derived from Mozilla Firefox
ar: متصفح مجاني بالكامل مشتق من Mozilla Firefox
