Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: This package provides all the locales supported by the GNU C Library, more than 400 in total. To use them set the @code{LOCPATH} environment variable to the @code{share/locale} sub-directory of this package.
fi: Tämä paketti sisältää kaikki GNU C -kirjaston tukemat kieliasetukset, yhteensä yli 400. Käytä niitä asettamalla @code{LOCPATH}-ympäristömuuttuja tämän paketin @code{share/locale}-alihakemistoon.
it: Questo pacchetto fornisce tutte le localizzazioni supportate dalla libreria GNU C, più di 400 in totale. Per utilizzarle, imposta la variabile d'ambiente @code{LOCPATH} sulla sottodirectory @code{share/locale} di questo pacchetto.

source: Find full path of shell commands
it: Trova il percorso completo dei comandi di shell

source: The which program finds the location of executables in PATH, with a variety of options. It is an alternative to the shell "type" built-in command.
it: Il programma which trova la posizione degli eseguibili in PATH, con una varietà di opzioni. È un'alternativa al comando incorporato della shell "type".

source: Database of current and historical time zones
de: Datenbank aktueller und historischer Zeitzonen
it: Database dei fusi orari attuali e storici

source: The Time Zone Database (often called tz or zoneinfo) contains code and data that represent the history of local time for many representative locations around the globe. It is updated periodically to reflect changes made by political bodies to time zone boundaries, UTC offsets, and daylight-saving rules.
de: Die Zeitzonen-Datenbank (oft »tz« oder »zoneinfo« genannt) enthält Code und Daten, welche den Verlauf der lokalen Zeit für zahlreiche repräsentative Orte rund um den Globus bereitstellen. Diese Daten werden regelmäßig aktualisiert, um politisch begründete Änderungen der Zeitzonengrenzen, Verschiebung gegenüber der Weltzeit oder der Sommerzeit-Winterzeit-Regelungen wiederzugeben.
it: Il Time Zone Database (spesso chiamato tz o zoneinfo) contiene codice e dati che rappresentano la storia dell'ora locale per molte località rappresentative in tutto il mondo. Viene aggiornato periodicamente per riflettere le modifiche apportate dagli organi politici ai confini dei fusi orari, agli offset UTC e alle regole dell'ora legale.

source: Character set conversion library
it: Libreria di conversione dei set di caratteri

source: libiconv provides an implementation of the iconv function for systems that lack it. iconv is used to convert between character encodings in a program. It supports a wide variety of different encodings.
it: libiconv fornisce un'implementazione della funzione iconv per i sistemi che ne sono sprovvisti. iconv viene utilizzata per convertire tra codifiche di caratteri in un programma. Supporta un'ampia varietà di codifiche diverse.

source: BitTorrent client
it: Client BitTorrent
sv: BitTorrent-klient

source: Transmission is a BitTorrent client that comes with graphical, textual, and Web user interfaces. Transmission also has a daemon for unattended operations. It supports local peer discovery, full encryption, DHT, µTP, PEX and Magnet Links.
it: Transmission è un client BitTorrent fornito con interfacce utente grafiche, testuali e Web. Transmission dispone anche di un daemon per operazioni non supervisionate. Supporta la scoperta di peer locali, la crittografia completa, DHT, µTP, PEX e Magnet Link.

source: Gtk frontend to the Transmission daemon
it: Frontend Gtk per il daemon di Transmission

source: transmission-remote-gtk is a GTK client for remote management of the Transmission BitTorrent client, using its HTTP RPC protocol.
it: transmission-remote-gtk è un client GTK per la gestione remota del client BitTorrent Transmission, utilizzando il suo protocollo HTTP RPC.

source: BitTorrent library of rtorrent
it: Libreria BitTorrent di rtorrent

source: LibTorrent is a BitTorrent library used by and developed in parallel with the BitTorrent client rtorrent. It is written in C++ with emphasis on speed and efficiency.
it: LibTorrent è una libreria BitTorrent utilizzata e sviluppata in parallelo con il client BitTorrent rtorrent. È scritta in C++ con enfasi su velocità ed efficienza.

source: BitTorrent client with ncurses interface
it: Client BitTorrent con interfaccia ncurses

source: rTorrent is a BitTorrent client with an ncurses interface. It supports full encryption, DHT, PEX, and Magnet Links. It can also be controlled via XML-RPC over SCGI.
it: rTorrent è un client BitTorrent con un'interfaccia ncurses. Supporta la crittografia completa, DHT, PEX e Magnet Link. Può anche essere controllato tramite XML-RPC su SCGI.

source: Console client for the Transmission BitTorrent daemon
it: Client da console per il daemon BitTorrent di Transmission

source: Tremc is a console client, with a curses interface, for the Transmission BitTorrent daemon.
it: Tremc è un client da console, con un'interfaccia curses, per il daemon BitTorrent di Transmission.

source: Utility for parallel downloading files
it: Utilità per il download parallelo di file

source: Aria2 is a lightweight, multi-protocol & multi-source command-line download utility. It supports HTTP/HTTPS, FTP, SFTP, BitTorrent and Metalink. Aria2 can be manipulated via built-in JSON-RPC and XML-RPC interfaces.
it: Aria2 è un'utilità di download da riga di comando leggera, multiprotocollo e multi-sorgente. Supporta HTTP/HTTPS, FTP, SFTP, BitTorrent e Metalink. Aria2 può essere manipolato tramite interfacce JSON-RPC e XML-RPC integrate.

source: Universal download manager with GTK+ interface
it: Gestore di download universale con interfaccia GTK+

source: uGet is portable download manager with GTK+ interface supporting HTTP, HTTPS, BitTorrent and Metalink, supporting multi-connection downloads, download scheduling, download rate limiting.
it: uGet è un gestore di download portatile con interfaccia GTK+ che supporta HTTP, HTTPS, BitTorrent e Metalink, con supporto per download multi-connessione, pianificazione dei download, limitazione della velocità di download.

source: Utility to create BitTorrent metainfo files
it: Utilità per creare file di metainfo BitTorrent

source: mktorrent is a simple command-line utility to create BitTorrent @dfn{metainfo} files, often known simply as @dfn{torrents}, from both single files and whole directories. It can add multiple trackers and web seed URLs, and set the @code{private} flag to disallow advertisement through the distributed hash table (@dfn{DHT}) and Peer Exchange. Hashing is multi-threaded and will take advantage of multiple processor cores where possible.
it: mktorrent è una semplice utilità da riga di comando per creare file @dfn{metainfo} di BitTorrent, spesso noti semplicemente come @dfn{torrents}, sia da singoli file che da intere directory. Può aggiungere più tracker e URL di seed web e impostare il flag @code{private} per non consentire la pubblicità attraverso la tabella hash distribuita (@dfn{DHT}) e lo scambio di peer. L'hashing è multithread e sfrutterà, ove possibile, più core del processore.

source: Feature-complete BitTorrent implementation
it: Implementazione BitTorrent completa di funzionalità

source: libtorrent-rasterbar is a feature-complete C++ BitTorrent implementation focusing on efficiency and scalability. It runs on embedded devices as well as desktops.
it: libtorrent-rasterbar è un'implementazione BitTorrent in C++ completa di funzionalità, che si concentra sull'efficienza e sulla scalabilità. Funziona su dispositivi embedded così come su desktop.

source: Graphical BitTorrent client
it: Client BitTorrent grafico

source: qBittorrent is a BitTorrent client programmed in C++/Qt that uses libtorrent (sometimes called libtorrent-rasterbar) by Arvid Norberg. It aims to be a good alternative to all other BitTorrent clients out there. qBittorrent is fast, stable and provides unicode support as well as many features.
it: qBittorrent è un client BitTorrent programmato in C++/Qt che utilizza libtorrent (a volte chiamato libtorrent-rasterbar) di Arvid Norberg. Si propone di essere una buona alternativa a tutti gli altri client BitTorrent esistenti. qBittorrent è veloce, stabile e fornisce supporto unicode così come molte funzionalità.

source: qBittorrent Enhanced is a bittorrent client based on qBittorrent with the following features: @itemize @item Auto Ban Xunlei, QQ, Baidu, Xfplay, DLBT and Offline downloader @item Auto Ban Unknown Peer from China Option (Default: OFF) @item Auto Update Public Trackers List (Default: OFF) @item Auto Ban BitTorrent Media Player Peer Option (Default: OFF) @item Peer whitelist/blacklist @end itemize
it: qBittorrent Enhanced è un client bittorrent basato su qBittorrent con le seguenti caratteristiche: @itemize @item Ban automatico di Xunlei, QQ, Baidu, Xfplay, DLBT e downloader offline @item Opzione di ban automatico di peer sconosciuti dalla Cina (predefinito: OFF) @item Aggiornamento automatico dell'elenco dei tracker pubblici (predefinito: OFF) @item Opzione di ban automatico dei peer dei lettori multimediali BitTorrent (predefinito: OFF) @item Whitelist/blacklist dei peer @end itemize

source: Fully-featured cross-platform ​BitTorrent client
it: Client BitTorrent multipiattaforma ricco di funzionalità

source: Deluge contains the common features to BitTorrent clients such as Protocol Encryption, DHT, Local Peer Discovery (LSD), Peer Exchange (PEX), UPnP, NAT-PMP, Proxy support, Web seeds, global and per-torrent speed limits. Deluge heavily utilises the ​libtorrent library. It is designed to run as both a normal standalone desktop application and as a ​client-server.
it: Deluge contiene le caratteristiche comuni ai client BitTorrent come la crittografia del protocollo, DHT, Local Peer Discovery (LSD), Peer Exchange (PEX), UPnP, NAT-PMP, supporto proxy, web seed, limiti di velocità globali e per torrent. Deluge utilizza pesantemente la libreria libtorrent. È progettato per funzionare sia come una normale applicazione desktop standalone che come client-server.

source: Utility to split TLS certificates data into multiple PEM files
it: Utilità per dividere i dati dei certificati TLS in più file PEM

source: This is a C version of the certdata2pem Python utility that was originally contributed to Debian.
it: Questa è una versione C dell'utilità Python certdata2pem che è stata originariamente contribuita a Debian.

source: Certbot DNS challenge automatization for deSEC
it: Automatizzazione della sfida DNS di Certbot per deSEC

source: The deSEC can be used to obtain certificates with certbot DNS ownership verification. With the help of this hook script, you can obtain your Let's Encrypt certificate using certbot with authorization provided by the DNS challenge mechanism, that is, you will not need a running web server or any port forwarding to your local machine.
it: deSEC può essere utilizzato per ottenere certificati con la verifica della proprietà DNS di certbot. Con l'aiuto di questo script hook, puoi ottenere il tuo certificato Let's Encrypt utilizzando certbot con l'autorizzazione fornita dal meccanismo di sfida DNS, ovvero non avrai bisogno di un server web in esecuzione o di alcun port forwarding sulla tua macchina locale.

source: Let's Encrypt root and intermediate certificates
it: Certificati root e intermedi di Let's Encrypt

source: This package provides a certificate store containing only the Let's Encrypt root and intermediate certificates. It is intended to be used within Guix.
it: Questo pacchetto fornisce un archivio di certificati contenente solo i certificati root e intermedi di Let's Encrypt. È destinato ad essere utilizzato all'interno di Guix.

source: Compression library
it: Libreria di compressione
sv: Kompressionsbibliotek

source: zlib is designed to be a free, general-purpose, legally unencumbered -- that is, not covered by any patents -- lossless data-compression library for use on virtually any computer hardware and operating system. The zlib data format is itself portable across platforms. Unlike the LZW compression method used in Unix compress(1) and in the GIF image format, the compression method currently used in zlib essentially never expands the data. (LZW can double or triple the file size in extreme cases.) zlib's memory footprint is also independent of the input data and can be reduced, if necessary, at some cost in compression.
it: zlib è progettato per essere una libreria di compressione dati senza perdita, libera, per uso generale, legalmente non vincolata, ovvero non coperta da alcun brevetto, per l'uso su praticamente qualsiasi hardware e sistema operativo. Il formato dati di zlib è a sua volta portabile tra piattaforme. A differenza del metodo di compressione LZW utilizzato in Unix compress(1) e nel formato immagine GIF, il metodo di compressione attualmente utilizzato in zlib non espande essenzialmente mai i dati. (LZW può raddoppiare o triplicare la dimensione del file in casi estremi.) L'impronta di memoria di zlib è anche indipendente dai dati di input e può essere ridotta, se necessario, a un certo costo in termini di compressione.

source: Zip Compression library
it: Libreria di compressione Zip

source: Minizip is a minimalistic library that supports compressing, extracting and viewing ZIP archives. This version is extracted from the @code{zlib} source.
it: Minizip è una libreria minimalista che supporta la compressione, l'estrazione e la visualizzazione di archivi ZIP. Questa versione è estratta dal sorgente di @code{zlib}.

source: Simple zip library
it: Semplice libreria zip

source: This package provides a simple zip library based on miniz.
it: Questo pacchetto fornisce una semplice libreria zip basata su miniz.

source: Replacement for Sun's 'jar' utility
it: Sostituto dell'utilità 'jar' di Sun

source: FastJar is an attempt to create a much faster replacement for Sun's @code{jar} utility. Instead of being written in Java, FastJar is written in C.
it: FastJar è un tentativo di creare un sostituto molto più veloce per l'utilità @code{jar} di Sun. Invece di essere scritto in Java, FastJar è scritto in C.

source: C library for manipulating POSIX tar files
it: Libreria C per la manipolazione di file tar POSIX

source: libtar is a C library for manipulating POSIX tar files. It handles adding and extracting files to/from a tar archive.
it: libtar è una libreria C per la manipolazione di file tar POSIX. Gestisce l'aggiunta e l'estrazione di file da/in un archivio tar.

source: General file (de)compression (using lzw)
it: Compressione/decompressione generale di file (usando lzw)

source: GNU Gzip provides data compression and decompression utilities; the typical extension is ".gz". Unlike the "zip" format, it compresses a single file; as a result, it is often used in conjunction with "tar", resulting in ".tar.gz" or ".tgz", etc.
it: GNU Gzip fornisce utilità di compressione e decompressione dei dati; l'estensione tipica è ".gz". A differenza del formato "zip", comprime un singolo file; di conseguenza, viene spesso utilizzato in combinazione con "tar", risultando in ".tar.gz" o ".tgz", ecc.

source: High-quality data compression program
it: Programma di compressione dati di alta qualità

source: bzip2 is a freely available, patent free (see below), high-quality data compressor. It typically compresses files to within 10% to 15% of the best available techniques (the PPM family of statistical compressors), whilst being around twice as fast at compression and six times faster at decompression.
it: bzip2 è un compressore di dati di alta qualità, liberamente disponibile e privo di brevetti (vedi sotto). Comprime tipicamente i file entro il 10-15% delle migliori tecniche disponibili (la famiglia PPM di compressori statistici), pur essendo circa due volte più veloce in compressione e sei volte più veloce in decompressione.

source: Parallel bzip2 compression utility
it: Utilità di compressione bzip2 parallela

source: lbzip2 is a multi-threaded compression utility with support for the bzip2 compressed file format. lbzip2 can process standard bz2 files in parallel. It uses POSIX threading model (pthreads), which allows it to take full advantage of symmetric multiprocessing (SMP) systems. It has been proven to scale linearly, even to over one hundred processor cores. lbzip2 is fully compatible with bzip2 – both at file format and command line level.
it: lbzip2 è un'utilità di compressione multithread con supporto per il formato di file compresso bzip2. lbzip2 può elaborare file bz2 standard in parallelo. Utilizza il modello di threading POSIX (pthreads), che gli consente di sfruttare appieno i sistemi di multiprocessing simmetrico (SMP). È stato dimostrato che scala linearmente, anche su oltre cento core del processore. lbzip2 è completamente compatibile con bzip2, sia a livello di formato di file che di riga di comando.

source: Parallel bzip2 implementation
it: Implementazione parallela di bzip2

source: Pbzip2 is a parallel implementation of the bzip2 block-sorting file compressor that uses pthreads and achieves near-linear speedup on SMP machines. The output of this version is fully compatible with bzip2 v1.0.2 (i.e. anything compressed with pbzip2 can be decompressed with bzip2).
it: Pbzip2 è un'implementazione parallela del compressore di file bzip2 con ordinamento a blocchi che utilizza pthreads e ottiene un'accelerazione quasi lineare su macchine SMP. L'output di questa versione è completamente compatibile con bzip2 v1.0.2 (cioè, qualsiasi cosa compressa con pbzip2 può essere decompressa con bzip2).

source: Wrapper around std::streambuf for zstd, xz, gzip, and bgzf files
it: Wrapper per std::streambuf per file zstd, xz, gzip e bgzf

source: Shrinkwrap provides a @code{std::streambuf} wrapper for various compression formats, including zstd, xz, gzip, and bgzf.
it: Shrinkwrap fornisce un wrapper @code{std::streambuf} per vari formati di compressione, inclusi zstd, xz, gzip e bgzf.

source: General-purpose data compression
it: Compressione dati per uso generale

source: XZ Utils is free general-purpose data compression software with high compression ratio. XZ Utils were written for POSIX-like systems, but also work on some not-so-POSIX systems. XZ Utils are the successor to LZMA Utils. The core of the XZ Utils compression code is based on LZMA SDK, but it has been modified quite a lot to be suitable for XZ Utils. The primary compression algorithm is currently LZMA2, which is used inside the .xz container format. With typical files, XZ Utils create 30 % smaller output than gzip and 15 % smaller output than bzip2.
it: XZ Utils è un software di compressione dati gratuito per uso generale con un elevato rapporto di compressione. XZ Utils è stato scritto per sistemi di tipo POSIX, ma funziona anche su alcuni sistemi non così POSIX. XZ Utils è il successore di LZMA Utils. Il nucleo del codice di compressione di XZ Utils si basa sull'SDK LZMA, ma è stato modificato parecchio per essere adatto a XZ Utils. L'algoritmo di compressione principale è attualmente LZMA2, che viene utilizzato all'interno del formato contenitore .xz. Con i file tipici, XZ Utils crea un output più piccolo del 30% rispetto a gzip e del 15% rispetto a bzip2.

source: Data compression library for embedded/real-time systems
it: Libreria di compressione dati per sistemi embedded/in tempo reale

source: LHA archive decompressor
it: Decompressore di archivi LHA

source: Lhasa is a replacement for the Unix LHa tool, for decompressing @file{.lzh} (LHA / LHarc) and .lzs (LArc) archives. The backend for the tool is a library, so that it can be reused for other purposes. Lhasa aims to be compatible with as many types of @file{.lzh}/@file{lzs} archives as possible. It also aims to generate the same output as the (non-free) Unix @command{lha} tool, so that it will act as a free drop-in replacement.
it: Lhasa è un sostituto dello strumento Unix LHa, per decomprimere archivi @file{.lzh} (LHA / LHarc) e .lzs (LArc). Il backend dello strumento è una libreria, in modo che possa essere riutilizzata per altri scopi. Lhasa mira ad essere compatibile con il maggior numero possibile di tipi di archivi @file{.lzh}/@file{lzs}. Mira anche a generare lo stesso output dello strumento Unix @command{lha} (non libero), in modo da fungere da sostituto drop-in libero.

source: Data compression library suitable for real-time data de-/compression
it: Libreria di compressione dati adatta alla de-/compressione di dati in tempo reale

source: LZO is a data compression library which is suitable for data de-/compression in real-time. This means it favours speed over compression ratio. LZO is written in ANSI C. Both the source code and the compressed data format are designed to be portable across platforms.
it: LZO è una libreria di compressione dati adatta alla de-/compressione di dati in tempo reale. Ciò significa che favorisce la velocità rispetto al rapporto di compressione. LZO è scritto in ANSI C. Sia il codice sorgente che il formato dei dati compressi sono progettati per essere portabili tra piattaforme.

source: Compress or expand files
it: Comprimi o espandi file

source: Lzop is a file compressor which is very similar to gzip. Lzop uses the LZO data compression library for compression services, and its main advantages over gzip are much higher compression and decompression speed (at the cost of some compression ratio).
it: Lzop è un compressore di file molto simile a gzip. Lzop utilizza la libreria di compressione dati LZO per i servizi di compressione, e i suoi principali vantaggi rispetto a gzip sono una velocità di compressione e decompressione molto più elevata (a scapito di un certo rapporto di compressione).

source: Lossless data compressor based on the LZMA algorithm
it: Compressore di dati senza perdita basato sull'algoritmo LZMA

source: Lzip is a lossless data compressor with a user interface similar to the one of gzip or bzip2. Lzip decompresses almost as fast as gzip and compresses more than bzip2, which makes it well-suited for software distribution and data archiving. Lzip is a clean implementation of the LZMA algorithm.
it: Lzip è un compressore di dati senza perdita con un'interfaccia utente simile a quella di gzip o bzip2. Lzip decomprime quasi velocemente quanto gzip e comprime più di bzip2, il che lo rende adatto per la distribuzione di software e l'archiviazione di dati. Lzip è un'implementazione pulita dell'algoritmo LZMA.

source: Recover and decompress data from damaged lzip files
it: Recupera e decomprimi dati da file lzip danneggiati
