Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: Faker is a pure Elixir library for generating fake data.
sv: Faker är ett rent Elixir-bibliotek för att generera falsk data.

source: This package provides an Emacs interface to the online service @uref{https://inspirehep.net/, Inspirehep}
sv: Det här paketet tillhandahåller ett Emacs-gränssnitt till onlinetjänsten @uref{https://inspirehep.net/, Inspirehep}

source: Find callers of elisp functions or macros
sv: Hitta anropare av elisp-funktioner eller makron

source: This package provides an Emacs major-mode for easy buffer-navigation
sv: Detta paket tillhandahåller ett Emacs major mode för enkel navigering mellan buffrar

source: This package provides a lobsters client for Emacs to browse stories and comments
sv: Det här paketet tillhandahåller en lobsters-klient till Emacs för att bläddra i historier och i kommentarer

source: Library to read and write MED files
sv: Bibliotek för att läsa och skriva MED-filer

source: Python bindings for orocos-kinematics-dynamics.
sv: Python-bindningar för orocos-kinematics-dynamics.

source: Abe's Amazing Adventure is a scrolling, platform-jumping, key-collecting, ancient pyramid exploring game, vaguely in the style of similar games for the Commodore+4.
sv: Abe's Amazing Adventure är ett sidorullande plattformsspel där man samlar nycklar samt utforskar antika pyramider och det liknar vagt spelen till Commodore+4.

source: Action game in four spatial dimensions
sv: Actionspel i fyra rumsliga dimensioner

source: Control your system with a gamepad
sv: Kontrollera ditt system med en spelkontroll

source: Terminal-based multiplayer Tetris clone
sv: Terminalbaserad Tetris-klon med flerspelarläge

source: Tetrinet is a multiplayer Tetris-like game with powerups and attacks you can use on opponents.
sv: Tetrinet är ett Tetris-liknande spel i flerspelarläge med powerup-funktioner och attacker du kan använda på motståndare.

source: Game data for Vdrift
sv: Speldata för Vdrift

source: Racing simulator
sv: Sportspelssimulator

source: Terminal-based Tetris clone
sv: Terminalbaserad Tetris-klon

source: Vitetris is a classic multiplayer Tetris clone for the terminal.
sv: Vitetris är en klassisk Tetris-klon i flerspelarläge för terminalen.

source: Platform action game featuring a blob with a lot of weapons
sv: Plattform- och actionspel med en plump och massa vapen i huvudrollen

source: Collection of the old text-based games and amusements
sv: Samling av de gamla textbaserade spelen och förströelserna

source: Simon Tatham's portable puzzle collection
sv: Simon Tathams portabla pusselsamling

source: Survival horror roguelike video game
sv: Rogueliknande skräck- och överlevnadspel

source: Implementation of the @i{Theme Hospital} game engine
sv: Implementation av @i{Theme Hospital}-spelmotorn

source: Fallout 2 game engine
sv: Fallout 2-spelmotor

source: This package provides the Fallout 2 game engine. Game data should be placed in @file{~/.local/share/falltergeist}.
sv: Det här paketet tillhandahåller Fallout 2-spelmotorn. Speldata bör placeras i @file{~/.local/share/falltergeist}.

source: 3D billiard game
sv: Tredimensionellt biljardspel

source: Free content game based on the Doom engine
sv: Spel med fritt innehåll baserat på Doom-motorn

source: Isometric role-playing game against killer robots
sv: Isometriskt datorrollspel mot mördarrobotar

source: Puzzle/platform game
sv: Pussel/plattformsspel

source: Chess board for GNOME
ar: لوحة الشطرنج لـ GNOME
sv: Schackbräde för GNOME

source: GNOME Chess provides a 2D board for playing chess games against human or computer players. It supports loading and saving games in Portable Game Notation. To play against a computer, install a chess engine such as chess or stockfish.
sv: GNOME Chess tillhandahåller ett tvådimensionellt schackbräde för att spela mot mänskliga eller datordrivna motståndare. Det kan läsa in och spara partier via filformatet Portable Game Notation (PNG). Installera en schackmotor så som chess eller stockfish för att spela mot datorn.

source: Backgammon game
sv: Backgammon-spel

source: 3d Rubik's cube game
sv: Tredimensionellt Rubikskubspel

source: GNU Shogi is a program that plays the game Shogi (Japanese Chess). It is similar to standard chess but this variant is far more complicated.
sv: GNU Shogi är ett program som spelar spelet Shogi (japanskt schack) Det liknar vanlig schack men denna variant är betydligt mer komplicerad.

source: Tetris clone based on the SDL library
sv: Tetrisklon baserad på SDL-biblioteket

source: Action platformer game
sv: Action- och plattformsspel

source: ReTux is an action platformer loosely inspired by the Mario games, utilizing the art assets from the @code{SuperTux} project.
sv: ReTux är ett action- och plattformsspel löst inspirerat av Mario-spelen och nyttjar grafik med mera från @code{SuperTux}-projektet.

source: Lightweight game engine for Action-RPGs
sv: Resurssnål spelmotor för action-rpg:er

source: Solarus is a 2D game engine written in C++, that can run games scripted in Lua. It has been designed with 16-bit classic Action-RPGs in mind.
sv: Solarus är en tvådimensionell spelmotor skriven i C++ och som kan köra spel skriptade i Lua. Den har formgivits med klassiska 16-bitars action-rpg:er i åtanke.

source: UFO: AI data files
sv: Datafiler för UFO: AI

source: Lemmings clone
sv: Lemmings-klon

source: Full chess implementation
sv: Fullständig schackimplementation

source: GNU Chess is a chess engine. It allows you to compete against the computer in a game of chess, either through the default terminal interface or via an external visual interface such as GNU XBoard.
sv: GNU Chess är en schackmotor. Den gör att du kan tävla mot datorn i ett parti schack, antingen via gränssnittet för standardterminalen eller genom ett externt visuellt gränssnitt så som GNU XBoard.

source: Game data for GNU Freedink
sv: Speldata för GNU Freedink

source: Graphical user interface for chess programs
sv: Grafiskt användargränssnitt för schackprogram

source: GNU XBoard is a graphical board for all varieties of chess, including international chess, xiangqi (Chinese chess), shogi (Japanese chess) and Makruk. Several lesser-known variants are also supported. It presents a fully interactive graphical interface and it can load and save games in the Portable Game Notation.
sv: GNU XBoard är ett grafiskt bräde för alla schackvarianter, så som internationellt schack, xiangqi (kinesiskt schack), shogi (japanskt schack) och Makruk. Flera mindre kända varianter stöds också. Det tillhandahåller ett fullständigt interaktivt grafiskt gränssnitt och det kan läsa in och spara partier i filformatet Portable Game Notation (PGN).

source: SuperTuxKart is a 3D kart racing game, with a focus on having fun over realism. You can play with up to 4 friends on one PC, racing against each other or just trying to beat the computer; single-player mode is also available.
sv: SuperTuxKart är ett tredimensionellt rallyspel med fokus på spelglädje snarare än realism. Du kan spela med upp till fyra vänner på en dator, tävla mot varandra eller bara försöka slå datorn; det finns också enspelarläge.

source: SuperTux is a classic 2D jump'n run sidescroller game in a style similar to the original Super Mario games.
sv: SuperTux är ett klassiskt tvådimensionellt sidorullande spel som liknar de ursprungliga Super Mario-spelen.

source: MUD client
sv: MUD-klient

source: Programming game
sv: Programmeringsspel

source: GameStream client
sv: GameStream-klient

source: Puzzle game
sv: Pusselspel

source: 4D Tetris
sv: Tetris i 4D

source: Flight simulator
sv: Flygsimulator

source: Graphical user interface to play chess
sv: Grafiskt användargränssnitt för att spela schack

source: Eboard is a chess board interface for ICS (Internet Chess Servers) and chess engines.
sv: Eboard är ett schackbrädesgränssnitt för ICS (Internet Chess Servers) och schackmotorer.

source: Chess game database
sv: Databas för schackpartier

source: ChessX is a chess database. With ChessX you can operate on your collection of chess games in many ways: browse, edit, add, organize, analyze, etc. You can also play games on FICS or against an engine.
sv: ChessX är en schackdatabas. Med ChessX kan du hantera din samling av schackpartier på flera sätt: bläddra, redigera, lägga till, organisera, analysera med mera. Du kan även spela partier på FICS eller mot en motor.

source: Strong chess engine
sv: Stark schackmotor

source: Stockfish is a very strong chess engine. It is much stronger than the best human chess grandmasters. It can be used with UCI-compatible GUIs like ChessX.
sv: Stockfish är en oerhört stark schackmotor. Den är avsevärt starkare än de bästa mänskliga schackstormästarna. Den kan användas med UCI-kompatibla grafiska användargränssnitt som ChessX.

source: Karaoke game
sv: Karaokespel

source: Color profile manager for the GNOME desktop
sv: Färgprofilhanterare för skrivbordsmiljön GNOME

source: GNOME Fonts
sv: Typsnitt för GNOME

source: Spreadsheet application
sv: Applikation för kalkylblad

source: Minesweeper game
sv: Spelet Minröj

source: Geolocation service
sv: Geolokaliseringstjänst

source: Music player for GNOME
sv: Musikspelare för GNOME

source: GNOME image viewer
sv: En bildvisare för GNOME

source: Eye of GNOME is the GNOME image viewer. It supports image conversion, rotation, and slideshows.
sv: Eye of GNOME är en bildvisare för GNOME. Den stödjer bildkonvertering, rotation och bildspel.

source: D-Bus debugger
sv: Avlusare för D-Bus

source: Photo manager for GNOME 3
sv: Fotohanterare för GNOME 3

source: Shotwell is a digital photo manager designed for the GNOME desktop environment. It allows you to import photos from disk or camera, organize them by keywords and events, view them in full-window or fullscreen mode, and share them with others via social networking and more.
sv: Shotwell är en digital fotohanterare utformad för skrivbordsmiljön GNOME. Den tillåter dig att importera foton från skiva eller kamera, organisera dem via nyckelord eller händelser, visa dem i helfönster- eller helskärmsläge och dela dem med andra på sociala medier med mera.

source: Graphical archive manager for GNOME
sv: Grafisk arkivhanterare för GNOME

source: File Roller is an archive manager for the GNOME desktop environment that allows users to view, unpack, and create compressed archives such as gzip tarballs.
sv: File Roller är en arkivhanterare för skrivbordsmiljön GNOME som ger användare möjligheten att se, packa upp och skapa komprimerade arkiv så som gzip-filer.

source: Session manager for GNOME
sv: Sessionshanterare för GNOME

source: Utilities to configure the GNOME desktop
sv: Verktyg för att konfigurera skrivbordsmiljön GNOME

source: File manager for GNOME
sv: Filhanterare för GNOME

source: Nautilus (Files) is a file manager designed to fit the GNOME desktop design and behaviour, giving the user a simple way to navigate and manage its files.
sv: Nautilus (Files) är en filhanterare utformad för att passa skrivbordsmiljön GNOME:s utformning och beteende genom att ge användaren ett enkelt sätt att navigera och hantera filer på.

source: Disk usage analyzer for GNOME
sv: Diskanvändningsanalysator för GNOME

source: GoVirt Library
sv: GoVirt-bibliotek

source: GNOME's clock application
sv: GNOME:s klockprogram

source: GNOME's calendar application
sv: GNOME:s kalenderprogram

source: Look up words in dictionary sources
sv: Sök efter ord i ordbokskällor

source: Desktop calculator
sv: Miniräknare för skrivbordet

source: File manager
sv: Filhanterare

source: Multihash implementation in Go.
sv: Multihash-implementering i Go.

source: Implementation of an R-Way Trie data structure.
sv: Implementering av en R-Way Trie-datastruktur.

source: Package for building command line apps in Golang
sv: Paket för att bygga Golang-appar till kommandoraden

source: gopdf is a Go library for generating PDF documents.
sv: gopdf är ett Go-bibliotek för att generera PDF-dokument.

source: Package kyaml contains libraries for reading and writing Kubernetes Resource configuration as YAML.
sv: Paketet kyaml innehåller bibliotek för att läsa och att skriva resurs- konfiguration som YAML till Kubernetes.

source: An implementation of the git-lfs protocol.
sv: En implementering av git-lfs-protokollet.

source: Theme scheduling for the KDE Plasma Desktop
sv: Schemaläggning av tema för KDE Plasma-skrivbordet

source: This package provides support components for porting from KF5/Qt5 to KF6/Qt6
sv: Det här paketet tillhandahåller stöd-komponenter för portering från KF5/Qt5 till KF6/Qt6

source: Hyphenation library
sv: Orddelningsbibliotek

source: Thesaurus
sv: Synonymordbok

source: Office suite
sv: Kontorsprogram

source: Container platform
sv: Container-plattform

source: Simple API to read and write INI-style files
sv: Enkelt API för att läsa och skriva filer i INI-stil

source: This package provides a distributed monitoring solution (server-side)
sv: Det här paketet tillhandahåller en distribuerad lösning för övervakning (på server-sidan)

source: Numeric comparisons
sv: Numeriska jämförelser

source: Anonymous packages
de: Anonyme Pakete
sv: Anonyma paket

source: Parameterizable packages
sv: Parametriserbara paket

source: Infinite sets
sv: Oändliga uppsättningar

source: Align text
sv: Justera text

source: UNIVERSAL::can() reimplementation
sv: omimplementering av UNIVERSAL::can()

source: UNIVERSAL::isa() reimplementation
sv: omimplementering av UNIVERSAL::isa()

source: This package provides tooling to build Prometheus exporters
sv: Det här paketet tillhandahåller hjälpmedel för att bygga Prometheus-exportörer

source: Pure-Python implementation of the blurhash algorithm.
sv: Ren Python-implementering av blurbash-algoritmen.

source: This package provides a class to deal with collections of unordered, unique values
sv: Det här paketet tillhandahåller en klass för att hantera samlingar av o-sorterade unika värden

source: This package provides a tool for writing manuals for Prawn and Prawn accessories
sv: Det här paketet tillhandahåller ett verktyg för att skriva manualer till Prawn och Prawn -tillbehör

source: Python package and project manager written in Rust
sv: Python-paket och projekthanterare skriven i Rust

source: Session management in a clean and simple way
ar: إدارة الحصص بطريقة منمقة وسهلة
de: Sitzungsverwaltung auf saubere und einfache Art
sv: Sessionshantering på ett rent och enkelt sätt

source: ConTeXt scheme
sv: ConTeXt-schema

source: Extended TeX
sv: Förlängd TeX

source: Calligraphic font
sv: Kaligrafiskt typsnitt

source: Intelligent cross-referencing
sv: Intelligent korsreferens

source: Color separation
sv: Färgseparation

source: Writing ``configurations''
sv: Skriver ``konfigurationer''

source: Vector arrows
sv: Vektor-pilar

source: Linguistic tools
sv: Lingvistiska verktyg

source: @code{hfbright} fonts
sv: @code{hfbright} typsnitt

source: Intelligent brackets
sv: Intelligenta parenteser

source: Documentation support
sv: Dokumentationsstöd

source: Straightforward pseudocode
sv: Rakt på sak pseudo-kod

source: Ridgeway's fonts
sv: Ridgeway's typsnitt

source: Letter spacing
sv: Bokstavsavstånd

source: Mongolian LaTeX
sv: Mongolisk LaTeX

source: Documentation macros
sv: Dokumentationsmakron

source: Generate timetables
sv: Generera tidtabeller

source: Tree macros
sv: Trädmakron

source: Draw trees
sv: Rita träd

source: LaTeX laboratory
sv: LaTeX-laboratorium

source: Sanskrit support
sv: Stöd för Sanskrit

source: Multilingual bibliographies
sv: Flerspråkiga bibliografier

source: 3D animations
sv: 3D-animationer

source: LaTeX editor
sv: LaTeX-redigerare

source: Personal organiser
sv: Personlig arrangör

source: Geographical projections
sv: Geografiska projektioner

source: Additional fonts
sv: Ytterligare typsnitt

source: Recommended fonts
sv: Rekommenderade typsnitt

source: LuaTeX packages
sv: LuaTeX-paket

source: Music packages
sv: Musik-paket

source: Concert programmes
sv: Konsertprogram

source: Generate invoices
sv: Generera fakturor

source: Avoid widows
sv: Undvik änkor

source: Microraptor GUI
sv: Grafiskt gränssnitt för Microraptor

source: Introduction
sv: Introduktion

source: JPEG-2000 library
sv: JPEG-2000-bibliotek

source: Color picker
sv: Färgväljare

source: SILC ToolKit
sv: Verktygskit för SILC

source: Message broker
sv: Meddelandeförmedlare

source: Bandwidth monitor
sv: Bandbreddsövervakare

source: CAN utilities
sv: Verktyg för CAN

source: Denial-of-service countermeasure
sv: Åtgärd mot överbelastningsattack

source: Linter
sv: Kodgranskare

source: This package provides a Python library to send files to the user's @file{~/Trash} directory.
sv: Det här paketet tillhandahåller ett Python-bibliotek för att skicka filer till användarens @file{~/Trash}-mapp

source: Python-ish shell
sv: Pytonaktigt skal

source: Ogg vorbis tools
sv: Ogg vorbis-verktyg

source: Ogg vorbis is a non-proprietary, patent-and-royalty-free, general-purpose compressed audio format. The package vorbis-tools contains ogg123, an ogg vorbis command line audio player; oggenc, the ogg vorbis encoder; oggdec, a simple, portable command line decoder (to wav and raw); ogginfo, to obtain information (tags, bitrate, length, etc.) about an ogg vorbis file.
sv: Ogg vorbis är ett komprimerat icke-proprietärt, patent- och royalty-fritt samt universalt ljudfilsformat. Paketet vorbis-verktyg innehåller ogg123, en terminalbaserad ogg vorbis-ljudspelare; oggenc, ogg vorbis-kodaren; oggdec, en simpel, portabel terminalbaserad avkodare (från wav till rå); ogginfo, för att skaffa information (taggar, bitfrekvens, längd etc.) om en ogg vorbis-fil.

source: Streaming media server
sv: Strömmande mediaserver

source: Portable Braille Library
de: Portable Braille-Bibliothek
nl: Draagbare braillebibliotheek
sk: Prenosná knižnica Braillovho písma

source: Libbraille is a library to easily access Braille displays and terminals.
de: Libbraille ist eine Bibliothek zum einfachen Zugriff auf Braillezeilen.
nl: Libbraille is een bibliotheek om gemakkelijk toegang te krijgen tot brailleschermen en Terminals.

source: BRLTTY is a background process (daemon) which provides access to the Linux/Unix console (when in text mode) for a blind person using a refreshable braille display. It drives the braille display, and provides complete screen review functionality. Some speech capability has also been incorporated.
de: BRLTTY ist ein Hintergrundprozess (daemon), der blinden Menschen, die eine aktualisierbare Braillezeile verwenden, Zugriff auf die Linux/Unix-Konsole (im Textmodus) ermöglicht. Er steuert die Braillezeile und bietet eine vollständige Bildschirmüberprüfungsfunktion. Außerdem wurden einige Sprachfunktionen integriert.

source: Extensible, scalable virtual keyboard for X11
de: Erweiterbare, skalierbare virtuelle Tastatur für X11
sk: Rozšíriteľná a škálovateľná virtuálna klávesnica pre X11

source: Florence is an extensible scalable virtual keyboard for X11. It is useful for people who can't use a real hardware keyboard (for example for people with disabilities), but you must be able to use a pointing device (as a mouse, a trackball, a touchscreen or opengazer). Florence stays out of your way when you don't need it: it appears on the screen only when you need it. A timer-based auto-click input method is available to help to click.
de: Florence ist eine erweiterbare, skalierbare virtuelle Tastatur für X11. Sie ist besonders nützlich für Menschen, die eine echte Hardware-Tastatur nicht benutzen können (wie zum Beispiel Menschen mit Behinderungen) und stattdessen Zeigegeräte (wie eine Maus, einen Trackball, einen Touchscreen oder Opengazer) verwenden. Florence ist nicht im Weg, wenn man es nicht braucht: es erscheint nur auf dem Bildschirm, wenn es gebraucht wird. Eine zeitgesteuerte Auto-Klick-Funktion ist verfügbar, um beim Klicken zu helfen.

source: Command line utilities for PCsensor and Scythe foot switches
de: Kommandozeilenwerkzeuge für PCsensor- und Scythe-Fußschalter
sk: Nástroje príkazového riadka pre nožné spínače PCsensor a Scythe

source: This package provides command line utilities for programming PCsensor and Scythe foot switches. It works for both single pedal and three pedal devices.
de: Dieses Paket beinhaltet Kommandozeilenwerkzeuge zum Konfigurieren von PCsensor- und Scythe-Fußschaltern. Es funktioniert sowohl für Einfachpedal- als auch für Dreifachpedalgeräte.
sk: Tento balík poskytuje nástroje príkazového riadka na programovanie nožných spínačov PCsensor a Scythe. Funguje pre zariadenia s jedným aj tromi pedálmi.

source: Tiny screen magnifier for X11
de: Kleine Bildschirmlupe für X11

source: Standard login and process accounting utilities
de: Standard-Anmelde- und -Prozessverwaltungs-Werkzeuge

source: System service manager
de: Verwaltung von Systemdiensten

source: System container manager
de: Verwaltung von Systemcontainern

source: Set of utilities for cloud computing environments
de: Sammlung von Werkzeugen für Cloud-Computing-Umgebungen

source: Complete GCC tool chain for C/C++ development
de: Vollständige GCC-Werkzeugsammlung für die Entwicklung in C/C++

source: Manipulate plain text files as databases
de: Bearbeitung von Datenbanken in Form einfacher Textdateien

source: GNU Recutils is a set of tools and libraries for creating and manipulating text-based, human-editable databases. Despite being text-based, databases created with Recutils carry all of the expected features such as unique fields, primary keys, time stamps and more. Many different field types are supported, as is encryption.
de: Die GNU Recutils sind eine Sammlung von Werkzeugen und Bibliotheken zum Erstellen und Bearbeiten textbasierter, menschenlesbarer Datenbanken. Obwohl rein textbasiert, bieten die mit Recutils erzeugten Datenbanken alles, was Sie von einer Datenbank erwarten, wie eindeutige Felder, Primärschlüssel, Zeitstempel und vieles mehr. Viele verschiedene Feldtypen sowie Verschlüsselung werden unterstützt.

source: Python ODBC Library
de: ODBC-Bibliothek für Python

source: Programming font
de: Programmierschriftart

source: This package provides a programming font focused on source code legibility.
de: Dieses Paket enthält eine Programmierschriftart, die auf die Lesbarkeit von Quellcode ausgerichtet ist.

source: GNOME Adwaita Fonts
de: GNOME-Adwaita-Schriftarten

source: GObject bindings for libudev
de: GObject-Anbindungen für libudev

source: GLib binding for libusb1
de: GLib-Anbindungen für libusb1

source: The package provides Perl bindings to OpenGL, GLU and FreeGLUT.
de: Dieses Paket bietet Perl-Anbindungen für OpenGL, GLU und FreeGLUT.

source: Collection of very basic statistics modules
de: Sammlung sehr grundlegender Statistik-Module

source: SDL bindings to Perl
de: SDL-Anbindungen für Perl

source: Scheme implementation using a bytecode interpreter
de: Scheme-Implementierung mit Bytecode-Interpretierer

source: Configuration files for LaTeX-related formats
de: Konfigurationsdateien für LaTeX und verwandte Formate

source: The package provides configuration files for LaTeX-related formats.
de: Dieses Paket bietet Konfigurationsdateien für LaTeX und verwandte Formate.

source: guile-ncurses provides Guile language bindings for the ncurses library.
de: guile-ncurses stellt Guile-Sprachbindungen für die ncurses- Bibliothek bereit.

source: Collection of useful Guile Scheme modules
de: Sammlung nützlicher Guile-Scheme-Modulen

source: Run jobs at scheduled times
de: Aufgaben planmäßig ausführen
