Repository: Millak/guix
Catalog: po/packages/*.po
Languages: ar, de, fi, it, nl, sk, sv, tr

source: JamesDSP is an audio effect processor for PipeWire and PulseAudio clients, featuring: @itemize @item Automatic bass boost: Frequency-detecting bass-boost @item Automatic dynamic range compressor: automated multiband dynamic range adjusting effect @item Complex reverberation IIR network (Progenitor 2) @item Interpolated FIR equalizer with flexible bands @item Arbitrary response equalizer (also known as GraphicEQ from EqualizerAPO) @item AutoEQ database integration (requires network connection) @item Partitioned convolver (Auto segmenting convolution): Mono, stereo, full/true stereo (LL, LR, RL, RR) impulse response @item Crossfeed: Realistic surround effects @item Soundstage wideness: A multiband stereo wideness controller @item ViPER-DDC: Parametric equalization on audio and creating VDC input files @item Analog modeling: An aliasing-free even harmonic generator @item Output limiter @item Scripting engine: Live programmable DSP using the EEL2 scripting language @item Scripting IDE featuring syntax highlighting, basic code completion, dynamic code outline window, console output support and detailed error messages with inline code highlighting @end itemize
it: JamesDSP è un processore di effetti audio per i client PipeWire e PulseAudio, che include: @itemize @item Bass Boost automatico: Bass Boost con rilevamento della frequenza @item Compressore automatico della gamma dinamica: Effetto di regolazione automatica della gamma dinamica multibanda @item Rete IIR a riverbero complesso (Progenitor 2) @item Equalizzatore FIR interpolato con bande flessibili @item Equalizzatore a risposta arbitraria (noto anche come GraphicEQ da EqualizerAPO) @item Integrazione con il database AutoEQ (richiede una connessione di rete) @item Convolver partizionato (Convoluzione a segmentazione automatica): Risposta all'impulso mono, stereo, stereo completo/vero (LL, LR, RL, RR) @item Crossfeed: Effetti surround realistici @item Ampiezza del palcoscenico sonoro: Controller di ampiezza stereo multibanda @item ViPER-DDC: Equalizzazione parametrica dell'audio e creazione di file di input VDC @item Modellazione analogica: Un Generatore di armoniche pari senza aliasing @item Limitatore di uscita @item Motore di scripting: DSP programmabile in tempo reale tramite il linguaggio di scripting EEL2 @item IDE di scripting con evidenziazione della sintassi, completamento del codice di base, finestra di struttura del codice dinamico, supporto per l'output della console e messaggi di errore dettagliati con evidenziazione del codice in linea @end itemize

source: Digital audio workstation
it: Stazione di lavoro audio digitale
tr: Dijital ses iş istasyonu

source: Ardour is a multi-channel digital audio workstation, allowing users to record, edit, mix and master audio and MIDI projects. It is targeted at audio engineers, musicians, soundtrack editors and composers.
de: Ardour ist eine mehrkanalige Digital Audio Workstation, die es Nutzern ermöglicht, Audio- und MIDI-Projekte aufzunehmen, zu bearbeiten, zu mischen und zu mastern. Seine Zielgruppe sind Tontechniker, Musiker, Soundtrack-Verfasser und Komponisten.
it: Ardour è una workstation audio digitale multicanale che consente agli utenti di registrare, modificare, mixare e masterizzare progetti audio e MIDI. È rivolta a ingegneri del suono , musicisti, editor di colonne sonore e compositori.
tr: Ardor, çok kanallı bir dijital ses iş istasyonudur.kullanıcıların ses ve MIDI projelerini kaydetmesine, düzenlemesine, mikslemesine ve master yapmasına olanak verir. Ses mühendislerine, müzisyenlere, film müziği editörlerine ve bestecilere yöneliktir.

source: Software for recording and editing sounds
de: Software zum Aufnehmen und Bearbeiten von Ton
it: Software per la registrazione e l'editing dei suoni
sv: Programvara för att spela in och redigera ljud
tr: Sesleri kaydetmek ve düzenlemek için yazılım

source: Audacity is a multi-track audio editor designed for recording, playing and editing digital audio. It features digital effects and spectrum analysis tools.
de: Audacity ist ein mehrspuriges Audiobearbeitungsprogramm zum Aufnehmen, Abspielen und Bearbeiten von digitalen Tondateien. Es bietet digitale Effekte und Spektrumsanalysewerkzeuge.
it: Audacity è un editor audio multitraccia progettato per la registrazione, la riproduzione e l'editing di audio digitale. Offre effetti digitali e strumenti di analisi spettrale.
sv: Audacity är en redigerare för multiljudspår och är utformad för att spela in, spela upp och redigera digitalt ljud. Det tillhandahåller digitala effekter och verktyg för spektrumanalysering.

source: Tenacity is a multi-track audio editor designed for recording, playing and editing digital audio. It features digital effects and spectrum analysis tools.
it: Tenacity è un editor audio multitraccia progettato per registrare, riprodurre e modificare l'audio digitale. Dispone di effetti digitali e strumenti di analisi dello spettro.
sv: Tenacity är en redigerare för multiljudspår och är utformad för att spela in, spela upp och redigera digitalt ljud. Det tillhandahåller digitala effekter och verktyg för spektrumanalysering.

source: Library to handle various audio file formats
it: Libreria per gestire vari formati di file audio
sv: Bibliotek för att hantera olika ljudfilsformat
tr: Çeşitli ses dosyası formatlarını işlemek için kütüphane

source: Pitch-correction LADSPA audio plugin
it: Plugin audio LADSPA per la correzione dell'intonazione
tr: Ses perdesi düzeltme LADSPA ses eklentisi

source: Autotalent is a LADSPA plugin for real-time pitch-correction. Among its controls are allowable notes, strength of correction, LFO for vibrato and formant warp.
it: Autotalent è un plugin LADSPA per la correzione dell'intonazione in tempo reale. Tra i suoi controlli ci sono le note consentite, la forza della correzione, l'LFO per il vibrato e il formant warp.

source: Tonewheel organ synthesizer
de: Tonrad-Orgel-Synthesizer
it: Sintetizzatore di organo a ruota fonica
tr: Tonewheel organ sentezleyici

source: AZR-3 is a port of the free VST plugin AZR-3. It is a tonewheel organ with drawbars, distortion and rotating speakers. The organ has three sections, two polyphonic sections with nine drawbars each and one monophonic bass section with five drawbars. A standalone JACK application and LV2 plugins are provided.
de: AZR-3 ist eine Portierung des freien VST-Plugins AZR-3. Es handelt sich um eine Tonrad-Orgel mit Zugriegeln, Verzerrung und rotierenden Lautsprechern. Die Orgel hat drei Teile, zwei mehrtönige mit neun Zugriegeln und einen eintönigen Bass-Teil mit fünf Zugriegeln. Eine eigenständige JACK-Anwendung und LV2-Plugins stehen zur Verfügung.
it: AZR-3 è un port del plugin VST gratuito AZR-3. È un organo a ruote foniche con drawbar, distorsione e altoparlanti rotanti. L'organo ha tre sezioni, due sezioni polifoniche con nove drawbar ciascuna e una sezione basso monofonica con cinque drawbar. Vengono fornite un'applicazione JACK standalone e plugin LV2.

source: Barebones, fast LV2 bass enhancement plugin.
it: Plugin LV2 minimale e veloce per il potenziamento dei bassi.

source: This package provides a barebones, fast LV2 bass enhancement plugin.
it: Questo pacchetto fornisce un plugin LV2 minimale e veloce per il potenziamento dei bassi.

source: GUI for pipewire and wireplumber settings and connections
it: GUI per le impostazioni e le connessioni di pipewire e wireplumber

source: This is a PyQT GUI application to dynamically modify Pipewire and Wireplumber settings at runtime, such as quantum. sample rate, latency offset setting, services restart and more. It features side-by-side and graph style connections manager, pw-top wrapper, simple ALSA mixer and jack_delay GUI.
it: Questa è un'applicazione GUI PyQT per modificare dinamicamente le impostazioni di Pipewire e Wireplumber in fase di esecuzione, come il quantum, la frequenza di campionamento, l'impostazione dell'offset di latenza, il riavvio dei servizi e altro ancora. Dispone di un gestore di connessioni in stile affiancato e a grafo, un wrapper pw-top, un semplice mixer ALSA e una GUI jack_delay.

source: Audio plug-in pack for LV2 and JACK environments
de: Audio-Plugin-Sammlung für LV2- und JACK-Umgebungen
it: Pacchetto di plug-in audio per ambienti LV2 e JACK
tr: LV2 ve JACK ortamları için ses eklenti paketi

source: Calf Studio Gear is an audio plug-in pack for LV2 and JACK environments. The suite contains lots of effects (delay, modulation, signal processing, filters, equalizers, dynamics, distortion and mastering effects), instruments (SF2 player, organ simulator and a monophonic synthesizer) and tools (analyzer, mono/stereo tools, crossovers).
de: Calf Studio Gear ist eine Sammlung von Audio-Plugins für LV2- und JACK-Umgebungen. Die Zusammenstellung enthält zahlreiche Effekte (Verzögerung, Modulation, Signalverarbeitung, Filter, Entzerrer, Dynamik, Verzerrung und Mastering-Effekte), Instrumente (SF2-Spieler, Orgelsimulator und einen monophonen Synthesizer) und Werkzeuge (Analyzer, Mono-/Stereo-Werkzeuge, Crossover).
it: Calf Studio Gear è un pacchetto di plug-in audio per ambienti LV2 e JACK. La suite contiene numerosi effetti (delay, modulazione, elaborazione del segnale, filtri, equalizzatori, dinamiche, distorsione ed effetti di mastering), strumenti (lettore SF2, simulatore d'organo e un sintetizzatore monofonico) e strumenti (analizzatore, strumenti mono/stereo, crossover).

source: LV2 port of the CAPS audio plugin collection
it: Port LV2 della collezione di plugin audio CAPS
tr: CAPS ses eklenti koleksiyonunun LV2 bağlantı noktası

source: LV2 port of CAPS, a collection of audio plugins comprising basic virtual guitar amplification and a small range of classic effects, signal processors and generators of mostly elementary and occasionally exotic nature.
it: Port LV2 di CAPS, una collezione di plugin audio che comprende un'amplificazione virtuale di base per chitarra e una piccola gamma di effetti classici, processori di segnale e generatori di natura prevalentemente elementare e occasionalmente esotica.

source: Physical modeling for analog tape machines
it: Modellazione fisica per macchine a nastro analogiche

source: CHOW Tape is an analog tape machine physical model, originally based on the Sony TC-260. The current version can be used to emulate a wide variety of reel-to-reel tape machines.
it: CHOW Tape è un modello fisico di macchina a nastro analogica, originariamente basato sul Sony TC-260. La versione attuale può essere utilizzata per emulare una vasta gamma di macchine a nastro reel-to-reel.

source: Real-time C++ @acronym{IIR, infinite impulse response} filter library
it: Libreria di filtri in tempo reale @acronym{IIR, infinite impulse response} per C++
tr: Gerçek zamanlı C++ @acronym{IIR, sonsuz dürtü yanıtı} filtre kütüphanesi

source: This C++ library implements the Butterworth, RBJ, and Chebychev @acronym{IIR, infinite impulse response} filters. Samples are processed one by one, in real time. It can easily import coefficients generated with Python (@code{scipy}). It also avoids memory leaks by allocating memory at compile time, using templates, instead of calling @code{malloc()} or @code{new}.
it: Questa libreria C++ implementa i filtri Butterworth, RBJ e Chebychev @acronym{IIR, infinite impulse response}. I campioni vengono elaborati uno per uno, in tempo reale. Può importare facilmente coefficienti generati con Python (@code{scipy}). Evita anche le perdite di memoria allocando la memoria in fase di compilazione, utilizzando i template, invece di chiamare @code{malloc()} o @code{new}.

source: LV2 plugins for live use
de: LV2-Plugins für Liveaufnahmen
it: Plugin LV2 per l'uso dal vivo
tr: Canlı kullanım için LV2 eklentileri

source: The infamous plugins are a collection of LV2 audio plugins for live performances. The plugins include a cellular automaton synthesizer, an envelope follower, distortion effects, tape effects and more.
de: Diese berüchtigten Plugins sind eine Sammlung von LV2-Audio-Plugins für Live-Darbietungen. Zu den Plugins gehören ein Zellulärer-Automaten-Synthesizer, ein Envelope Follower, Verzerrungseffekte, Tape-Effekte und mehr.
it: Gli infamous plugins sono una collezione di plugin audio LV2 per esibizioni dal vivo. I plugin includono un sintetizzatore ad automa cellulare, un envelope follower, effetti di distorsione, effetti nastro e altro.

source: LV2 audio plugins for modular synthesis
it: Plugin audio LV2 per sintesi modulare

source: Omins-lv2 is a small collection of LV2 audio plugins for modular synthesis.
it: Omins-lv2 è una piccola collezione di plugin audio LV2 per la sintesi modulare.

source: Synchronous multiroom audio player
it: Lettore audio sincrono multi-stanza
tr: Eşzamanlı çok odalı müzik çalar

source: Snapcast is a multi-room client-server audio player. Clients are time synchronized with the server to play synced audio.
it: Snapcast è un lettore audio client-server multi-stanza. I client sono sincronizzati temporalmente con il server per riprodurre audio sincronizzato.

source: The SWH Plugins package for the LADSPA plugin system
it: Il pacchetto SWH Plugins per il sistema di plugin LADSPA

source: This package provides Steve Harris's LADSPA plugins.
de: Dieses Paket bietet Steve Harris’ LADSPA-Plugins.
it: Questo pacchetto fornisce i plugin LADSPA di Steve Harris.
tr: Bu paket Steve Harris'in LADSPA eklentilerini sağlar.

source: SWH plugins in LV2 format
de: SWH-Plugins im LV2-Format
it: Plugin SWH in formato LV2
tr: LV2 formatında SWH eklentileri

source: Swh-plugins-lv2 is a collection of audio plugins in LV2 format. Plugin classes include: dynamics (compressor, limiter), time (delay, chorus, flanger), ringmodulator, distortion, filters, pitchshift, oscillators, emulation (valve, tape), bit fiddling (decimator, pointer-cast), etc.
de: Swh-plugins-lv2 ist eine Sammlung von Audio-Plugins im LV2-Format. Zu den Pluginkategorien gehören Dynamik (Kompressor, Limiter), Zeit (Verzögerung, Chorus, Flanger), Ringmodulator, Verzerrung, Filter, Tonhöhenabweichung, Oszillatoren, Emulation (Ventil, Band), Bit-Fiddling (Decimator, Pointer-Cast) usw.
it: Swh-plugins-lv2 è una collezione di plugin audio in formato LV2. Le classi di plugin includono: dinamiche (compressore, limitatore), tempo (delay, chorus, flanger), ringmodulator, distorsione, filtri, pitchshift, oscillatori, emulazione (valvolare, nastro), manipolazione di bit (decimator, pointer-cast), ecc.
tr: Swh-plugins-lv2 Lv2 formatında ses eklentilerinin koleksiyonudur.Eklenti sınıfları şunları içerir: dinamikler (kompresör, sınırlayıcı), zaman (gecikme, koro, Flanger), halka modülatör, distorsiyon, filtreler, pitchshift, osilatörler, emulasyon(valf, bant), bit oynama (desimator, pointer-cast), vb.

source: C++ library for access to DJ record libraries
it: Libreria C++ per l'accesso alle librerie di dischi per DJ
tr: DJ kayıt kütüphanelerine erişim için C++ kütüphanesi

source: @code{libdjinterop} is a C++ library that allows access to database formats used to store information about DJ record libraries.
it: @code{libdjinterop} è una libreria C++ che permette l'accesso ai formati di database utilizzati per memorizzare informazioni sulle librerie di dischi per DJ.
tr: @code{libdjinterop} veritabanına erişime izin veren bir C++ kütüphanesidir. DJ kayıt kitaplıkları hakkında bilgi depolamak için kullanılan formatlar.

source: Sound Synthesis with Physical Models
it: Sintesi sonora con modelli fisici
tr: Fiziksel Modellerle Ses Sentezi

source: Tao is a software package for sound synthesis using physical models. It provides a virtual acoustic material constructed from masses and springs which can be used as the basis for building quite complex virtual musical instruments. Tao comes with a synthesis language for creating and playing instruments and a C++ API for those who would like to use it as an object library.
it: Tao è un pacchetto software per la sintesi sonora tramite modelli fisici. Fornisce un materiale acustico virtuale costruito da masse e molle che può essere utilizzato come base per la costruzione di strumenti musicali virtuali piuttosto complessi. Tao è dotato di un linguaggio di sintesi per creare e suonare strumenti e di un'API C++ per coloro che desiderano utilizzarlo come libreria di oggetti.

source: Sound synthesis with physical models
it: Sintesi sonora con modelli fisici
tr: Fiziksel modellerle ses sentezi

source: Sound and music computing system
de: Ton- und Musikrechensystem
it: Sistema di calcolo per suoni e musica
tr: Ses ve müzik hesaplama sistemi

source: Csound is a user-programmable and user-extensible sound processing language and software synthesizer.
de: Csound ist eine nutzerprogrammierbare und nutzererweiterbare Tonverarbeitungssprache und ein Software-Synthesizer.
it: Csound è un linguaggio di elaborazione del suono e un sintetizzatore software programmabile ed estendibile dall'utente.
tr: Csound kullanıcı tarafından programlanabilir ve geliştirebilir ses işleme dili ve yazılım sentezliyicisidir.

source: Convert SMF MIDI files to and from plain text
it: Converte file MIDI SMF da e verso testo semplice

source: midicomp can manipulate SMF (Standard MIDI File) files. It can both read and write SMF files in 0 or format 1 and also read and write its own plain text format. This means a SMF file can be turned into easily parseable text, edited with any text editor or filtered through any script language, and recompiled back into a binary SMF file.
it: midicomp può manipolare file SMF (Standard MIDI File). Può leggere e scrivere file SMF in formato 0 o 1 e anche leggere e scrivere il proprio formato di testo semplice. Ciò significa che un file SMF può essere trasformato in testo facilmente analizzabile, modificato con qualsiasi editor di testo o filtrato attraverso qualsiasi linguaggio di scripting e ricompilato in un file SMF binario.

source: Pre-GM Roland MIDI device emulator
it: Emulatore di dispositivi MIDI Roland pre-GM

source: libmt32emu is a C/C++ library which approximately emulates the Roland MT-32, CM-32L and LAPC-I synthesizer modules. It is part of the Munt project.
it: libmt32emu è una libreria C/C++ che emula approssimativamente i moduli sintetizzatori Roland MT-32, CM-32L e LAPC-I. Fa parte del progetto Munt.

source: C++ wrapper around the ALSA API
de: C++-Wrapper um die ALSA-Programmierschnittstelle
it: Wrapper C++ per l'API ALSA
tr: ALSA API'si etrafında C++ sarıcı

source: clalsadrv is a C++ wrapper around the ALSA API simplifying access to ALSA PCM devices.
de: clalsadrv ist ein C++-Wrapper um die ALSA-Programmierschnittstelle, der den Zugang zu ALSA-PCM-Geräten vereinfacht.
it: clalsadrv è un wrapper C++ per l'API ALSA che semplifica l'accesso ai dispositivi PCM ALSA.
tr: clalsadrv, ALSA API'si etrafında erişimi basitleştiren bir C++ wrapperdır. ALSA PCM cihazları.

source: LADSPA ambisonics plugins
it: Plugin ambisonici LADSPA
tr: LADSPA ambisonics eklentileri

source: The AMB plugins are a set of LADSPA ambisonics plugins, mainly to be used within Ardour. Features include: mono and stereo to B-format panning, horizontal rotator, square, hexagon and cube decoders.
de: Die AMB-Plugins sind eine Reihe von LADSPA-Ambisonics-Plugins und hauptsächlich für die Nutzung mit Ardour gedacht. Sie bieten Panning von Mono oder Stereo zum B-Format, horizontalen Rotierer, Quadrat-, Sechseck und Würfel-Decoder.
it: I plugin AMB sono un set di plugin ambisonici LADSPA, da utilizzare principalmente all'interno di Ardour. Le caratteristiche includono: panning da mono e stereo a formato B, rotatore orizzontale, decodificatori a quadrato, esagono e cubo.
tr: AMB eklentileri, bir dizi LADSPA ambisonics eklentisidir; Ardour'da kullanılır. Özellikler şunları içerir: mono ve stereodan B-formatına kaydırma, yatay döndürücü, kare, altıgen ve küp kod çözücüler.

source: Chorus, phaser, and vintage high-pass and low-pass filters
de: Chorus-, Phaser- und Vintage-Hochpass und -Tiefpass-Filter
it: Chorus, phaser e filtri passa-alto e passa-basso vintage

source: This package provides various LADSPA plugins. @code{cs_chorus} and @code{cs_phaser} provide chorus and phaser effects, respectively; @code{mvclpf24} provides four implementations of the low-pass filter used in vintage Moog synthesizers; @code{mvchpf24} is based on the voltage-controlled high-pass filter by Robert Moog. The filters attempt to accurately emulate the non-linear circuit elements of their original analog counterparts.
de: Dieses Paket bietet verschiedene LADSPA-Plugins. @code{cs_chorus} und @code{cs_phaser} bieten jeweils Chorus- und Phaser-Effekte; @code{mvclpf24} bietet vier Implementierungen des Tiefpassfilters, der in Vintage-Moog-Synthesizern benutzt wird; @code{mvchpf24} basiert auf dem spannungsgesteuerten Hochpassfilter von Robert Moog. Die Filter versuchen, die nicht-linearen Schaltkreiselemente ihrer ursprünglichen analogen Gegenstücke zu emulieren.
it: Questo pacchetto fornisce vari plugin LADSPA. @code{cs_chorus} e @code{cs_phaser} forniscono rispettivamente effetti chorus e phaser; @code{mvclpf24} fornisce quattro implementazioni del filtro passa-basso utilizzato nei sintetizzatori Moog vintage; @code{mvchpf24} si basa sul filtro passa-alto controllato in tensione di Robert Moog. I filtri tentano di emulare accuratamente gli elementi di circuito non lineari delle loro controparti analogiche originali.

source: LADSPA reverb plugin
de: LADSPA-Nachhall-Plugin
it: Plugin di riverbero LADSPA
tr: LADSPA yankı eklentisi

source: This package provides a stereo reverb LADSPA plugin based on the well-known greverb.
de: Dieses Paket bietet ein Stereo-Nachhall-LADSPA-Plugin basierend auf dem wohlbekannten greverb.
it: Questo pacchetto fornisce un plugin LADSPA di riverbero stereo basato sul ben noto greverb.
tr: Bu paket, bir stereo reverb LADSPA eklentisi sağlar. ünlü greverb.

source: LADSPA four-band parametric equalizer plugin
de: LADSPA-Vierband-Parametrischer-Equalizer-Plugin
it: Plugin equalizzatore parametrico a quattro bande LADSPA
tr: LADSPA dört bantlı parametrik ekolayzır eklentisi
