Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: (define-public guile (package (name "guile") (version "3.0.99-git") ;funky version number (source (local-file "../.." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{}))
it: (define-public guile (package (name "guile") (version "3.0.99-git") ;numero di versione strano (source (local-file "../.." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{}))
pt_br: (define-public guile (package (name "guile") (version "3.0.99-git") ;número da versão funky (source (local-file "../.." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{}))

source: ;; Return the package object define above at the end of the module. guile
it: ;; Restituisce l'oggetto pacchetto definito sopra alla fine del modulo. guile
pt_br: ;; Retorna o objeto do pacote definido acima no final do módulo. guile

source: We need one last thing: a @uref{https://guix.gnu.org/manual/devel/en/html_node/Package-Modules-in-a-Sub_002ddirectory.html,@code{.guix-channel} file} so Guix knows where to look for package modules in our repository:
it: Ci serve un'ultima cosa: un file @uref{https://guix.gnu.org/manual/devel/en/html_node/Package-Modules-in-a-Sub_002ddirectory.html,@code{.guix-channel}} in modo che Guix sappia dove cercare i moduli dei pacchetti nel nostro repository:
pt_br: Precisamos de uma última coisa: um arquivo @uref{https://guix.gnu.org/manual/devel/pt-br/html_node/Modulos-de-pacote-em-um-subdiretorio,@code{.guix-channel}} para que o Guix saiba onde procurar módulos de pacote em nosso repositório:

source: ;; This file lets us present this repo as a Guix channel.
it: ;; Questo file ci permette di presentare questo repository come un canale Guix.
pt_br: ;; Este arquivo nos permite apresentar este repositório como um canal Guix.

source: (channel (version 0) (directory ".guix/modules")) ;look for package modules under .guix/modules/
it: (channel (version 0) (directory ".guix/modules")) ;cerca i moduli dei pacchetti sotto .guix/modules/
pt_br: (channel (version 0) (directory ".guix/modules")) ;procure por módulos de pacote em .guix/modules/

source: To recap, we now have these files:
it: Per ricapitolare, ora abbiamo questi file:
pt_br: Para recapitular, agora temos estes arquivos:

source: And that's it: we have a channel! (We could do better and support @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Channel-Authorizations.html,@emph{channel authentication}} so users know they're pulling genuine code. We'll spare you the details here but it's worth considering!) Users can pull from this channel by @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Additional-Channels.html,adding it to @code{~/.config/guix/channels.scm}}, along these lines:
it: E questo è tutto: abbiamo un canale! (Potremmo fare di meglio e supportare @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Channel-Authorizations.html,@emph{l'autenticazione del canale}} in modo che gli utenti sappiano di scaricare codice autentico. Ti risparmiamo i dettagli qui, ma vale la pena considerarlo!) Gli utenti possono scaricare da questo canale @uref{https://guix.gnu.org/manual/devel/en/html_node/Specifying-Additional-Channels.html,aggiungendolo a @code{~/.config/guix/channels.scm}}, secondo queste linee:
pt_br: E é isso: temos um canal! (Poderíamos fazer melhor e dar suporte a @uref{https://guix.gnu.org/manual/devel/pt-br/html_node/Especificando-autorizacoes-de-canal.html,@emph{autenticação de canal}} para que os usuários saibam que estão extraindo código genuíno. Vamos poupá-lo dos detalhes aqui, mas vale a pena considerar!) Os usuários podem extrair deste canal por @uref{https://guix.gnu.org/manual/devel/pt-br/html_node/Especificando-canais-adicionais.html,adicionando-o a @code{~/.config/guix/channels.scm}}, ao longo destas linhas:

source: After running @command{guix pull}, we can see the new package:
it: Dopo aver eseguito @command{guix pull}, possiamo vedere il nuovo pacchetto:
pt_br: Após executar @command{guix pull}, podemos ver o novo pacote:

source: $ guix describe Generation 264 May 26 2023 16:00:35 (current) guile 36fd2b4 repository URL: https://git.savannah.gnu.org/git/guile.git branch: main commit: 36fd2b4920ae926c79b936c29e739e71a6dff2bc guix c5bc698 repository URL: https://git.guix.gnu.org/guix.git commit: c5bc698e8922d78ed85989985cc2ceb034de2f23 $ guix package -A ^guile$ guile 3.0.99-git out,debug guile-package.scm:51:4 guile 3.0.9 out,debug gnu/packages/guile.scm:317:2 guile 2.2.7 out,debug gnu/packages/guile.scm:258:2 guile 2.2.4 out,debug gnu/packages/guile.scm:304:2 guile 2.0.14 out,debug gnu/packages/guile.scm:148:2 guile 1.8.8 out gnu/packages/guile.scm:77:2 $ guix build guile@@3.0.99-git [@dots{}] /gnu/store/axnzbl89yz7ld78bmx72vpqp802dwsar-guile-3.0.99-git-debug /gnu/store/r34gsij7f0glg2fbakcmmk0zn4v62s5w-guile-3.0.99-git
it: $ guix describe Generazione 264 26 maggio 2023 16:00:35 (corrente) guile 36fd2b4 URL repository: https://git.savannah.gnu.org/git/guile.git ramo: main commit: 36fd2b4920ae926c79b936c29e739e71a6dff2bc guix c5bc698 URL repository: https://git.guix.gnu.org/guix.git commit: c5bc698e8922d78ed85989985cc2ceb034de2f23 $ guix package -A ^guile$ guile 3.0.99-git out,debug guile-package.scm:51:4 guile 3.0.9 out,debug gnu/packages/guile.scm:317:2 guile 2.2.7 out,debug gnu/packages/guile.scm:258:2 guile 2.2.4 out,debug gnu/packages/guile.scm:304:2 guile 2.0.14 out,debug gnu/packages/guile.scm:148:2 guile 1.8.8 out gnu/packages/guile.scm:77:2 $ guix build guile@@3.0.99-git [@dots{}] /gnu/store/axnzbl89yz7ld78bmx72vpqp802dwsar-guile-3.0.99-git-debug /gnu/store/r34gsij7f0glg2fbakcmmk0zn4v62s5w-guile-3.0.99-git
pt_br: $ guix describe Geração 264 26 de maio de 2023 16:00:35 (atual) guile 36fd2b4 repository URL: https://git.savannah.gnu.org/git/guile.git branch: main commit: 36fd2b4920ae926c79b936c29e739e71a6dff2bc guix c5bc698 repository URL: https://git.guix.gnu.org/guix.git commit: c5bc698e8922d78ed85989985cc2ceb034de2f23 $ guix package -A ^guile$ guile 3.0.99-git out,debug guile-package.scm:51:4 guile 3.0.9 out,debug gnu/packages/guile.scm:317:2 guile 2.2.7 out,debug gnu/packages/guile.scm:258:2 guile 2.2.4 out,debug gnu/packages/guile.scm:304:2 guile 2.0.14 out,debug gnu/packages/guile.scm:148:2 guile 1.8.8 out gnu/packages/guile.scm:77:2 $ guix build guile@@3.0.99-git [@dots{}] /gnu/store/axnzbl89yz7ld78bmx72vpqp802dwsar-guile-3.0.99-git-debug /gnu/store/r34gsij7f0glg2fbakcmmk0zn4v62s5w-guile-3.0.99-git

source: That's how, as a developer, you get your software delivered directly into the hands of users! No intermediaries, yet no loss of transparency and provenance tracking.
it: È così che, come sviluppatore, consegni il tuo software direttamente nelle mani degli utenti! Nessun intermediario, eppure nessuna perdita di trasparenza e tracciamento della provenienza.
pt_br: É assim que, como desenvolvedor, você tem seu software entregue diretamente nas mãos dos usuários! Sem intermediários, mas sem perda de transparência e rastreamento de procedência.

source: With that in place, it also becomes trivial for anyone to create Docker images, Deb/RPM packages, or a plain tarball with @command{guix pack} (@pxref{Invoking guix pack,,, guix, GNU Guix Reference Manual}):
it: Con questo in atto, diventa anche banale per chiunque creare immagini Docker, pacchetti Deb/RPM o un semplice tarball con @command{guix pack} (@pxref{Invocare guix pack,,, guix.it, Manuale di riferimento GNU Guix}):
pt_br: Com isso em prática, também se torna trivial para qualquer um criar imagens Docker, pacotes Deb/RPM ou um tarball simples com @command{guix pack} (@pxref{Invocando guix pack,,, guix.pt_BR, Manual de Referência GNU Guix}):

source: # How about a Docker image of our Guile snapshot? guix pack -f docker -S /bin=bin guile@@3.0.99-git
it: # Che ne dici di un'immagine Docker del nostro snapshot Guile? guix pack -f docker -S /bin=bin guile@@3.0.99-git
pt_br: # Que tal uma imagem Docker do nosso instantâneo Guile? guix pack -f docker -S /bin=bin guile@@3.0.99-git

source: # And a relocatable RPM? guix pack -f rpm -R -S /bin=bin guile@@3.0.99-git
it: # E un RPM rilocabile? guix pack -f rpm -R -S /bin=bin guile@@3.0.99-git
pt_br: # E um RPM relocável? guix pack -f rpm -R -S /bin=bin guile@@3.0.99-git

source: Bonus: Package Variants
it: Bonus: Varianti di Pacchetto
pt_br: Bônus: Variantes do pacote

source: We now have an actual channel, but it contains only one package (@pxref{The Repository as a Channel}). While we're at it, we can define @dfn{package variants} (@pxref{Defining Package Variants,,, guix, GNU Guix Reference Manual}) in our @file{guile-package.scm} file, variants that we want to be able to test as Guile developers---similar to what we did above with transformation options. We can add them like so:
it: Ora abbiamo un canale effettivo, ma contiene un solo pacchetto (@pxref{The Repository as a Channel}). Già che ci siamo, possiamo definire @dfn{varianti di pacchetto} (@pxref{Definire varianti di pacchetto,,, guix.it, Manuale di riferimento GNU Guix}) nel nostro file @file{guile-package.scm}, varianti che vogliamo poter testare come sviluppatori Guile --- in modo simile a quanto fatto sopra con le opzioni di trasformazione. Possiamo aggiungerle così:
pt_br: Agora temos um canal real, mas ele contém apenas um pacote (@pxref{The Repository as a Channel}). Enquanto estamos nisso, podemos definir @dfn{variantes de pacote} (@pxref{Definindo variantes de pacote,,, guix.pt_BR, Manual de Referência do GNU Guix}) em nosso arquivo @file{guile-package.scm}, variantes que queremos poder testar como desenvolvedores Guile---semelhante ao que fizemos acima com opções de transformação. Podemos adicioná-las assim:

source: ;; This is the ‘.guix/modules/guile-package.scm’ file.
it: ;; Questo è il file «.guix/modules/guile-package.scm».
pt_br: ;; Este é o arquivo ‘.guix/modules/guile-package.scm’.

source: (define (package-with-configure-flags p flags) "Return P with FLAGS as additional 'configure' flags." (package/inherit p (arguments (substitute-keyword-arguments (package-arguments p) ((#:configure-flags original-flags #~(list)) #~(append #$original-flags #$flags))))))
it: (define (package-with-configure-flags p flags) "Restituisce P con FLAGS come flag 'configure' aggiuntivi." (package/inherit p (arguments (substitute-keyword-arguments (package-arguments p) ((#:configure-flags original-flags #~(list)) #~(append #$original-flags #$flags))))))
pt_br: (define (package-with-configure-flags p flags) "Retorna P com FLAGS como sinalizadores 'configure' adicionais." (package/inherit p (arguments (substitute-keyword-arguments (package-arguments p) ((#:configure-flags original-flags #~(list)) #~(append #$original-flags #$flags))))))

source: ;; Return the package object defined above at the end of the module. guile
it: ;; Restituisce l'oggetto pacchetto definito sopra alla fine del modulo. guile
pt_br: ;; Retorna o objeto do pacote definido acima no final do módulo. guile

source: We can build these variants as regular packages once we've pulled the channel. Alternatively, from a checkout of Guile, we can run a command like this one from the top level:
it: Possiamo costruire queste varianti come pacchetti regolari una volta che abbiamo scaricato il canale. In alternativa, da un checkout di Guile, possiamo eseguire un comando come questo dal livello superiore:
pt_br: Podemos construir essas variantes como pacotes regulares assim que tivermos puxado o canal. Alternativamente, a partir de um checkout do Guile, podemos executar um comando como este do nível superior:

source: Level 3: Setting Up Continuous Integration
it: Livello 3: Configurazione dell'Integrazione Continua
pt_br: Nível 3: Configurando a integração contínua

source: continuous integration (CI)
it: integrazione continua (CI)
pt_br: integração contínua (CI)
ru: непрерывная интеграция

source: The channel we defined above (@pxref{The Repository as a Channel}) becomes even more interesting once we set up @uref{https://en.wikipedia.org/wiki/Continuous_integration, @dfn{continuous integration}} (CI). There are several ways to do that.
it: Il canale che abbiamo definito sopra (@pxref{The Repository as a Channel}) diventa ancora più interessante una volta che configuriamo @uref{https://it.wikipedia.org/wiki/Integrazione_continua, @dfn{l'integrazione continua}} (CI). Ci sono diversi modi per farlo.
pt_br: O canal que definimos acima (@pxref{The Repository as a Channel}) se torna ainda mais interessante quando configuramos @uref{https://pt.wikipedia.org/wiki/Integra%C3%A7%C3%A3o_cont%C3%ADnua, @dfn{continuous integration}} (CI). Há várias maneiras de fazer isso.

source: You can use one of the mainstream continuous integration tools, such as GitLab-CI. To do that, you need to make sure you run jobs in a Docker image or virtual machine that has Guix installed. If we were to do that in the case of Guile, we'd have a job that runs a shell command like this one:
it: Puoi utilizzare uno degli strumenti di integrazione continua più diffusi, come GitLab-CI. Per farlo, devi assicurarti di eseguire i job in un'immagine Docker o in una macchina virtuale che abbia Guix installato. Se lo facessimo nel caso di Guile, avremmo un job che esegue un comando shell come questo:
pt_br: Você pode usar uma das principais ferramentas de integração contínua, como o GitLab-CI. Para fazer isso, você precisa ter certeza de executar jobs em uma imagem Docker ou máquina virtual que tenha o Guix instalado. Se fizéssemos isso no caso do Guile, teríamos um job que executa um comando shell como este:

source: Doing this works great and has the advantage of being easy to achieve on your favorite CI platform.
it: Fare questo funziona alla grande e ha il vantaggio di essere facile da ottenere sulla tua piattaforma CI preferita.
pt_br: Fazer isso funciona muito bem e tem a vantagem de ser fácil de fazer na sua plataforma de CI favorita.

source: That said, you'll really get the most of it by using @uref{https://guix.gnu.org/en/cuirass,Cuirass}, a CI tool designed for and tightly integrated with Guix. Using it is more work than using a hosted CI tool because you first need to set it up, but that setup phase is greatly simplified if you use its Guix System service (@pxref{Continuous Integration,,, guix, GNU Guix Reference Manual}). Going back to our example, we give Cuirass a spec file that goes like this:
it: Detto questo, otterrai il massimo usandoti di @uref{https://guix.gnu.org/it/cuirass,Cuirass}, uno strumento di CI progettato e strettamente integrato con Guix. Usarlo richiede più lavoro rispetto all'utilizzo di uno strumento di CI ospitato perché devi prima configurarlo, ma quella fase di configurazione è notevolmente semplificata se usi il suo servizio Guix System (@pxref{Integrazione continua,,, guix.it, Manuale di riferimento GNU Guix}). Tornando al nostro esempio, diamo a Cuirass un file di specifica che assomiglia a questo:
pt_br: Dito isso, você realmente aproveitará ao máximo usando @uref{https://guix.gnu.org/pt-BR/cuirass,Cuirass}, uma ferramenta de CI projetada para e fortemente integrada com Guix. Usá-la dá mais trabalho do que usar uma ferramenta de CI hospedada porque primeiro você precisa configurá-la, mas essa fase de configuração é bastante simplificada se você usar seu serviço Guix System (@pxref{Integração Contínua,,, guix.pt_BR, Manual de Referência GNU Guix}). Voltando ao nosso exemplo, damos ao Cuirass um arquivo de especificação que é assim:

source: ;; Cuirass spec file to build all the packages of the ‘guile’ channel. (list (specification (name "guile") (build '(channels guile)) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))
it: ;; File di specifica Cuirass per costruire tutti i pacchetti del canale «guile». (list (specification (name "guile") (build '(channels guile)) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))
pt_br: ;; Arquivo de especificações do Cuirass para construir todos os pacotes do canal ‘guile’. (list (specification (name "guile") (build '(channels guile)) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))

source: It differs from what you'd do with other CI tools in two important ways:
it: Differisce da ciò che faresti con altri strumenti di CI in due modi importanti:
pt_br: Ela difere do que você faria com outras ferramentas de CI em dois aspectos importantes:

source: Cuirass knows it's tracking @emph{two} channels, @code{guile} and @code{guix}. Indeed, our own @code{guile} package depends on many packages provided by the @code{guix} channel---GCC, the GNU libc, libffi, and so on. Changes to packages from the @code{guix} channel can potentially influence our @code{guile} build and this is something we'd like to see as soon as possible as Guile developers.
it: Cuirass sa che sta tracciando @emph{two} canali, @code{guile} e @code{guix}. Infatti, il nostro pacchetto @code{guile} dipende da molti pacchetti forniti dal canale @code{guix} --- GCC, la GNU libc, libffi, e così via. Le modifiche ai pacchetti del canale @code{guix} possono potenzialmente influenzare la nostra build di @code{guile} e questo è qualcosa che vorremmo vedere il prima possibile come sviluppatori Guile.
pt_br: O Cuirass sabe que está rastreando @emph{dois} canais, @code{guile} e @code{guix}. De fato, nosso próprio pacote @code{guile} depende de muitos pacotes fornecidos pelo canal @code{guix}---GCC, o GNU libc, libffi e assim por diante. Mudanças em pacotes do canal @code{guix} podem potencialmente influenciar nossa construção @code{guile} e isso é algo que gostaríamos de ver o mais rápido possível como desenvolvedores do Guile.

source: Build results are not thrown away: they can be distributed as @dfn{substitutes} so that users of our @code{guile} channel transparently get pre-built binaries! (@pxref{Substitutes,,, guix, GNU Guix Reference Manual}, for background info on substitutes.)
it: I risultati della costruzione non vengono scartati: possono essere distribuiti come @dfn{sostituti} in modo che gli utenti del nostro canale @code{guile} ottengano in modo trasparente i binari precompilati! (@pxref{Sostituti,,, guix.it, Manuale di riferimento GNU Guix}, per informazioni di base sui sostituti.)
pt_br: Os resultados da compilação não são descartados: eles podem ser distribuídos como @dfn{substitutos} para que os usuários do nosso canal @code{guile} obtenham binários pré-compilados de forma transparente! (@pxref{Substitutos,,, guix.pt_BR, Manual de Referência do GNU Guix}, para informações básicas sobre substitutos.)

source: From a developer's viewpoint, the end result is this @uref{https://ci.guix.gnu.org/jobset/guile,status page} listing @emph{evaluations}: each evaluation is a combination of commits of the @code{guix} and @code{guile} channels providing a number of @emph{jobs}---one job per package defined in @file{guile-package.scm} times the number of target architectures.
it: Dal punto di vista di uno sviluppatore, il risultato finale è questa @uref{https://ci.guix.gnu.org/jobset/guile,pagina di stato} che elenca le @emph{evaluations}: ogni valutazione è una combinazione di commit dei canali @code{guix} e @code{guile} che fornisce un numero di @emph{job} --- un job per pacchetto definito in @file{guile-package.scm} moltiplicato per il numero di architetture di destinazione.
pt_br: Do ponto de vista de um desenvolvedor, o resultado final é esta @uref{https://ci.guix.gnu.org/jobset/guile,status page} listando @emph{avaliações}: cada avaliação é uma combinação de confirmações dos canais @code{guix} e @code{guile}, fornecendo um número de @emph{trabalhos} — um trabalho por pacote definido em @file{guile-package.scm} vezes o número de arquiteturas de destino.

source: As for substitutes, they come for free! As an example, since our @code{guile} jobset is built on ci.guix.gnu.org, which runs @command{guix publish} (@pxref{Invoking guix publish,,, guix, GNU Guix Reference Manual}) in addition to Cuirass, one automatically gets substitutes for @code{guile} builds from ci.guix.gnu.org; no additional work is needed for that.
it: Per quanto riguarda i sostituti, sono gratuiti! Ad esempio, poiché il nostro jobset @code{guile} è costruito su ci.guix.gnu.org, che esegue @command{guix publish} (@pxref{Invocare guix publish,,, guix.it, Manuale di riferimento GNU Guix}) oltre a Cuirass, si ottengono automaticamente i sostituti per le build di @code{guile} da ci.guix.gnu.org; non è necessario alcun lavoro aggiuntivo per questo.
pt_br: Quanto aos substitutos, eles vêm de graça! Por exemplo, já que nosso jobset @code{guile} é construído em ci.guix.gnu.org, que executa @command{guix publish} (@pxref{Invocando guix publish,,, guix.pt_BR, Manual de Referência do GNU Guix}) além do Cuirass, obtém-se automaticamente substitutos para compilações @code{guile} de ci.guix.gnu.org; nenhum trabalho adicional é necessário para isso.

source: Bonus: Build manifest
it: Bonus: Manifest di costruzione
pt_br: Bônus: Construir manifesto

source: The Cuirass spec above is convenient: it builds every package in our channel, which includes a few variants (@pxref{Setting Up Continuous Integration}). However, this might be insufficiently expressive in some cases: one might want specific cross-compilation jobs, transformations, Docker images, RPM/Deb packages, or even system tests.
it: La specifica Cuirass sopra è comoda: costruisce ogni pacchetto nel nostro canale, che include alcune varianti (@pxref{Setting Up Continuous Integration}). Tuttavia, questo potrebbe essere insufficientemente espressivo in alcuni casi: si potrebbero volere specifici job di cross-compilazione, trasformazioni, immagini Docker, pacchetti RPM/Deb, o persino test di sistema.
pt_br: A especificação Cuirass acima é conveniente: ela constrói todos os pacotes em nosso canal, o que inclui algumas variantes (@pxref{Setting Up Continuous Integration}). No entanto, isso pode ser insuficientemente expressivo em alguns casos: pode-se querer trabalhos específicos de compilação cruzada, transformações, imagens Docker, pacotes RPM/Deb ou até mesmo testes de sistema.

source: To achieve that, you can write a @dfn{manifest} (@pxref{Writing Manifests,,, guix, GNU Guix Reference Manual}). The one we have for Guile has entries for the package variants we defined above, as well as additional variants and cross builds:
it: Per ottenere ciò, puoi scrivere un @dfn{manifest} (@pxref{Scrivere manifesti,,, guix.it, Manuale di riferimento GNU Guix}). Quello che abbiamo per Guile ha voci per le varianti di pacchetto che abbiamo definito sopra, così come varianti aggiuntive e build incrociate:
pt_br: Para conseguir isso, você pode escrever um @dfn{manifest} (@pxref{Escrevendo manifestos,,, guix.pt_BR, Manual de Referência do GNU Guix}). O que temos para Guile tem entradas para as variantes de pacote que definimos acima, bem como variantes adicionais e compilações cruzadas:

source: ;; This is ‘.guix/manifest.scm’.
it: ;; Questo è «.guix/manifest.scm».
pt_br: ;; Este é ‘.guix/manifest.scm’.

source: (use-modules (guix) (guix profiles) (guile-package)) ;import our own package module
it: (use-modules (guix) (guix profiles) (guile-package)) ;importa il nostro modulo pacchetto
pt_br: (use-modules (guix) (guix profiles) (guile-package)) ;importa nosso próprio módulo de pacote
