Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Contributing
it: Contribuire
pt_br: Contribuindo

source: This project is a cooperative effort, and we need your help to make it grow! Please get in touch with us on @email{guix-devel@@gnu.org} and @code{#guix} on the Libera Chat IRC network. We welcome ideas, bug reports, patches, and anything that may be helpful to the project. We particularly welcome help on packaging (@pxref{Packaging Guidelines}).
it: Questo progetto è frutto di un lavoro cooperativo, e abbiamo bisogno del tuo aiuto per farlo crescere! Per favore mettiti in contatto con noi attraverso @email{guix-devel@@gnu.org} e @code{#guix} sulla rete IRC di Libera Chat. Accogliamo idee, segnalazioni di bug, patch, e qualsiasi cosa possa dare una mano progetto. È benvenuto in particolare un aiuto nel creare pacchetti (@pxref{Packaging Guidelines}).
pt_br: Este projeto é um esforço cooperativo e precisamos da sua ajuda para fazê-lo crescer! Por favor, entre em contato conosco por meio de @email{guix-devel@@gnu.org} e @code{#guix} na rede IRC do Libera Chat. Ideias, relatórios de bugs, patches e qualquer coisa que possa ser útil para o projeto são sempre bem-vindos. Nós particularmente agradecemos a ajuda no empacotamento das (@pxref{Packaging Guidelines}).

source: code of conduct, of contributors
it: codice di condotta, dei contributori
pt_br: código de conduta, de contribuidores

source: contributor covenant
it: patto del collaboratore
pt_br: acordo de contribuição

source: We want to provide a warm, friendly, and harassment-free environment, so that anyone can contribute to the best of their abilities. To this end our project uses a ``Contributor Covenant'', which was adapted from @url{https://contributor-covenant.org/}. You can find a local version in the @file{CODE-OF-CONDUCT} file in the source tree.
it: Vogliamo fornire un ambiente aperto, amichevole e senza molestie, in modo che chiunque possa contribuire al meglio delle proprie capacità. A questo scopo il nostro progetto usa un ``Patto del collaboratore'', che è stato adattato da @url{https://contributor-covenant.org/}. Puoi trovare una versione locale nel file @file{CODE-OF-CONDUCT} nell'albero dei sorgenti.
pt_br: Queremos oferecer um ambiente acolhedor, amigável e sem assédio, para que todos possam contribuir com o melhor de suas habilidades. Para este fim, nosso projeto usa um ``Acordo de contribuição``, que foi adaptado de @url{https://contributor-covenant.org/}. Você pode encontrar uma versão local no arquivo @file{CODE-OF-CONDUCT} na árvore de fontes.

source: Contributors are not required to use their legal name in patches and on-line communication; they can use any name or pseudonym of their choice.
it: I contributori non sono tenuti a usare il loro nome legale nelle patch e nelle comunicazioni on-line; possono usare qualsiasi nome o alias di loro scelta.
pt_br: Os contribuidores não são obrigados a usar seu nome legal em patches e comunicação on-line; eles podem usar qualquer nome ou pseudônimo de sua escolha.

source: Requirements
it: Requisiti
pt_br: Requisitos

source: Software needed to build and run Guix.
it: Software necessari per assemblare ed eseguire Guix.
pt_br: Software necessário para compilar e executar o Guix.

source: Building from Git
it: Costruire da Git
pt_br: Compilando do git

source: The latest and greatest.
it: Il più recente e migliore.
pt_br: A mais recente e melhor.

source: Running the Test Suite
it: Eseguire la suite dei test
pt_br: Executando o conjunto de testes

source: Testing Guix.
it: Provare Guix.
pt_br: Testando o Guix.

source: Running Guix Before It Is Installed
it: Eseguire Guix prima di installarlo
pt_br: Executando guix antes dele ser instalado

source: Hacker tricks.
it: Trucchi da hacker.
pt_br: Truques de hacker.

source: The Perfect Setup
it: L'impostazione perfetta
pt_br: A configuração perfeita

source: The right tools.
it: Gli strumenti giusti.
pt_br: As ferramentas certas.

source: Alternative Setups
it: Setup alternativi
pt_br: Configurações alternativas

source: Other possible tools that do the job.
it: Altri possibili strumenti che svolgono lo stesso lavoro.
pt_br: Outras ferramentas possíveis que esta fazendo o trabalho.

source: Source Tree Structure
it: Struttura dell'albero dei sorgenti
pt_br: Estrutura da árvore de origem

source: Source code guided tour.
it: Tour guidato nel codice sorgente.
pt_br: Visita guiada ao código-fonte.

source: Packaging Guidelines
it: Linee-guida per pacchettizzare
pt_br: Diretrizes de empacotamento

source: Growing the distribution.
it: Gli strumenti giusti.
pt_br: Crescendo a distribuição.

source: Coding Style
it: Stile del codice
pt_br: Estilo de código

source: Hygiene of the contributor.
it: Igiene del contributore.
pt_br: Limpeza do contribuidor.

source: Submitting Patches
it: Invia delle patches
pt_br: Enviando patches

source: Share your work.
it: Condividi il tuo lavoro.
pt_br: Compartilhe seu trabalho.

source: Tracking Bugs and Changes
it: Tracciare bug e modifiche
pt_br: Rastreando Bugs e Mudanças

source: Keeping it all organized.
it: Tenere il tutto organizzato.
pt_br: Mantendo tudo organizado.

source: Teams
it: Gruppi
pt_br: Equipes

source: Coordinating efforts.
it: Coordinare gli sforzi.
pt_br: Coordenando esforços.

source: Making Decisions
it: Prendere decisioni
pt_br: Tomando decisões

source: Collectively choosing the way forward.
it: Scegliere collettivamente la strada da seguire.
pt_br: Escolhendo coletivamente o caminho a seguir.

source: Commit Access
it: Acesso commit
pt_br: Confirmar acesso

source: Pushing to the official repository.
it: Pushing sul repository ufficiale.
pt_br: Submeter para o repositório oficial.

source: Reviewing the Work of Others
it: Commentare il lavoro di altri
pt_br: Revendo o trabalho de outros

source: Some guidelines for sharing reviews.
it: Alcune linee-guida per condividere commenti.
pt_br: Algumas diretrizes para compartilhar avaliações.

source: Updating the Guix Package
it: Aggiornamento del pacchetto Guix
pt_br: Atualizando o pacote Guix

source: Updating the Guix package definition.
it: Aggiornamento della definizione del pacchetto Guix.
pt_br: Atualizando a definição do pacote Guix.

source: Deprecation Policy
it: logica di deprecazione
pt_br: Política de depreciação

source: Commitments and tools for deprecation.
it: Impegni e strumenti per la deprecazione.
pt_br: Compromissos e ferramentas para depreciação.

source: Writing Documentation
it: Scrivere documentazione
pt_br: Escrevendo documentação

source: Improving documentation in GNU Guix.
it: Migliorare la documentazione di GNU Guix.
pt_br: Melhorando a documentação no GNU Guix.

source: Translating Guix
it: Tradurre Guix
pt_br: Traduzindo o Guix

source: Make Guix speak your native language.
it: Fai in modo che Guix parli la tua lingua madre.
pt_br: Faça o Guix falar sua língua nativa.

source: Contributing to Guix's Infrastructure
it: Contribuire all'infrastruttura di Guix
pt_br: Contribuindo para a infraestrutura Guix

source: Make Guix ecosystem work better.
it: Migliorare il funzionamento dell'ecosistema Guix.
pt_br: Faça o ecossistema do guix funcionar melhor.

source: You can easily hack on Guix itself using Guix and Git, which we use for version control (@pxref{Building from Git}).
it: Puoi facilmente hackerare su Guix stesso usando Guix e Git, che usiamo per il controllo di versione (@pxref{Building from Git}).
pt_br: Você pode facilmente hackear o próprio Guix usando Guix e Git, que usamos para controle de versão (@pxref{Building from Git}).

source: But when packaging Guix for foreign distros or when bootstrapping on systems without Guix, and if you decide to not just trust and install our readily made binary (@pxref{Binary Installation}), you can download a release version of our reproducible source tarball and read on.
it: Ma quando si pacchettizza Guix per distribuzioni terze o quando si effettua il bootstrap su sistemi senza Guix, e se decidi di non fidarti e installare il nostro binario già pronto (@pxref{Binary Installation}), puoi scaricare una versione di rilascio del nostro tarball sorgente riproducibile e continuare a leggere.
pt_br: Mas ao empacotar o Guix para distribuições estrangeiras ou ao inicializar em sistemas sem Guix, e se você decidir não confiar e instalar nosso binário prontamente criado (@pxref{Binary Installation}), você pode baixar uma versão de lançamento do nosso tarball de código-fonte reproduzível e continuar lendo.

source: This section lists requirements when building Guix from source. The build procedure for Guix is the same as for other GNU software, and is not covered here. Please see the files @file{README} and @file{INSTALL} in the Guix source tree for additional details.
it: Questa sezione elenca i requisiti per costruire Guix dai sorgenti. La procedura di compilazione per Guix è la stessa di altri software GNU, e non è trattata qui. Per maggiori dettagli, fare riferimento ai file @file{README} e @file{INSTALL} nell'albero dei sorgenti di Guix.
pt_br: Esta seção lista os requisitos ao compilar o Guix a partir do fonte. O procedimento de compilação do Guix é o mesmo que para outros softwares GNU, e não é coberto aqui. Por favor, veja os arquivos @file{README} e @file{INSTALL} na árvore fonte do Guix para detalhes adicionais.

source: official website
it: sito web ufficiale
pt_br: site oficial

source: GNU Guix is available for download from its website at @url{https://guix.gnu.org}.
it: GNU Guix è disponibile per il download dal suo sito web a @url{https://guix.gnu.org}.
pt_br: O GNU Guix está disponível para download em seu site em @url{https://guix.gnu.org}.

source: GNU Guix depends on the following packages:
it: GNU Guix dipende dai seguenti pacchetti:
pt_br: GNU Guix depende dos seguintes pacotes:

source: @url{https://gnu.org/software/guile/, GNU Guile}, version 3.0.x,
it: @url{https://gnu.org/software/guile/, GNU Guile}, versione 3.0.x,
pt_br: @url{https://gnu.org/software/guile/, GNU Guile}, versão 3.0.x,

source: version 3.0.3 or later;
it: versione 3.0.3 o successiva;
pt_br: versão 3.0.3 ou posterior;

source: @url{https://notabug.org/cwebber/guile-gcrypt, Guile-Gcrypt}, version
it: @url{https://notabug.org/cwebber/guile-gcrypt, Guile-Gcrypt}, versione
pt_br: @url{https://notabug.org/cwebber/guile-gcrypt, Guile-Gcrypt}, versão

source: 0.1.0 or later;
it: 0.1.0 o successiva;
pt_br: 0.1.0 ou posterior;

source: @uref{https://gitlab.com/gnutls/guile/, Guile-GnuTLS} (@pxref{Guile Preparations, how to install the GnuTLS bindings for Guile,, gnutls-guile, GnuTLS-Guile})@footnote{The Guile bindings to @uref{https://gnutls.org/, GnuTLS} were distributed as part of GnuTLS until version 3.7.8 included.};
it: @uref{https://gitlab.com/gnutls/guile/, Guile-GnuTLS} (@pxref{Guile Preparations, how to install the GnuTLS bindings for Guile,, gnutls-guile, GnuTLS-Guile})@footnote{I collegamenti Guile a @uref{https://gnutls.org/, GnuTLS} erano distribuiti come parte di GnuTLS fino alla versione 3.7.8 inclusa.};
pt_br: @uref{https://gitlab.com/gnutls/guile/, Guile-GnuTLS} (@pxref{Guile Preparations, como instalar as ligações do GnuTLS para o Guile, gnutls-guile, GnuTLS-Guile})@footnote{As ligações do Guile para @uref{https://gnutls.org/, GnuTLS} foram distribuídas como parte do GnuTLS até a versão 3.7.8 incluída.};

source: @uref{https://notabug.org/guile-sqlite3/guile-sqlite3, Guile-SQLite3}, version 0.1.0 or later;
it: @uref{https://notabug.org/guile-sqlite3/guile-sqlite3, Guile-SQLite3}, versione 0.1.0 o successiva;
pt_br: @uref{https://notabug.org/guile-sqlite3/guile-sqlite3, Guile-SQLite3}, versão 0.1.0 ou posterior;

source: version 0.1.0 or later;
it: versione 0.1.0 o successiva;
pt_br: versão 0.1.0 ou posterior;

source: @uref{https://gitlab.com/guile-git/guile-git, Guile-Git}, version 0.10.0 or later;
it: @uref{https://gitlab.com/guile-git/guile-git, Guile-Git}, versione 0.10.0 o successiva;
pt_br: @uref{https://gitlab.com/guile-git/guile-git, Guile-Git}, versão 0.10.0 ou posterior;

source: @uref{https://git-scm.com, Git} (yes, both!);
it: @uref{https://git-scm.com, Git} (sì, entrambi!);
pt_br: @uref{https://git-scm.com, Git} (sim, ambos!);

source: 4.3.0 or later;
it: 4.3.0 o successiva;
pt_br: 4.3.0 ou posterior;

source: The following dependencies are optional:
it: Le seguenti dipendenze sono opzionali:
pt_br: As seguintes dependências são opcionais:

source: Support for build offloading (@pxref{Daemon Offload Setup}) and @command{guix copy} (@pxref{Invoking guix copy}) depends on @uref{https://github.com/artyom-poptsov/guile-ssh, Guile-SSH}, version 0.13.0 or later.
it: Il supporto per il build offloading (@pxref{Daemon Offload Setup}) e @command{guix copy} (@pxref{Invoking guix copy}) dipende da @uref{https://github.com/artyom-poptsov/guile-ssh, Guile-SSH}, versione 0.13.0 o successiva.
pt_br: O suporte para descarregamento de compilação (@pxref{Daemon Offload Setup}) e @command{guix copy} (@pxref{Invoking guix copy}) depende do @uref{https://github.com/artyom-poptsov/guile-ssh, Guile-SSH}, versão 0.13.0 ou posterior.

source: @uref{https://notabug.org/guile-zstd/guile-zstd, Guile-zstd}, for zstd compression and decompression in @command{guix publish} and for substitutes (@pxref{Invoking guix publish}).
it: @uref{https://notabug.org/guile-zstd/guile-zstd, Guile-zstd}, per la compressione e decompressione zstd in @command{guix publish} e per i sostituti (@pxref{Invoking guix publish}).
pt_br: @uref{https://notabug.org/guile-zstd/guile-zstd, Guile-zstd}, para compressão e descompressão zstd em @command{guix publish} e para substitutos (@pxref{Invoking guix publish}).

source: @uref{https://ngyro.com/software/guile-semver.html, Guile-Semver} for the @code{crate} importer (@pxref{Invoking guix import}).
it: @uref{https://ngyro.com/software/guile-semver.html, Guile-Semver} per l'importatore @code{crate} (@pxref{Invoking guix import}).
pt_br: @uref{https://ngyro.com/software/guile-semver.html, Guile-Semver} para o importador @code{crate} (@pxref{Invoking guix import}).

source: @uref{https://www.nongnu.org/guile-lib/doc/ref/htmlprag/, Guile-Lib} for the @code{go} importer (@pxref{Invoking guix import}) and for some of the ``updaters'' (@pxref{Invoking guix refresh}).
it: @uref{https://www.nongnu.org/guile-lib/doc/ref/htmlprag/, Guile-Lib} per l'importatore @code{go} (@pxref{Invoking guix import}) e per alcuni degli ``aggiornatori'' (@pxref{Invoking guix refresh}).
pt_br: @uref{https://www.nongnu.org/guile-lib/doc/ref/htmlprag/, Guile-Lib} para o importador @code{go} (@pxref{Invoking guix import}) e para alguns dos ``atualizadores'' (@pxref{Invoking guix refresh}).

source: When @url{http://www.bzip.org, libbz2} is available, @command{guix-daemon} can use it to compress build logs.
it: Quando @url{http://www.bzip.org, libbz2} è disponibile, @command{guix-daemon} può usarla per comprimere i log di compilazione.
pt_br: Quando @url{http://www.bzip.org, libbz2} está disponível, @command{guix-daemon} pode usá-lo para comprimir logs de compilação.

source: Unless @option{--disable-daemon} was passed to @command{configure}, the following packages are also needed:
it: A meno che @option{--disable-daemon} non sia stato passato a @command{configure}, sono necessari anche i seguenti pacchetti:
pt_br: A menos que @option{--disable-daemon} tenha sido passado para @command{configure}, os seguintes pacotes também são necessários:

source: @url{https://gcc.gnu.org, GCC's g++}, with support for the
it: @url{https://gcc.gnu.org, il g++ di GCC}, con supporto per lo
pt_br: @url{https://gcc.gnu.org, GCC's g++}, com suporte ao

source: C++11 standard.
it: standard C++11.
pt_br: padrão C++11.

source: If you want to hack Guix itself, it is recommended to use the latest version from the Git repository:
it: Se vuoi modificare Guix stesso, è preferibile usare l'ultima versione presa dal repository Git:
pt_br: Se você quiser hackear o próprio Guix, é recomendado usar a versão mais recente do repositório Git:

source: authentication, of a Guix checkout
it: autenticazione, di un checkout Guix
pt_br: autenticação, de um checkout Guix

source: How do you ensure that you obtained a genuine copy of the repository? To do that, run @command{guix git authenticate}, passing it the commit and OpenPGP fingerprint of the @dfn{channel introduction} (@pxref{Invoking guix git authenticate}):
it: Come assicurarti di avere una copia genuina del repository? Per farlo, esegui @command{guix git authenticate}, passandogli il commit e l'impronta OpenPGP della @dfn{channel introduction} (@pxref{Invoking guix git authenticate}):
pt_br: Como você garante que obteve uma cópia genuína do repositório? Para fazer isso, execute @command{guix git authenticate}, passando a ele o commit e a impressão digital OpenPGP do @dfn{introdução ao canal} (@pxref{Invoking guix git authenticate}):

source: This command completes with exit code zero on success; it prints an error message and exits with a non-zero code otherwise.
it: Questo comando termina con un codice di uscita zero in caso di successo; altrimenti, stampa un messaggio di errore ed esce con un codice diverso da zero.
pt_br: Este comando é concluído com um código de saída zero em caso de sucesso; caso contrário, ele imprime uma mensagem de erro e sai com um código diferente de zero.

source: As you can see, there is a chicken-and-egg problem: you first need to have Guix installed. Typically you would install Guix System (@pxref{System Installation}) or Guix on top of another distro (@pxref{Binary Installation}); in either case, you would verify the OpenPGP signature on the installation medium. This ``bootstraps'' the trust chain.
it: Come si può vedere, c'è un problema dell'uovo e della gallina: è prima necessario avere Guix installato. Tipicamente, si installerebbe Guix System (@pxref{System Installation}) o Guix sopra un'altra distribuzione (@pxref{Binary Installation}); in entrambi i casi, si verificherebbe la firma OpenPGP sul supporto di installazione. Questo dà inizio alla catena di fiducia.
pt_br: Como você pode ver, há um problema de ovo e galinha: primeiro você precisa ter o Guix instalado. Normalmente você instalaria o Guix System (@pxref{System Installation}) ou o Guix em cima de outra distro (@pxref{Binary Installation}); em ambos os casos, você verificaria a assinatura OpenPGP na mídia de instalação. Isso ``bootstraps'' a cadeia de confiança.

source: The easiest way to set up a development environment for Guix is, of course, by using Guix! The following command starts a new shell where all the dependencies and appropriate environment variables are set up to hack on Guix:
it: Il modo più semplice per impostare un ambiente di sviluppo per Guix è, naturalmente, usare Guix! Il seguente comando avvia una nuova shell dove tutte le dipendenze e le variabili d'ambiente appropriate sono impostate per hackerare su Guix:
pt_br: A maneira mais fácil de configurar um ambiente de desenvolvimento para Guix é, claro, usando Guix! O comando a seguir inicia um novo shell onde todas as dependências e variáveis de ambiente apropriadas são configuradas para hackear em Guix:

source: or even, from within a Git worktree for Guix:
it: o anche, da un albero di lavoro Git per Guix:
pt_br: ou mesmo, de dentro de uma árvore de trabalho Git para Guix:

source: If @option{-C} (short for @option{--container}) is not supported on your system, try @command{--pure} instead of @option{-CPW}. @xref{Invoking guix shell}, for more information on that command.
it: Se @option{-C} (abbreviazione di @option{--container}) non è supportato sul tuo sistema, prova @command{--pure} invece di @option{-CPW}. @xref{Invoking guix shell}, per maggiori informazioni su questo comando.
pt_br: Se @option{-C} (abreviação de @option{--container}) não for compatível com seu sistema, tente @command{--pure} em vez de @option{-CPW}. @xref{Invoking guix shell}, para obter mais informações sobre esse comando.

source: If you are unable to use Guix when building Guix from a checkout, the following are the required packages in addition to those mentioned in the installation instructions (@pxref{Requirements}).
it: Se non sei in grado di usare Guix quando compili Guix da un checkout, i seguenti sono i pacchetti richiesti in aggiunta a quelli menzionati nelle istruzioni di installazione (@pxref{Requirements}).
pt_br: Se você não conseguir usar o Guix ao criar o Guix a partir de um checkout, a seguir estão os pacotes necessários, além daqueles mencionados nas instruções de instalação (@pxref{Requirements}).

source: @url{https://www.gnu.org/software/help2man/, GNU Help2man (optional)}.
it: @url{https://www.gnu.org/software/help2man/, GNU Help2man (opzionale)}.
pt_br: @url{https://www.gnu.org/software/help2man/, GNU Help2man (opcional)}.

source: On Guix, extra dependencies can be added by instead running @command{guix shell}:
it: Su Guix, dipendenze extra possono essere aggiunte eseguendo invece @command{guix shell}:
pt_br: No Guix, dependências extras podem ser adicionadas executando @command{guix shell}:

source: From there you can generate the build system infrastructure using Autoconf and Automake:
it: Da lì puoi generare l'infrastruttura del sistema di compilazione usando Autoconf e Automake:
pt_br: A partir daí você pode gerar a infraestrutura do sistema de construção usando Autoconf e Automake:

source: If you get an error like this one:
it: Se ricevi un errore come questo:
pt_br: Se você receber um erro como este:

source: it probably means that Autoconf couldn’t find @file{pkg.m4}, which is provided by pkg-config. Make sure that @file{pkg.m4} is available. The same holds for the @file{guile.m4} set of macros provided by Guile. For instance, if you installed Automake in @file{/usr/local}, it wouldn’t look for @file{.m4} files in @file{/usr/share}. In that case, you have to invoke the following command:
it: probabilmente significa che Autoconf non è riuscito a trovare @file{pkg.m4}, che è fornito da pkg-config. Assicurati che @file{pkg.m4} sia disponibile. Lo stesso vale per il set di macro @file{guile.m4} fornito da Guile. Ad esempio, se hai installato Automake in @file{/usr/local}, non cercherà i file @file{.m4} in @file{/usr/share}. In tal caso, devi invocare il seguente comando:
pt_br: provavelmente significa que o Autoconf não conseguiu encontrar o @file{pkg.m4}, que é fornecido pelo pkg-config. Certifique-se de que @file{pkg.m4} esteja disponível. O mesmo vale para o conjunto de macros @file{guile.m4} fornecido pelo Guile. Por exemplo, se você instalou o Automake em @file{/usr/local}, ele não procuraria arquivos @file{.m4} em @file{/usr/share}. Nesse caso, você tem que invocar o seguinte comando:

source: @xref{Macro Search Path,,, automake, The GNU Automake Manual}, for more information.
it: @xref{Macro Search Path,,, automake, The GNU Automake Manual}, per maggiori informazioni.
pt_br: @xref{Macro Search Path,,, automake, The GNU Automake Manual}, para mais informações.

source: state directory
it: directory di stato
pt_br: diretório de estado

source: system configuration directory
pt_br: diretório de configuração do sistema

source: Then, run:
it: Quindi, esegui:
pt_br: Então, execute:
