Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Weblate is backed by a git repository from which it discovers new strings to translate and pushes new and updated translations. Normally, it would be enough to give it commit access to our repositories. However, we decided to use a separate repository for two reasons. First, we would have to give Weblate commit access and authorize its signing key, but we do not trust it in the same way we trust guix developers, especially since we do not manage the instance ourselves. Second, if translators mess something up, it can break the generation of the website and/or guix pull for all our users, independently of their language.
it: Weblate è supportato da un repository git da cui scopre nuove stringhe da tradurre e invia nuove traduzioni e aggiornamenti. Normalmente, sarebbe sufficiente dargli accesso in commit ai nostri repository. Tuttavia, abbiamo deciso di utilizzare un repository separato per due motivi. Primo, dovremmo dare a Weblate l'accesso in commit e autorizzare la sua chiave di firma, ma non ci fidiamo di esso nello stesso modo in cui ci fidiamo degli sviluppatori di guix, specialmente poiché non gestiamo l'istanza noi stessi. Secondo, se i traduttori combinano pasticci, potrebbe interrompere la generazione del sito web e/o di guix pull per tutti i nostri utenti, indipendentemente dalla loro lingua.
pt_br: O Weblate é apoiado por um repositório git do qual ele descobre novas strings para traduzir e envia traduções novas e atualizadas. Normalmente, seria suficiente dar a ele acesso de commit para nossos repositórios. No entanto, decidimos usar um repositório separado por dois motivos. Primeiro, teríamos que dar ao Weblate acesso de commit e autorizar sua chave de assinatura, mas não confiamos nele da mesma forma que confiamos nos desenvolvedores do guix, especialmente porque não gerenciamos a instância nós mesmos. Segundo, se os tradutores bagunçarem alguma coisa, isso pode quebrar a geração do site e/ou o guix pull para todos os nossos usuários, independentemente do idioma deles.

source: For these reasons, we use a dedicated repository to host translations, and we synchronize it with our guix and artworks repositories after checking no issue was introduced in the translation.
it: Per questi motivi, utilizziamo un repository dedicato per ospitare le traduzioni e lo sincronizziamo con i nostri repository guix e artworks dopo aver verificato che nessun problema sia stato introdotto nella traduzione.
pt_br: Por esses motivos, usamos um repositório dedicado para hospedar as traduções e o sincronizamos com nossos repositórios guix e artworks após verificar se nenhum problema foi introduzido na tradução.

source: Developers can download the latest PO files from weblate in the Guix repository by running the @command{make download-po} command. It will automatically download the latest files from weblate, reformat them to a canonical form, and check they do not contain issues. The manual needs to be built again to check for additional issues that might crash Texinfo.
it: Gli sviluppatori possono scaricare i file PO più recenti da weblate nel repository Guix eseguendo il comando @command{make download-po}. Scaricherà automaticamente i file più recenti da weblate, li riformatterà in una forma canonica e controllerà che non contengano problemi. Il manuale deve essere ricostruito per verificare ulteriori problemi che potrebbero far crashare Texinfo.
pt_br: Os desenvolvedores podem baixar os arquivos PO mais recentes do weblate no repositório Guix executando o comando @command{make download-po}. Ele baixará automaticamente os arquivos mais recentes do weblate, os reformatará para um formato canônico e verificará se eles não contêm problemas. O manual precisa ser construído novamente para verificar se há problemas adicionais que podem travar o Texinfo.

source: Before pushing new translation files, developers should add them to the make machinery so the translations are actually available. The process differs for the various components.
it: Prima di inviare nuovi file di traduzione, gli sviluppatori dovrebbero aggiungerli alla meccanica make in modo che le traduzioni siano effettivamente disponibili. Il processo differisce per i vari componenti.
pt_br: Antes de enviar novos arquivos de tradução, os desenvolvedores devem adicioná-los à maquinaria de make para que as traduções estejam realmente disponíveis. O processo difere para os vários componentes.

source: New po files for the @code{guix} and @code{packages} components must
it: I nuovi file po per i componenti @code{guix} e @code{packages} devono
pt_br: Novos arquivos po para os componentes @code{guix} e @code{packages} devem

source: be registered by adding the new language to @file{po/guix/LINGUAS} or @file{po/packages/LINGUAS}.
it: essere registrati aggiungendo la nuova lingua a @file{po/guix/LINGUAS} o @file{po/packages/LINGUAS}.
pt_br: ser registrado adicionando o novo idioma em @file{po/guix/LINGUAS} ou @file{po/packages/LINGUAS}.

source: New po files for the @code{documentation-manual} component must be
it: I nuovi file po per il componente @code{documentation-manual} devono essere
pt_br: Novos arquivos po para o componente @code{documentation-manual} devem ser

source: registered by adding the file name to @code{DOC_PO_FILES} in @file{po/doc/local.mk}, the generated @file{%D%/guix.xx.texi} manual to @code{info_TEXINFOS} in @file{doc/local.mk} and the generated @file{%D%/guix.xx.texi} and @file{%D%/contributing.xx.texi} to @code{TRANSLATED_INFO} also in @file{doc/local.mk}.
it: registrati aggiungendo il nome del file a @code{DOC_PO_FILES} in @file{po/doc/local.mk}, il manuale generato @file{%D%/guix.xx.texi} a @code{info_TEXINFOS} in @file{doc/local.mk} e @file{%D%/guix.xx.texi} e @file{%D%/contributing.xx.texi} a @code{TRANSLATED_INFO} sempre in @file{doc/local.mk}.
pt_br: registrado adicionando o nome do arquivo em @code{DOC_PO_FILES} em @file{po/doc/local.mk}, o manual gerado em @file{%D%/guix.xx.texi} em @code{info_TEXINFOS} em @file{doc/local.mk} e o gerado em @file{%D%/guix.xx.texi} e @file{%D%/contributing.xx.texi} em @code{TRANSLATED_INFO} também em @file{doc/local.mk}.

source: New po files for the @code{documentation-cookbook} component must be
it: I nuovi file po per il componente @code{documentation-cookbook} devono essere
pt_br: Novos arquivos po para o componente @code{documentation-cookbook} devem ser

source: registered by adding the file name to @code{DOC_COOKBOOK_PO_FILES} in @file{po/doc/local.mk}, the generated @file{%D%/guix-cookbook.xx.texi} manual to @code{info_TEXINFOS} in @file{doc/local.mk} and the generated @file{%D%/guix-cookbook.xx.texi} to @code{TRANSLATED_INFO} also in @file{doc/local.mk}.
it: registrati aggiungendo il nome del file a @code{DOC_COOKBOOK_PO_FILES} in @file{po/doc/local.mk}, il manuale generato @file{%D%/guix-cookbook.xx.texi} a @code{info_TEXINFOS} in @file{doc/local.mk} e @file{%D%/guix-cookbook.xx.texi} a @code{TRANSLATED_INFO} sempre in @file{doc/local.mk}.
pt_br: registrado adicionando o nome do arquivo em @code{DOC_COOKBOOK_PO_FILES} em @file{po/doc/local.mk}, o manual gerado em @file{%D%/guix-cookbook.xx.texi} em @code{info_TEXINFOS} em @file{doc/local.mk} e o gerado em @file{%D%/guix-cookbook.xx.texi} em @code{TRANSLATED_INFO} também em @file{doc/local.mk}.

source: New po files for the @code{website} component must be added to the
it: I nuovi file po per il componente @code{website} devono essere aggiunti al
pt_br: Novos arquivos po para o componente @code{website} devem ser adicionados ao

source: @code{guix-artwork} repository, in @file{website/po/}. @file{website/po/LINGUAS} and @file{website/po/ietf-tags.scm} must be updated accordingly (see @file{website/i18n-howto.txt} for more information on the process).
it: repository @code{guix-artwork}, in @file{website/po/}. @file{website/po/LINGUAS} e @file{website/po/ietf-tags.scm} devono essere aggiornati di conseguenza (vedi @file{website/i18n-howto.txt} per maggiori informazioni sul processo).
pt_br: Repositório @code{guix-artwork}, em @file{website/po/}. @file{website/po/LINGUAS} e @file{website/po/ietf-tags.scm} devem ser atualizados adequadamente (veja @file{website/i18n-howto.txt} para mais informações sobre o processo).

source: infrastructure
it: infrastrutture
pt_br: infraestrutura

source: Since its inception, the Guix project has always valued its autonomy, and that reflects in its infrastructure: our servers run Guix System and exclusively free software, and are administered by volunteers.
it: Fin dalla sua creazione, il progetto Guix ha sempre valorizzato la sua autonomia, e questo si riflette nella sua infrastruttura: i nostri server eseguono Guix System e software esclusivamente libero, e sono amministrati da volontari.
pt_br: Desde de o começo, o projeto Guix sempre valorizou sua autonomia, e isso se reflete em sua infraestrutura: nossos servidores rodam Guix System e usam exclusicamente software livre, e são administrados por voluntários.

source: Of course this comes at a cost and this is why we need contributions. Our hope is to make infrastructure-related activity more legible so that maybe you can picture yourself helping in one of these areas.
it: Naturalmente questo ha un costo ed è per questo che abbiamo bisogno di contributi. La nostra speranza è rendere più leggibili le attività relative all'infrastruttura in modo che forse tu possa immaginarti di aiutare in una di queste aree.
pt_br: Claro que isso tem um custo, e é por isso que precisamos de contribuições. Nossa esperança é tornar as atividades relacionadas à infraestrutura mais legíveis para que você possa se imaginar ajudando em uma dessas áreas.

source: Coding
pt_br: Código

source: System Administration
pt_br: Administração do sistema

source: Day-to-Day System Administration
it: Amministrazione del Sistema Giornaliera
pt_br: Administração diária do sistema

source: On-Site Intervention
it: Intervento in Sito
pt_br: Intervenção no local

source: Hosting
pt_br: Hospedagem

source: Administrative Tasks
it: Compiti Amministrativi
pt_br: Tarefas administrativas

source: @url{https://git.cbaines.net/guix/bffe, Build Farm Front End}
pt_br: @url{https://git.cbaines.net/guix/bffe, Front End da Fazenda de compilação}

source: Prerequisites: Familiarity with Guile, HTTP, and databases.
it: Prerequisiti: Familiarità con Guile, HTTP e database.
pt_br: Pré-requisitos: familiaridade com o Guile, HTTP, e banco de dados.

source: If you wish to get started, check out the README of the project of your choice and get in touch with guix-devel and the primary developer(s) of the tool as per @code{git shortlog -s | sort -k1 -n}.
it: Se desideri iniziare, controlla il README del progetto di tua scelta e mettiti in contatto con guix-devel e lo/i sviluppatore/i principale/i dello strumento come da @code{git shortlog -s | sort -k1 -n}.
pt_br: Se você deseja iniciar, dê uma olhada no README do projeto de sua escolha e entre em contato com o guix-devel e os desenvolvedores principais da ferramenta conforme @code{git shortlog -s | sort -k1 -n}.

source: Guix System configuration for all our systems is held in this repository:
it: La configurazione di Guix System per tutti i nostri sistemi è contenuta in questo repository:
pt_br: A configuração do Sistema Guix para todos os nossos sistemas é mantida neste repositório:

source: Without even having SSH access to the machine, you can help by posting patches to improve the configuration (you can test it with @code{guix system vm}). Here are ways you can help:
it: Anche senza accesso SSH alla macchina, puoi aiutare inviando patch per migliorare la configurazione (puoi testarla con @code{guix system vm}). Ecco come puoi aiutare:
pt_br: Caso não tenha inclusive acesso SSH à máquina, voucê pode ajudar postando patches para melhorar a configuração (pode testar isso com @code{guix system vm}). Alguns caminhos para você poder ajudar:

source: @documentencoding UTF-8
it: @documentencoding UTF-8 @documentlanguage it @frenchspacing on
pt_br: @documentencoding UTF-8 @documentlanguage pt_BR @frenchspacing on

source: GNU Guix Reference Manual
it: Manuale di riferimento di GNU Guix
pt_br: Manual de referência do GNU Guix

source: version.texi
it: version-it.texi
pt_br: version-pt_BR.texi

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled ``GNU Free Documentation License''.
it: È concesso il permesso di copiare, distribuire e/o modificare questo documento secondo i termini della GNU Free Documentation License, Versione 1.3 o qualsiasi versione successiva pubblicata dalla Free Software Foundation; senza Sezioni Invarianti, senza Testi di Copertina e senza Testi di Retro copertina. Una copia della licenza è inclusa nella sezione intitolata "Licenza di Documentazione Libera GNU".
pt_br: Permissão concedida para copiar, distribuir e/ou modificar este documento sob os termos da Licença de Documentação Livre GNU, Versão 1.3 ou qualquer versão mais recente publicada pela Free Software Foundation; sem Seções Invariantes, Textos de Capa Frontal, e sem Textos de Contracapa. Uma cópia da licença está incluída na seção intitulada ``GNU Free Documentation License''.

source: System administration
it: Amministrazione di sistema
pt_br: Administração do sistema

source: Guix: (guix)
it: Guix.it: (guix.it)
pt_br: Guix.pt_BR: (guix.pt_BR)

source: Manage installed software and system configuration.
it: Gestisci il software installato e la configurazione del sistema.
pt_br: Gerencie softwares instalados e configuração do sistema.

source: guix package: (guix)Invoking guix package
it: guix package: (guix.it)Invocare guix package
pt_br: guix package: (guix.pt_BR)Invocando guix package

source: Installing, removing, and upgrading packages.
it: Installazione, rimozione e aggiornamento dei pacchetti.
pt_br: Instalando, removendo e atualizando pacotes.

source: guix gc: (guix)Invoking guix gc
it: guix gc: (guix.it)Invocare guix gc
pt_br: guix gc: (guix.pt_BR)Invocando guix gc

source: Reclaiming unused disk space.
it: Recupero dello spazio su disco non utilizzato.
pt_br: Recuperando espaço em disco não utilizado.

source: guix pull: (guix)Invoking guix pull
it: guix pull: (guix.it)Invocare guix pull
pt_br: guix pull: (guix.pt_BR)Invocando guix pull

source: Update the list of available packages.
it: Aggiorna l'elenco dei pacchetti disponibili.
pt_br: Atualize a lista de pacotes disponíveis.

source: guix system: (guix)Invoking guix system
it: guix system: (guix.it)Invocare guix system
pt_br: guix system: (guix.pt_BR)Invocando guix system

source: Manage the operating system configuration.
it: Gestisci la configurazione del sistema operativo.
pt_br: Gerencie a configuração do sistema operacional.

source: guix deploy: (guix)Invoking guix deploy
it: guix deploy: (guix.it)Invocare guix deploy
pt_br: guix deploy: (guix.pt_BR)Invocando guix deploy

source: Manage operating system configurations for remote hosts.
it: Gestisci le configurazioni del sistema operativo per host remoti.
pt_br: Gerenciar configurações do sistema operacional para hosts remotos.

source: Software development
it: Sviluppo software
pt_br: Desenvolvimento de software

source: guix shell: (guix)Invoking guix shell
it: guix shell: (guix.it)Invocare guix shell
pt_br: guix shell: (guix.pt_BR)Invocando guix shell

source: guix environment: (guix)Invoking guix environment
it: guix environment: (guix.it)Invocare guix environment
pt_br: guix environment: (guix.pt_BR)Invocando guix environment

source: Building development environments with Guix.
it: Costruire ambienti di sviluppo con Guix.
pt_br: Compilando ambientes de desenvolvimento com Guix.

source: guix build: (guix)Invoking guix build
it: guix build: (guix.it)Invocare guix build
pt_br: guix build: (guix.pt_BR)Invocando guix build

source: Building packages.
it: Compilazione di pacchetti.
pt_br: Compilando pacotes.

source: guix pack: (guix)Invoking guix pack
it: guix pack: (guix.it)Invocare guix pack
pt_br: guix pack: (guix.pt_BR)Invocando guix pack

source: Creating binary bundles.
it: Creazione di bundle binari.
pt_br: Criando embalagens de binários.

source: Using the GNU Guix Functional Package Manager
it: Utilizzo del Gestore di Pacchetti Funzionale GNU Guix
pt_br: Usando o Gerenciador de Pacotes Funcional GNU Guix

source: The GNU Guix Developers
it: Gli Sviluppatori di GNU Guix
pt_br: Desenvolvedores do GNU Guix

source: Edition @value{EDITION} @* @value{UPDATED} @*
it: Edizione @value{EDITION} @* @value{UPDATED} @*
pt_br: Edição @value{EDITION} @* @value{UPDATED} @*

source: This document describes GNU Guix version @value{VERSION}, a functional package management tool written for the GNU system.
it: Questo documento descrive GNU Guix versione @value{VERSION}, uno strumento funzionale di gestione dei pacchetti scritto per il sistema GNU.
pt_br: Esse documento descreve Guix versão @value{VERSION}, uma ferramenta de gerenciamento de pacotes funcional escrita para o sistema GNU.

source: This manual is also available in Simplified Chinese (@pxref{Top,,, guix.zh_CN, GNU Guix参考手册}), French (@pxref{Top,,, guix.fr, Manuel de référence de GNU Guix}), German (@pxref{Top,,, guix.de, Referenzhandbuch zu GNU Guix}), Spanish (@pxref{Top,,, guix.es, Manual de referencia de GNU Guix}), Italian (@pxref{Top,,, guix.it, Manuale di riferimento di GNU Guix}), Brazilian Portuguese (@pxref{Top,,, guix.pt_BR, Manual de referência do GNU Guix}), and Russian (@pxref{Top,,, guix.ru, Руководство GNU Guix}). If you would like to translate it in your native language, consider joining @uref{https://translate.codeberg.org/projects/guix/documentation-manual, Weblate} (@pxref{Translating Guix}).
it: Questo manuale è disponibile anche in inglese (@pxref{Top,,, guix, GNU Guix Reference Manual}), cinese semplificato (@pxref{Top,,, guix.zh_CN, GNU Guix参考手册}), francese (@pxref{Top,,, guix.fr, Manuel de référence de GNU Guix}), tedesco (@pxref{Top,,, guix.de, Referenzhandbuch zu GNU Guix}), spagnolo (@pxref{Top,,, guix.es, Manual de referencia de GNU Guix}), portoghese brasiliano (@pxref{Top,,, guix.pt_BR, Manual de referência do GNU Guix}) e russo (@pxref{Top,,, guix.ru, Руководство GNU Guix}). Se desideri tradurlo nella tua lingua madre, considera di unirti a @uref{https://translate.codeberg.org/projects/guix/documentation-manual, Weblate} (@pxref{Translating Guix}).
pt_br: Este manual também está disponível em inglês (@pxref{Top,,, guix, GNU Guix Reference Manual}), chinês simplificado (@pxref{Top ,,, guix.zh_CN, GNU Guix参考手册}), francês (@pxref{Top ,,, guix.fr, Manuel de référence de GNU Guix}), alemão (@pxref{Top,,, guix.de, Referenzhandbuch zu GNU Guix}), espanhol (@pxref{Top,,, guix.es, Manual de referencia de GNU Guix}), italiano (@pxref{Top,,, guix.it, Manuale di riferimento di GNU Guix}) e russo (@pxref{Top,,, guix.ru, Руководство GNU Guix}). Se você quiser traduzi-lo para seu idioma nativo, considere participar do @uref{https://translate.codeberg.org/projects/guix/documentation-manual, Weblate} (@pxref{Translating Guix}).

source: Introduction
it: Introduzione
pt_br: Introdução

source: What is Guix about?
it: Di cosa tratta Guix?
pt_br: Sobre o que é o Guix?

source: Installation
it: Installazione
pt_br: Instalação

source: Installing Guix.
it: Installazione di Guix.
pt_br: Instalando o Guix.

source: System Installation
it: Installazione del Sistema
pt_br: Instalação do sistema

source: Installing the whole operating system.
it: Installazione dell'intero sistema operativo.
pt_br: Instalando todo o sistema operacional.

source: Getting Started
it: Per iniziare
pt_br: Começando

source: Your first steps.
it: I tuoi primi passi.
pt_br: Seus primeiros passos.

source: Package Management
it: Gestione dei pacchetti
pt_br: Gerenciamento de pacote

source: Package installation, upgrade, etc.
it: Installazione, aggiornamento, ecc. dei pacchetti.
pt_br: Instalação de pacote, atualização, etc.

source: Channels
it: Canali
pt_br: Canais

source: Customizing the package collection.
it: Personalizzazione della collezione di pacchetti.
pt_br: Personalizando a coleção de pacotes.

source: Development
it: Sviluppo
pt_br: Desenvolvimento

source: Guix-aided software development.
it: Sviluppo software assistito da Guix.
pt_br: Desenvolvimento de software auxiliado pelo Guix.

source: Programming Interface
it: Interfaccia di Programmazione
pt_br: Interface de programação

source: Using Guix in Scheme.
it: Utilizzo di Guix in Scheme.
pt_br: Usando o Guix no Scheme.

source: Utilities
it: Utilità
pt_br: Utilitários

source: Package management commands.
it: Comandi di gestione dei pacchetti.
pt_br: Comandos de gerenciamento de pacote.

source: Foreign Architectures
it: Architetture Estere
pt_br: Arquiteturas estrangeiras

source: Build for foreign architectures.
it: Compilazione per architetture estere.
pt_br: Construir para arquiteturas estrangeiras.

source: System Configuration
it: Configurazione di sistema
pt_br: Configuração do sistema

source: Configuring the operating system.
it: Configurazione del sistema operativo.
pt_br: Configurando o sistema operacional.

source: System Troubleshooting Tips
it: Suggerimenti per la Risoluzione dei Problemi del Sistema
pt_br: Dicas para solução de problemas do sistema

source: When things don't go as planned.
it: Quando le cose non vanno come previsto.
pt_br: Quando as coisas não saem como planejado.

source: Documentation
it: Documentazione
pt_br: Documentação

source: Browsing software user manuals.
it: Navigazione nei manuali utente del software.
pt_br: Navegando por manuais do usuário do software.

source: Platforms
it: Piattaforme
pt_br: Plataformas

source: System Images
it: Immagini di Sistema
pt_br: Imagens do sistema

source: Installing Debugging Files
it: Installazione dei File di Debug
pt_br: Instalando arquivos de depuração

source: Feeding the debugger.
it: Alimentazione del debugger.
pt_br: Alimentando o depurador.

source: Using TeX and LaTeX
it: Utilizzo di TeX e LaTeX
pt_br: Usando TeX e LaTeX

source: Security Updates
it: Aggiornamenti di sicurezza
pt_br: Atualizações de segurança

source: Deploying security fixes quickly.
it: Distribuzione rapida delle correzioni di sicurezza.
pt_br: Implementando correções de segurança rapidamente.

source: Bootstrapping
pt_br: Inicializando

source: GNU/Linux built from scratch.
it: GNU/Linux costruito da zero.
pt_br: GNU/Linux compilado do zero.

source: Porting
pt_br: Portando

source: Targeting another platform or kernel.
it: Mirare a un'altra piattaforma o kernel.
pt_br: Objetivando outra plataforma ou kernel.

source: Your help needed!
it: Il tuo aiuto è necessario!
pt_br: Sua ajuda é necessária!

source: Acknowledgments
it: Ringraziamenti
pt_br: Agradecimentos

source: Thanks!
it: Grazie!
pt_br: Obrigado!

source: GNU Free Documentation License
it: Licenza di Documentazione Libera GNU
pt_br: Licença de Documentação Livre GNU

source: The license of this manual.
it: La licenza di questo manuale.
pt_br: A licença deste manual.

source: Concept Index
it: Indice dei concetti
pt_br: Índice de conceitos

source: Concepts.
it: Concetti.
pt_br: Conceitos.

source: Programming Index
it: Indice di Programmazione
pt_br: Índice de programação

source: Data types, functions, and variables.
it: Tipi di dati, funzioni e variabili.
pt_br: Tipos de dados, funções e variáveis.

source: --- The Detailed Node Listing ---
it: --- L'Elenco Dettagliato dei Nodi ---
pt_br: --- A listagem detalhada de nós ---

source: Managing Software the Guix Way
it: Gestione del Software alla Maniera di Guix
pt_br: Gerenciando software do jeito do Guix
