Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The system types the remote machine supports---e.g., @code{(list "x86_64-linux" "i686-linux")}.
it: I tipi di sistema che la macchina remota supporta - ad es., @code{(list "x86_64-linux" "i686-linux")}.
pt_br: O sistema digita os tipos que a máquina remota suporta, por exemplo, @code{(list "x86_64-linux" "i686-linux")}.

source: This must be the machine's SSH @dfn{public host key} in OpenSSH format. This is used to authenticate the machine when we connect to it. It is a long string that looks like this:
it: Questa deve essere la @dfn{chiave host pubblica} SSH della macchina in formato OpenSSH. Viene usata per autenticare la macchina quando ci colleghiamo ad essa. È una stringa lunga che assomiglia a questa:
pt_br: Essa deve ser a SSH @dfn{chave pública do host} da máquina no formato OpenSSH. Isso é usado para autenticar a máquina quando nos conectamos a ela. É uma string longa que se parece com isso:

source: If the machine is running the OpenSSH daemon, @command{sshd}, the host key can be found in a file such as @file{/etc/ssh/ssh_host_ed25519_key.pub}.
it: Se la macchina sta eseguendo il demone OpenSSH, @command{sshd}, la chiave host può essere trovata in un file come @file{/etc/ssh/ssh_host_ed25519_key.pub}.
pt_br: Se a máquina estiver executando o daemon OpenSSH, @command{sshd}, a chave do host poderá ser encontrada em um arquivo como @file{/etc/ssh/ssh_host_ed25519_key.pub}.

source: If the machine is running the SSH daemon of GNU@tie{}lsh, @command{lshd}, the host key is in @file{/etc/lsh/host-key.pub} or a similar file. It can be converted to the OpenSSH format using @command{lsh-export-key} (@pxref{Converting keys,,, lsh, LSH Manual}):
it: Se la macchina sta eseguendo il demone SSH di GNU@tie{}lsh, @command{lshd}, la chiave host si trova in @file{/etc/lsh/host-key.pub} o un file simile. Può essere convertita al formato OpenSSH usando @command{lsh-export-key} (@pxref{Converting keys,,, lsh, LSH Manual}):
pt_br: Se a máquina estiver executando o daemon SSH do GNU@tie{}lsh, @command{lshd}, a chave do host estará em @file{/etc/lsh/host-key.pub} ou em um arquivo semelhante. Ele pode ser convertido para o formato OpenSSH usando o @command{lsh-export-key} (@pxref{Converting keys,,, lsh, LSH Manual}):

source: A number of optional fields may be specified:
it: Possono essere specificati alcuni campi opzionali:
pt_br: Vários campos opcionais podem ser especificados:

source: @code{port} (default: @code{22})
it: @code{port} (predefinito: @code{22})
pt_br: @code{port} (padrão: @code{22})

source: Port number of SSH server on the machine.
it: Numero di porta del server SSH sulla macchina.
pt_br: O número da porta para o servidor SSH na máquina.

source: @code{private-key} (default: @file{~root/.ssh/id_rsa})
it: @code{private-key} (predefinito: @file{~root/.ssh/id_rsa})
pt_br: @code{private-key} (padrão: @file{~root/.ssh/id_rsa})

source: The SSH private key file to use when connecting to the machine, in OpenSSH format. This key must not be protected with a passphrase.
it: Il file della chiave privata SSH da usare per la connessione alla macchina, in formato OpenSSH. Questa chiave non deve essere protetta da passphrase.
pt_br: O arquivo de chave privada SSH a ser usado ao conectar-se à máquina, no formato OpenSSH. Esta chave não deve ser protegida com uma senha.

source: Note that the default value is the private key @emph{of the root account}. Make sure it exists if you use the default.
it: Nota che il valore predefinito è la chiave privata @emph{dell'account root}. Assicurati che esista se usi il valore predefinito.
pt_br: Observe que o valor padrão é a chave privada @emph{da usuário root}. Verifique se ele existe se você usar o padrão.

source: @code{compression} (default: @code{"zlib@@openssh.com,zlib"})
it: @code{compression} (predefinito: @code{"zlib@@openssh.com,zlib"})
pt_br: @code{compression} (padrão: @code{"zlib@@openssh.com,zlib"})

source: @code{compression-level} (default: @code{3})
it: @code{compression-level} (predefinito: @code{3})
pt_br: @code{compression-level} (padrão: @code{3})

source: The SSH-level compression methods and compression level requested.
it: I metodi di compressione a livello SSH e il livello di compressione richiesti.
pt_br: Os métodos de compactação no nível SSH e o nível de compactação solicitado.

source: Note that offloading relies on SSH compression to reduce bandwidth usage when transferring files to and from build machines.
it: Nota che l'offload si basa sulla compressione SSH per ridurre l'uso della banda durante il trasferimento di file da e verso le macchine di build.
pt_br: Observe que o descarregamento depende da compactação SSH para reduzir o uso da largura de banda ao transferir arquivos de e para máquinas de compilação.

source: @code{daemon-socket} (default: @code{"/var/guix/daemon-socket/socket"})
it: @code{daemon-socket} (predefinito: @code{"/var/guix/daemon-socket/socket"})
pt_br: @code{daemon-socket} (padrão: @code{"/var/guix/daemon-socket/socket"})

source: File name of the Unix-domain socket @command{guix-daemon} is listening to on that machine.
it: Nome del file della socket di dominio Unix su cui @command{guix-daemon} è in ascolto su quella macchina.
pt_br: O nome do arquivo do soquete do domínio Unix @command{guix-daemon} está escutando nessa máquina.

source: The load threshold above which a potential offload machine is disregarded by the offload scheduler. The value roughly translates to the total processor usage of the build machine, ranging from 0.0 (0%) to 1.0 (100%). It can also be disabled by setting @code{overload-threshold} to @code{#f}.
it: La soglia di carico al di sopra della quale una potenziale macchina di offload viene scartata dallo scheduler di offload. Il valore si traduce approssimativamente nell'utilizzo totale del processore della macchina di build, con un intervallo da 0.0 (0%) a 1.0 (100%). Può anche essere disabilitato impostando @code{overload-threshold} a @code{#f}.
pt_br: O limite de carga acima do qual uma máquina de offload potencial é desconsiderada pelo agendador de offload. O valor traduz aproximadamente o uso total do processador da máquina de build, variando de 0,0 (0%) a 1,0 (100%). Ele também pode ser desabilitado definindo @code{overload-threshold} para @code{#f}.

source: @code{parallel-builds} (default: @code{1})
it: @code{parallel-builds} (predefinito: @code{1})
pt_br: @code{parallel-builds} (padrão: @code{1})

source: The number of builds that may run in parallel on the machine.
it: Il numero di build che possono essere eseguite in parallelo sulla macchina.
pt_br: O número de compilações que podem ser executadas paralelamente na máquina.

source: @code{speed} (default: @code{1.0})
it: @code{speed} (predefinito: @code{1.0})
pt_br: @code{speed} (padrão: @code{1.0})

source: A ``relative speed factor''. The offload scheduler will tend to prefer machines with a higher speed factor.
it: Un ``fattore di velocità relativa''. Lo scheduler di offload tenderà a preferire le macchine con un fattore di velocità più alto.
pt_br: Um ``fator de velocidade relativo''. O agendador de descarregamento tenderá a preferir máquinas com um fator de velocidade mais alto.

source: @code{features} (default: @code{'()})
it: @code{features} (predefinito: @code{'()})
pt_br: @code{features} (padrão: @code{'()})

source: A list of strings denoting specific features supported by the machine. An example is @code{"kvm"} for machines that have the KVM Linux modules and corresponding hardware support. Derivations can request features by name, and they will be scheduled on matching build machines.
it: Un elenco di stringhe che denotano caratteristiche specifiche supportate dalla macchina. Un esempio è @code{"kvm"} per le macchine che hanno i moduli KVM di Linux e il supporto hardware corrispondente. Le derivazioni possono richiedere caratteristiche per nome, e verranno pianificate su macchine di build corrispondenti.
pt_br: Uma lista de strgins que denotam recursos específicos suportados pela máquina. Um exemplo é @code{"kvm"} para máquinas que possuem os módulos KVM Linux e o suporte de hardware correspondente. As derivações podem solicitar recursos pelo nome e serão agendadas nas máquinas de compilação correspondentes.

source: On Guix System, instead of managing @file{/etc/guix/machines.scm} independently, you can choose to specify build machines directly in the @code{operating-system} declaration, in the @code{build-machines} field of @code{guix-configuration}. @xref{guix-configuration-build-machines, @code{build-machines} field of @code{guix-configuration}}.
it: Su Guix System, invece di gestire @file{/etc/guix/machines.scm} indipendentemente, puoi scegliere di specificare le macchine di build direttamente nella dichiarazione @code{operating-system}, nel campo @code{build-machines} di @code{guix-configuration}. @xref{guix-configuration-build-machines, campo @code{build-machines} di @code{guix-configuration}}.
pt_br: No Guix System, em vez de gerenciar @file{/etc/guix/machines.scm} de forma independente, você pode escolher especificar máquinas de compilação diretamente na declaração @code{operating-system}, no campo @code{build-machines} de @code{guix-configuration}. @xref{guix-configuration-build-machines, campo @code{build-machines} de @code{guix-configuration}}.

source: The @command{guix} command must be in the search path on the build machines. You can check whether this is the case by running:
it: Il comando @command{guix} deve trovarsi nel percorso di ricerca delle macchine di build. Puoi verificare se questo è il caso eseguendo:
pt_br: O comando @command{guix} deve estar no caminho de pesquisa nas máquinas de compilação. Você pode verificar se este é o caso executando:

source: There is one last thing to do once @file{machines.scm} is in place. As explained above, when offloading, files are transferred back and forth between the machine stores. For this to work, you first need to generate a key pair on each machine to allow the daemon to export signed archives of files from the store (@pxref{Invoking guix archive}):
it: C'è un'ultima cosa da fare una volta che @file{machines.scm} è a posto. Come spiegato sopra, durante l'offloading, i file vengono trasferiti avanti e indietro tra gli store delle macchine. Affinché ciò funzioni, devi prima generare una coppia di chiavi su ogni macchina per consentire al demone di esportare archivi firmati di file dallo store (@pxref{Invoking guix archive}):
pt_br: Há uma última coisa a fazer quando o @file{machines.scm} está em vigor. Como explicado acima, ao descarregar, os arquivos são transferidos entre os armazéns das máquinas. Para que isso funcione, primeiro você precisa gerar um par de chaves em cada máquina para permitir que o daemon exporte arquivos assinados de arquivos do armazém (@pxref{Invoking guix archive}):

source: This key pair is not related to the SSH key pair that was previously mentioned in the description of the @code{build-machine} data type.
it: Questa coppia di chiavi non è correlata alla coppia di chiavi SSH che è stata menzionata in precedenza nella descrizione del tipo di dato @code{build-machine}.
pt_br: Este par de chaves não está relacionado ao par de chaves SSH mencionado anteriormente na descrição do tipo de dados @code{build-machine}.

source: Each build machine must authorize the key of the master machine so that it accepts store items it receives from the master:
it: Ogni macchina di build deve autorizzare la chiave della macchina principale in modo da accettare gli elementi dello store che riceve dal master:
pt_br: Cada máquina de construção deve autorizar a chave da máquina principal para que ela aceite itens do armazém que recebe do mestre:

source: Likewise, the master machine must authorize the key of each build machine.
it: Allo stesso modo, la macchina principale deve autorizzare la chiave di ogni macchina di build.
pt_br: Da mesma forma, a máquina principal deve autorizar a chave de cada máquina de compilação.

source: All the fuss with keys is here to express pairwise mutual trust relations between the master and the build machines. Concretely, when the master receives files from a build machine (and @i{vice versa}), its build daemon can make sure they are genuine, have not been tampered with, and that they are signed by an authorized key.
it: Tutto questo trambusto con le chiavi serve per esprimere relazioni di fiducia reciproca a coppie tra la macchina principale e le macchine di build. Concretamente, quando la macchina principale riceve file da una macchina di build (e @i{viceversa}), il suo demone di build può assicurarsi che siano genuini, che non siano stati manomessi e che siano firmati da una chiave autorizzata.
pt_br: Todo esse barulho com as chaves está aqui para expressar relações de confiança mútua de pares entre a máquina mestre e as de compilação. Concretamente, quando o mestre recebe arquivos de uma máquina de compilação (e @i{vice-versa}), seu daemon de compilação pode garantir que eles sejam genuínos, não tenham sido violados e que sejam assinados por uma chave autorizada.

source: To test whether your setup is operational, run this command on the master node:
it: Per verificare se la tua configurazione è operativa, esegui questo comando sul nodo principale:
pt_br: Para testar se sua configuração está operacional, execute este comando no nó principal:

source: This will attempt to connect to each of the build machines specified in @file{/etc/guix/machines.scm}, make sure Guix is available on each machine, attempt to export to the machine and import from it, and report any error in the process.
it: Questo tenterà di connettersi a ciascuna delle macchine di build specificate in @file{/etc/guix/machines.scm}, si assicurerà che Guix sia disponibile su ogni macchina, tenterà di esportare sulla macchina e di importare da essa, e segnalerà qualsiasi errore nel processo.
pt_br: Isso tentará se conectar a cada uma das máquinas de compilação especificadas em @file{/etc/guix/machines.scm}, certificar-se de que o Guix esteja disponível em cada máquina, tentará exportar para a máquina e importar dela e relatará qualquer erro no processo.

source: If you want to test a different machine file, just specify it on the command line:
it: Se vuoi testare un file di macchine diverso, specificalo semplicemente sulla riga di comando:
pt_br: Se você quiser testar um arquivo de máquina diferente, basta especificá-lo na linha de comando:

source: Last, you can test the subset of the machines whose name matches a regular expression like this:
it: Infine, puoi testare il sottoinsieme delle macchine il cui nome corrisponde a un'espressione regolare come questa:
pt_br: Por fim, você pode testar o subconjunto das máquinas cujo nome corresponde a uma expressão regular como esta:

source: To display the current load of all build hosts, run this command on the main node:
it: Per visualizzare il carico corrente di tutti gli host di build, esegui questo comando sul nodo principale:
pt_br: Para exibir o carregamento atual de todos os hosts de compilação, execute este comando no nó principal:

source: SELinux, daemon policy
it: SELinux, policy del demone
pt_br: SELinux, política de daemons

source: mandatory access control, SELinux
it: controllo di accesso obbligatorio, SELinux
pt_br: controle de acesso obrigatório, SELinux

source: security, guix-daemon
it: sicurezza, guix-daemon
pt_br: segurança, guix-daemon

source: Guix includes an SELinux policy file at @file{etc/guix-daemon.cil} that can be installed on a system where SELinux is enabled, in order to label Guix files and to specify the expected behavior of the daemon. Since Guix System does not provide an SELinux base policy, the daemon policy cannot be used on Guix System.
it: Guix include un file di policy SELinux in @file{etc/guix-daemon.cil} che può essere installato su un sistema in cui SELinux è abilitato, al fine di etichettare i file di Guix e di specificare il comportamento atteso del demone. Poiché Guix System non fornisce una policy di base SELinux, la policy del demone non può essere usata su Guix System.
pt_br: O Guix inclui um arquivo de políticas do SELinux em @file{etc/guix-daemon.cil} que pode ser instalado em um sistema em que o SELinux está ativado, para rotular os arquivos do Guix e especificar o comportamento esperado do daemon. Como o Guix System não fornece uma política básica do SELinux, a política do daemon não pode ser usada no Guix System.

source: Installing the SELinux policy
it: Installare la policy SELinux
pt_br: Instalando a política do SELinux

source: SELinux, policy installation
it: SELinux, installazione della policy
pt_br: SELinux, instalação de política

source: The @code{guix-install.sh} binary installation script offers to perform the steps below for you (@pxref{Binary Installation}).
it: Lo script di installazione binaria @code{guix-install.sh} offre di eseguire i passaggi seguenti per te (@pxref{Binary Installation}).
pt_br: O script de instalação binária @code{guix-install.sh} se oferece para executar as etapas abaixo para você (@pxref{Binary Installation}).

source: To install the policy run this command as root:
it: Per installare la policy, esegui questo comando come root:
pt_br: Para instalar a política, execute esse comando como root:

source: Then, as root, relabel the file system, possibly after making it writable:
it: Poi, come root, rietichetta il file system, eventualmente dopo averlo reso scrivibile:
pt_br: Então, como root, renomeie o sistema de arquivos, possivelmente depois de torná-lo gravável:

source: At this point you can start or restart @command{guix-daemon}; on a distribution that uses systemd as its service manager, you can do that with:
it: A questo punto puoi avviare o riavviare @command{guix-daemon}; su una distribuzione che usa systemd come gestore di servizi, puoi farlo con:
pt_br: Neste ponto, você pode iniciar ou reiniciar @command{guix-daemon}; em uma distribuição que usa systemd como seu gerenciador de serviços, você pode fazer isso com:

source: Once the policy is installed, the file system has been relabeled, and the daemon has been restarted, it should be running in the @code{guix_daemon_t} context. You can confirm this with the following command:
it: Una volta che la policy è installata, il file system è stato rietichettato e il demone è stato riavviato, dovrebbe essere in esecuzione nel contesto @code{guix_daemon_t}. Puoi confermarlo con il seguente comando:
pt_br: Depois que a política é instalada, o sistema de arquivos foi rotulado novamente e o daemon foi reiniciado, ele deve estar em execução no contexto @code{guix_daemon_t}. Você pode confirmar isso com o seguinte comando:

source: Monitor the SELinux log files as you run a command like @code{guix build hello} to convince yourself that SELinux permits all necessary operations.
it: Monitora i file di log di SELinux mentre esegui un comando come @code{guix build hello} per convincerti che SELinux permette tutte le operazioni necessarie.
pt_br: Monitore os arquivos de log do SELinux enquanto executa um comando como @code{guix build hello} para se convencer de que o SELinux permite todas as operações necessárias.

source: SELinux, limitations
it: SELinux, limitazioni
pt_br: SELinux, limitações

source: This policy is not perfect. Here is a list of limitations or quirks that should be considered when deploying the provided SELinux policy for the Guix daemon.
it: Questa policy non è perfetta. Ecco un elenco di limitazioni o stranezze che dovrebbero essere considerate quando si implementa la policy SELinux fornita per il demone Guix.
pt_br: Esta política não é perfeita. Aqui está uma lista de limitações ou peculiaridades que devem ser consideradas ao implementar a política SELinux fornecida para o daemon Guix.

source: @code{guix gc} cannot access arbitrary links to profiles. By design, the file label of the destination of a symlink is independent of the file label of the link itself. Although all profiles under @file{$localstatedir} are labelled, the links to these profiles inherit the label of the directory they are in. For links in the user’s home directory this will be @code{user_home_t}. But for links from the root user’s home directory, or @file{/tmp}, or the HTTP server’s working directory, etc, this won’t work. @code{guix gc} would be prevented from reading and following these links.
it: @code{guix gc} non può accedere a collegamenti arbitrari ai profili. Per progetto, l'etichetta del file di destinazione di un collegamento simbolico è indipendente dall'etichetta del file del collegamento stesso. Sebbene tutti i profili sotto @file{$localstatedir} siano etichettati, i collegamenti a questi profili ereditano l'etichetta della directory in cui si trovano. Per i collegamenti nella directory home dell'utente, questa sarà @code{user_home_t}. Ma per i collegamenti dalla directory home dell'utente root, o @file{/tmp}, o la directory di lavoro del server HTTP, ecc, questo non funzionerà. A @code{guix gc} verrebbe impedito di leggere e seguire questi collegamenti.
pt_br: @code{guix gc} não pode acessar links arbitrários para perfis. Por design, o rótulo do arquivo do destino de uma ligação simbólica é independente do rótulo do arquivo do próprio link. Embora todos os perfis em @file{$localstatedir} estejam rotulados, as ligações para esses perfis herdam o rótulo do diretório em que estão. Para as ligações no diretório pessoal do usuário, será @code{user_home_t}. Mas, para ligações do diretório pessoal do usuário root, ou @file{/tmp}, ou do diretório de trabalho do servidor HTTP etc., isso não funcionará. @code{guix gc} seria impedido de ler e seguir essas ligações.

source: The daemon’s feature to listen for TCP connections might no longer work. This might require extra rules, because SELinux treats network sockets differently from files.
it: La funzione del demone di ascoltare le connessioni TCP potrebbe non funzionare più. Questo potrebbe richiedere regole extra, perché SELinux tratta le socket di rete diversamente dai file.
pt_br: O recurso do daemon de escutar conexões TCP pode não funcionar mais. Isso pode exigir regras extras, porque o SELinux trata os soquetes de rede de maneira diferente dos arquivos.
