Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: These aliases are less expressive than @command{guix package} and provide fewer options, so in some cases you'll probably want to use @command{guix package} directly.
pt_br: Esses aliases são menos expressivos que @command{guix package} e oferecem menos opções, então em alguns casos você provavelmente desejará usar @command{guix package} diretamente.

source: @command{guix package} also supports a @dfn{declarative approach} whereby the user specifies the exact set of packages to be available and passes it @i{via} the @option{--manifest} option (@pxref{profile-manifest, @option{--manifest}}).
pt_br: @command{guix package} também suporta uma @dfn{abordagem declarativa} em que o usuário especifica o conjunto exato de pacotes que estarão disponíveis e passa a ele @i{via} a opção @option{--manifest} (@pxref{profile-manifest, @option{--manifest}}).

source: For each user, a symlink to the user's default profile is automatically created in @file{$HOME/.guix-profile}. This symlink always points to the current generation of the user's default profile. Thus, users can add @file{$HOME/.guix-profile/bin} to their @env{PATH} environment variable, and so on.
pt_br: Para cada usuário, uma ligação simbólica para o perfil padrão do usuário é criado automaticamente em @file{$HOME/.guix-profile}. Esta ligação simbólico sempre aponta para a geração atual do perfil padrão do usuário. Assim, os usuários podem adicionar @file{$HOME/.guix-profile/bin} à sua variável de ambiente @env{PATH} e assim por diante.

source: search paths
pt_br: caminhos de pesquisa

source: If you are not using Guix System, consider adding the following lines to your @file{~/.bash_profile} (@pxref{Bash Startup Files,,, bash, The GNU Bash Reference Manual}) so that newly-spawned shells get all the right environment variable definitions:
pt_br: Se você não estiver usando o sistema Guix, considere adicionar as seguintes linhas ao seu @file{~/.bash_profile} (@pxref{Bash Startup Files,,, bash, Manual de referência do GNU Bash}) para que os shells recém-gerados obtenham todos as definições corretas de variáveis de ambiente:

source: In a multi-user setup, user profiles are stored in a place registered as a @dfn{garbage-collector root}, which @file{$HOME/.guix-profile} points to (@pxref{Invoking guix gc}). That directory is normally @code{@var{localstatedir}/guix/profiles/per-user/@var{user}}, where @var{localstatedir} is the value passed to @code{configure} as @option{--localstatedir}, and @var{user} is the user name. The @file{per-user} directory is created when @command{guix-daemon} is started, and the @var{user} sub-directory is created by @command{guix package}.
pt_br: Em uma configuração multiusuário, os perfis de usuário são armazenados em um local registrado como @dfn{raiz do coletor de lixo}, para o qual @file{$HOME/.guix-profile} aponta (@pxref{Invoking guix gc}). Esse diretório geralmente é @code{@var{localstatedir}/guix/profiles/per-user/@var{usuário}}, onde @var{localstatedir} é o valor passado para @code{configure} como @option{-- localstatedir} e @var{usuário} é o nome do usuário. O diretório @file{per-user} é criado quando @command{guix-daemon} é iniciado, e o subdiretório @var{usuário} é criado por @command{guix package}.

source: The @var{options} can be among the following:
pt_br: As seguintes @var{opções} podem ser usadas:

source: --install=@var{package} @dots{}
pt_br: --install=@var{pacote} @dots{}

source: -i @var{package} @dots{}
pt_br: -i @var{pacote} @dots{}

source: Install the specified @var{package}s.
pt_br: Instale os @var{pacote}s especificados.

source: Each @var{package} may specify a simple package name, such as @code{guile}, optionally followed by an at-sign and version number, such as @code{guile@@3.0.7} or simply @code{guile@@3.0}. In the latter case, the newest version prefixed by @code{3.0} is selected.
pt_br: Cada @var{pacote} pode especificar um nome de pacote simples como @code{guile}, opcionalmente seguido por uma arroba e número de versão, como @code{guile@@3.0.7} ou simplesmente @code{guile@@3.0}. Neste último caso, a versão mais recente prefixada por @code{3.0} é selecionada.

source: If no version number is specified, the newest available version will be selected. In addition, such a @var{package} specification may contain a colon, followed by the name of one of the outputs of the package, as in @code{gcc:doc} or @code{binutils@@2.22:lib} (@pxref{Packages with Multiple Outputs}).
pt_br: Se nenhum número de versão for especificado, a versão mais recente disponível será selecionada. Além disso, tal especificação @var{pacote} pode conter dois pontos, seguido pelo nome de uma das saídas do pacote, como em @code{gcc:doc} ou @code{binutils@@2.22:lib} (@pxref{Packages with Multiple Outputs}).

source: Packages with a corresponding name (and optionally version) are searched for among the GNU distribution modules (@pxref{Package Modules}).
pt_br: Pacotes com um nome correspondente (e opcionalmente versão) são procurados entre os módulos de distribuição GNU (@pxref{Package Modules}).

source: Alternatively, a @var{package} can directly specify a store file name such as @file{/gnu/store/...-guile-3.0.7}, as produced by, e.g., @code{guix build}.
pt_br: Alternativamente, um @var{pacote} pode especificar diretamente um nome de arquivo de armazém como @file{/gnu/store/...-guile-3.0.7}, conforme produzido por, por exemplo, @code{guix build}.

source: propagated inputs
pt_br: entradas propagadas

source: Sometimes packages have @dfn{propagated inputs}: these are dependencies that automatically get installed along with the required package (@pxref{package-propagated-inputs, @code{propagated-inputs} in @code{package} objects}, for information about propagated inputs in package definitions).
pt_br: Às vezes, os pacotes têm @dfn{propagated-inputs}: são dependências que são instaladas automaticamente junto com o pacote necessário (@pxref{package-propagated-inputs, @code{propagated-inputs} em @code{package} objetos}, para obter informações sobre entradas propagadas em definições de pacote).

source: An example is the GNU MPC library: its C header files refer to those of the GNU MPFR library, which in turn refer to those of the GMP library. Thus, when installing MPC, the MPFR and GMP libraries also get installed in the profile; removing MPC also removes MPFR and GMP---unless they had also been explicitly installed by the user.
pt_br: Um exemplo é a biblioteca GNU MPC: seus arquivos de cabeçalho C referem-se aos da biblioteca GNU MPFR, que por sua vez se refere aos da biblioteca GMP. Assim, ao instalar o MPC, as bibliotecas MPFR e GMP também são instaladas no perfil; a remoção do MPC também remove o MPFR e o GMP --- a menos que eles também tenham sido explicitamente instalados pelo usuário.

source: Besides, packages sometimes rely on the definition of environment variables for their search paths (see explanation of @option{--search-paths} below). Any missing or possibly incorrect environment variable definitions are reported here.
pt_br: Além disso, os pacotes às vezes dependem da definição de variáveis de ambiente para seus caminhos de pesquisa (veja a explicação de @option{--search-paths} abaixo). Quaisquer definições de variáveis ambientais ausentes ou possivelmente incorretas são relatadas aqui.

source: Install the package @var{exp} evaluates to.
pt_br: Instale o pacote avaliado por @var{exp}.

source: @var{exp} must be a Scheme expression that evaluates to a @code{<package>} object. This option is notably useful to disambiguate between same-named variants of a package, with expressions such as @code{(@@ (gnu packages commencement) guile-final)}.
pt_br: @var{exp} deve ser uma expressão de Scheme avaliada como um objeto @code{<package>}. Esta opção é particularmente útil para desambiguar variantes de um pacote com o mesmo nome, com expressões como @code{(@@(gnu packages commencement) guile-final)}.

source: Note that this option installs the first output of the specified package, which may be insufficient when needing a specific output of a multiple-output package.
pt_br: Observe que esta opção instala a primeira saída do pacote especificado, o que pode ser insuficiente quando for necessária uma saída específica de um pacote de múltiplas saídas.

source: --install-from-file=@var{file}
pt_br: --install-from-file=@var{arquivo}

source: -f @var{file}
pt_br: -f @var{arquivo}

source: Install the package that the code within @var{file} evaluates to.
pt_br: Instale o pacote avaliado pelo código em @var{arquivo}.

source: As an example, @var{file} might contain a definition like this (@pxref{Defining Packages}):
pt_br: Por exemplo, @var{arquivo} pode conter uma definição como esta (@pxref{Defining Packages}):

source: Developers may find it useful to include such a @file{guix.scm} file in the root of their project source tree that can be used to test development snapshots and create reproducible development environments (@pxref{Invoking guix shell}).
pt_br: Os desenvolvedores podem achar útil incluir um arquivo @file{guix.scm} na raiz da árvore de origem do projeto que pode ser usado para testar instantâneos de desenvolvimento e criar ambientes de desenvolvimento reproduzíveis (@pxref{Invoking guix shell}).

source: The @var{file} may also contain a JSON representation of one or more package definitions. Running @code{guix package -f} on @file{hello.json} with the following contents would result in installing the package @code{greeter} after building @code{myhello}:
pt_br: O @var{arquivo} também pode conter uma representação JSON de uma ou mais definições de pacote. Executar @code{guix package -f} em @file{hello.json} com o seguinte conteúdo resultaria na instalação do pacote @code{greeter} após construir @code{myhello}:

source: --remove=@var{package} @dots{}
pt_br: --remove=@var{pacote} @dots{}

source: -r @var{package} @dots{}
pt_br: -r @var{pacote} @dots{}

source: Remove the specified @var{package}s.
pt_br: Remova os @var{pacote}s especificados.

source: As for @option{--install}, each @var{package} may specify a version number and/or output name in addition to the package name. For instance, @samp{-r glibc:debug} would remove the @code{debug} output of @code{glibc}.
pt_br: Quanto a @option{--install}, cada @var{pacote} pode especificar um número de versão e/ou nome de saída além do nome do pacote. Por exemplo, @samp{-r glibc:debug} removeria a saída de @code{glibc}.

source: upgrading packages
pt_br: atualização de pacotes

source: Upgrade all the installed packages. If one or more @var{regexp}s are specified, upgrade only installed packages whose name matches a @var{regexp}. Also see the @option{--do-not-upgrade} option below.
pt_br: Atualize todos os pacotes instalados. Se um ou mais @var{regexp}s forem especificados, atualize apenas os pacotes instalados cujo nome corresponda a um @var{regexp}. Veja também a opção @option{--do-not-upgrade} abaixo.

source: Note that this upgrades package to the latest version of packages found in the distribution currently installed. To update your distribution, you should regularly run @command{guix pull} (@pxref{Invoking guix pull}).
pt_br: Note que isso atualiza o pacote para a versão mais recente dos pacotes encontrados na distribuição atualmente instalada. Para atualizar sua distribuição, você deve executar regularmente @command{guix pull} (@pxref{Invoking guix pull}).

source: package transformations, upgrades
pt_br: transformações de pacotes, atualizações

source: When upgrading, package transformations that were originally applied when creating the profile are automatically re-applied (@pxref{Package Transformation Options}). For example, assume you first installed Emacs from the tip of its development branch with:
pt_br: Ao atualizar, as transformações de pacote que foram aplicadas originalmente ao criar o perfil são automaticamente reaplicadas (@pxref{Package Transformation Options}). Por exemplo, suponha que você instalou o Emacs pela ponta do seu branch de desenvolvimento com:

source: Next time you run @command{guix upgrade}, Guix will again pull the tip of the Emacs development branch and build @code{emacs-next} from that checkout.
pt_br: Na próxima vez que você executar @command{guix upgrade}, o Guix puxará novamente a ponta do branch de desenvolvimento do Emacs e compilará @code{emacs-next} a partir desse checkout.

source: Note that transformation options such as @option{--with-branch} and @option{--with-source} depend on external state; it is up to you to ensure that they work as expected. You can also discard a transformations that apply to a package by running:
pt_br: Observe que opções de transformação como @option{--with-branch} e @option{--with-source} dependem do estado externo; cabe a você garantir que elas funcionem conforme o esperado. Você também pode descartar transformações que se aplicam a um pacote executando:

source: guix install @var{package}
pt_br: guix install @var{pacote}

source: When used together with the @option{--upgrade} option, do @emph{not} upgrade any packages whose name matches a @var{regexp}. For example, to upgrade all packages in the current profile except those containing the substring ``emacs'':
pt_br: Quando usado junto com a opção @option{--upgrade}, @emph{não} atualize nenhum pacote cujo nome corresponda a um @var{regexp}. Por exemplo, para atualizar todos os pacotes no perfil atual, exceto aqueles que contêm a substring "emacs'':

source: --manifest=@var{file}
pt_br: --manifest=@var{arquivo}

source: -m @var{file}
pt_br: -m @var{arquivo}

source: profile declaration
pt_br: declaração de perfil

source: profile manifest
pt_br: manifesto de perfil

source: Create a new generation of the profile from the manifest object returned by the Scheme code in @var{file}. This option can be repeated several times, in which case the manifests are concatenated.
pt_br: Crie uma nova geração do perfil a partir do objeto manifest retornado pelo código Scheme em @var{arquivo}. Esta opção pode ser repetida várias vezes, em cujo caso os manifestos são concatenados.

source: This allows you to @emph{declare} the profile's contents rather than constructing it through a sequence of @option{--install} and similar commands. The advantage is that @var{file} can be put under version control, copied to different machines to reproduce the same profile, and so on.
pt_br: Isso permite que você @emph{declarando} o conteúdo do perfil em vez de construí-lo por meio de uma sequência de @option{--install} e comandos similares. A vantagem é que @var{arquivo} pode ser colocado sob controle de versão, copiado para máquinas diferentes para reproduzir o mesmo perfil, e assim por diante.

source: @var{file} must return a @dfn{manifest} object, which is roughly a list of packages:
pt_br: @var{arquivo} deve retornar um objeto @dfn{manifest}, que é aproximadamente uma lista de pacotes:

source: (packages->manifest (list emacs guile-2.0 ;; Use a specific package output. (list guile-2.0 "debug")))
pt_br: (packages->manifest (list emacs guile-2.0 ;; Usa uma saída de pacote específica. (list guile-2.0 "debug")))

source: @xref{Writing Manifests}, for information on how to write a manifest. @xref{export-manifest, @option{--export-manifest}}, to learn how to obtain a manifest file from an existing profile.
pt_br: @xref{Writing Manifests}, para obter informações sobre como escrever um manifesto. @xref{export-manifest, @option{--export-manifest}}, para aprender como obter um arquivo de manifesto de um perfil existente.

source: rolling back
pt_br: revertendo

source: undoing transactions
pt_br: desfazendo transações

source: transactions, undoing
pt_br: transações, desfazendo

source: Roll back to the previous @dfn{generation} of the profile---i.e., undo the last transaction.
pt_br: Reverta para a @dfn{geração} anterior do perfil, ou seja, desfaça a última transação.

source: When combined with options such as @option{--install}, roll back occurs before any other actions.
pt_br: Quando combinado com opções como @option{--install}, a reversão ocorre antes de qualquer outra ação.

source: When rolling back from the first generation that actually contains installed packages, the profile is made to point to the @dfn{zeroth generation}, which contains no files apart from its own metadata.
pt_br: Ao reverter da primeira geração que realmente contém pacotes instalados, o perfil é feito para apontar para a @dfn{geração zero}, que não contém arquivos além de seus próprios metadados.

source: After having rolled back, installing, removing, or upgrading packages overwrites previous future generations. Thus, the history of the generations in a profile is always linear.
pt_br: Após ter revertido, instalar, remover ou atualizar pacotes sobrescreve gerações futuras anteriores. Assim, o histórico das gerações em um perfil é sempre linear.

source: --switch-generation=@var{pattern}
pt_br: --switch-generation=@var{padrão}

source: -S @var{pattern}
pt_br: -S @var{padrão}

source: generations
pt_br: gerações

source: Switch to a particular generation defined by @var{pattern}.
pt_br: Mude para uma geração específica definida por @var{padrão}.

source: @var{pattern} may be either a generation number or a number prefixed with ``+'' or ``-''. The latter means: move forward/backward by a specified number of generations. For example, if you want to return to the latest generation after @option{--roll-back}, use @option{--switch-generation=+1}.
pt_br: @var{padrão} pode ser um número de geração ou um número prefixado com "+'' ou "-''. O último significa: mover para frente/para trás por um número especificado de gerações. Por exemplo, se você quiser retornar para a última geração após @option{--roll-back}, use @option{--switch-generation=+1}.

source: The difference between @option{--roll-back} and @option{--switch-generation=-1} is that @option{--switch-generation} will not make a zeroth generation, so if a specified generation does not exist, the current generation will not be changed.
pt_br: A diferença entre @option{--roll-back} e @option{--switch-generation=-1} é que @option{--switch-generation} não fará uma geração zero, então se uma geração especificada não existir, a geração atual não será alterada.

source: --search-paths[=@var{kind}]
pt_br: --search-paths[=@var{tipo}]

source: Report environment variable definitions, in Bash syntax, that may be needed in order to use the set of installed packages. These environment variables are used to specify @dfn{search paths} for files used by some of the installed packages.
pt_br: Relata definições de variáveis de ambiente, na sintaxe Bash, que podem ser necessárias para usar o conjunto de pacotes instalados. Essas variáveis de ambiente são usadas para especificar @dfn{caminhos de busca} para arquivos usados por alguns dos pacotes instalados.

source: For example, GCC needs the @env{CPATH} and @env{LIBRARY_PATH} environment variables to be defined so it can look for headers and libraries in the user's profile (@pxref{Environment Variables,,, gcc, Using the GNU Compiler Collection (GCC)}). If GCC and, say, the C library are installed in the profile, then @option{--search-paths} will suggest setting these variables to @file{@var{profile}/include} and @file{@var{profile}/lib}, respectively (@pxref{Search Paths}, for info on search path specifications associated with packages.)
pt_br: Por exemplo, o GCC precisa que as variáveis de ambiente @env{CPATH} e @env{LIBRARY_PATH} sejam definidas para que ele possa procurar cabeçalhos e bibliotecas no perfil do usuário (@pxref{Environment Variables,,, gcc, Usando o GNU Compiler Collection (GCC)}). Se o GCC e, digamos, a biblioteca C estiverem instalados no perfil, então @option{--search-paths} sugerirá definir essas variáveis como @file{@var{perfil}/include} e @file{@var{perfil}/lib}, respectivamente (@pxref{Search Paths}, para obter informações sobre especificações de caminho de pesquisa associadas a pacotes.)

source: The typical use case is to define these environment variables in the shell:
pt_br: O caso de uso típico é definir essas variáveis de ambiente no shell:

source: @var{kind} may be one of @code{exact}, @code{prefix}, or @code{suffix}, meaning that the returned environment variable definitions will either be exact settings, or prefixes or suffixes of the current value of these variables. When omitted, @var{kind} defaults to @code{exact}.
pt_br: @var{tipo} pode ser um dos seguintes: @code{exact}, @code{prefix} ou @code{suffix}, o que significa que as definições de variáveis de ambiente retornadas serão configurações exatas ou prefixos ou sufixos do valor atual dessas variáveis. Quando omitido, @var{tipo} assume como padrão @code{exact}.

source: This option can also be used to compute the @emph{combined} search paths of several profiles. Consider this example:
pt_br: Esta opção também pode ser usada para calcular os caminhos de busca @emph{combinados} de vários perfis. Considere este exemplo:

source: The last command above reports about the @env{GUILE_LOAD_PATH} variable, even though, taken individually, neither @file{foo} nor @file{bar} would lead to that recommendation.
pt_br: O último comando acima relata sobre a variável @env{GUILE_LOAD_PATH}, embora, considerados individualmente, nem @file{foo} nem @file{bar} levariam a essa recomendação.

source: --profile=@var{profile}
pt_br: --profile=@var{perfil}

source: -p @var{profile}
pt_br: -p @var{perfil}

source: Use @var{profile} instead of the user's default profile.
pt_br: Use @var{perfil} em vez do perfil padrão do usuário.

source: @var{profile} must be the name of a file that will be created upon completion. Concretely, @var{profile} will be a mere symbolic link (``symlink'') pointing to the actual profile where packages are installed:
pt_br: @var{perfil} deve ser o nome de um arquivo que será criado após a conclusão. Concretamente, @var{perfil} será uma mera ligação simbólica ("symlink'') apontanda para o perfil real onde os pacotes estão instalados:

source: $ guix install hello -p ~/code/my-profile @dots{} $ ~/code/my-profile/bin/hello Hello, world!
pt_br: $ guix install hello -p ~/code/my-profile @dots{} $ ~/code/my-profile/bin/hello Olá, mundo!

source: All it takes to get rid of the profile is to remove this symlink and its siblings that point to specific generations:
pt_br: Tudo o que é preciso para se livrar do perfil é remover este link simbólico e seus irmãos que apontam para gerações específicas:

source: List all the user's profiles:
pt_br: Liste todos os perfis dos usuários:

source: When running as root, list all the profiles of all the users.
pt_br: Ao executar como root, liste todos os perfis de todos os usuários.

source: collisions, in a profile
pt_br: colisões, em um perfil

source: colliding packages in profiles
pt_br: pacotes colidindo em perfis

source: profile collisions
pt_br: colisões de perfil

source: Allow colliding packages in the new profile. Use at your own risk!
pt_br: Permitir pacotes de colisão no novo perfil. Use por sua conta e risco!

source: By default, @command{guix package} reports as an error @dfn{collisions} in the profile. Collisions happen when two or more different versions or variants of a given package end up in the profile.
pt_br: Por padrão, @command{guix package} relata como um erro @dfn{collisions} no perfil. Colisões acontecem quando duas ou mais versões ou variantes diferentes de um determinado pacote acabam no perfil.

source: Use the bootstrap Guile to build the profile. This option is only useful to distribution developers.
pt_br: Use o bootstrap Guile para construir o perfil. Esta opção é útil somente para desenvolvedores de distribuição.
