Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Top-level variables are only referenced in delayed (@i{thunked}) package fields: @code{arguments}, @code{native-inputs}, @code{inputs}, @code{propagated-inputs} or @code{replacement}
it: Le variabili di primo livello sono referenziate solo nei campi di pacchetto ritardati (@i{thunked}): @code{arguments}, @code{native-inputs}, @code{inputs}, @code{propagated-inputs} o @code{replacement}
pt_br: Variáveis de nível superior são referenciadas apenas em campos de pacote atrasados (@i{thunked}): @code{arguments}, @code{native-inputs}, @code{inputs}, @code{propagated-inputs} ou @code{replacement}

source: Procedures referencing top-level variables from another module are not called at the top level of a module themselves.
it: Le procedure che referenziano variabili di primo livello di un altro modulo non sono chiamate esse stesse a livello di primo livello di un modulo.
pt_br: Procedimentos que fazem referência a variáveis de nível superior de outro módulo não são chamados no nível superior de um módulo.

source: Straying away from the above rules may work while there are no dependency cycles between modules, but given such cycles are confusing and difficult to troubleshoot, it is best to follow the rules to avoid introducing problems down the line.
it: Deviare dalle regole sopra indicate può funzionare finché non ci sono cicli di dipendenza tra i moduli, ma dato che tali cicli sono confusi e difficili da risolvere, è meglio seguire le regole per evitare di introdurre problemi in futuro.
pt_br: Afastar-se das regras acima pode funcionar enquanto não houver ciclos de dependência entre os módulos, mas como tais ciclos são confusos e difíceis de solucionar, é melhor seguir as regras para evitar a introdução de problemas no futuro.

source: Here is a common trap to avoid:
it: Ecco una trappola comune da evitare:
pt_br: Aqui está uma armadilha comum a ser evitada:

source: In the above example, the @code{avr-binutils} package was defined in the module @code{(gnu packages avr)}, and the @code{cross-binutils} procedure in @code{(gnu packages cross-base)}. Because the @code{inherit} field is not delayed (thunked), it is evaluated at the top level at load time, which is problematic in the presence of module dependency cycles. This could be resolved by turning the package into a procedure instead, like:
it: Nell'esempio sopra, il pacchetto @code{avr-binutils} è stato definito nel modulo @code{(gnu packages avr)}, e la procedura @code{cross-binutils} in @code{(gnu packages cross-base)}. Poiché il campo @code{inherit} non è ritardato (thunked), viene valutato a livello di primo livello al momento del caricamento, il che è problematico in presenza di cicli di dipendenza tra i moduli. Questo potrebbe essere risolto trasformando il pacchetto in una procedura, come:
pt_br: No exemplo acima, o pacote @code{avr-binutils} foi definido no módulo @code{(gnu packages avr)}, e o procedimento @code{cross-binutils} em @code{(gnu packages cross-base)}. Como o campo @code{inherit} não é atrasado (thunked), ele é avaliado no nível superior no momento do carregamento, o que é problemático na presença de ciclos de dependência do módulo. Isso pode ser resolvido transformando o pacote em um procedimento, como:

source: Care would need to be taken to ensure the above procedure is only ever used in a package delayed fields or within another procedure also not called at the top level.
it: Bisognerebbe fare attenzione per assicurarsi che la procedura sopra descritta venga usata solo nei campi ritardati di un pacchetto o all'interno di un'altra procedura che non venga anch'essa chiamata al livello più alto.
pt_br: Seria necessário tomar cuidado para garantir que o procedimento acima só seja usado em campos atrasados de pacote ou dentro de outro procedimento também não chamado no nível superior.

source: packaging, maintenance
pt_br: empacotamento, manutenção

source: Sometimes you may need to update a monotonic collection of grouped packages, in a particular module---e.g., @code{(gnu packages astronomy)}. Doing so requires refreshing package versions, creating commits following guidelines and testing them. Let's say there are 200+ packages with fresh versions, you may deal with this task by applying the following technique.
pt_br: Às vezes, em um módulo específico, você pode precisar atualizar uma coleção monótona de pacotes --- por exemplo, @code{(gnu packages astronomy)}. Isso requer a atualização das versões dos pacotes, a criação de commits seguindo as diretrizes e testando-os. Digamos que haja mais de 200 pacotes com versões novas; você pode realizar essa tarefa aplicando a seguinte técnica.

source: Enter a development shell in your local Guix checkout, assuming you already ran @code{bootstrap} and @code{configure}:
pt_br: Crie um shell de desenvolvimento no seu checkout local de Guix, supondo que você já tenha executado @code{bootstrap} e @code{configure}:

source: The first command updates all packages in @code{(gnu packages astronomy)} to the latest versions and writes changes back to the file. The second invokes @code{etc/committer.scm} script, a helper script for larger scale updates; it identifies each package diff and creates corresponding commits with the correct style.
pt_br: O primeiro comando atualiza todos os pacotes em @code{(gnu packages astronomy)} para as versões mais recentes e grava as alterações em arquivo. O segundo invoca o script @code{etc/committer.scm}, um script auxiliar para atualizações em larga escala; ele identifica cada diff de pacote e cria os commits correspondentes com o estilo correto.

source: If your machine is powerful enough, you may check that the whole collection has no regressions and can still be built successfully:
pt_br: Se sua máquina for potente o suficiente, você pode verificar se toda a coleção não tem regressões e ainda pode ser compilada com sucesso:

source: emacs, packaging
it: emacs, pacchettizzazione
pt_br: emacs, empacotando

source: elisp, packaging
it: elisp, pacchettizzazione
pt_br: elisp, empacotando

source: Emacs packages should preferably use the Emacs build system (@pxref{emacs-build-system}), for uniformity and the benefits provided by its build phases, such as the auto-generation of the autoloads file and the byte compilation of the sources. Because there is no standardized way to run a test suite for Emacs packages, tests are disabled by default. When a test suite is available, it should be enabled by setting the @code{#:tests?} argument to @code{#true}. By default, the command to run the test is @command{make check}, but any command can be specified via the @code{#:test-command} argument. The @code{#:test-command} argument expects a list containing a command and its arguments, to be invoked during the @code{check} phase.
it: I pacchetti Emacs dovrebbero preferibilmente usare il sistema di compilazione Emacs (@pxref{emacs-build-system}), per uniformità e per i benefici forniti dalle sue fasi di compilazione, come la generazione automatica del file di autoload e la compilazione in bytecode dei sorgenti. Poiché non esiste un modo standardizzato per eseguire una suite di test per i pacchetti Emacs, i test sono disabilitati per impostazione predefinita. Quando una suite di test è disponibile, dovrebbe essere abilitata impostando l'argomento @code{#:tests?} a @code{#true}. Per impostazione predefinita, il comando per eseguire il test è @command{make check}, ma qualsiasi comando può essere specificato tramite l'argomento @code{#:test-command}. L'argomento @code{#:test-command} si aspetta una lista contenente un comando e i suoi argomenti, da invocare durante la fase @code{check}.
pt_br: Os pacotes Emacs devem preferencialmente usar o sistema de compilação Emacs (@pxref{emacs-build-system}), para uniformidade e os benefícios proporcionados por suas fases de compilação, como a geração automática do arquivo autoloads e a compilação de bytes das fontes. Como não existe uma maneira padronizada de executar um conjunto de testes para pacotes Emacs, os testes são desabilitados por padrão. Quando um conjunto de testes estiver disponível, ele deverá ser habilitado definindo o argumento @code{#:tests?} como @code{#true}. Por padrão, o comando para executar o teste é @command{make check}, mas qualquer comando pode ser especificado através do argumento @code{#:test-command}. O argumento @code{#:test-command} espera que uma lista contendo um comando e seus argumentos seja invocada durante a fase @code{check}.

source: The Elisp dependencies of Emacs packages are typically provided as @code{propagated-inputs} when required at run time. As for other packages, build or test dependencies should be specified as @code{native-inputs}.
it: Le dipendenze Elisp dei pacchetti Emacs sono tipicamente fornite come @code{propagated-inputs} quando richieste a runtime. Come per altri pacchetti, le dipendenze di compilazione o di test dovrebbero essere specificate come @code{native-inputs}.
pt_br: As dependências Elisp dos pacotes Emacs são normalmente fornecidas como @code{propagated-inputs} quando necessário em tempo de execução. Quanto a outros pacotes, as dependências de construção ou teste devem ser especificadas como @code{native-inputs}.

source: Emacs packages sometimes depend on resources directories that should be installed along the Elisp files. The @code{#:include} argument can be used for that purpose, by specifying a list of regexps to match. The best practice when using the @code{#:include} argument is to extend rather than override its default value (accessible via the @code{%default-include} variable). As an example, a yasnippet extension package typically include a @file{snippets} directory, which could be copied to the installation directory using:
it: I pacchetti Emacs a volte dipendono da directory di risorse che dovrebbero essere installate insieme ai file Elisp. L'argomento @code{#:include} può essere usato a questo scopo, specificando una lista di espressioni regolari da corrispondere. La buona pratica quando si usa l'argomento @code{#:include} è di estendere piuttosto che sovrascrivere il suo valore predefinito (accessibile tramite la variabile @code{%default-include}). Ad esempio, un pacchetto di estensione yasnippet include tipicamente una directory @file{snippets}, che potrebbe essere copiata nella directory di installazione usando:
pt_br: Pacotes Emacs às vezes dependem de diretórios de recursos que devem ser instalados junto com os arquivos Elisp. O argumento @code{#:include} pode ser usado para esse propósito, especificando uma lista de regexps para corresponder. A melhor prática ao usar o argumento @code{#:include} é estender em vez de substituir seu valor padrão (acessível por meio da variável @code{%default-include}). Como exemplo, um pacote de extensão yasnippet normalmente inclui um diretório @file{snippets}, que pode ser copiado para o diretório de instalação usando:

source: When encountering problems, it is wise to check for the presence of the @code{Package-Requires} extension header in the package main source file, and whether any dependencies and their versions listed therein are satisfied.
it: Quando si incontrano problemi, è saggio verificare la presenza dell'header dell'estensione @code{Package-Requires} nel file sorgente principale del pacchetto, e se tutte le dipendenze e le loro versioni elencate lì sono soddisfatte.
pt_br: Ao encontrar problemas, é aconselhável verificar a presença do cabeçalho de extensão @code{Package-Requires} no arquivo de origem principal do pacote e se quaisquer dependências e suas versões listadas nele foram atendidas.

source: We currently package Python 2 and Python 3, under the Scheme variable names @code{python-2} and @code{python} as explained in @ref{Version Numbers}. To avoid confusion and naming clashes with other programming languages, it seems desirable that the name of a package for a Python module contains the word @code{python}.
it: Attualmente pacchettizziamo Python 2 e Python 3, con i nomi di variabile Scheme @code{python-2} e @code{python} come spiegato in @ref{Version Numbers}. Per evitare confusione e conflitti di nomi con altri linguaggi di programmazione, sembra desiderabile che il nome di un pacchetto per un modulo Python contenga la parola @code{python}.
pt_br: Atualmente empacotamos Python 2 e Python 3, sob os nomes de variável Scheme @code{python-2} e @code{python} conforme explicado em @ref{Version Numbers}. Para evitar confusão e conflitos de nomes com outras linguagens de programação, parece desejável que o nome de um pacote para um módulo Python contenha a palavra @code{python}.

source: Some modules are compatible with only one version of Python, others with both. If the package Foo is compiled with Python 3, we name it @code{python-foo}. If it is compiled with Python 2, we name it @code{python2-foo}. Python 2 packages are being removed from the distribution; please do no not submit any new Python 2 packages.
it: Alcuni moduli sono compatibili solo con una versione di Python, altri con entrambe. Se il pacchetto Foo è compilato con Python 3, lo chiamiamo @code{python-foo}. Se è compilato con Python 2, lo chiamiamo @code{python2-foo}. I pacchetti Python 2 vengono rimossi dalla distribuzione; per favore non inviare nuovi pacchetti Python 2.
pt_br: Alguns módulos são compatíveis com apenas uma versão do Python, outros com ambas. Se o pacote Foo for compilado com Python 3, nós o nomeamos @code{python-foo}. Se ele for compilado com Python 2, nós o nomeamos @code{python2-foo}. Pacotes Python 2 estão sendo removidos da distribuição; por favor, não envie nenhum pacote Python 2 novo.

source: If a project already contains the word @code{python}, we drop this; for instance, the module python-dateutil is packaged under the names @code{python-dateutil} and @code{python2-dateutil}. If the project name starts with @code{py} (e.g.@: @code{pytz}), we keep it and prefix it as described above.
it: Se un progetto contiene già la parola @code{python}, la omettiamo; ad esempio, il modulo python-dateutil è pacchettizzato con i nomi @code{python-dateutil} e @code{python2-dateutil}. Se il nome del progetto inizia con @code{py} (es: @code{pytz}), lo manteniamo e lo prefissiamo come descritto sopra.
pt_br: Se um projeto já contém a palavra @code{python}, nós a descartamos; por exemplo, o módulo python-dateutil é empacotado sob os nomes @code{python-dateutil} e @code{python2-dateutil}. Se o nome do projeto começa com @code{py} (p.ex., @code{pytz}), nós o mantemos e o prefixamos conforme descrito acima.

source: Currently there are two different build systems for Python packages in Guix: @var{python-build-system} and @var{pyproject-build-system}. For the longest time, Python packages were built from an informally specified @file{setup.py} file. That worked amazingly well, considering Python's success, but was difficult to build tooling around. As a result, a host of alternative build systems emerged and the community eventually settled on a @url{https://peps.python.org/pep-0517/, formal standard} for specifying build requirements. @var{pyproject-build-system} is Guix's implementation of this standard. It is considered ``experimental'' in that it does not yet support all the various PEP-517 @emph{build backends}, but you are encouraged to try it for new Python packages and report any problems. It will eventually be deprecated and merged into @var{python-build-system}.
it: Attualmente ci sono due diversi sistemi di compilazione per i pacchetti Python in Guix: @var{python-build-system} e @var{pyproject-build-system}. Per molto tempo, i pacchetti Python venivano costruiti da un file @file{setup.py} specificato informalmente. Questo ha funzionato sorprendentemente bene, considerando il successo di Python, ma era difficile costruire strumenti attorno ad esso. Di conseguenza, sono emersi una serie di sistemi di compilazione alternativi e la comunità alla fine si è stabilizzata su uno @url{https://peps.python.org/pep-0517/, standard formale} per specificare i requisiti di compilazione. @var{pyproject-build-system} è l'implementazione di Guix di questo standard. È considerato ``sperimentale'' in quanto non supporta ancora tutti i vari @emph{backend di compilazione} PEP-517, ma sei incoraggiato a provarlo per nuovi pacchetti Python e a segnalare eventuali problemi. Alla fine verrà deprecato e fuso in @var{python-build-system}.
pt_br: Atualmente, há dois sistemas de construção diferentes para pacotes Python no Guix: @var{python-build-system} e @var{pyproject-build-system}. Por muito tempo, os pacotes Python foram construídos a partir de um arquivo @file{setup.py} especificado informalmente. Isso funcionou incrivelmente bem, considerando o sucesso do Python, mas era difícil construir ferramentas em torno dele. Como resultado, uma série de sistemas de construção alternativos surgiram e a comunidade eventualmente decidiu por um @url{https://peps.python.org/pep-0517/, padrão formal} para especificar os requisitos de construção. @var{pyproject-build-system} é a implementação do Guix desse padrão. Ele é considerado ``experimental'', pois ainda não suporta todos os vários @emph{backends de construção} PEP-517, mas você é encorajado a experimentá-lo para novos pacotes Python e relatar quaisquer problemas. Ele eventualmente será descontinuado e mesclado ao @var{python-build-system}.

source: Specifying Dependencies
it: Specifica delle dipendenze
pt_br: Especificando dependências

source: inputs, for Python packages
it: input, per i pacchetti Python
pt_br: entradas, para pacotes Python

source: Dependency information for Python packages is usually available in the package source tree, with varying degrees of accuracy: in the @file{pyproject.toml} file, the @file{setup.py} file, in @file{requirements.txt}, or in @file{tox.ini} (the latter mostly for test dependencies).
it: Le informazioni sulle dipendenze per i pacchetti Python sono di solito disponibili nell'albero dei sorgenti del pacchetto, con vari gradi di precisione: nel file @file{pyproject.toml}, nel file @file{setup.py}, in @file{requirements.txt}, o in @file{tox.ini} (quest'ultimo principalmente per le dipendenze di test).
pt_br: Informações de dependências para pacotes Python estão geralmente disponíveis na árvore de fonte do pacote, com variados graus de precisão nos arquivos: @file{setup.py}, @file{requirements.txt} ou @file{tox.ini} (este último principalmente para testes de dependência).

source: Your mission, when writing a recipe for a Python package, is to map these dependencies to the appropriate type of ``input'' (@pxref{package Reference, inputs}). Although the @code{pypi} importer normally does a good job (@pxref{Invoking guix import}), you may want to check the following check list to determine which dependency goes where.
it: La tua missione, quando scrivi una ricetta per un pacchetto Python, è di mappare queste dipendenze al tipo appropriato di ``input'' (@pxref{package Reference, inputs}). Sebbene l'importatore @code{pypi} faccia normalmente un buon lavoro (@pxref{Invoking guix import}), potresti voler controllare la seguente lista di controllo per determinare quale dipendenza va dove.
pt_br: Sua missão, ao escrever uma receita para um pacote Python, é mapear essas dependências para o tipo apropriado de ``entrada'' (@pxref{package Reference, inputs}). Apesar do importador do @code{pypi} normalmente fazer um bom trabalho (@pxref{Invoking guix import}), você pode se interessar em verificar a lista de verificação a seguir para determinar qual dependência vai onde.

source: We currently package Python with @code{setuptools} and @code{pip} installed per default. This is about to change, and users are encouraged to use @code{python-toolchain} if they want a build environment for Python.
it: Attualmente pacchettizziamo Python con @code{setuptools} e @code{pip} installati per impostazione predefinita. Questo sta per cambiare, e gli utenti sono incoraggiati a usare @code{python-toolchain} se desiderano un ambiente di compilazione per Python.
pt_br: Atualmente empacotamos Python com @code{setuptools} e @code{pip} instalados por padrão. Isto está prestes a mudar, e os usuários são encorajados a usar o @code{python-toolchain} se quiserem um ambiente de construção para Python.

source: @command{guix lint} will warn if @code{setuptools} or @code{pip} are added as native-inputs because they are generally not necessary.
it: @command{guix lint} avvertirà se @code{setuptools} o @code{pip} vengono aggiunti come native-inputs perché generalmente non sono necessari.
pt_br: @command{guix lint} avisará se @code{setuptools} ou @code{pip} forem adicionados como entradas nativas porque geralmente não são necessários.

source: Python dependencies required at run time go into @code{propagated-inputs}. They are typically defined with the @code{install_requires} keyword in @file{setup.py}, or in the @file{requirements.txt} file.
it: Le dipendenze Python richieste a runtime vanno in @code{propagated-inputs}. Sono tipicamente definite con la parola chiave @code{install_requires} in @file{setup.py}, o nel file @file{requirements.txt}.
pt_br: Dependências de Python necessárias em tempo de execução vão em @code{propagated-inputs}. Elas geralmente são definidas com a palavra-chave @code{install_requires} em @file{setup.py} ou no arquivo @file{requirements.txt}.

source: Python packages required only at build time---e.g., those listed under @code{build-system.requires} in @file{pyproject.toml} or with the @code{setup_requires} keyword in @file{setup.py}---or dependencies only for testing---e.g., those in @code{tests_require} or @file{tox.ini}---go into @code{native-inputs}. The rationale is that (1) they do not need to be propagated because they are not needed at run time, and (2) in a cross-compilation context, it's the ``native'' input that we'd want.
it: I pacchetti Python richiesti solo in fase di compilazione --- ad esempio, quelli elencati sotto @code{build-system.requires} in @file{pyproject.toml} o con la parola chiave @code{setup_requires} in @file{setup.py} --- o le dipendenze solo per i test --- ad esempio, quelle in @code{tests_require} o @file{tox.ini} --- vanno in @code{native-inputs}. La logica è che (1) non hanno bisogno di essere propagate perché non sono necessarie a runtime, e (2) in un contesto di compilazione incrociata, è l'input ``nativo'' che vorremmo.
pt_br: Pacotes Python necessários apenas em tempo de compilação --- e.g., aqueles listados sob @code{build-system.requires} no @file{pyproject.toml} ou com a palavra-chave @code{setup_requires} no @file{setup.py} --- ou dependencias apenas para teste --- e.g., aqueles no @code{tests_require} ou no @file{tox.ini} --- vão no @code{native-inputs}. A razão é que (1) eles não precisam ser propagados porque não são necessários em tempo de execução e (2) em um contexto de compilação cruzada, é a entrada ``nativa'' que nós queríamo.

source: Examples are the @code{pytest}, @code{mock}, and @code{nose} test frameworks. Of course if any of these packages is also required at run-time, it needs to go to @code{propagated-inputs}.
it: Esempi sono i framework di test @code{pytest}, @code{mock} e @code{nose}. Naturalmente, se uno di questi pacchetti è richiesto anche a runtime, deve andare in @code{propagated-inputs}.
pt_br: Exemplos são os frameworks de teste @code{pytest}, @code{mock} e @code{nose}. É claro, se qualquer um desses pacotes também for necessário em tempo de compilação, ele precisa ir para @code{propagated-inputs}.
