Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Set up GnuPG such that it never uses the SHA1 hash algorithm for digital signatures, which is known to be unsafe since 2019, for instance by adding the following line to @file{~/.gnupg/gpg.conf} (@pxref{GPG Esoteric Options,,, gnupg, The GNU Privacy Guard Manual}):
it: Configura GnuPG in modo che non usi mai l'algoritmo di hash SHA1 per le firme digitali, che è noto per essere insicuro dal 2019, ad esempio aggiungendo la seguente riga a @file{~/.gnupg/gpg.conf} (@pxref{GPG Esoteric Options,,, gnupg, The GNU Privacy Guard Manual}):
pt_br: Configure o GnuPG de forma que ele nunca use o algoritmo de hash SHA1 para assinaturas digitais, que é conhecido por ser inseguro desde 2019, por exemplo, adicionando a seguinte linha em @file{~/.gnupg/gpg.conf} (@pxref{GPG Esoteric Options,,, gnupg, The GNU Privacy Guard Manual}):

source: Maintainers ultimately decide whether to grant you commit access, usually following your referrals' recommendation.
it: I maintainer decidono in ultima istanza se concederti l'accesso in commit, di solito seguendo la raccomandazione dei tuoi referenti.
pt_br: Os mantenedores decidem, em última instância, se lhe concedem acesso de confirmação, geralmente seguindo a recomendação das suas referências.

source: OpenPGP, signed commits
it: OpenPGP, commit firmati
pt_br: OpenPGP, confirmações assinadas

source: If and once you've been given access, please send a message to @email{guix-devel@@gnu.org} to say so, again signed with the OpenPGP key you will use to sign commits (do that before pushing your first commit). That way, everyone can notice and ensure you control that OpenPGP key.
it: Se e una volta che ti è stato concesso l'accesso, invia un messaggio a @email{guix-devel@@gnu.org} per dirlo, di nuovo firmato con la chiave OpenPGP che userai per firmare i commit (fallo prima di inviare il tuo primo commit). In questo modo, tutti possono notare e assicurarsi che tu controlli quella chiave OpenPGP.
pt_br: Se e uma vez que você tenha recebido acesso, envie uma mensagem para @email{guix-devel@@gnu.org} para dizer isso, novamente assinada com a chave OpenPGP que você usará para assinar os commits (faça isso antes de enviar seu primeiro commit). Dessa forma, todos podem notar e garantir que você controle essa chave OpenPGP.

source: Important
it: Importante
pt_br: Importante

source: Before you can push for the first time, maintainers must:
it: Prima che tu possa inviare per la prima volta, i maintainer devono:
pt_br: Antes de poder fazer push pela primeira vez, os mantenedores devem:

source: add your OpenPGP key to the @code{keyring} branch;
it: aggiungere la tua chiave OpenPGP al ramo @code{keyring};
pt_br: adicione sua chave OpenPGP à ramificação @code{keyring};

source: add your OpenPGP fingerprint to the @file{.guix-authorizations} file of the branch(es) you will commit to.
it: aggiungere la tua impronta digitale OpenPGP al file @file{.guix-authorizations} del/dei ramo/i in cui effettuerai commit.
pt_br: adicione sua impressão digital OpenPGP ao arquivo @file{.guix-authorizations} da(s) ramificação(ões) para as quais você fará o commit.

source: Make sure to read the rest of this section and... profit!
it: Assicurati di leggere il resto di questa sezione e... buon profitto!
pt_br: Não deixe de ler o restante desta seção e... lucre!

source: Maintainers are happy to give commit access to people who have been contributing for some time and have a track record---don't be shy and don't underestimate your work!
it: I maintainer sono felici di dare accesso in commit a persone che hanno contribuito per un po' di tempo e hanno un track record---non essere timido e non sottovalutare il tuo lavoro!
pt_br: Os mantenedores ficarão felizes em dar acesso de comprometimento a pessoas que contribuem há algum tempo e têm um histórico. Não seja tímido e não subestime seu trabalho!

source: However, note that the project is working towards a more automated patch review and merging system, which, as a consequence, may lead us to have fewer people with commit access to the main repository. Stay tuned!
it: Tuttavia, nota che il progetto sta lavorando verso un sistema più automatizzato di revisione e unione delle patch, che, di conseguenza, potrebbe portarci ad avere meno persone con accesso in commit al repository principale. Rimani sintonizzato!
pt_br: No entanto, observe que o projeto está trabalhando em direção a um sistema de revisão e mesclagem de patches mais automatizado, o que, como consequência, pode nos levar a ter menos pessoas com acesso de commit ao repositório principal. Fique ligado!

source: All commits that are pushed to the central repository on Codeberg must be signed with an OpenPGP key, and the public key should be uploaded to your user account on Codeberg and to public key servers, such as @code{keys.openpgp.org}. To configure Git to automatically sign commits, run:
it: Tutti i commit inviati al repository centrale su Codeberg devono essere firmati con una chiave OpenPGP e la chiave pubblica dovrebbe essere caricata sul tuo account utente su Codeberg e su server di chiavi pubblici, come @code{keys.openpgp.org}. Per configurare Git per firmare automaticamente i commit, esegui:
pt_br: Todos os commits que são enviados para o repositório central no Codeberg devem ser assinados com uma chave OpenPGP, e a chave pública deve ser carregada para sua conta de usuário no Codeberg e para servidores de chave pública, como @code{keys.openpgp.org}. Para configurar o Git para assinar commits automaticamente, execute:

source: # Substitute the fingerprint of your public PGP key. git config user.signingkey CABBA6EA1DC0FF33
it: # Sostituisci l'impronta digitale della tua chiave PGP pubblica. git config user.signingkey CABBA6EA1DC0FF33
pt_br: # Substitua a impressão digital da sua chave PGP pública. git config user.signingkey CABBA6EA1DC0FF33

source: To check that commits are signed with correct key, use:
it: Per verificare che i commit siano firmati con la chiave corretta, usa:
pt_br: Para verificar se os commits estão assinados com a chave correta, use:

source: @xref{Building from Git} for running the first authentication of a Guix checkout.
it: @xref{Building from Git} per eseguire la prima autenticazione di un checkout di Guix.
pt_br: @xref{Building from Git} para executar a primeira autenticação de um checkout do Guix.

source: To avoid accidentally pushing unsigned or signed with the wrong key commits to Codeberg, make sure to configure Git according to @xref{Configuring Git}.
it: Per evitare di inviare accidentalmente commit non firmati o firmati con la chiave sbagliata a Codeberg, assicurati di configurare Git secondo @xref{Configuring Git}.
pt_br: Para evitar enviar acidentalmente commits não assinados ou assinados com a chave errada para o Codeberg, certifique-se de configurar o Git de acordo com @xref{Configuring Git}.

source: Commit Policy
it: Politica dei Commit
pt_br: Política de Comprometimento

source: If you get commit access, please make sure to follow the policy below (discussions of the policy can take place on @email{guix-devel@@gnu.org}).
it: Se ottieni l'accesso in commit, assicurati di seguire la politica seguente (le discussioni sulla politica possono aver luogo su @email{guix-devel@@gnu.org}).
pt_br: Se você obtiver acesso de confirmação, certifique-se de seguir a política abaixo (as discussões sobre a política podem ocorrer em @email{guix-devel@@gnu.org}).

source: Ensure you're aware of how the changes should be handled (@pxref{Managing Patches and Branches}) prior to being pushed to the repository, especially for the @code{master} branch.
it: Assicurati di essere consapevole di come le modifiche dovrebbero essere gestite (@pxref{Managing Patches and Branches}) prima di essere inviate al repository, specialmente per il ramo @code{master}.
pt_br: Certifique-se de estar ciente de como as alterações devem ser tratadas (@pxref{Managing Patches and Branches}) antes de serem enviadas ao repositório, especialmente para a ramificação @code{master}.

source: If you're committing and pushing your own changes, try and wait at least one week (two weeks for more significant changes, up to one month for changes such as removing a package---@pxref{package-removal-policy, Package Removal}) after you send them for review. After this, if no one else is available to review them and if you're confident about the changes, it's OK to commit.
it: Se stai effettuando commit e inviando le tue modifiche, cerca di attendere almeno una settimana (due settimane per modifiche più significative, fino a un mese per modifiche come la rimozione di un pacchetto---@pxref{package-removal-policy, Package Removal}) dopo averle inviate per la revisione. Dopo ciò, se nessun altro è disponibile per revisionarle e sei sicuro delle modifiche, va bene effettuare il commit.
pt_br: Se você estiver fazendo commit e enviando suas próprias alterações, tente esperar pelo menos uma semana (duas semanas para alterações mais significativas, até um mês para alterações como remover um pacote---@pxref{package-removal-policy, Remoção de Pacotes}) depois de enviá-las para revisão. Depois disso, se ninguém mais estiver disponível para revisá-las e se você estiver confiante sobre as alterações, está tudo bem fazer commit.

source: When pushing a commit on behalf of somebody else, please add a @code{Signed-off-by} line at the end of the commit log message---e.g., with @command{git am --signoff}. This improves tracking of who did what.
it: Quando invii un commit per conto di qualcun altro, aggiungi una linea @code{Signed-off-by} alla fine del messaggio di log del commit---ad esempio, con @command{git am --signoff}. Ciò migliora il tracciamento di chi ha fatto cosa.
pt_br: Ao enviar um commit em nome de outra pessoa, adicione uma linha @code{Signed-off-by} no final da mensagem de log do commit---por exemplo, com @command{git am --signoff}. Isso melhora o rastreamento de quem fez o quê.

source: When adding channel news entries (@pxref{Channels, Writing Channel News}), make sure they are well-formed by running the following command right before pushing:
it: Quando aggiungi voci di notizie dei canali (@pxref{Channels, Writing Channel News}), assicurati che siano ben formate eseguendo il seguente comando appena prima di inviare:
pt_br: Ao adicionar entradas de notícias do canal (@pxref{Channels, Escrevendo Notícias do Canal}), certifique-se de que elas estejam bem formadas executando o seguinte comando antes de enviar:

source: Addressing Issues
it: Affrontare i Problemi
pt_br: Abordando questões

source: Peer review (@pxref{Submitting Patches}) and tools such as @command{guix lint} (@pxref{Invoking guix lint}) and the test suite (@pxref{Running the Test Suite}) should catch issues before they are pushed. Yet, commits that ``break'' functionality might occasionally go through. When that happens, there are two priorities: mitigating the impact, and understanding what happened to reduce the chance of similar incidents in the future. The responsibility for both these things primarily lies with those involved, but like everything this is a group effort.
it: La revisione tra pari (@pxref{Submitting Patches}) e strumenti come @command{guix lint} (@pxref{Invoking guix lint}) e la suite di test (@pxref{Running the Test Suite}) dovrebbero rilevare i problemi prima che siano inviati. Tuttavia, commit che ``rompono'' funzionalità potrebbero occasionalmente passare. Quando ciò accade, ci sono due priorità: mitigare l'impatto e capire cosa è successo per ridurre la possibilità di incidenti simili in futuro. La responsabilità per entrambe queste cose ricade principalmente su quelli coinvolti, ma come tutto questo è uno sforzo di gruppo.
pt_br: A revisão por pares (@pxref{Submitting Patches}) e ferramentas como @command{guix lint} (@pxref{Invoking guix lint}) e o conjunto de testes (@pxref{Running the Test Suite}) devem detectar problemas antes que eles sejam enviados. No entanto, confirmações que ``quebram'' a funcionalidade podem ocasionalmente passar. Quando isso acontece, há duas prioridades: mitigar o impacto e entender o que aconteceu para reduzir a chance de incidentes semelhantes no futuro. A responsabilidade por ambas as coisas recai principalmente sobre os envolvidos, mas, como tudo, este é um esforço de grupo.

source: Some issues can directly affect all users---for instance because they make @command{guix pull} fail or break core functionality, because they break major packages (at build time or run time), or because they introduce known security vulnerabilities.
it: Alcuni problemi possono influenzare direttamente tutti gli utenti---ad esempio perché fanno fallire @command{guix pull} o rompono funzionalità fondamentali, perché rompono pacchetti principali (al momento della build o dell'esecuzione), o perché introducono vulnerabilità di sicurezza note.
pt_br: Alguns problemas podem afetar diretamente todos os usuários, por exemplo, porque fazem com que @command{guix pull} falhe ou interrompa a funcionalidade principal, porque interrompem pacotes importantes (em tempo de compilação ou execução) ou porque introduzem vulnerabilidades de segurança conhecidas.

source: reverting commits
it: revert dei commit
pt_br: revertendo commits

source: The people involved in authoring, reviewing, and pushing such commit(s) should be at the forefront to mitigate their impact in a timely fashion: by pushing a followup commit to fix it (if possible), or by reverting it to leave time to come up with a proper fix, and by communicating with other developers about the problem.
it: Le persone coinvolte nella creazione, revisione e invio di tali commit dovrebbero essere in prima linea per mitigare il loro impatto in modo tempestivo: inviando un commit di followup per risolverlo (se possibile), o revertendolo per lasciare tempo per trovare una soluzione corretta, e comunicando con altri sviluppatori sul problema.
pt_br: As pessoas envolvidas na criação, revisão e envio de tais confirmações devem estar na vanguarda para mitigar seu impacto em tempo hábil: enviando uma confirmação de acompanhamento para corrigi-lo (se possível) ou revertendo-o para dar tempo de encontrar uma correção adequada e comunicando-se com outros desenvolvedores sobre o problema.

source: If these persons are unavailable to address the issue in time, other committers are entitled to revert the commit(s), explaining in the commit log and on the mailing list what the problem was, with the goal of leaving time to the original committer, reviewer(s), and author(s) to propose a way forward.
it: Se queste persone non sono disponibili per affrontare il problema in tempo, altri committer hanno il diritto di revertare i commit, spiegando nel log del commit e nella mailing list qual era il problema, con l'obiettivo di lasciare tempo al committer originale, ai revisori e agli autori di proporre una via da seguire.
pt_br: Se essas pessoas não estiverem disponíveis para resolver o problema a tempo, outros responsáveis pelo commit têm o direito de reverter o(s) commit(s), explicando no log de commits e na lista de discussão qual era o problema, com o objetivo de dar tempo ao responsável pelo commit original, revisor(es) e autor(es) para propor um caminho a seguir.

source: Once the problem has been dealt with, it is the responsibility of those involved to make sure the situation is understood. If you are working to understand what happened, focus on gathering information and avoid assigning any blame. Do ask those involved to describe what happened, do not ask them to explain the situation---this would implicitly blame them, which is unhelpful. Accountability comes from a consensus about the problem, learning from it and improving processes so that it's less likely to reoccur.
it: Una volta affrontato il problema, è responsabilità di quelli coinvolti assicurarsi che la situazione sia compresa. Se stai lavorando per capire cosa è successo, concentrati sulla raccolta di informazioni ed evita di assegnare colpe. Chiedi a quelli coinvolti di descrivere cosa è successo, non chiedere loro di spiegare la situazione---questo implicherebbe implicitamente incolparli, il che non è utile. La responsabilità deriva da un consenso sul problema, imparare da esso e migliorare i processi in modo che sia meno probabile che si ripeta.
pt_br: Uma vez que o problema tenha sido resolvido, é responsabilidade dos envolvidos garantir que a situação seja compreendida. Se você estiver trabalhando para entender o que aconteceu, concentre-se em reunir informações e evite atribuir qualquer culpa. Peça aos envolvidos para descrever o que aconteceu, não peça para eles explicarem a situação --- isso os culparia implicitamente, o que não ajuda. A responsabilização vem de um consenso sobre o problema, aprendendo com ele e melhorando os processos para que seja menos provável que ele ocorra novamente.

source: In order to reduce the possibility of mistakes, committers will have their Codeberg account removed from the Guix Codeberg project and their key removed from @file{.guix-authorizations} after 12 months of inactivity; they can ask to regain commit access by emailing the maintainers, without going through the vouching process.
it: Per ridurre la possibilità di errori, i committer avranno il loro account Codeberg rimosso dal progetto Guix Codeberg e la loro chiave rimossa da @file{.guix-authorizations} dopo 12 mesi di inattività; possono richiedere di riottenere l'accesso in commit inviando un'email ai maintainer, senza passare attraverso il processo di garanzia.
pt_br: Para reduzir a possibilidade de erros, os responsáveis pelo commit terão suas contas Codeberg removidas do projeto Guix em Codeberg e suas chaves removidas de @file{.guix-authorizations} após 12 meses de inatividade; eles podem solicitar o acesso de commit novamente enviando um e-mail aos mantenedores, sem passar pelo processo de garantia.

source: Maintainers@footnote{See @uref{https://guix.gnu.org/en/about} for the current list of maintainers. You can email them privately at @email{guix-maintainers@@gnu.org}.} may also revoke an individual's commit rights, as a last resort, if cooperation with the rest of the community has caused too much friction---even within the bounds of the project's code of conduct (@pxref{Contributing}). They would only do so after public or private discussion with the individual and a clear notice. Examples of behavior that hinders cooperation and could lead to such a decision include:
it: I maintainer@footnote{Vedi @uref{https://guix.gnu.org/en/about} per l'elenco attuale dei maintainer. Puoi inviare loro email privatamente a @email{guix-maintainers@@gnu.org}.} possono anche revocare i diritti di commit di un individuo, come ultima risorsa, se la cooperazione con il resto della comunità ha causato troppa attrito---anche entro i limiti del codice di condotta del progetto (@pxref{Contributing}). Lo farebbero solo dopo una discussione pubblica o privata con l'individuo e un chiaro preavviso. Esempi di comportamento che ostacola la cooperazione e potrebbe portare a una tale decisione includono:
pt_br: Mantenedores@footnote{Veja @uref{https://guix.gnu.org/pt-BR/about} para a lista atual de mantenedores. Você pode enviar um e-mail privado para eles em @email{guix-maintainers@@gnu.org}.} também pode revogar os direitos de commit de um indivíduo, como último recurso, se a cooperação com o resto da comunidade tiver causado muito atrito --- mesmo dentro dos limites do código de conduta do projeto (@pxref{Contributing}). Eles só fariam isso após discussão pública ou privada com o indivíduo e um aviso claro. Exemplos de comportamento que dificulta a cooperação e pode levar a tal decisão incluem:

source: repeated violation of the commit policy stated above;
it: violazione ripetuta della politica dei commit sopra indicata;
pt_br: violação repetida da política de compromisso declarada acima;

source: repeated failure to take peer criticism into account;
it: mancato ripetuto di tenere conto delle critiche dei pari;
pt_br: falha repetida em levar em consideração as críticas dos colegas;

source: breaching trust through a series of grave incidents.
it: violazione della fiducia attraverso una serie di incidenti gravi.
pt_br: quebrando a confiança através de uma série de incidentes graves.

source: When maintainers resort to such a decision, they notify developers on @email{guix-devel@@gnu.org}; inquiries may be sent to @email{guix-maintainers@@gnu.org}. Depending on the situation, the individual may still be welcome to contribute.
it: Quando i maintainer ricorrono a una tale decisione, notificano gli sviluppatori su @email{guix-devel@@gnu.org}; le richieste possono essere inviate a @email{guix-maintainers@@gnu.org}. A seconda della situazione, l'individuo potrebbe ancora essere il benvenuto a contribuire.
pt_br: Quando os mantenedores recorrem a tal decisão, eles notificam os desenvolvedores em @email{guix-devel@@gnu.org}; consultas podem ser enviadas para @email{guix-maintainers@@gnu.org}. Dependendo da situação, o indivíduo ainda pode ser bem-vindo para contribuir.

source: Helping Out
it: Dare una Mano
pt_br: Ajudando

source: One last thing: the project keeps moving forward because committers not only push their own awesome changes, but also offer some of their time @emph{reviewing} and pushing other people's changes. As a committer, you're welcome to use your expertise and commit rights to help other contributors, too!
it: Un'ultima cosa: il progetto continua ad avanzare perché i committer non solo inviare le loro fantastiche modifiche, ma offrono anche parte del loro tempo a @emph{revisionare} e inviare le modifiche di altre persone. Come committer, sei il benvenuto a usare la tua esperienza e i tuoi diritti di commit per aiutare anche altri contributori!
pt_br: Uma última coisa: o projeto continua avançando porque os committers não apenas empurram suas próprias mudanças incríveis, mas também oferecem parte do seu tempo @emph{revisando} e empurrando as mudanças de outras pessoas. Como committer, você é bem-vindo para usar sua expertise e direitos de commit para ajudar outros contribuidores também!

source: Review comments should be unambiguous; be as clear and explicit as you can about what you think should be changed, ensuring the author can take action on it. Please try to keep the following guidelines in mind during review:
it: I commenti di revisione dovrebbero essere inequivocabili; sii il più chiaro ed esplicito possibile su cosa pensi debba essere cambiato, assicurandoti che l'autore possa agire su di esso. Per favore cerca di tenere a mente le seguenti linee guida durante la revisione:
pt_br: Comentários de revisão devem ser inequívocos; seja o mais claro e explícito possível sobre o que você acha que deve ser alterado, garantindo que o autor possa tomar medidas sobre isso. Tente manter as seguintes diretrizes em mente durante a revisão:

source: @emph{Be clear and explicit about changes you are suggesting}, ensuring the author can take action on it. In particular, it is a good idea to explicitly ask for new revisions when you want it.
it: @emph{Sii chiaro ed esplicito riguardo alle modifiche che stai suggerendo}, assicurandoti che l'autore possa agire su di esse. In particolare, è una buona idea chiedere esplicitamente nuove revisioni quando le vuoi.
pt_br: @emph{Seja claro e explícito sobre as mudanças que você está sugerindo}, garantindo que o autor possa agir sobre isso. Em particular, é uma boa ideia pedir explicitamente por novas revisões quando você quiser.
