Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The text changed from ``The following derivations would be built'' to ``112.3 MB would be downloaded''. This indicates that substitutes from the configured substitute servers are usable and will be downloaded, when possible, for future builds.
pt_br: O texto mudou de "As seguintes derivações seriam construídas'' para "112,3 MB seriam baixados''. Isso indica que os substitutos dos servidores substitutos configurados são utilizáveis e serão baixados, quando possível, para construções futuras.

source: substitutes, how to disable
pt_br: substitutos, como desabilitar

source: The substitute mechanism can be disabled globally by running @code{guix-daemon} with @option{--no-substitutes} (@pxref{Invoking guix-daemon}). It can also be disabled temporarily by passing the @option{--no-substitutes} option to @command{guix package}, @command{guix build}, and other command-line tools.
pt_br: O mecanismo de substituição pode ser desabilitado globalmente executando @code{guix-daemon} com @option{--no-substitutes} (@pxref{Invoking guix-daemon}). Ele também pode ser desabilitado temporariamente passando a opção @option{--no-substitutes} para @command{guix package}, @command{guix build} e outras ferramentas de linha de comando.

source: substitute servers, adding more
pt_br: servidores substitutos, adicionando mais

source: Guix can look up and fetch substitutes from several servers. This is useful when you are using packages from additional channels for which the official server does not have substitutes but another server provides them. Another situation where this is useful is when you would prefer to download from your organization's substitute server, resorting to the official server only as a fallback or dismissing it altogether.
pt_br: Guix pode procurar e buscar substitutos de vários servidores. Isso é útil quando você está usando pacotes de canais adicionais para os quais o servidor oficial não tem substitutos, mas outro servidor os fornece. Outra situação em que isso é útil é quando você prefere baixar do servidor substituto da sua organização, recorrendo ao servidor oficial apenas como um fallback ou descartando-o completamente.

source: You can give Guix a list of substitute server URLs and it will check them in the specified order. You also need to explicitly authorize the public keys of substitute servers to instruct Guix to accept the substitutes they sign.
pt_br: Você pode dar ao Guix uma lista de URLs de servidores substitutos e ele irá verificá-los na ordem especificada. Você também precisa autorizar explicitamente as chaves públicas dos servidores substitutos para instruir o Guix a aceitar os substitutos que eles assinam.

source: On Guix System, this is achieved by modifying the configuration of the @code{guix} service. Since the @code{guix} service is part of the default lists of services, @code{%base-services} and @code{%desktop-services}, you can use @code{modify-services} to change its configuration and add the URLs and substitute keys that you want (@pxref{Service Reference, @code{modify-services}}).
pt_br: No Guix System, isso é obtido modificando a configuração do serviço @code{guix}. Como o serviço @code{guix} faz parte das listas padrão de serviços, @code{%base-services} e @code{%desktop-services}, você pode usar @code{modify-services} para alterar sua configuração e adicionar as URLs e chaves substitutas que você deseja (@pxref{Service Reference, @code{modify-services}}).

source: As an example, suppose you want to fetch substitutes from @code{guix.example.org} and to authorize the signing key of that server, in addition to the default @code{@value{SUBSTITUTE-SERVER-1}} and @code{@value{SUBSTITUTE-SERVER-2}}. The resulting operating system configuration will look something like:
pt_br: Como exemplo, suponha que você queira buscar substitutos de @code{guix.example.org} e autorizar a chave de assinatura desse servidor, além do padrão @code{@value{SUBSTITUTE-SERVER-1}} e @code{@value{SUBSTITUTE-SERVER-2}}. A configuração do sistema operacional resultante será algo como:

source: (operating-system ;; @dots{} (services ;; Assume we're starting from '%desktop-services'. Replace it ;; with the list of services you're actually using. (modify-services %desktop-services (guix-service-type config => (guix-configuration (inherit config) (substitute-urls (append (list "https://guix.example.org") %default-substitute-urls)) (authorized-keys (append (list (local-file "./key.pub")) %default-authorized-guix-keys)))))))
pt_br: (operating-system ;; @dots{} (services ;; Suponha que estamos começando com '%desktop-services'. Substitua-o ;; pela lista de serviços que você está realmente usando. (modify-services %desktop-services (guix-service-type config => (guix-configuration (inherit config) (substitute-urls (append (list "https://guix.example.org") %default-substitute-urls)) (authorized-keys (append (list (local-file "./key.pub")) %default-authorized-guix-keys)))))))

source: This assumes that the file @file{key.pub} contains the signing key of @code{guix.example.org}. With this change in place in your operating system configuration file (say @file{/etc/config.scm}), you can reconfigure and restart the @code{guix-daemon} service or reboot so the changes take effect:
pt_br: Isso pressupõe que o arquivo @file{key.pub} contém a chave de assinatura de @code{guix.example.org}. Com essa alteração em vigor no arquivo de configuração do seu sistema operacional (digamos @file{/etc/config.scm}), você pode reconfigurar e reiniciar o serviço @code{guix-daemon} ou reinicializar para que as alterações entrem em vigor:

source: If you're running Guix on a ``foreign distro'', you would instead take the following steps to get substitutes from additional servers:
pt_br: Se você estiver executando o Guix em uma "distribuição estrangeira'', você deve seguir os seguintes passos para obter substitutos de servidores adicionais:

source: Edit the service configuration file for @code{guix-daemon}; when using systemd, this is normally @file{/etc/systemd/system/guix-daemon.service}. Add the @option{--substitute-urls} option on the @command{guix-daemon} command line and list the URLs of interest (@pxref{daemon-substitute-urls, @code{guix-daemon --substitute-urls}}):
pt_br: Edite o arquivo de configuração de serviço para @code{guix-daemon}; ao usar systemd, normalmente é @file{/etc/systemd/system/guix-daemon.service}. Adicione a opção @option{--substitute-urls} na linha de comando @command{guix-daemon} e liste as URLs de interesse (@pxref{daemon-substitute-urls, @code{guix-daemon --substitute-urls}}):

source: Restart the daemon. For systemd, it goes like this:
pt_br: Reinicie o daemon. Para systemd, é assim:

source: Authorize the key of the new server (@pxref{Invoking guix archive}):
pt_br: Autorize a chave do novo servidor (@pxref{Invoking guix archive}):

source: Again this assumes @file{key.pub} contains the public key that @code{guix.example.org} uses to sign substitutes.
pt_br: Novamente, isso pressupõe que @file{key.pub} contém a chave pública que @code{guix.example.org} usa para assinar substitutos.

source: Now you're all set! Substitutes will be preferably taken from @code{https://guix.example.org}, using @code{@value{SUBSTITUTE-SERVER-1}} then @code{@value{SUBSTITUTE-SERVER-2}} as fallback options. Of course you can list as many substitute servers as you like, with the caveat that substitute lookup can be slowed down if too many servers need to be contacted.
pt_br: Agora você está pronto! Os substitutos serão preferencialmente retirados de @code{https://guix.example.org}, usando @code{@value{SUBSTITUTE-SERVER-1}} e então @code{@value{SUBSTITUTE-SERVER-2}} como opções de fallback. Claro que você pode listar quantos servidores substitutos quiser, com a ressalva de que a pesquisa de substitutos pode ser desacelerada se muitos servidores precisarem ser contatados.

source: To diagnose problems, you can run @command{guix weather}. For example, running:
pt_br: Para diagnosticar problemas, você pode executar @command{guix weather}. Por exemplo, executando:

source: not only tells you which of the currently-configured servers has substitutes for the @code{coreutils} package, it also reports whether one of these servers is unauthorized. @xref{Invoking guix weather}, for more information.
pt_br: não apenas informa qual dos servidores atualmente configurados tem substitutos para o pacote @code{coreutils}, mas também informa se um desses servidores não está autorizado. @xref{Invoking guix weather}, para mais informações.

source: Note that there are also situations where one may want to add the URL of a substitute server @emph{without} authorizing its key. @xref{Substitute Authentication}, to understand this fine point.
pt_br: Observe que também há situações em que é possível adicionar a URL de um servidor substituto @emph{sem} autorizar sua chave. @xref{Substitute Authentication}, para entender esse ponto.

source: digital signatures
pt_br: assinaturas digitais

source: Guix detects and raises an error when attempting to use a substitute that has been tampered with. Likewise, it ignores substitutes that are not signed, or that are not signed by one of the keys listed in the ACL.
pt_br: Guix detecta e gera um erro ao tentar usar um substituto que foi adulterado. Da mesma forma, ele ignora substitutos que não são assinados, ou que não são assinados por uma das chaves listadas na ACL.

source: There is one exception though: if an unauthorized server provides substitutes that are @emph{bit-for-bit identical} to those provided by an authorized server, then the unauthorized server becomes eligible for downloads. For example, assume we have chosen two substitute servers with this option:
pt_br: Há uma exceção, no entanto: se um servidor não autorizado fornecer substitutos que sejam @emph{bit-for-bit idênticos} aos fornecidos por um servidor autorizado, então o servidor não autorizado se torna elegível para downloads. Por exemplo, suponha que escolhemos dois servidores substitutos com esta opção:

source: If the ACL contains only the key for @samp{b.example.org}, and if @samp{a.example.org} happens to serve the @emph{exact same} substitutes, then Guix will download substitutes from @samp{a.example.org} because it comes first in the list and can be considered a mirror of @samp{b.example.org}. In practice, independent build machines usually produce the same binaries, thanks to bit-reproducible builds (see below).
pt_br: Se a ACL contiver apenas a chave para @samp{b.example.org}, e se @samp{a.example.org} servir os substitutos @emph{exatamente os mesmos}, então o Guix baixará os substitutos de @samp{a.example.org} porque ele vem primeiro na lista e pode ser considerado um espelho de @samp{b.example.org}. Na prática, máquinas de construção independentes geralmente produzem os mesmos binários, graças às construções reproduzíveis em bits (veja abaixo).

source: When using HTTPS, the server's X.509 certificate is @emph{not} validated (in other words, the server is not authenticated), contrary to what HTTPS clients such as Web browsers usually do. This is because Guix authenticates substitute information itself, as explained above, which is what we care about (whereas X.509 certificates are about authenticating bindings between domain names and public keys).
pt_br: Ao usar HTTPS, o certificado X.509 do servidor é @emph{não} validado (em outras palavras, o servidor não é autenticado), ao contrário do que os clientes HTTPS, como navegadores da Web, geralmente fazem. Isso ocorre porque o Guix autentica as próprias informações substitutas, conforme explicado acima, que é o que nos importa (enquanto os certificados X.509 são sobre autenticação de ligações entre nomes de domínio e chaves públicas).

source: Substitutes are downloaded over HTTP or HTTPS@. The @env{http_proxy} and @env{https_proxy} environment variables can be set in the environment of @command{guix-daemon} and are honored for downloads of substitutes. Note that the value of those environment variables in the environment where @command{guix build}, @command{guix package}, and other client commands are run has @emph{absolutely no effect}.
pt_br: Os substitutos são baixados por HTTP ou HTTPS@. As variáveis de ambiente @env{http_proxy} e @env{https_proxy} podem ser definidas no ambiente de @command{guix-daemon} e são honradas para downloads de substitutos. Observe que o valor dessas variáveis de ambiente no ambiente onde @command{guix build}, @command{guix package} e outros comandos de cliente são executados não tem @emph{absolutamente nenhum efeito}.

source: Even when a substitute for a derivation is available, sometimes the substitution attempt will fail. This can happen for a variety of reasons: the substitute server might be offline, the substitute may recently have been deleted, the connection might have been interrupted, etc.
pt_br: Mesmo quando um substituto para uma derivação estiver disponível, às vezes a tentativa de substituição falhará. Isso pode acontecer por vários motivos: o servidor substituto pode estar offline, o servidor substituto pode ter sido excluído recentemente, a conexão pode ter sido interrompida, etc.

source: When substitutes are enabled and a substitute for a derivation is available, but the substitution attempt fails, Guix will attempt to build the derivation locally depending on whether or not @option{--fallback} was given (@pxref{fallback-option,, common build option @option{--fallback}}). Specifically, if @option{--fallback} was omitted, then no local build will be performed, and the derivation is considered to have failed. However, if @option{--fallback} was given, then Guix will attempt to build the derivation locally, and the success or failure of the derivation depends on the success or failure of the local build. Note that when substitutes are disabled or no substitute is available for the derivation in question, a local build will @emph{always} be performed, regardless of whether or not @option{--fallback} was given.
pt_br: Quando os substitutos estão habilitados e um substituto para uma derivação está disponível, mas a tentativa de substituição falha, o Guix tentará construir a derivação localmente dependendo se @option{--fallback} foi fornecido ou não (@pxref{fallback-option,, opção de compilação comum @option{--fallback}}). Especificamente, se @option{--fallback} for omitido, nenhuma construção local será executada e a derivação será considerada como tendo falhado. No entanto, se @option{--fallback} for fornecido, o Guix tentará construir a derivação localmente, e o sucesso ou fracasso da derivação dependerá do sucesso ou fracasso da construção local. Observe que quando os substitutos estão desabilitados ou nenhum substituto está disponível para a derivação em questão, uma construção local @emph{sempre} será executada, independentemente de @option{--fallback} ter sido fornecido ou não.

source: To get an idea of how many substitutes are available right now, you can try running the @command{guix weather} command (@pxref{Invoking guix weather}). This command provides statistics on the substitutes provided by a server.
pt_br: Para ter uma ideia de quantos substitutos estão disponíveis no momento, você pode tentar executar o comando @command{guix weather} (@pxref{Invoking guix weather}). Este comando fornece estatísticas sobre os substitutos fornecidos por um servidor.

source: trust, of pre-built binaries
pt_br: confiança, de binários pré-construídos

source: Today, each individual's control over their own computing is at the mercy of institutions, corporations, and groups with enough power and determination to subvert the computing infrastructure and exploit its weaknesses. While using substitutes can be convenient, we encourage users to also build on their own, or even run their own build farm, such that the project run substitute servers are less of an interesting target. One way to help is by publishing the software you build using @command{guix publish} so that others have one more choice of server to download substitutes from (@pxref{Invoking guix publish}).
pt_br: Hoje, o controlo de cada indivíduo sobre a sua própria computação está à mercê de instituições, empresas e grupos com poder e determinação suficientes para subverter a infra-estrutura informática e explorar as suas fraquezas. Embora o uso de substitutos possa ser conveniente, encorajamos os usuários a também construírem por conta própria, ou até mesmo executarem seu próprio build farm, de modo que os servidores substitutos executados pelo projeto sejam um alvo menos interessante. Uma maneira de ajudar é publicando o software que você constrói usando @command{guix publish} para que outros tenham mais uma opção de servidor para baixar substitutos (@pxref{Invoking guix publish}).

source: In the future, we want Guix to have support to publish and retrieve binaries to/from other users, in a peer-to-peer fashion. If you would like to discuss this project, join us on @email{guix-devel@@gnu.org}.
pt_br: No futuro, queremos que o Guix tenha suporte para publicação e recuperação de binários de/para outros usuários, de forma peer-to-peer. Se você gostaria de discutir este projeto, entre em contato conosco em @email{guix-devel@@gnu.org}.

source: package outputs
pt_br: saídas de pacote

source: outputs
pt_br: saídas

source: Often, packages defined in Guix have a single @dfn{output}---i.e., the source package leads to exactly one directory in the store. When running @command{guix install glibc}, one installs the default output of the GNU libc package; the default output is called @code{out}, but its name can be omitted as shown in this command. In this particular case, the default output of @code{glibc} contains all the C header files, shared libraries, static libraries, Info documentation, and other supporting files.
pt_br: Frequentemente, os pacotes definidos no Guix têm uma única @dfn{saída} --- ou seja, o pacote fonte leva a exatamente um diretório no armazém. Ao executar @command{guix install glibc}, instala-se a saída padrão do pacote GNU libc; A saída padrão é chamada @code{out}, mas seu nome pode ser omitido conforme mostrado neste comando. Neste caso específico, a saída padrão de @code{glibc} contém todos os arquivos de cabeçalho C, bibliotecas compartilhadas, bibliotecas estáticas, documentação de informações e outros arquivos de suporte.

source: Sometimes it is more appropriate to separate the various types of files produced from a single source package into separate outputs. For instance, the GLib C library (used by GTK+ and related packages) installs more than 20 MiB of reference documentation as HTML pages. To save space for users who do not need it, the documentation goes to a separate output, called @code{doc}. To install the main GLib output, which contains everything but the documentation, one would run:
pt_br: Às vezes é mais apropriado separar os vários tipos de arquivos produzidos a partir de um único pacote fonte em saídas separadas. Por exemplo, a biblioteca GLib C (usada pelo GTK+ e pacotes relacionados) instala mais de 20 MiB de documentação de referência como páginas HTML. Para economizar espaço para usuários que não precisam, a documentação vai para uma saída separada, chamada @code{doc}. Para instalar a saída principal do GLib, que contém tudo menos a documentação, seria executado:

source: The command to install its documentation is:
pt_br: O comando para instalar sua documentação é:

source: While the colon syntax works for command-line specification of package outputs, it will not work when using a package @emph{variable} in Scheme code. For example, to add the documentation of @code{glib} to the globally installed packages of an @code{operating-system} (see @ref{operating-system Reference}), a list of two items, the first one being the package @emph{variable} and the second one the name of the output to select (a string), must be used instead:
pt_br: Embora a sintaxe de dois pontos funcione para especificação de linha de comando de saídas de pacotes, ela não funcionará ao usar uma @emph{variável} de pacote no código do Scheme. Por exemplo, para adicionar a documentação do @code{glib} aos pacotes instalados globalmente de um @code{operating-system} (veja @ref{operating-system Reference}), uma lista de dois itens, sendo o primeiro a @emph{variável} de pacote e o segundo o nome da saída a ser selecionada (uma string), devem ser usados:

source: (use-modules (gnu packages glib)) ;; glib-with-documentation is the Guile symbol for the glib package (operating-system ... (packages (append (list (list glib-with-documentation "doc")) %base-packages)))
pt_br: (use-modules (gnu packages glib)) ;; glib-with-documentation é o símbolo de Guile para o pacote glib (operating-system ... (packages (append (list (list glib-with-documentation "doc")) %base-packages)))

source: Some packages install programs with different ``dependency footprints''. For instance, the WordNet package installs both command-line tools and graphical user interfaces (GUIs). The former depend solely on the C library, whereas the latter depend on Tcl/Tk and the underlying X libraries. In this case, we leave the command-line tools in the default output, whereas the GUIs are in a separate output. This allows users who do not need the GUIs to save space. The @command{guix size} command can help find out about such situations (@pxref{Invoking guix size}). @command{guix graph} can also be helpful (@pxref{Invoking guix graph}).
pt_br: Alguns pacotes instalam programas com diferentes "pegadas de dependência''. Por exemplo, o pacote WordNet instala ferramentas de linha de comando e interfaces gráficas de usuário (GUIs). Os primeiros dependem exclusivamente da biblioteca C, enquanto os últimos dependem apenas do Tcl/Tk e das bibliotecas X subjacentes. Nesse caso, deixamos as ferramentas de linha de comando na saída padrão, enquanto as GUIs ficam em uma saída separada. Isso permite que usuários que não precisam de GUIs economizem espaço. O comando @command{guix size} pode ajudar a descobrir tais situações (@pxref{Invoking guix size}). @command{guix graph} também pode ser útil (@pxref{Invoking guix graph}).

source: There are several such multiple-output packages in the GNU distribution. Other conventional output names include @code{lib} for libraries and possibly header files, @code{bin} for stand-alone programs, and @code{debug} for debugging information (@pxref{Installing Debugging Files}). The outputs of a package are listed in the third column of the output of @command{guix package --list-available} (@pxref{Invoking guix package}).
pt_br: Existem vários desses pacotes de múltiplas saídas na distribuição GNU. Outros nomes de saída convencionais incluem @code{lib} para bibliotecas e possivelmente arquivos de cabeçalho, @code{bin} para programas independentes e @code{debug} para informações de depuração (@pxref{Installing Debugging Files}). A saída de um pacote está listada na terceira coluna da saída de @command{guix package --list-available} (@pxref{Invoking guix package}).

source: Invoking @command{guix locate}
pt_br: Invocando @command{guix locate}

source: There's so much free software out there that sooner or later, you will need to search for packages. The @command{guix search} command that we've seen before (@pxref{Invoking guix package}) lets you search by keywords:
pt_br: Há tantos softwares gratuitos por aí que, mais cedo ou mais tarde, você precisará procurar por pacotes. O comando @command{guix search} que vimos antes (@pxref{Invoking guix package}) permite pesquisar por palavras-chave:

source: searching for packages, by file name
pt_br: procurando por pacotes, por nome de arquivo
