Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: (define* (package->manifest-entry* package system #:key target) "Return a manifest entry for PACKAGE on SYSTEM, optionally cross-compiled to TARGET." (manifest-entry (inherit (package->manifest-entry package)) (name (string-append (package-name package) "." system (if target (string-append "." target) ""))) (item (with-parameters ((%current-system system) (%current-target-system target)) package))))
it: (define* (package->manifest-entry* package system #:key target) "Restituisce una voce di manifest per PACKAGE su SYSTEM, opzionalmente cross-compilato su TARGET." (manifest-entry (inherit (package->manifest-entry package)) (name (string-append (package-name package) "." system (if target (string-append "." target) ""))) (item (with-parameters ((%current-system system) (%current-target-system target)) package))))
pt_br: (define* (package->manifest-entry* package system #:key target) "Retorna uma entrada de manifesto para pacote PACKAGE no sisteme SYSTEM, opcionalmente compilado cruzado para alvo TARGET." (manifest-entry (inherit (package->manifest-entry package)) (name (string-append (package-name package) "." system (if target (string-append "." target) ""))) (item (with-parameters ((%current-system system) (%current-target-system target)) package))))

source: We won't go into the details of this manifest; suffice to say that it provides additional flexibility. We now need to tell Cuirass to build this manifest, which is done with a spec slightly different from the previous one:
it: Non entreremo nei dettagli di questo manifest; basti dire che fornisce flessibilità aggiuntiva. Ora dobbiamo dire a Cuirass di costruire questo manifest, cosa che si fa con una specifica leggermente diversa dalla precedente:
pt_br: Não entraremos em detalhes deste manifesto; basta dizer que ele fornece flexibilidade adicional. Agora precisamos dizer ao Cuirass para construir este manifesto, que é feito com uma especificação ligeiramente diferente da anterior:

source: ;; Cuirass spec file to build all the packages of the ‘guile’ channel. (list (specification (name "guile") (build '(manifest ".guix/manifest.scm")) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))
it: ;; File di specifica Cuirass per costruire tutti i pacchetti del canale «guile». (list (specification (name "guile") (build '(manifest ".guix/manifest.scm")) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))
pt_br: ;; Arquivo de especificação do Cuirass para compilar todos os pacotes do canal ‘guile’. (list (specification (name "guile") (build '(manifest ".guix/manifest.scm")) (channels (append (list (channel (name 'guile) (url "https://git.savannah.gnu.org/git/guile.git") (branch "main"))) %default-channels))))

source: We changed the @code{(build @dots{})} part of the spec to @code{'(manifest ".guix/manifest.scm")} so that it would pick our manifest, and that's it!
it: Abbiamo cambiato la parte @code{(build @dots{})} della specifica in @code{'(manifest ".guix/manifest.scm")} in modo che prelevasse il nostro manifest, e questo è tutto!
pt_br: Alteramos a parte @code{(build @dots{})} da especificação para @code{'(manifest ".guix/manifest.scm")} para que ele escolhesse nosso manifesto, e pronto!

source: We picked Guile as the running example in this chapter and you can see the result here:
it: Abbiamo scelto Guile come esempio in questo capitolo e puoi vedere il risultato qui:
pt_br: Escolhemos Guile como exemplo prático neste capítulo e você pode ver o resultado aqui:

source: @uref{https://git.savannah.gnu.org/cgit/guile.git/tree/.guix/modules/guile-package.scm?id=cd57379b3df636198d8cd8e76c1bfbc523762e79,@code{.guix/modules/guile-package.scm}} with the top-level @file{guix.scm} symlink;
it: @uref{https://git.savannah.gnu.org/cgit/guile.git/tree/.guix/modules/guile-package.scm?id=cd57379b3df636198d8cd8e76c1bfbc523762e79,@code{.guix/modules/guile-package.scm}} con il symlink @file{guix.scm} di primo livello;
pt_br: @uref{https://git.savannah.gnu.org/cgit/guile.git/tree/.guix/modules/guile-package.scm?id=cd57379b3df636198d8cd8e76c1bfbc523762e79,@code{.guix/modules/guile-package.scm}} com o link simbólico de nível superior @file{guix.scm};

source: These days, repositories are commonly peppered with dot files for various tools: @code{.envrc}, @code{.gitlab-ci.yml}, @code{.github/workflows}, @code{Dockerfile}, @code{.buildpacks}, @code{Aptfile}, @code{requirements.txt}, and whatnot. It may sound like we're proposing a bunch of @emph{additional} files, but in fact those files are expressive enough to @emph{supersede} most or all of those listed above.
it: Al giorno d'oggi, i repository sono spesso cosparsi di file nascosti per vari strumenti: @code{.envrc}, @code{.gitlab-ci.yml}, @code{.github/workflows}, @code{Dockerfile}, @code{.buildpacks}, @code{Aptfile}, @code{requirements.txt}, e così via. Potrebbe sembrare che stiamo proponendo un mucchio di file @emph{additional}, ma in realtà questi file sono sufficientemente espressivi da @emph{sostituire} la maggior parte o tutti quelli elencati sopra.
pt_br: Hoje em dia, os repositórios são comumente recheados com arquivos dot para várias ferramentas: @code{.envrc}, @code{.gitlab-ci.yml}, @code{.github/workflows}, @code{Dockerfile}, @code{.buildpacks}, @code{Aptfile}, @code{requirements.txt} e outros. Pode parecer que estamos propondo um monte de arquivos @emph{adicionais}, mas na verdade esses arquivos são expressivos o suficiente para @emph{substituir} a maioria ou todos os listados acima.

source: With a couple of files, we get support for:
it: Con un paio di file, otteniamo il supporto per:
pt_br: Com alguns arquivos, obtemos suporte para:
sv: Med några filer får vi stöd för:

source: development environments (@command{guix shell});
it: ambienti di sviluppo (@command{guix shell});
pt_br: ambientes de desenvolvimento (@command{guix shell});
sv: utvecklingsmiljöer (@command{guix shell});

source: pristine test builds, including for package variants and for cross-compilation (@command{guix build});
it: build di test pulite, incluse per varianti di pacchetti e per la cross-compilazione (@command{guix build});
pt_br: compilações de teste originais, incluindo para variantes de pacote e para compilação cruzada (@command{guix build});

source: continuous integration (with Cuirass or with some other tool);
it: integrazione continua (con Cuirass o con qualche altro strumento);
pt_br: integração contínua (com Cuirass ou com alguma outra ferramenta);

source: continuous delivery to users (@emph{via} the channel and with pre-built binaries);
it: consegna continua agli utenti (@emph{via} il canale e con binari precompilati);
pt_br: entrega contínua aos usuários (@emph{via} o canal e com binários pré-construídos);

source: generation of derivative build artifacts such as Docker images or Deb/RPM packages (@command{guix pack}).
it: generazione di artefatti di build derivati come immagini Docker o pacchetti Deb/RPM (@command{guix pack}).
pt_br: geração de artefatos de construção derivados, como imagens Docker ou pacotes Deb/RPM (@command{guix pack}).

source: This a nice (in our view!) unified tool set for reproducible software deployment, and an illustration of how you as a developer can benefit from it!
it: Questo è un bel set di strumenti unificato (a nostro avviso!) per il deployment riproducibile del software, e un'illustrazione di come tu, come sviluppatore, puoi trarne beneficio!
pt_br: Este é um bom (na nossa opinião!) conjunto de ferramentas unificadas para implantação de software reproduzível e uma ilustração de como você, como desenvolvedor, pode se beneficiar dele!

source: Guix provides multiple tools to manage environment. This chapter demonstrate such utilities.
it: Guix fornisce numerosi strumenti per gestire l'ambiente. Questo capitolo illustra tali utilità.
pt_br: Guix fornece múltiplas ferramentas para gerenciar o ambiente. Este capítulo demonstra tais utilitários.
sk: Guix poskytuje viacero nástrojov na správu prostredí. Táto kapitola ich predstavuje.

source: Guix provides a @samp{direnv} package, which could extend shell after directory change. This tool could be used to prepare a pure Guix environment.
it: Guix fornisce un pacchetto @samp{direnv}, che potrebbe estendere la shell dopo il cambio di directory. Questo strumento potrebbe essere usato per preparare un ambiente Guix puro.
pt_br: Guix fornece um pacote @samp{direnv}, que pode estender o shell após a mudança de diretório. Esta ferramenta pode ser usada para preparar um ambiente Guix puro.
sk: Guix poskytuje balík @samp{direnv}, ktorým možno rozšíriť prostredie shellu po zmene priečinka. Tento nástroj sa dá využiť na prípravu čistého prostredia Guix.

source: The following example provides a shell function for @file{~/.direnvrc} file, which could be used from Guix Git repository in @file{~/src/guix/.envrc} file to setup a build environment similar to described in @pxref{Building from Git,,, guix, GNU Guix Reference Manual}.
it: L'esempio seguente fornisce una funzione di shell per il file @file{~/.direnvrc}, che potrebbe essere utilizzata dal repository Git di Guix nel file @file{~/src/guix/.envrc} per configurare un ambiente di build simile a quello descritto in @pxref{Costruire da Git,,, guix.it, Manuale di riferimento GNU Guix}.
pt_br: O exemplo a seguir fornece uma função de shell para o arquivo @file{~/.direnvrc}, que pode ser usada no repositório Guix Git no arquivo @file{~/src/guix/.envrc} para configurar um ambiente de compilação semelhante ao descrito em @pxref{Compilando do git,,, guix.pt_BR, Manual de Referência do GNU Guix}.
sk: Nasledovný príklad poskytuje shellovskú funkciu pre súbor @file{~/.direnvrc}, ktorú možno použiť z Git repozitára Guixu v súbore @file{~/src/guix/.envrc} na nastavenie vývojového prostredia podobnému tomu, ktoré je opísané v @pxref{Building from Git,,, guix, GNU Guix Reference Manual}.

source: Create a @file{~/.direnvrc} with a Bash code:
it: Crea un file @file{~/.direnvrc} con codice Bash:
pt_br: Crie um @file{~/.direnvrc} com um código Bash:
sk: Vytvorte súbor @file{~/.direnvrc} obsahujúci nasledovný kód Bash:

source: # Thanks <https://github.com/direnv/direnv/issues/73#issuecomment-152284914> export_function() @{ local name=$1 local alias_dir=$PWD/.direnv/aliases mkdir -p "$alias_dir" PATH_add "$alias_dir" local target="$alias_dir/$name" if declare -f "$name" >/dev/null; then echo "#!$SHELL" > "$target" declare -f "$name" >> "$target" 2>/dev/null # Notice that we add shell variables to the function trigger. echo "$name \$*" >> "$target" chmod +x "$target" fi @}
it: # Grazie a <https://github.com/direnv/direnv/issues/73#issuecomment-152284914> export_function() @{ local name=$1 local alias_dir=$PWD/.direnv/aliases mkdir -p "$alias_dir" PATH_add "$alias_dir" local target="$alias_dir/$name" if declare -f "$name" >/dev/null; then echo "#!$SHELL" > "$target" declare -f "$name" >> "$target" 2>/dev/null # Notare che aggiungiamo variabili di shell al trigger della funzione. echo "$name \$*" >> "$target" chmod +x "$target" fi @}
pt_br: # Obrigado <https://github.com/direnv/direnv/issues/73#issuecomment-152284914> export_function() @{ local name=$1 local alias_dir=$PWD/.direnv/aliases mkdir -p "$alias_dir" PATH_add "$alias_dir" local target="$alias_dir/$name" if declare -f "$name" >/dev/null; then echo "#!$SHELL" > "$target" declare -f "$name" >> "$target" 2>/dev/null # Observe que adicionamos variáveis de shell ao gatilho da função. echo "$name \$*" >> "$target" chmod +x "$target" fi @}
sk: # Vďaka <https://github.com/direnv/direnv/issues/73#issuecomment-152284914> export_function() @{ local name=$1 local alias_dir=$PWD/.direnv/aliases mkdir -p "$alias_dir" PATH_add "$alias_dir" local target="$alias_dir/$name" if declare -f "$name" >/dev/null; then echo "#!$SHELL" > "$target" declare -f "$name" >> "$target" 2>/dev/null # Všimnite si, že pridávame premenné shellu do spúšťača funkcie. echo "$name \$*" >> "$target" chmod +x "$target" fi @}

source: use_guix() @{ # Set GitHub token. export GUIX_GITHUB_TOKEN="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
it: use_guix() @{ # Imposta il token GitHub. export GUIX_GITHUB_TOKEN="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
pt_br: use_guix() @{ # Defina o token do GitHub. export GUIX_GITHUB_TOKEN="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
sk: use_guix() @{ # Nastaviť žetón pre GitHub. export GUIX_GITHUB_TOKEN="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"

source: # Unset 'GUIX_PACKAGE_PATH'. export GUIX_PACKAGE_PATH=""
it: # Disattiva 'GUIX_PACKAGE_PATH'. export GUIX_PACKAGE_PATH=""
pt_br: # Cancela definição de 'GUIX_PACKAGE_PATH'. export GUIX_PACKAGE_PATH=""
sk: # Vyčistiť „GUIX_PACKAGE_PATH“. export GUIX_PACKAGE_PATH=""

source: # Recreate a garbage collector root. gcroots="$HOME/.config/guix/gcroots" mkdir -p "$gcroots" gcroot="$gcroots/guix" if [ -L "$gcroot" ] then rm -v "$gcroot" fi
it: # Ricrea una radice del garbage collector. gcroots="$HOME/.config/guix/gcroots" mkdir -p "$gcroots" gcroot="$gcroots/guix" if [ -L "$gcroot" ] then rm -v "$gcroot" fi
pt_br: # Recrie uma raiz do coletor de lixo. gcroots="$HOME/.config/guix/gcroots" mkdir -p "$gcroots" gcroot="$gcroots/guix" if [ -L "$gcroot" ] then rm -v "$gcroot" fi
sk: # Opätovne vytvoriť koreň zberača odpadkov. gcroots="$HOME/.config/guix/gcroots" mkdir -p "$gcroots" gcroot="$gcroots/guix" if [ -L "$gcroot" ] then rm -v "$gcroot" fi

source: # Miscellaneous packages. PACKAGES_MAINTENANCE=( direnv git git:send-email git-cal gnupg guile-colorized guile-readline less ncurses openssh xdot )
it: # Pacchetti vari. PACKAGES_MAINTENANCE=( direnv git git:send-email git-cal gnupg guile-colorized guile-readline less ncurses openssh xdot )
pt_br: # Pacotes diversos. PACKAGES_MAINTENANCE=( direnv git git:send-email git-cal gnupg guile-colorized guile-readline less ncurses openssh xdot )
sk: # Doplnkové balíky. PACKAGES_MAINTENANCE=( direnv git git:send-email git-cal gnupg guile-colorized guile-readline less ncurses openssh xdot )

source: # Environment packages. PACKAGES=(help2man guile-sqlite3 guile-gcrypt)
it: # Pacchetti ambiente. PACKAGES=(help2man guile-sqlite3 guile-gcrypt)
pt_br: # Pacotes de ambiente. PACKAGES=(help2man guile-sqlite3 guile-gcrypt)
sk: # Balíky prostredia. PACKAGES=(help2man guile-sqlite3 guile-gcrypt)

source: # Thanks <https://lists.gnu.org/archive/html/guix-devel/2016-09/msg00859.html> eval "$(guix shell --search-paths --root="$gcroot" --pure \ --development guix $@{PACKAGES[@@]@} $@{PACKAGES_MAINTENANCE[@@]@} "$@@")"
it: # Grazie a <https://lists.gnu.org/archive/html/guix-devel/2016-09/msg00859.html> eval "$(guix shell --search-paths --root="$gcroot" --pure \ --development guix $@{PACKAGES[@@]@} $@{PACKAGES_MAINTENANCE[@@]@} "$@@")"
pt_br: # Obrigado <https://lists.gnu.org/archive/html/guix-devel/2016-09/msg00859.html> eval "$(guix shell --search-paths --root="$gcroot" --pure \ --development guix $@{PACKAGES[@@]@} $@{PACKAGES_MAINTENANCE[@@]@} "$@@")"
sk: # Vďaka <https://lists.gnu.org/archive/html/guix-devel/2016-09/msg00859.html> eval "$(guix shell --search-paths --root="$gcroot" --pure \ --development guix $@{PACKAGES[@@]@} $@{PACKAGES_MAINTENANCE[@@]@} "$@@")"

source: # Predefine configure flags. configure() @{ ./configure @} export_function configure
it: # Predefinisci i flag di configurazione. configure() @{ ./configure @} export_function configure
pt_br: # Predefina sinalizadores de configuração. configure() @{ ./configure @} export_function configure
sk: # Vopred zadať voľby nastavenia. configure() @{ ./configure @} export_function configure

source: # Run make and optionally build something. build() @{ make -j 2 if [ $# -gt 0 ] then ./pre-inst-env guix build "$@@" fi @} export_function build
it: # Esegui make e opzionalmente costruisci qualcosa. build() @{ make -j 2 if [ $# -gt 0 ] then ./pre-inst-env guix build "$@@" fi @} export_function build
pt_br: # Execute make e, opcionalmente, construa algo. build() @{ make -j 2 if [ $# -gt 0 ] then ./pre-inst-env guix build "$@@" fi @} export_function build
sk: # Spustiť „make“ a možno niečo zostaviť. build() @{ make -j 2 if [ $# -gt 0 ] then ./pre-inst-env guix build "$@@" fi @} export_function build

source: # Predefine push Git command. push() @{ git push --set-upstream origin @} export_function push
it: # Predefinisci il comando Git push. push() @{ git push --set-upstream origin @} export_function push
pt_br: # Predefina o comando push do Git. push() @{ git push --set-upstream origin @} export_function push
sk: # Vopred zadať Git príkaz pre odoslanie zmien. push() @{ git push --set-upstream origin @} export_function push

source: clear # Clean up the screen. git-cal --author='Your Name' # Show contributions calendar.
it: clear # Pulisci lo schermo. git-cal --author='Il tuo nome' # Mostra il calendario dei contributi.
pt_br: clear # Limpe a tela. git-cal --author='Seu nome' # Mostrar calendário de contribuições.
sk: clear # Vyčistiť obrazovku. git-cal --author='Vaše meno' # Zobraziť kalendár zmien.

source: # Show commands help. echo " build build a package or just a project if no argument provided configure run ./configure with predefined parameters push push to upstream Git repository " @}
it: # Mostra l'aiuto dei comandi. echo " build costruisce un pacchetto o solo un progetto se non viene fornito alcun argomento configure esegui ./configure con parametri predefiniti push effettua il push al repository Git upstream " @}
pt_br: #Mostrar ajuda de comandos. echo " build construir um pacote ou apenas um projeto se nenhum argumento for fornecido configure execute ./configure com parâmetros predefinidos push enviar para o repositório Git upstream " @}
sk: # Zobraziť pomocníka príkazov. echo " build zostaviť balík alebo iba projekt ak nebol poskytnutý žiaden parameter configure vykonať ./configure s predvolenými voľbami push odoslať zmeny do vzdialeného repozitára Git " @}

source: Every project containing @file{.envrc} with a string @code{use guix} will have predefined environment variables and procedures.
it: Ogni progetto contenente @file{.envrc} con la stringa @code{use guix} avrà variabili d'ambiente e procedure predefinite.
pt_br: Cada projeto contendo @file{.envrc} com uma string @code{use guix} terá variáveis de ambiente e procedimentos predefinidos.
sk: Každý projekt obsahujúci @file{.envrc} s reťazcom @code{use guix} bude mať vopred pripravené premenné prostredia a funkcie.

source: Run @command{direnv allow} to setup the environment for the first time.
it: Esegui @command{direnv allow} per configurare l'ambiente per la prima volta.
pt_br: Execute @command{direnv allow} para configurar o ambiente pela primeira vez.
sk: Vykonajte @command{direnv allow} pre prvé nastavenie prostredia.

source: cluster installation
it: installazione cluster
pt_br: instalação de cluster
ru: установка кластера
sk: inštalácia na zhluk počítačov

source: high-performance computing, HPC
it: calcolo ad alte prestazioni, HPC
pt_br: computação de alto desempenho, HPC
sk: vysokovýkonné počítanie, HPC

source: HPC, high-performance computing
it: HPC, calcolo ad alte prestazioni
pt_br: HPC, computação de alto desempenho
sk: HPC, vysokovýkonné počítanie

source: Guix is appealing to scientists and @acronym{HPC, high-performance computing} practitioners: it makes it easy to deploy potentially complex software stacks, and it lets you do so in a reproducible fashion---you can redeploy the exact same software on different machines and at different points in time.
it: Guix è attraente per gli scienziati e i professionisti dell'@acronym{HPC, calcolo ad alte prestazioni}: semplifica il deployment di stack software potenzialmente complessi e consente di farlo in modo riproducibile, permettendo di ridistribuire esattamente lo stesso software su macchine diverse e in momenti diversi.
pt_br: O Guix é atraente para cientistas e profissionais de @acronym{HPC, computação de alto desempenho}: ele facilita a implantação de pilhas de software potencialmente complexas e permite que você faça isso de forma reproduzível — você pode reimplantar exatamente o mesmo software em máquinas diferentes e em momentos diferentes.
sk: Guix môže zaujať vedcov a odborníkov na @acronym{HPC, vysokovýkonné počítanie}: umožňuje jednoduchšie a opakovateľné nasadenie zložitých sústav programov---môžete opätovne nasadiť to isté programové vybavenie na rôzne stroje a v rôznych časových odstupoch.

source: In this chapter we look at how a cluster sysadmin can install Guix for system-wide use, such that it can be used on all the cluster nodes, and discuss the various tradeoffs@footnote{This chapter is adapted from a @uref{https://hpc.guix.info/blog/2017/11/installing-guix-on-a-cluster/, blog post published on the Guix-HPC web site in 2017}.}.
it: In questo capitolo esaminiamo come un amministratore di sistema di un cluster può installare Guix per un uso a livello di sistema, in modo che possa essere utilizzato su tutti i nodi del cluster, e discutiamo i vari compromessi@footnote{Questo capitolo è adattato da un @uref{https://hpc.guix.info/blog/2017/11/installing-guix-on-a-cluster/, post del blog pubblicato sul sito web di Guix-HPC nel 2017}.}
pt_br: Neste capítulo, veremos como um administrador de sistema de cluster pode instalar o Guix para uso em todo o sistema, de modo que ele possa ser usado em todos os nós do cluster, e discutiremos as várias compensações@footnote{Este capítulo foi adaptado de uma postagem de blog do @uref{https://hpc.guix.info/blog/2017/11/installing-guix-on-a-cluster/, publicada no site Guix-HPC em 2017}.}.
sk: V tejto kapitole sa pozrieme na to, ako môže systémový správca zhluku počítačov nainštalovať Guix na celosystémovej úrovni tak, aby ho bolo možné využiť na všetkých uzloch zhluku, a povieme si aj rôznych ústupkoch@footnote{Táto kapitola je založená na @uref{https://hpc.guix.info/blog/2017/11/installing-guix-on-a-cluster/, príspevku zverejnenom na stránke Guix-HPC v roku 2017}.}.

source: Here we assume that the cluster is running a GNU/Linux distro other than Guix System and that we are going to install Guix on top of it.
it: Qui si assume che il cluster stia eseguendo una distribuzione GNU/Linux diversa da Guix System e che installeremo Guix su di essa.
pt_br: Aqui, assumimos que o cluster está executando uma distribuição GNU/Linux diferente do Guix System e que vamos instalar o Guix sobre ele.
sk: V tomto prípade predpokladáme, že na zhluku počítačov beží distribúcia GNU/Linuxu iná než systém Guix, a že budeme Guix inštalovať na ňu.

source: The recommended approach is to set up one @emph{head node} running @command{guix-daemon} and exporting @file{/gnu/store} over NFS to compute nodes.
it: L'approccio raccomandato è quello di configurare un @emph{nodo head} che esegue @command{guix-daemon} ed esporta @file{/gnu/store} tramite NFS ai nodi di calcolo.
pt_br: A abordagem recomendada é configurar um @emph{nó principal} executando @command{guix-daemon} e exportando @file{/gnu/store} via NFS para nós de computação.
sk: Odporúčaný postup je nastaviť jeden @emph{hlavný uzol}, kde bude bežať @command{guix-daemon}, a @file{/gnu/store} uzlom sprístupniť cez NFS.
