Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Remember that @command{guix-daemon} is responsible for spawning build processes and downloads on behalf of clients (@pxref{Invoking guix-daemon,,, guix, GNU Guix Reference Manual}), and more generally accessing @file{/gnu/store}, which contains all the package binaries built by all the users (@pxref{The Store,,, guix, GNU Guix Reference Manual}). ``Client'' here refers to all the Guix commands that users see, such as @code{guix install}. On a cluster, these commands may be running on the compute nodes and we'll want them to talk to the head node's @code{guix-daemon} instance.
it: Ricorda che @command{guix-daemon} è responsabile dell'avvio dei processi di costruzione e dei download per conto dei client (@pxref{Invocare guix-daemon,,, guix.it, Manuale di riferimento GNU Guix}), e più in generale dell'accesso a @file{/gnu/store}, che contiene tutti i binari dei pacchetti costruiti da tutti gli utenti (@pxref{Lo store,,, guix.it, Manuale di riferimento GNU Guix}). ``Client'' qui si riferisce a tutti i comandi Guix che gli utenti vedono, come @code{guix install}. Su un cluster, questi comandi potrebbero essere eseguiti sui nodi di calcolo e vorremo che comunicassero con l'istanza @code{guix-daemon} del nodo head.
pt_br: Lembre-se de que @command{guix-daemon} é responsável por gerar processos de compilação e downloads em nome dos clientes (@pxref{Invocando guix-daemon,,, guix.pt_BR, Manual de Referência do GNU Guix}) e, de forma mais geral, acessando @file{/gnu/store}, que contém todos os binários de pacotes compilados por todos os usuários (@pxref{O armazém,,, guix.pt_BR, Manual de Referência do GNU Guix}). ``Cliente'' aqui se refere a todos os comandos Guix que os usuários veem, como @code{guix install}. Em um cluster, esses comandos podem estar em execução nos nós de computação e queremos que eles conversem com a instância @code{guix-daemon} do nó principal.
sk: Zapamätajte si, že @command{guix-daemon} je zodpovedný za spúšťanie zostavovacích procesov a sťahovaní v mene klientov (@pxref{Invoking guix-daemon,,, guix, GNU Guix Reference Manual}), a v širšom ohľade za prístup ku @file{/gnu/store}, ktoré obsahuje binárne súbory všetkých balíkov zostavené každým z používateľov. „Klient“ tu odkazuje na všetky Guix príkazy prístupné pre používateľov, ako @code{guix install}. Na zhluku počítačov môžu tieto príkazy bežať na výpočtových uzloch a musia byť v spojení s @code{guix-daemon} na hlavnom uzle.

source: To begin with, the head node can be installed following the usual binary installation instructions (@pxref{Binary Installation,,, guix, GNU Guix Reference Manual}). Thanks to the installation script, this should be quick. Once installation is complete, we need to make some adjustments.
it: Per iniziare, il nodo head può essere installato seguendo le solite istruzioni di installazione binaria (@pxref{Installazione binaria,,, guix.it, Manuale di riferimento GNU Guix}). Grazie allo script di installazione, questo dovrebbe essere rapido. Una volta completata l'installazione, dobbiamo apportare alcune modifiche.
pt_br: Para começar, o nó principal pode ser instalado seguindo as instruções usuais de instalação binária (@pxref{Instalação de binários,,, guix.pt_BR, Manual de Referência do GNU Guix}). Graças ao script de instalação, isso deve ser rápido. Assim que a instalação for concluída, precisamos fazer alguns ajustes.
sk: Na začiatok, inštaláciu na hlavný uzol možno vykonať podľa obvyklého postupu (@pxref{Binary Installation,,, guix, GNU Guix Reference Manual}). Vďaka inštalačnému skriptu by to malo byť rýchle. Po dokončení inštalácie musíme vykonať niekoľko prispôsobení.

source: Since we want @code{guix-daemon} to be reachable not just from the head node but also from the compute nodes, we need to arrange so that it listens for connections over TCP/IP. To do that, we'll edit the systemd startup file for @command{guix-daemon}, @file{/etc/systemd/system/guix-daemon.service}, and add a @code{--listen} argument to the @code{ExecStart} line so that it looks something like this:
it: Poiché vogliamo che @code{guix-daemon} sia raggiungibile non solo dal nodo head ma anche dai nodi di calcolo, dobbiamo fare in modo che ascolti le connessioni su TCP/IP. Per fare ciò, modificheremo il file di avvio di systemd per @command{guix-daemon}, @file{/etc/systemd/system/guix-daemon.service}, e aggiungeremo un argomento @code{--listen} alla riga @code{ExecStart} in modo che assomigli a questo:
pt_br: Como queremos que o @code{guix-daemon} seja acessível não apenas do nó principal, mas também dos nós de computação, precisamos organizar para que ele escute conexões por TCP/IP. Para fazer isso, editaremos o arquivo de inicialização do systemd para @command{guix-daemon}, @file{/etc/systemd/system/guix-daemon.service} e adicionaremos um argumento @code{--listen} à linha @code{ExecStart} para que fique parecido com isto:
sk: Pretože chceme, aby bol @code{guix-daemon} dostupný nie len z hlavného uzla, ale aj z výpočtových uzlov, musíme to zariadiť tak, aby zisťoval prichádzajúce pripojenia cez TCP/IP. Upravíme, teda, spúšťací súbor systemd @file{/etc/systemd/system/guix-daemon.service} pre @code{guix-daemon} a pridáme voľbu @code{--listen} na riadok s @code{ExecStart} asi takto:

source: For these changes to take effect, the service needs to be restarted:
it: Affinché queste modifiche abbiano effetto, il servizio deve essere riavviato:
pt_br: Para que essas alterações entrem em vigor, o serviço precisa ser reiniciado:
sk: Pre uplatnenie zmien musíme službu opätovne spustiť:

source: The @code{--listen=0.0.0.0} bit means that @code{guix-daemon} will process @emph{all} incoming TCP connections on port 44146 (@pxref{Invoking guix-daemon,,, guix, GNU Guix Reference Manual}). This is usually fine in a cluster setup where the head node is reachable exclusively from the cluster's local area network---you don't want that to be exposed to the Internet!
it: Il bit @code{--listen=0.0.0.0} significa che @code{guix-daemon} elaborerà @emph{all} le connessioni TCP in entrata sulla porta 44146 (@pxref{Invocare guix-daemon,,, guix.it, Manuale di riferimento GNU Guix}). Questo di solito va bene in una configurazione cluster in cui il nodo head è raggiungibile esclusivamente dalla rete locale del cluster --- non vuoi che sia esposto a Internet!
pt_br: O bit @code{--listen=0.0.0.0} significa que @code{guix-daemon} processará @emph{todas} as conexões TCP de entrada na porta 44146 (@pxref{Invocando guix-daemon,,, guix.pt_BR, Manual de Referência do GNU Guix}). Isso geralmente é bom em uma configuração de cluster onde o nó principal é acessível exclusivamente da rede local do cluster --- você não quer que isso seja exposto à Internet!
sk: @code{--listen=0.0.0.0} znamená, že @code{guix-daemon} spracuje @emph{všetky} TCP pripojenia prichádzajúce cez koncový bod 44146 (@pxref{Invoking guix-daemon,,, guix, GNU Guix Reference Manual}). V prípade zhluku počítačov, kde je hlavný uzol prístupný výhradne z miestnej, je to vyhovujúce. Nechcete, predsa, aby bol @code{guix-daemon} prístupný aj z internetu!

source: The next step is to define our NFS exports in @uref{https://linux.die.net/man/5/exports,@file{/etc/exports}} by adding something along these lines:
it: Il passo successivo è definire le nostre esportazioni NFS in @uref{https://linux.die.net/man/5/exports,@file{/etc/exports}} aggiungendo qualcosa del genere:
pt_br: O próximo passo é definir nossas exportações NFS em @uref{https://linux.die.net/man/5/exports,@file{/etc/exports}} adicionando algo como isto:
sk: Ďalším krokom je sprístupnenie úložiska cez NFS v @uref{https://linux.die.net/man/5/exports,@file{/etc/exports}} asi takto:

source: The @file{/gnu/store} directory can be exported read-only since only @command{guix-daemon} on the master node will ever modify it. @file{/var/guix} contains @emph{user profiles} as managed by @code{guix package}; thus, to allow users to install packages with @code{guix package}, this must be read-write.
it: La directory @file{/gnu/store} può essere esportata in sola lettura poiché solo @command{guix-daemon} sul nodo master la modificherà. @file{/var/guix} contiene @emph{profili utente} gestiti da @code{guix package}; quindi, per consentire agli utenti di installare pacchetti con @code{guix package}, questo deve essere in lettura-scrittura.
pt_br: O diretório @file{/gnu/store} pode ser exportado somente para leitura, pois somente @command{guix-daemon} no nó mestre poderá modificá-lo. @file{/var/guix} contém @emph{perfis de usuário} conforme gerenciados por @code{guix package}; portanto, para permitir que os usuários instalem pacotes com @code{guix package}, isso deve ser de leitura e gravação.
sk: Priečinok @file{/gnu/store} môže byť sprístupnený len na čítanie, keďže @command{guix-daemon} na hlavnom uzle ho nikdy nebude upravovať. @file{/var/guix} obsahuje @emph{profily používateľov}, ktoré spravuje @code{guix package}. Aby mohli používatelia inštalovať s @code{guix package}, toto umiestnenie musí zostať prístupné aj na čítanie, aj na zápis.

source: Users can create as many profiles as they like in addition to the default profile, @file{~/.guix-profile}. For instance, @code{guix package -p ~/dev/python-dev -i python} installs Python in a profile reachable from the @code{~/dev/python-dev} symlink. To make sure that this profile is protected from garbage collection---i.e., that Python will not be removed from @file{/gnu/store} while this profile exists---, @emph{home directories should be mounted on the head node} as well so that @code{guix-daemon} knows about these non-standard profiles and avoids collecting software they refer to.
it: Gli utenti possono creare tutti i profili che desiderano oltre al profilo predefinito, @file{~/.guix-profile}. Ad esempio, @code{guix package -p ~/dev/python-dev -i python} installa Python in un profilo raggiungibile dal symlink @code{~/dev/python-dev}. Per assicurarsi che questo profilo sia protetto dalla raccolta della spazzatura --- cioè, che Python non venga rimosso da @file{/gnu/store} finché questo profilo esiste ---, le @emph{directory home dovrebbero essere montate anche sul nodo head} in modo che @code{guix-daemon} sia a conoscenza di questi profili non standard ed eviti di raccogliere il software a cui si riferiscono.
pt_br: Os usuários podem criar quantos perfis quiserem, além do perfil padrão, @file{~/.guix-profile}. Por exemplo, @code{guix package -p ~/dev/python-dev -i python} instala o Python em um perfil acessível pelo link simbólico @code{~/dev/python-dev}. Para garantir que esse perfil esteja protegido contra coleta de lixo --- ou seja, que o Python não será removido de @file{/gnu/store} enquanto esse perfil existir ---, @emph{diretórios home devem ser montados no nó principal} também para que @code{guix-daemon} saiba sobre esses perfis não padrão e evite coletar softwares aos quais eles se referem.
sk: Používatelia si môžu okrem predvoleného profilu @file{~/.guix-profile} vytvoriť toľko profilov, koľko len chcú. Napríklad, @code{guix package -p ~/dev/python-dev -i python} nainštaluje Python do profilu prístupného cez symbolický odkaz @code{~/dev/python-dev}. Aby sme sa uistili, že sa zberač odpadkov tomuto profilu vyhne---t.j., že Python nebude z @file{/gnu/store} odstránený pokiaľ sa profil používa---@emph{domovské priečinky by tiež mali byť pripojené k rovnakému uzlu}. @code{guix-daemon} tak bude vedieť o týchto neobvyklých profiloch a zabráni vyčisteniu programového vybavenia, na ktoré odkazujú.

source: It may be a good idea to periodically remove unused bits from @file{/gnu/store} by running @command{guix gc} (@pxref{Invoking guix gc,,, guix, GNU Guix Reference Manual}). This can be done by adding a crontab entry on the head node:
it: Potrebbe essere una buona idea rimuovere periodicamente i bit inutilizzati da @file{/gnu/store} eseguendo @command{guix gc} (@pxref{Invocare guix gc,,, guix.it, Manuale di riferimento GNU Guix}). Questo può essere fatto aggiungendo una voce crontab sul nodo head:
pt_br: Pode ser uma boa ideia remover periodicamente bits não utilizados de @file{/gnu/store} executando @command{guix gc} (@pxref{Invocando guix gc,,, guix.pt_BR, Manual de Referência do GNU Guix}). Isso pode ser feito adicionando uma entrada crontab no nó principal:
sk: Môže byť užitočné pravidelne odstraňovať nepoužívané súbory z @file{/gnu/store} pomocou @command{guix gc} (@pxref{Invoking guix gc,,, guix, GNU Guix Reference Manual}). Nastavíte to pridaním vstupu contrab na hlavný uzol:

source: ... with something like this:
it: ... con qualcosa del genere:
pt_br: ... com algo assim:
sk: … s niečím takýmto:

source: # Every day at 5AM, run the garbage collector to make sure # at least 10 GB are free on /gnu/store. 0 5 * * 1 /usr/local/bin/guix gc -F10G
it: # Ogni giorno alle 5 del mattino, esegui il garbage collector per assicurarti # che ci siano almeno 10 GB liberi su /gnu/store. 0 5 * * 1 /usr/local/bin/guix gc -F10G
pt_br: # Todos os dias às 5h da manhã, execute o coletor de lixo para garantir # pelo menos 10 GB estão livres em /gnu/store. 0 5 * * 1 /usr/local/bin/guix gc -F10G
sk: # Každé ráno o 5:00 spustiť zberač odpadkov a zabezpečiť, # že v /gnu/store je aspoň 10 GB voľného miesta. 0 5 * * 1 /usr/local/bin/guix gc -F10G

source: We're done with the head node! Let's look at compute nodes now.
it: Abbiamo finito con il nodo head! Ora passiamo ai nodi di calcolo.
pt_br: Terminamos com o nó principal! Vamos dar uma olhada nos nós de computação agora.
sk: S hlavným uzlom sme hotoví! Pozrime sa teraz na výpočtové uzly.

source: First of all, we need compute nodes to mount those NFS directories that the head node exports. This can be done by adding the following lines to @uref{https://linux.die.net/man/5/fstab,@file{/etc/fstab}}:
it: Innanzitutto, abbiamo bisogno che i nodi di calcolo montino le directory NFS che il nodo head esporta. Questo può essere fatto aggiungendo le seguenti righe a @uref{https://linux.die.net/man/5/fstab,@file{/etc/fstab}}:
pt_br: Primeiro, precisamos de nós de computação para montar os diretórios NFS que o nó principal exporta. Isso pode ser feito adicionando as seguintes linhas a @uref{https://linux.die.net/man/5/fstab,@file{/etc/fstab}}:
sk: Predovšetkým musíme na výpočtových uzloch pripojiť NFS priečinky sprístupnené hlavným uzlom. Môžeme tak urobiť pridaním nasledovných riadkov do @uref{https://linux.die.net/man/5/fstab,@file{/etc/fstab}}:

source: ... where @var{head-node} is the name or IP address of your head node. From there on, assuming the mount points exist, you should be able to mount each of these on the compute nodes.
it: ... dove @var{head-node} è il nome o l'indirizzo IP del tuo nodo head. Da lì in poi, supponendo che i punti di montaggio esistano, dovresti essere in grado di montare ognuno di questi sui nodi di calcolo.
pt_br: ... onde @var{head-node} é o nome ou endereço IP do seu nó principal. A partir daí, assumindo que os pontos de montagem existam, você deve conseguir montar cada um deles nos nós de computação.
sk: … kde @var{hlavny-uzol} je názov alebo IP adresa vášho hlavného uzla. Potom, predpokladajúc, že prípojné body sú prítomné, by ste mali byť schopní pripojiť každý z nich ku výpočtovým uzlom.

source: Next, we need to provide a default @command{guix} command that users can run when they first connect to the cluster (eventually they will invoke @command{guix pull}, which will provide them with their ``own'' @command{guix} command). Similar to what the binary installation script did on the head node, we'll store that in @file{/usr/local/bin}:
it: Successivamente, dobbiamo fornire un comando @command{guix} predefinito che gli utenti possano eseguire quando si connettono per la prima volta al cluster (alla fine invocheranno @command{guix pull}, che fornirà loro il loro ``proprio'' comando @command{guix}). Simile a quanto fatto dallo script di installazione binaria sul nodo head, lo memorizzeremo in @file{/usr/local/bin}:
pt_br: Em seguida, precisamos fornecer um comando @command{guix} padrão que os usuários possam executar quando se conectarem ao cluster pela primeira vez (eventualmente, eles invocarão @command{guix pull}, que fornecerá a eles seu ``próprio'' comando @command{guix}). Semelhante ao que o script de instalação binário fez no nó principal, armazenaremos isso em @file{/usr/local/bin}:
sk: Ďalej musíme používateľom poskytnúť predvolený @command{guix} príkaz, ktorý môžu spustiť po prvom prihlásení k zhluku počítačov (nakoniec si spustením @command{guix pull} vytvoria „vlastný“ @command{guix} príkaz). Podobne ako to inštalačný skript zariadil na hlavnom uzle, uložíme ho do @file{/usr/local/bin}:

source: We then need to tell @code{guix} to talk to the daemon running on our master node, by adding these lines to @code{/etc/profile}:
it: Dobbiamo quindi dire a @code{guix} di comunicare con il demone in esecuzione sul nostro nodo master, aggiungendo queste righe a @code{/etc/profile}:
pt_br: Precisamos então dizer ao @code{guix} para falar com o daemon em execução no nosso nó mestre, adicionando estas linhas ao @code{/etc/profile}:
sk: Potom musíme @code{guixu} povedať, aby bol v spojení s démonom bežiacim na hlavnom uzle, pridaním týchto riadkov do @code{/etc/profile}:

source: To avoid warnings and make sure @code{guix} uses the right locale, we need to tell it to use locale data provided by Guix (@pxref{Application Setup,,, guix, GNU Guix Reference Manual}):
it: Per evitare avvisi e assicurarsi che @code{guix} utilizzi la locale corretta, dobbiamo dirgli di usare i dati di locale forniti da Guix (@pxref{Configurazione dell'applicazione,,, guix.it, Manuale di riferimento GNU Guix}):
pt_br: Para evitar avisos e garantir que o @code{guix} use o local correto, precisamos instruí-lo a usar os dados de local fornecidos pelo Guix (@pxref{Configuração de aplicativo,,, guix.pt_BR, Manual de Referência do GNU Guix}):
sk: Aby sme predišli varovným správam a uistili sa, že @code{guix} používa správne miestne jazykové nastavenie, musíme ho nastaviť na používanie údajov poskytovaných Guixom (@pxref{Application Setup,,, guix, GNU Guix Reference Manual}):

source: # Here we must use a valid locale name. Try "ls $GUIX_LOCPATH/*" # to see what names can be used. LC_ALL=fr_FR.utf8 export LC_ALL
it: # Qui dobbiamo usare un nome di locale valido. Prova "ls $GUIX_LOCPATH/*" # per vedere quali nomi possono essere usati. LC_ALL=fr_FR.utf8 export LC_ALL
pt_br: # Aqui, devemos usar um nome de localidade válido. Tente "ls $GUIX_LOCPATH/*" # para ver quais nomes podem ser usados. LC_ALL=fr_FR.utf8 export LC_ALL
sk: # Tu musíme použiť platný názov miestneho jazykového nastavenia. # Dostupné nastavenia môžete zobraziť pomocou „ls $GUIX_LOCPATH/*“. LC_ALL=sk_SK.utf8 export LC_ALL

source: For convenience, @code{guix package} automatically generates @file{~/.guix-profile/etc/profile}, which defines all the environment variables necessary to use the packages---@code{PATH}, @code{C_INCLUDE_PATH}, @code{PYTHONPATH}, etc. Likewise, @command{guix pull} does that under @file{~/.config/guix/current}. Thus it's a good idea to source both from @code{/etc/profile}:
it: Per comodità, @code{guix package} genera automaticamente @file{~/.guix-profile/etc/profile}, che definisce tutte le variabili d'ambiente necessarie per utilizzare i pacchetti --- @code{PATH}, @code{C_INCLUDE_PATH}, @code{PYTHONPATH}, ecc. Allo stesso modo, @command{guix pull} lo fa sotto @file{~/.config/guix/current}. Quindi è una buona idea caricare entrambi da @code{/etc/profile}:
pt_br: Por conveniência, @code{guix package} gera automaticamente @file{~/.guix-profile/etc/profile}, que define todas as variáveis de ambiente necessárias para usar os pacotes---@code{PATH}, @code{C_INCLUDE_PATH}, @code{PYTHONPATH}, etc. Da mesma forma, @command{guix pull} faz isso em @file{~/.config/guix/current}. Portanto, é uma boa ideia obter ambos de @code{/etc/profile}:

source: Last but not least, Guix provides command-line completion notably for Bash and zsh. In @code{/etc/bashrc}, consider adding this line:
it: Infine, Guix fornisce il completamento della riga di comando, in particolare per Bash e zsh. In @code{/etc/bashrc}, considera di aggiungere questa riga:
pt_br: Por último, mas não menos importante, o Guix fornece conclusão de linha de comando, notavelmente para Bash e zsh. Em @code{/etc/bashrc}, considere adicionar esta linha:
sk: Konečne, Guix poskytuje dopĺňanie príkazov hlavne pre Bash a zsh. Zvážte pridanie nasledovného riadka do @code{/etc/bashrc}:

source: Voilà!
it: Ecco fatto!
sk: A je to!
sv: Varsågod!

source: You can check that everything's in place by logging in on a compute node and running:
it: Puoi verificare che tutto sia a posto accedendo a un nodo di calcolo ed eseguendo:
pt_br: Você pode verificar se tudo está no lugar efetuando login em um nó de computação e executando:
sk: Prihláste sa na jeden z výpočtových uzlov a overte či všetko pracuje správne spustením:

source: The daemon on the head node should download pre-built binaries on your behalf and unpack them in @file{/gnu/store}, and @command{guix install} should create @file{~/.guix-profile} containing the @file{~/.guix-profile/bin/hello} command.
it: Il demone sul nodo principale dovrebbe scaricare i binari precompilati per tuo conto e decomprimerli in @file{/gnu/store}, e @command{guix install} dovrebbe creare @file{~/.guix-profile} contenente il comando @file{~/.guix-profile/bin/hello}.
pt_br: O daemon no nó principal deve baixar binários pré-compilados em seu nome e descompactá-los em @file{/gnu/store}, e @command{guix install} deve criar @file{~/.guix-profile} contendo o comando @file{~/.guix-profile/bin/hello}.
sk: Démon na hlavnom uzle by mal vašim menom stiahnuť pred-zostavené binárne súbory a rozbaliť ich v @file{/gnu/store}. @command{guix install} by mal vytvoriť @file{~/.guix-profile} obsahujúci príkaz @file{~/.guix-profile/bin/hello}.

source: Network Access
it: Accesso alla Rete
pt_br: Acesso à rede
ru: Сетевой доступ
sk: Prístup do siete
sv: Nätverksåtkomst

source: Guix requires network access to download source code and pre-built binaries. The good news is that only the head node needs that since compute nodes simply delegate to it.
it: Guix richiede l'accesso alla rete per scaricare il codice sorgente e i binari precompilati. La buona notizia è che solo il nodo principale ne ha bisogno, poiché i nodi di calcolo si limitano a delegare a esso.
pt_br: Guix requer acesso à rede para baixar código-fonte e binários pré-construídos. A boa notícia é que somente o nó principal precisa disso, já que nós de computação simplesmente delegam a ele.
sk: Guix vyžaduje prístup do siete pre sťahovanie zdrojových kódov a pred-zostavených binárnych súborov. Dobrá správa je, že táto podmienka platí len pre hlavný uzol, keďže koná aj v mene výpočtových uzlov.
sv: Guix kräver en nätverksåtkomst för att hämta källkod och förbyggda binärfiler. The good news is that only the head node needs that since compute nodes simply delegate to it.
