Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: @documentencoding UTF-8
es: @documentencoding UTF-8 @documentlanguage es @frenchspacing on
it: @documentencoding UTF-8 @documentlanguage it @frenchspacing on
pt_br: @documentencoding UTF-8 @documentlanguage pt_BR @frenchspacing on
sk: @documentencoding UTF-8 @documentlanguage sk

source: GNU Guix Cookbook
es: Libro de recetas de GNU Guix
it: Ricettario di GNU Guix
pt_br: Livro de receitas do GNU Guix
ru: GNU Guix Рецепты
sk: Receptár GNU Guix
sv: Kokbok för GNU Guix

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled ``GNU Free Documentation License''.
es: Se garantiza el permiso de copia, distribución y/o modificación de este documento bajo los términos de la licencia de documentación libre de GNU (GNU Free Documentation License), versión 1.3 o cualquier versión posterior publicada por la Free Software Foundation; sin secciones invariantes, sin textos de cubierta delantera ni trasera. Una copia de la licencia está incluida en la sección titulada ``GNU Free Documentation License''.
it: È concesso il permesso di copiare, distribuire e/o modificare questo documento secondo i termini della GNU Free Documentation License, Versione 1.3 o qualsiasi versione successiva pubblicata dalla Free Software Foundation; senza Sezioni Invarianti, senza Testi di Copertina e senza Testi di Retro copertina. Una copia della licenza è inclusa nella sezione intitolata "Licenza di Documentazione Libera GNU".
pt_br: Permissão concedida para copiar, distribuir e/ou modificar este documento sob os termos da Licença de Documentação Livre GNU, Versão 1.3 ou qualquer versão mais recente publicada pela Free Software Foundation; sem Seções Invariantes, Textos de Capa Frontal, e sem Textos de Contracapa. Uma cópia da licença está incluída na seção intitulada ``GNU Free Documentation License''.
ru: Разрешено копирование, распространение и/или модификация этого документа на условиях лицензии свободной документации GNU (GNU FDL) версии 1.3 или любой более поздней версии, опубликованной Фондом свободного программного обеспечения (FSF), исключая неизменяемые секции, исключая тексты, размещенные на переплёте и задней стороне обложки. Копия лицензии включена в документ в разделе под названием "GNU Free Documentation Licens".
sk: Tento dokument môžete kopírovať, ďalej šíriť a/alebo upravovať pod podmienkami licencie GNU Free Documentation License vo verzii 1.3 alebo v akejkoľvek novšej verzii, ktorú vydáva Free Software Foundation; bez nemenných oddielov, úvodnej strany a propagačného textu. Kópia tejto licencie je priložená v oddiele „GNU Free Documentation License“.

source: System administration
es: Administración del sistema
it: Amministrazione di sistema
pt_br: Administração do Sistema
ru: Администрирование системы
sk: Správa systému

source: Guix cookbook: (guix-cookbook)
es: Libro de recetas de Guix: (guix-cookbook.es)
it: Libro di ricette di Guix: (guix-cookbook.it)
pt_br: Livro de receitas do Guix: (guix-cookbook.pt_br)
ru: Guix рецепты: (guix-cookbook.ru)
sk: Receptár Guix: (guix-cookbook)
sv: Kokbok för Guix: (guix-cookbook.sv)

source: Tutorials and examples for GNU Guix.
es: Tutoriales y ejemplos para GNU Guix.
it: Tutorial ed esempi per GNU Guix.
pt_br: Tutoriais e exemplos para o GNU Guix.
ru: Учебники и примеры по GNU Guix.
sk: Návody a príklady GNU Guix.
sv: Handledningar och exempel för GNU Guix.

source: Tutorials and examples for using the GNU Guix Functional Package Manager
es: Tutoriales y ejemplos para usar el Gestor funcional de paquetes de GNU Guix
it: Tutorial ed esempi per l'uso del Gestore di Pacchetti Funzionale GNU Guix
pt_br: Tutoriais e exemplos para usar o Gerenciador de Pacotes Funcional do GNU Guix
ru: Учебники и примеры по использованию функционального менеджера пакетов GNU Guix
sk: Návody na používanie funkcionálneho správcu balíkov GNU Guix a príklady z praxe
sv: Handledningar och exempel för att använda den funktionella pakethanteraren GNU Guix

source: The GNU Guix Developers
es: Los desarrolladores de GNU Guix
it: Gli Sviluppatori di GNU Guix
pt_br: Desenvolvedores do GNU Guix
ru: Разработчики GNU Guix
sk: Vývojári GNU Guix
sv: GNU Guix-utvecklarna

source: This document presents tutorials and detailed examples for GNU@tie{}Guix, a functional package management tool written for the GNU system. Please @pxref{Top,,, guix, GNU Guix reference manual} for details about the system, its API, and related concepts.
es: Este documento presenta tutoriales y ejemplos detallados para GNU@tie{}Guix, una herramienta funcional de paquetes para el sistema GNU. Por favor @pxref{Top,,, guix.es, Manual de referencia de GNU Guix} para detalles acerca del sistema, su API, y conceptos relacionados.
it: Questo documento presenta tutorial ed esempi dettagliati per GNU@tie{}Guix, uno strumento di gestione pacchetti funzionale scritto per il sistema GNU. Si prega di @pxref{Top,,, guix.it, manuale di riferimento di GNU Guix} per dettagli sul sistema, la sua API e i concetti correlati.
pt_br: Este documento apresenta tutoriais e exemplos detalhados para o GNU@tie{}Guix, uma ferramenta funcional de gerenciamento de pacotes escrita para o sistema GNU. Por favor, acesse o @pxref{Top,,, guix.pt_BR, Manual de Referência do GNU Guix} para mais detalhes sobre o sistema, sua API, e conceitos relacionados.
ru: В этом документе представлены учебные пособия и подробные примеры для GNU@tie{}Guix, инструмента для функционального управления пакетами, написанного для системы GNU. Пожалуйста, @pxref{Top,,, guix.ru, справочное руководство GNU Guix} для получения подробной информации о системе, ее API и связанных с ней идеях.
sk: Tento dokument obsahuje návody a podrobné príklady použitia GNU@tie{}Guix, funkcionálneho správcu balíkov napísaného pre systém GNU. Získajte viac podrobností o systéme, jeho API a súvisiacich pojmoch v @pxref{Top,,, guix, GNU Guix reference manual}.
sv: Det här dokumentet presenterar handledningar och detaljerade exempel för GNU@tie{}Guix, ett funktionellt pakethanteringsverktyg skrivet för GNU-systemet. Var god se @pxref{Top,,, guix, GNU Guix reference manual} för fler detaljer om systemet, dess API samt relaterade begrepp.

source: This manual is also available in Simplified Chinese (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), French (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), German (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), Korean (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), Spanish (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), Italian (@pxref{Top,,, guix-cookbook.it, Ricettario di GNU Guix}), Brazilian Portuguese (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), Russian (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), Slovak (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}), Swedish (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}), and Tamil (@pxref{Top,,, guix-cookbook.ta, GNU Guix கையேடு}). If you would like to translate this document in your native language, consider joining @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Translating Guix,,, guix, GNU Guix Reference Manual}).
it: Questo manuale è disponibile anche in inglese (@pxref{Top,,, guix-cookbook, GNU Guix Cookbook}), francese (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), cinese semplificato (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), tedesco (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), coreano (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), spagnolo (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), portoghese brasiliano (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), russo (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), slovacco (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}), svedese (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}) e tamulo (@pxref{Top,,, guix-cookbook.ta, GNU Guix கையேடு}). Se desideri tradurre questo documento nella tua lingua madre, considera di unirti a @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Tradurre Guix,,, guix.it, Manuale di riferimento di GNU Guix}).
ru: Это руководство также доступно на английском (@pxref{Top,,, guix-cookbook, GNU Guix Cookbook}), (упрощённом) китайском языке (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), французском (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), немецком (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), корейском (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), испанском (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), итальянском (@pxref{Top,,, guix-cookbook.it, Ricettario di GNU Guix}), бразильский португальский (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), словацкий (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}), шведский (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}) и тами́льском (@pxref{Top,,, guix-cookbook.ta, GNU Guix கையேடு}). Если вы хотите перевести этот документ на свой родной язык, присоединяйтесь к @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Перевод Guix на другие языки,,, guix.ru, Руководство по GNU Guix}).
sv: Den här manualen är också tillgänglig på engelska (@pxref{Top,,, guix-cookbook, GNU Guix Cookbook}), förenklade kinesiska (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), franska (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), tysa (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), koreanska (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), spanska (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), italienska (@pxref{Top,,, guix-cookbook.it, Ricettario di GNU Guix}), brasiliansk portugisiska (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), ryska (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), slovakiska (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}) och tamilska (@pxref{Top,,, guix-cookbook.ta, GNU Guix கையேடு}). Överväg att gå med @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Translating Guix,,, guix, GNU Guix reference manual}) om du vill översätta det här dokumentet till ditt modersmål.

source: Scheme tutorials
es: Tutoriales de Scheme
it: Tutorial di Scheme
pt_br: Tutoriais sobre Scheme
ru: Учебник по Scheme
sk: Návody na Scheme
sv: Handledningar för Scheme

source: Meet your new favorite language!
es: ¡Conoce a tu nuevo lenguaje favorito!
it: Incontra il tuo nuovo linguaggio preferito!
pt_br: Conheça sua nova linguagem favorita!
ru: Встречайте свой новый любимый язык!
sk: Zoznámte sa s vašim novým najobľúbenejším jazykom!
sv: Träffa ditt nya favoritspråk!

source: Packaging
es: Empaquetado
it: Impacchettamento
pt_br: Empacotamento
ru: Управление пакетами
sk: Zadávanie balíkov
sv: Paketering

source: Packaging tutorials
es: Tutoriales de empaquetado
it: Tutorial sull'impacchettamento
pt_br: Tutoriais sobre empacotamento
ru: Руководство по управлению пакетами
sk: Návody na zadávanie balíkov
sv: Paketeringshandledningar

source: System Configuration
es: Configuración del sistema
it: Configurazione di sistema
pt_br: Configuração do sistema
ru: Настройка системы
sk: Nastavenie systému
sv: Systemkonfiguration

source: Customizing the GNU System
es: Personalizar el sistema GNU
it: Personalizzazione del Sistema GNU
pt_br: Customizando o Sistema GNU
ru: Настройка системы GNU
sk: Prispôsobenie systému GNU
sv: Att anpassa GNU System

source: Containers
es: Contenedores
it: Contenitori
pt_br: Contêineres
ru: Контейнеры
sk: Kontajnery
sv: Behållare

source: Isolated environments and nested systems
es: Entornos aislados y sistemas anidados
it: Ambienti isolati e sistemi annidati
pt_br: Ambientes isolados e sistemas aninhados
ru: Изолированные среды и встроенные системы
sk: Oddelené prostredia a vnorené systémy
sv: Isolerade miljöer och nästlade system

source: Virtual Machines
es: Máquinas virtuales
it: Macchine virtuali
pt_br: Máquinas Virtuais
ru: Виртуальные машины
sk: Virtuálne stroje
sv: Virtuella maskiner

source: Virtual machines usage and configuration
es: Uso y configuración de máquinas virtuales
it: Uso e configurazione delle macchine virtuali
pt_br: Uso e configuração de máquinas virtuais
ru: Использование и настройка виртуальных машин
sk: Nastavenie a používanie virtuálnych strojov
sv: Virtuell maskinanvändning och konfiguration

source: Advanced package management
es: Gestión avanzada de paquetes
it: Gestione avanzata dei pacchetti
pt_br: Gerenciamento avançado de pacotes
ru: Расширенное управление пакетами
sk: Pokročilá správa balíkov
sv: Avancerad pakethantering

source: Power to the users!
es: ¡Poder para los usuarios!
it: Potere agli utenti!
pt_br: Poder aos usuários!
ru: Власть пользователям!
sk: Moc pre používateľov!
sv: Makt till användarna!

source: Software Development
es: Desarrollo de software
it: Sviluppo software
pt_br: Desenvolvimento de software X
ru: Разработка программного обеспечения
sk: Vývoj programového vybavenia
sv: Programutveckling

source: Environments, continuous integration, etc.
es: Entornos, integración continua, etc.
it: Ambienti, integrazione continua, ecc.
pt_br: Ambientes, integração contínua, etc.
ru: Окружения среды, непрерывная интеграция и т. д.
sk: Prostredia, priebežné zaraďovanie, atď.
sv: Miljöer, kontinuerlig integration etcetera.

source: Environment management
es: Gestión del entorno
it: Gestione dell'ambiente
pt_br: Gerenciamento de ambientes
ru: Управление окружающей средой
sk: Správa prostredí
sv: Miljöhantering

source: Control environment
es: Control del entorno
it: Ambiente di controllo
pt_br: Ambiente de controle
ru: Управление окружением
sk: Kontrolné prostredie
sv: Kontrollmiljö

source: Installing Guix on a Cluster
es: Instalación de Guix en un clúster
it: Installare Guix su un Cluster
pt_br: Instalando Guix em um Cluster
sk: Inštalácia Guixu na zhluk počítačov

source: High-performance computing.
es: Computación de alto rendimiento.
it: Calcolo ad alte prestazioni.
pt_br: Computação de alta performance.
ru: Высокопроизводительные вычисления.
sk: Vysokovýkonné počítanie.
sv: Högpresterande databehandling.

source: Guix System Management
es: Gestión del sistema Guix
it: Gestione del Sistema Guix
pt_br: Gerenciamento do sistema Guix
ru: Управление системой Guix
sk: Správa systému Guix

source: System Management specifics.
es: Especificidades de la gestión del sistema.
it: Specifiche della gestione di sistema.
pt_br: Especificidades de gerenciamento de sistema.
ru: Особенности управления системой.
sk: Osobitosti správy systému.

source: Acknowledgments
es: Agradecimientos
it: Ringraziamenti
pt_br: Agradecimentos
ru: Благодарности
sk: Poďakovanie
sv: Erkännanden

source: Thanks!
es: ¡Gracias!
it: Grazie!
pt_br: Obrigado!
ru: Спасибо!
sk: Ďakujeme!
sv: Tack!

source: GNU Free Documentation License
es: Licencia de documentación libre GNU
it: Licenza di Documentazione Libera GNU
pt_br: Licença de Documentação Livre GNU
ru: Лицензия свободной документации GNU
sk: Licencia GNU Free Documentation
sv: GNU's licens för fria dokumentation

source: The license of this document.
es: La licencia de este documento.
it: La licenza di questo documento.
pt_br: A licença deste documento.
ru: Лицензия этого документа.
sk: Licencia, ktorej podlieha tento dokument.
sv: Licensen för det här dokumentet.

source: Concept Index
es: Índice de conceptos
it: Indice dei concetti
pt_br: Índice de conceitos
ru: Термины и указатели
sk: Zoznam pojmov
sv: Begreppslista

source: Concepts.
es: Conceptos.
it: Concetti.
pt_br: Conceitos.
ru: Понятия.
sk: Pojmy.
sv: Begrepp.

source: --- The Detailed Node Listing ---
es: --- La lista detallada de nodos ---
it: --- L'Elenco Dettagliato dei Nodi ---
pt_br: --- A listagem detalhada de nós ---
ru: --- Детальный список записей ---
sk: --- Podrobný zoznam uzlov ---

source: A Scheme Crash Course
es: Curso acelerado de Scheme
it: Un corso intensivo di Scheme
pt_br: Um curso intensivo de Scheme
ru: Ускоренный курс по Scheme
sk: Zrýchlené školenie jazyka Scheme
sv: En snabbkurs i Scheme

source: Packaging Tutorial
es: Tutorial de empaquetado
it: Tutorial sull'Impacchettamento
pt_br: Tutorial sobre empacotamento
ru: Руководство по пакетам
sk: Návod na zadávanie balíkov
sv: Pakteringshandledning

source: A tutorial on how to add packages to Guix.
es: Un tutorial sobre cómo añadir paquetes a Guix.
it: Un tutorial su come aggiungere pacchetti a Guix.
pt_br: Um tutorial sobre como adicionar pacotes ao Guix.
ru: Учебник о том, как добавлять пакеты в Guix.
sk: Návod na pridávanie balíkov do Guixu.
sv: En handledning i hur man lägger till paket till Guix.

source: A ``Hello World'' package
es: Un paquete ``Hola Mundo''
it: Un pacchetto "Hello World"
pt_br: Um pacote ``Hello World''
ru: Пакет ``Hello World''
sk: Balík „Vitaj svet“
sv: Ett ``Hello World'' -paket

source: Setup
es: Ajuste
it: Configurazione
pt_br: Configuração
ru: Настройка
sk: Nastavenie
sv: Inställning

source: Extended example
es: Ejemplo ampliado
it: Esempio esteso
pt_br: Exemplo estendido
ru: Расширенный пример
sk: Zložitejší príklad
sv: Utökat exempel

source: Other build systems
es: Otros sistemas de construcción
it: Altri sistemi di build
pt_br: Outros sistemas de construção
ru: Другие системы сборки
sk: Ďalšie zostavovacie systémy
sv: Andra byggsystem

source: Programmable and automated package definition
es: Definición de paquetes programable y automatizada
it: Definizione di pacchetto programmabile e automatizzata
pt_br: Definição de pacote programável e automatizada
ru: Программируемое и автоматизированное определение пакетов
sk: Programovateľné a automatické zadávanie balíkov
sv: Programmeringsbar och automatiserad paketdefinition

source: Getting help
es: Obtener ayuda
it: Ottenere aiuto
pt_br: Obtendo ajuda
ru: Получить помощь
sk: Získavanie pomoci
sv: Få hjälp

source: Conclusion
es: Conclusión
it: Conclusione
pt_br: Conclusão
ru: Заключение
sk: Záver
sv: Slutsats

source: References
es: Referencias
it: Riferimenti
pt_br: Referências
ru: Ссылки
sk: Odkazy
sv: Referenser

source: Local file
es: Archivo local
it: File locale
pt_br: Arquivo local
ru: Локальный файл
sk: Miestny súbor
sv: Lokal fil

source: Channels
es: Canales
it: Canali
pt_br: Canais
ru: Каналы
sk: Kanály
sv: Kanaler

source: Direct checkout hacking
es: Jaqueo directo de revisión de código
it: Modifica diretta dal checkout
pt_br: Conferir o hacking direto
ru: Работа с копией репозитория напрямую
sk: Priamy zásah do git repozitára

source: Recursive importers
es: Importadores recursivos
it: Importatori ricorsivi
pt_br: Importadores recursivos
ru: Рекурсивные импортеры
sk: Rekurzívne nahrávače

source: Automatic update
es: Actualizaciones automáticas
it: Aggiornamento automatico
pt_br: Atualização automática
ru: Автоматическое обновление
sk: Automatické aktualizácie
sv: Automatisk uppdatering

source: Inheritance
es: Herencia
it: Ereditarietà
pt_br: Herança
ru: Наследование
sk: Dedičnosť
sv: Arv

source: Auto-Login to a Specific TTY
es: Inicio de sesión automático en un TTY específico
it: Accesso automatico a una TTY specifica
pt_br: Login automático em um TTY específico
ru: Автоматический вход на заданный TTY
sk: Automatické pripojenie k určitému TTY

source: Automatically Login a User to a Specific TTY
es: Iniciar automáticamente la sesión de un usuario en un TTY específico
it: Accedere automaticamente un utente a una TTY specifica
pt_br: Faça login automaticamente de um usuário em um TTY específico
ru: Автоматический вход пользователя на заданный TTY
sk: Automaticky pripojiť používateľa k určitému TTY

source: Customizing the Kernel
es: Personalización del kernel
it: Personalizzazione del kernel
pt_br: Customizando o Kernel
ru: Настройка ядра
sk: Prispôsobenie jadra
sv: Att anpassa kärnan

source: Creating and using a custom Linux kernel on Guix System.
es: Creación y uso de un núcleo Linux personalizado en el sistema Guix.
it: Creazione e utilizzo di un kernel Linux personalizzato su Guix System.
pt_br: Criando e usando um kernel Linux customizado no Sistema Guix.
ru: Создание и использование собственного ядра Linux в системе Guix.
sk: Vytvorenie a používanie vlastného Linuxového jadra v systéme Guix.
sv: Att skapa och använda en anpassad Linux-kärna på Guix System.

source: Guix System Image API
es: API de imagen del sistema Guix
it: API immagine di Sistema Guix
pt_br: API de imagem do sistema Guix
ru: API образа Guix системы
sk: API pre vytváranie obrazov systému Guix

source: Customizing images to target specific platforms.
es: Personalización de imágenes para dirigirlas a plataformas específicas.
it: Personalizzazione di immagini per piattaforme specifiche.
pt_br: Customizando imagens visando plataformas específicas.
ru: Настройка образов для конкретных платформ.
sk: Prispôsobenie obrazov nezvyčajným platformám.

source: Using security keys
es: Utilización de claves de seguridad
it: Utilizzo di chiavi di sicurezza
pt_br: Usando chaves de segurança
ru: Использование ключей безопасности
sk: Používanie bezpečnostných kľúčov
sv: Att använda säkerhetsnycklar

source: How to use security keys with Guix System.
es: Cómo utilizar claves de seguridad con Guix System.
it: Come usare le chiavi di sicurezza con Guix System.
pt_br: Como usar chaves de segurança com o Sistema Guix.
ru: Как использовать ключи безопасности с системой Guix.
sk: Ako používať bezpečnostné kľúče so systémom Guix.
sv: Hur man använder säkerhetsnycklar med Guix System.

source: Dynamic DNS mcron job
es: Tarea mcron de DNS dinámico
it: Processo mcron per DNS dinamico
pt_br: Trabalho mcron de DNS dinâmico
ru: Динамическая задача DNS mcron
sk: mcron úloha pre dynamický DNS

source: Job to update the IP address behind a DuckDNS host name.
es: Tarea para actualizar la dirección IP detrás de un nombre de anfitrión DuckDNS.
it: Processo per aggiornare l'indirizzo IP dietro un nome host DuckDNS.
pt_br: Tarefa para atualizar o endereço IP por trás de um nome de host DuckDNS.
ru: Задача на обновление IP-адреса, находящегося по имени хоста DuckDNS.
sk: Úloha na aktualizovanie IP adresy v pozadí názvu hostiteľa DuckDNS.

source: Connecting to Wireguard VPN
es: Conexión a Wireguard VPN
it: Connessione a una VPN Wireguard
pt_br: Conectando-se à VPN Wireguard
ru: Подключение к Wireguard VPN
sk: Pripojenie k Wireguard VPN
sv: Att ansluta till Wireguard VPN

source: Connecting to a Wireguard VPN.
es: Conexión a una VPN Wireguard.
it: Connessione a una VPN Wireguard.
pt_br: Conectando-se a uma VPN Wireguard.
ru: Подключение к Wireguard VPN.
sk: Pripojenie k Wireguard VPN sieti.
sv: Att ansluta till en Wireguard VPN.

source: Customizing a Window Manager
es: Personalizar un gestor de ventanas
it: Personalizzazione di un Window Manager
pt_br: Customizando um Gerenciador de Janelas
ru: Настройка оконного менеджера
sk: Prispôsobenie správcu okien
sv: Att anpassa en fönsterhanterare

source: Handle customization of a Window manager on Guix System.
es: Manejar la personalización de un gestor de ventanas en el sistema Guix.
it: Gestire la personalizzazione di un Window Manager su Guix System.
pt_br: Customização de um gerenciador de janelas no Sistema Guix.
ru: Управление настройкой оконного менеджера в системе Guix.
sk: Spravovať prispôsobenie správcu okien v systéme Guix.

source: Running Guix on a Linode Server
es: Ejecución de Guix en un servidor Linode
it: Eseguire Guix su un Server Linode
pt_br: Executando Guix em um Servidor Linode
ru: Запуск Guix на сервере Linode
sk: Spúšťanie Guixu na serveri Linode
sv: Att köra Guix på en Linode-server
