Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Running Guix on a Linode Server.
es: Ejecución de Guix en un servidor Linode.
it: Eseguire Guix su un Server Linode.
pt_br: Executando Guix em um Servidor Linode.
ru: Запуск Guix на сервере Linode.
sk: Spúšťanie Guixu na serveri Linode.
sv: Att köra Guix på en Linode-server.

source: Running Guix on a Kimsufi Server
es: Ejecución de Guix en un servidor Kimsufi
it: Eseguire Guix su un Server Kimsufi
pt_br: Executando Guix em um servidor Kimsufi
ru: Запуск Guix на сервере Kimsufi
sk: Spúšťanie Guixu na Kimsufi serveri
sv: Att köra Guix på en Kimsufi-server

source: Running Guix on a Kimsufi Server.
es: Ejecución de Guix en un servidor Kimsufi.
it: Eseguire Guix su un Server Kimsufi.
pt_br: Executando Guix em um servidor Kimsufi.
ru: Запуск Guix на сервере Kimsufi.
sk: Spúšťanie Guixu na Kimsufi serveri.
sv: Att köra Guix på en Kimsufi-server.

source: Setting up a bind mount
es: Instalar un montaje enlazado
it: Configurazione di un bind mount
pt_br: Configurando uma montagem vinculada
ru: Настройка привязки
sk: Nastavenie podvojného pripojenia

source: Setting up a bind mount in the file-systems definition.
es: Instalar un ‘bind mount’ dentro de definición de sistemas de archivos.
it: Configurazione di un bind mount nella definizione dei file system.
pt_br: Configurando uma montagem vinculada na definição de sistemas de arquivos.
ru: Настройка привязки при определении файловых систем.
sk: Nastavenie podvojného pripojenia v zadaní systému súborov.

source: Getting substitutes from Tor
es: Obtener sustituciones desde Tor
it: Ottenere sostituti da Tor
pt_br: Obtendo substitutos pelo Tor
ru: Получение подмен из Tor
sk: Získavanie náhrad prostredníctvom Tor
sv: Att få ersättningar från Tor

source: Configuring Guix daemon to get substitutes through Tor.
es: Configurar el daemon Guix para obtener sustituciones desde Tor.
it: Configurazione del demone Guix per ottenere sostituti tramite Tor.
pt_br: Configurando o daemon Guix para obter substitutos através do Tor.
ru: Настройка демона Guix для получения подстановок через Tor.
sk: Nastavenie démona Guix na získavanie náhrad cez Tor.
sv: Konfigurerar Guix-demon för att få ersättningar genom Tor.

source: Setting up NGINX with Lua
es: Instalar NGINX con Lua
it: Configurazione di NGINX con Lua
pt_br: Configurando NGINX com Lua
ru: Настройка NGINX с Lua
sk: Nastavenia NGINX a Lua
sv: Ställa in NGINX med Lua

source: Configuring NGINX web-server to load Lua modules.
es: Configurar servidor de web NGINX para cargar módulos Lua.
it: Configurazione del server web NGINX per caricare i moduli Lua.
pt_br: Configurando o servidor web NGINX para carregar módulos Lua.
ru: Настройка веб-сервера NGINX для загрузки модулей Lua.
sk: Nastavenie web-servera NGINX na načítavanie Lua modulov.
sv: Att konfigurera webbserver för NGINX till att läsa in Lua-moduler.

source: Music Server with Bluetooth Audio
es: Servidor de música con sonido Bluetooth
it: Server musicale con audio Bluetooth
pt_br: Servidor de música com áudio Bluetooth
ru: Музыкальный сервер с Bluetooth-аудио
sk: Hudobný server so zvukom cez Bluetooth
sv: Musikserver med Bluetooth-ljud

source: Headless music player with Bluetooth output.
es: Reproductor de música sin cabeceras con salida Bluetooth.
it: Lettore musicale headless con uscita Bluetooth.
pt_br: Leitor de música com saída Bluetooth.
ru: Безинтерфейсный music player with Bluetooth output.
sk: Bezobrazovkový prehrávač hudby s Bluetooth výstupom.

source: Session lock
es: Bloqueo de sesión
it: Blocco sessione
pt_br: Bloqueio de sessão
ru: Блокировка сессии
sk: Uzamykanie sedenia
sv: Sessionslås

source: Guix Containers
es: Contenedores Guix
it: Contenitori Guix
pt_br: Contêineres Guix
ru: Guix Контейнеры
sk: Kontajnery Guix
sv: Guix-behållare

source: Perfectly isolated environments
es: Entornos perfectamente aislados
it: Ambienti perfettamente isolati
pt_br: Ambientes perfeitamente isolados
ru: Идеально изолированные окружения
sk: Dokonale oddelené prostredia
sv: Perfekt isolerade miljöer

source: Guix System Containers
es: Contenedores de Sistema Guix
it: Contenitori di Sistema Guix
pt_br: Contêineres do Sistema Guix
ru: Guix System контейнеры
sk: Kontajnery systému Guix
sv: Guix System-behållare

source: A system inside your system
es: Un sistema interno a su sistema
it: Un sistema dentro il tuo sistema
pt_br: Um sistema dentro do seu sistema
ru: Система внутри вашей системы
sk: Systém vo vašom systéme
sv: Ett system inuti ditt system

source: A Database Container
es: Un contenedor de base de datos
it: Un contenitore Database
pt_br: Um banco de dados de contêineres
ru: Контейнер базы данных
sk: Databázový kontajner
sv: En databasbehållare

source: Container Networking
es: Red de Contenedor
it: Networking dei contenitori
pt_br: Rede em contêineres
ru: Работа с сетями контейнеров
sk: Prístup do siete vrámci kontajnera

source: Network bridge for QEMU
es: Puente de red para QEMU
it: Ponte di rete per QEMU
pt_br: Ponte de rede para QEMU
ru: Сетевый мост для QEMU
sk: Sieťový most pre QEMU
sv: Nätverksbrygga för QEMU

source: Routed network for libvirt
es: Red enrutada para libvirt
it: Rete instradata per libvirt
pt_br: Roteamento de rede para libvirt
ru: Маршрутизируемая сеть для libvirt
sk: Smerovaná sieť pre libvirt

source: Custom NAT-based network for libvirt
es: Red basada en NAT personal para libvirt
it: Rete personalizzata basata su NAT per libvirt
pt_br: Rede baseado em NAT customizado para libvirt
ru: Пользовательская сеть NAT для libvirt

source: References: VM References
es: Referencias: Referencias de MV
it: Riferimenti: Riferimenti VM
pt_br: Referências: Referências de MV

source: Further reading on virtual machines.
es: Más lecturas sobre máquinas virtuales.
it: Ulteriori letture sulle macchine virtuali.
pt_br: Leituras adicionais sobre máquinas virtuais.
ru: Дополнительная информация по виртуальным машинам.

source: Guix Profiles in Practice
es: Perfiles Guix en práctica
it: Profili Guix in pratica
pt_br: Perfis Guix na Prática
ru: Guix профили на практике
sk: Profily Guix v praxi
sv: Guix-profiler i praktiken

source: Strategies for multiple profiles and manifests.
es: Estrategias para múltiples perfiles y declaraciones.
it: Strategie per profili e manifesti multipli.
pt_br: Estratégias para múltiplos perfis e manifestos.
ru: Стратегии для множества профилей и манифестов.
sk: Postupy pre spravovanie viacerých profilov a balíkospisov.
sv: Strategier för multipla profiler och manifest.

source: Basic setup with manifests
es: Configuración base con declaraciones
it: Configurazione di base con i manifesti
pt_br: Configuração básica com manifestos
ru: Базовая настройка с манифестами
sk: Základné použitie balíkospisov
sv: Grundläggande inställning med manifest

source: Required packages
es: Paquetes requeridos
it: Pacchetti richiesti
pt_br: Pacotes necessários
ru: Требуемые пакеты
sk: Požadované balíky
sv: Nödvändiga paket

source: Default profile
es: Perfil por defecto
it: Profilo predefinito
pt_br: Perfil padrão
ru: Профиль по-умолчанию
sk: Predvolený profil
sv: Standardprofil

source: The benefits of manifests
es: Los beneficios de declaraciones
it: I benefici dei manifesti
pt_br: Os benefícios dos manifestos
ru: Преимущества манифестов
sk: Výhody balíkospisov
sv: Manifestens fördelar

source: Reproducible profiles
es: Perfiles reproducibles
it: Profili riproducibili
pt_br: Perfis reproduzíveis
ru: Воспроизводимые профили
sk: Opakovateľné profily
sv: Reproducerbara profiler

source: Getting Started
es: Empezando
it: Per iniziare
pt_br: Começando
ru: Начало работы
sk: Začíname
sv: Att komma igång

source: Step 0: using `guix shell'.
es: Paso 0: utilizar `guix shell'.
it: Passo 0: usare `guix shell'.
pt_br: Passo 0: usando `guix shell'.
ru: Шаг 0: использование `guix shell'.
sk: Krok 0: použitie „guix shell“.
sv: Steg 0: att använda `guix shell'.

source: Building with Guix
es: Compilar con Guix
it: Costruire con Guix
pt_br: Construindo com Guix
ru: Сборка с Guix
sk: Zostavovanie s Guixom
sv: Att bygga med Guix

source: Step 1: building your code.
es: Paso 1: compilar su código.
it: Passo 1: compilare il tuo codice.
pt_br: Etapa 1: construindo seu código.
ru: Шаг 1: Создание вашего кода.
sk: Krok 1: zostavenie vášho kódu.
sv: Steg 1: att bygga din kod.

source: The Repository as a Channel
es: El repositorio como un canal
it: Il repository come canale
pt_br: O Repositório como um Canal
ru: Репозиторий как канал
sk: Repozitár ako kanál
sv: Förrådet som en kanal

source: Step 2: turning the repo in a channel.
es: Paso 2: ajustar el repo en un canal.
it: Passo 2: trasformare il repo in un canale.
pt_br: Passo 2: transformar o repositório em um canal.
ru: Шаг 2: превращение репозитория в канал.
sk: Krok 2: premena repozitára na kanál.

source: Package Variants
es: Variantes de paquetes
it: Varianti di pacchetto
pt_br: Variantes de Pacotes
ru: Варианты пакета
sk: Obmeny balíkov
sv: Paketvarianter

source: Bonus: Defining variants.
es: Bono: definir variantes.
it: Bonus: Definire le varianti.
pt_br: Bônus: definição de variantes.
ru: Бонус: Определение вариантов.
sk: Prídavok: Zadávanie obmien.

source: Setting Up Continuous Integration
es: Configurar Integración Continua
it: Configurazione dell'integrazione continua
pt_br: Configurando Integração Contínua
ru: Настройка непрерывной интеграции
sk: Nastavenie priebežného zaraďovania
sv: Att ställa in kontinuerlig integration

source: Step 3: continuous integration.
es: Paso 3: integración continua.
it: Passo 3: integrazione continua.
pt_br: Etapa 3: integração contínua.
ru: Шаг 3: непрерывная интеграция.
sk: Krok 3: priebežné zaraďovanie.
sv: Steg 3: kontinuerlig integration.

source: Build Manifest
es: Compilar manifiesto
it: Manifesto di build
pt_br: Construir Manifesto
ru: Манифест сборки
sk: Zostavovací balíkospis
sv: Byggmanifest

source: Bonus: Manifest.
es: Bono: Manifiesto.
it: Bonus: Manifesto.
pt_br: Bônus: Manifesto.
ru: Бонус: Манифест.
sk: Prídavok: Balíkospis.

source: Wrapping Up
es: Cobertura
it: In conclusione
pt_br: Empacotando
ru: Подводя итоги
sk: Zhrnutie

source: Recap.
es: Resumen.
it: Riepilogo.
pt_br: Recapitular.
ru: Резюме.
sk: Súhrn.
sv: Sammanfattning.

source: Guix environment via direnv
es: Entorno Guix por direnv
it: Ambiente Guix tramite direnv
pt_br: Ambiente Guix via direnv
ru: Окружение Guix через direnv
sk: Guix prostredie cez direnv
sv: Guix-miljö via direnv

source: Setup Guix environment with direnv
es: Configurar entorno Guix con direnv
it: Configura l'ambiente Guix con direnv
pt_br: Configurar ambiente Guix com o direnv
ru: Установка среды Guix с direnv
sk: Vytvoriť Guix prostredie pomocou direnv
sv: Ställa in Guix-miljö med direnv

source: Setting Up a Head Node
es: Configurar un nodo de cabecera
it: Configurazione di un nodo principale
pt_br: Configurando um nó principal
ru: Настройка головного узла
sk: Nastavenie hlavného uzla

source: The node that runs the daemon.
es: El nodo que ejecuta el daemon.
it: Il nodo che esegue il demone.
pt_br: O nó que executa o daemon.
ru: Узел, запускающий демон.
sk: Uzol, ktorý spúšťa démona.
sv: Noden som kör demonen.

source: Setting Up Compute Nodes
es: Configurar nodos de cálculo
it: Configurazione dei nodi di calcolo
pt_br: Configurando nós de computação
ru: Настройка вычислительных узлов
sk: Nastavenie výpočtových uzlov

source: Client nodes.
es: Nodos cliente.
it: Nodi client.
pt_br: Nós clientes.
ru: Клиентские узлы.
sk: Klientske uzly.
sv: Klientnoder.

source: Cluster Network Access
es: Acceso a red de racimo
it: Accesso alla rete del cluster
pt_br: Acesso à rede de cluster
ru: Доступ в сети кластеров
sk: Prístup do siete zhluku

source: Dealing with network access restrictions.
es: Tratando con restricciones de acceso a red.
it: Gestione delle restrizioni di accesso alla rete.
pt_br: Lidando com restrições de acesso à rede.
ru: Решение проблем с ограничениями доступа к сети.
sk: Správa obmedzení pre vstup do siete.

source: Cluster Disk Usage
es: Empleo del disco en racimo
it: Utilizzo del disco del cluster
pt_br: Uso de disco de cluster
ru: Использование кластерного диска
sk: Využitie diskového priestoru zhluku

source: Disk usage considerations.
es: Consideraciones de uso del disco.
it: Considerazioni sull'utilizzo del disco.
pt_br: Considerações sobre o uso do disco.
ru: Примечания по использованию дискового пространства.
sk: Úvahy o využití diskového priestoru.

source: Cluster Security Considerations
es: Consideraciones de seguridad del racimo
it: Considerazioni sulla sicurezza del cluster
pt_br: Considerações sobre segurança de cluster
ru: Примечания по безопасности кластеров
sk: Úvahy o zabezpečení zhluku

source: Keeping the cluster secure.
es: Conservar el racimo seguro.
it: Mantenere il cluster sicuro.
pt_br: Mantendo o cluster seguro.
ru: Защита кластера от угроз.
sk: Udržiavanie zhluku v bezpečí.

source: Upgrade Postgres for Cuirass
es: Modernizar Postgres para Cuirass
it: Aggiornare Postgres per Cuirass
pt_br: Atualizar Postgres para Cuirass
ru: Обновить Postgres для Cuirass
sk: Aktualizovať Postgres pre Cuirass

source: Upgrading from the default postgres.
es: Modernizar desde el postgres predeterminado.
it: Aggiornamento dal postgres predefinito.
pt_br: Atualizando do postgres padrão.

source: GNU@tie{}Guix is written in the general purpose programming language Scheme, and many of its features can be accessed and manipulated programmatically. You can use Scheme to generate package definitions, to modify them, to build them, to deploy whole operating systems, etc.
es: GNU@tie{}Guix está escrito en el lenguaje de programación de propósito general Scheme, y muchas de sus características pueden ser accedidas y manipuladas mediante programación. Puede utilizar Scheme para generar definiciones de paquetes, para modificarlos, para construirlos, para desplegar sistemas operativos completos, etc.
it: GNU@tie{}Guix è scritto nel linguaggio di programmazione generico Scheme, e molte delle sue funzionalità possono essere accessibili e manipolate programmaticamente. Puoi usare Scheme per generare definizioni di pacchetti, per modificarle, per compilarle, per distribuire interi sistemi operativi, ecc.
pt_br: GNU@tie{}Guix foi escrito na linguagem de programação de uso geral Scheme, e muitos de seus recursos podem ser acessados e manipulados programaticamente. Você pode usar Scheme para gerar definições de pacotes, modificá-los, construí-los, implantar sistemas operacionais inteiros, etc.
ru: GNU@tie{}Guix написан на языке программирования общего назначения Scheme, и многие его функции могут быть доступны и управляться программным образом. Scheme может быть использована для генерации определений пакетов, их модификации, сборки, установки всей операционной системы и т.д.
sk: GNU@tie{}Guix je zapísaný v programovacom jazyku Scheme. K mnohým jeho súčastiam je možné pristupovať a upravovať ich prostredníctvom programovania. Pomocou jazyka Scheme môžete zadávať, upravovať a zostavovať balíky, nasadzovať celé operačné systémy, atď.
sv: GNU@tie{}Guix är skrivet i universalspråket Scheme och många av dess funktioner kan nås och manipuleras programmatiskt. Du kan använda Scheme för att generera paketdefinitioner, ändra dem, bygga dem, utveckla ett helt operativsystem med mera.

source: Knowing the basics of how to program in Scheme will unlock many of the advanced features Guix provides --- and you don't even need to be an experienced programmer to use them!
es: Saber lo básico de cómo programar en Scheme desbloqueará muchas de las características avanzadas que Guix proporciona --- ¡y ni siquiera necesita ser un programador experimentado para usarlas!
it: Conoscere le basi di come programmare in Scheme sbloccherà molte delle funzionalità avanzate che Guix fornisce --- e non è nemmeno necessario essere un programmatore esperto per usarle!
pt_br: Conhecer o básico de como programar com Scheme irá desbloquear muitos dos recursos avançados que o Guix oferece --- e você nem precisa ser um programador experiente para usá-los!
ru: Знание основ программирования на Scheme сделает доступными многие расширенные функции Guix обеспечивает --- и вам даже не нужно быть опытным программистом для их использования!
sk: Poznať základy programovania v jazyku Scheme vám otvorí dvere k množstvu pokročilých súčastí, ktoré Guix ponúka --- a to ani nemusíte byť skúseným vývojárom, aby ste ich mohli využívať!
sv: Att känna till grunderna i hur man programmerar i Scheme kommer att ge dig många av de avancerade funktionerna som Guix tilhandahåller --- och du behöver inte vara en erfaren programmerare för att använda dem!

source: Let's get started!
es: ¡Empecemos!
it: Iniziamo!
pt_br: Vamos começar!
ru: Начнём же!
sk: Poďme na to!
sv: Låt oss börja!

source: Scheme, crash course
es: Scheme, curso intensivo
it: Scheme, corso intensivo
pt_br: Scheme, curso intensivo
ru: Scheme, курс для начинающих
sk: Scheme, rýchlokurz
sv: Scheme, snabbkurs

source: Guix uses the Guile implementation of Scheme. To start playing with the language, install it with @code{guix install guile} and start a @dfn{REPL}---short for @uref{https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop, @dfn{read-eval-print loop}}---by running @code{guile} from the command line.
es: Guix utiliza la implementación Guile de Scheme. Para empezar a jugar con el lenguaje, instálelo con @code{guix install guile} e inicie un @dfn{REPL}---abreviatura de @uref{https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop, @dfn{read-eval-print loop}}---ejecutando @code{guile} desde la línea de comandos.
it: Guix utilizza l'implementazione Guile di Scheme. Per iniziare a giocare con il linguaggio, installalo con @code{guix install guile} e avvia un @dfn{REPL} --- abbreviazione di @uref{https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop, @dfn{read-eval-print loop}} --- eseguendo @code{guile} dalla riga di comando.
pt_br: Guix usa a implementação Guile do Scheme. Para começar a brincar com a linguagem, instale-a com @code{guix install guile} e inicie um @dfn{REPL}---abreviação de @uref{https://pt.wikipedia.org/wiki/REPL, @dfn{read-eval-print loop}}---executando @code{guile} na linha de comando.
ru: Guix использует Guile имплементацию Scheme. Чтобы опробовать язык, установите его с помощью @code{guix install guile} и запустите @dfn{REPL}---сокращение от @uref{https://ru.wikipedia.org/wiki/REPL, @dfn{read-eval-print loop}}---запустив @code{guile} в командной строке.
sk: Guix používa Guile implementáciu jazyka Scheme. Ak si chcete tento jazyk vyskúšať, nainštalujte si Guile pomocou @code{guix install guile} a spustite @dfn{REPL}, tzv. @uref{https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop, @dfn{slučku čítaj-vykonaj-zobraz}}, zadaním @code{guile} v príkazovom riadku.
sv: Guix använder Guile-implementationen av Scheme. För att börja leka med språket kan du installera det med @code{guix install guile} och starta en @dfn{REPL}---en förkortning av @uref{https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop, @dfn{read-eval-print loop}}---genom att köra @code{guile} från kommandoraden.

source: Alternatively you can also run @code{guix shell guile -- guile} if you'd rather not have Guile installed in your user profile.
es: También puede ejecutar @code{guix shell guile -- guile} si prefiere no tener Guile instalado en su perfil de usuario.
it: In alternativa, puoi anche eseguire @code{guix shell guile -- guile} se preferisci non avere Guile installato nel tuo profilo utente.
pt_br: Alternativamente, você também pode executar @code{guix shell guile -- guile} se preferir não ter o Guile instalado em seu perfil de usuário.
ru: Кроме того, вы можете запускать @code{guix shell guile -- guile}, если у вас нет Guile в профиле пользователя.
sk: Môžete tiež použiť príkaz @code{guix shell guile -- guile} ak nechcete inštalovať Guile do vášho používateľského profilu.
sv: Alternativt kan du också köra @code{guix shell guile -- guile} om du hellre vill undvika att Guile installeras i din användarprofil.

source: In the following examples, lines show what you would type at the REPL; lines starting with ``@result{}'' show evaluation results, while lines starting with ``@print{}'' show things that get printed. @xref{Using Guile Interactively,,, guile, GNU Guile Reference Manual}, for more details on the REPL.
es: En los siguientes ejemplos, las líneas muestran lo que usted escribiría en la REPL; las líneas que comienzan con ``@result{}'' muestran los resultados de la evaluación, mientras que las líneas que comienzan con ``@print{}'' muestran las cosas que se mostren. Para más detalles sobre la REPL, @xref{Using Guile Interactively,,, guile, Manual de referencia de GNU Guile}.
it: Negli esempi seguenti, le righe mostrano cosa digiteresti nel REPL; le righe che iniziano con "@result{}" mostrano i risultati della valutazione, mentre le righe che iniziano con "@print{}" mostrano le cose che vengono stampate. @xref{Using Guile Interactively,,, guile, Manuale di riferimento di GNU Guile}, per maggiori dettagli sul REPL.
pt_br: Nos exemplos a seguir, as linhas mostram o que você digitaria no REPL; linhas que começam com ``@result{}'' mostram resultados de avaliação, enquanto linhas que começam com ``@print{}'' mostram coisas que são exibidas. @xref{Using Guile Interactively,,, guile, Manual de referência do GNU Guile}, para mais detalhes sobre o REPL.
ru: В следующих примерах строки показывают то, что вы будете вводить в REPL; строки, начинающиеся с ``@result{}'', показывают вычислительные результаты, в то время как строки, начинающиеся с ``@print{}'', показывают напечатанные вещи. @xref{Using Guile Interactively,,, guile, GNU Guile Reference Manual}, для более подробной информации о REPL.
sk: Riadky v nasledovných príkladoch znázorňujú to, čo treba zadať v rámci REPL; riadky začínajúce na „@result{}“ znázorňujú výsledok vykonania príkazu, zatiaľ čo riadky začínajúce na „@print{}“ znázorňujú to čo sa zobrazí na obrazovke. @xref{Using Guile Interactively,,, guile, GNU Guile Reference Manual}, pre viac podrobností o REPL.
