Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Scheme syntax boils down to a tree of expressions (or @emph{s-expression} in Lisp lingo). An expression can be a literal such as numbers and strings, or a compound which is a parenthesized list of compounds and literals. @code{#true} and @code{#false} (abbreviated @code{#t} and @code{#f}) stand for the Booleans ``true'' and ``false'', respectively.
es: La sintaxis de Scheme se reduce a un árbol de expresiones (o @emph{s-expression} en la jerga de Lisp). Una expresión puede ser un literal como números y cadenas, o un compuesto que es una lista entre paréntesis de compuestos y literales. @code{#true} y @code{#false} (abreviados @code{#t} y @code{#f}) representan los booleanos ``true'' y ``false'', respectivamente.
it: La sintassi di Scheme si riduce a un albero di espressioni (o @emph{s-expression} nel gergo Lisp). Un'espressione può essere un letterale come numeri e stringhe, o un composto che è una lista tra parentesi di composti e letterali. @code{#true} e @code{#false} (abbreviato @code{#t} e @code{#f}) rappresentano i booleani "vero" e "falso", rispettivamente.
pt_br: A sintaxe de Scheme se resume a uma árvore de expressões (ou @emph{s-expression} no jargão Lisp). Uma expressão pode ser um literal, como números e strings, ou um composto que é uma lista entre parênteses de compostos e literais. @code{#true} e @code{#false} (abreviados @code{#t} e @code{#f}) representam os booleanos ``true'' e ``false'', respectivamente.
ru: Синтаксис Scheme сводится к дереву выражений (или @emph{s-expression} на Lisp lingo). Выражение может быть литеральным, таким как цифры и строки, или составным, который представляет собой обернутый в скобки список составных выражений и литералов. @code{#true} и @code{#false} (сокращенно @code{#t} и @code{#f}) представляет логические `true'' and ``false'' соответственно.
sk: Skladbu jazyka Scheme si možno predstaviť ako strom výrazov (alebo ako @emph{s-expression} v jazyku Lisp). Výrazom môže byť priama konštanta, napr. číselná hodnota či reťazec znakov, alebo môže predstavovať zoznam iných zložených prvkov a priamych konštánt ohraničený v zátvorkách. @code{#true} a @code{#false} (skrátene @code{#t} a @code{#f}) znázorňujú logické hodnoty „pravda“ a „nepravda“.

source: Examples of valid expressions:
es: Ejemplos de expresiones válidas:
it: Esempi di espressioni valide:
pt_br: Exemplos de expressões válidas:
ru: Примеры допустимых выражений:
sk: Príklady platných výrazov:

source: (display (string-append "Hello " "Guix" "\n")) @print{} Hello Guix! @result{} #<unspecified>
es: (display (string-append "Hola " "Guix" "\n")) @print{} ¡Hola Guix! @result{} #<unspecified>
it: (display (string-append "Ciao " "Guix" "\n")) @print{} Ciao Guix! @result{} #<unspecified>
pt_br: (display (string-append "Olá " "Guix" "\n")) @print{} Olá Guix! @result{} #<unspecified>
sk: (display (string-append "Ahoj " "Guix" "\n")) @print{} Ahoj Guix! @result{} #<unspecified>

source: This last example is a function call nested in another function call. When a parenthesized expression is evaluated, the first term is the function and the rest are the arguments passed to the function. Every function returns the last evaluated expression as its return value.
es: Este último ejemplo es una llamada a una función anidada en otra llamada a una función. Cuando se evalúa una expresión entre paréntesis, el primer término es la función y el resto son los argumentos pasados a la función. Cada función devuelve la última expresión evaluada como valor de retorno.
it: Quest'ultimo esempio è una chiamata di funzione annidata in un'altra chiamata di funzione. Quando un'espressione tra parentesi viene valutata, il primo termine è la funzione e il resto sono gli argomenti passati alla funzione. Ogni funzione restituisce l'ultima espressione valutata come valore di ritorno.
pt_br: Este último exemplo é uma chamada de função aninhada em outra chamada de função. Quando uma expressão entre parênteses é avaliada, o primeiro termo é a função e o restante são os argumentos passados para a função. Cada função retorna a última expressão avaliada como valor de retorno.
ru: В последнем примере это вызов функции вложенный в другой вызов функции. Когда вычисляется скобочное выражения, первым термом является функция, а остальные аргументы передаются в функцию. Каждая функция возвращает последнее вычисляемое выражение как возвращаемое значение.
sk: Tento posledný príklad znázorňuje volanie funkcie vnorené do iného volania funkcie. Pri vykonávaní výrazu v zátvorkách predstavuje prvá položka funkciu a zvyšok sú parametre volania. Návratová hodnota každej funkcie je výsledok vykonania posledného výrazu v nej.

source: Anonymous functions---@dfn{procedures} in Scheme parlance---are declared with the @code{lambda} term:
es: Las funciones anónimas---@dfn{procedimientos} en habla de Scheme--- es declarado con el término @code{lambda}:
it: Le funzioni anonime --- @dfn{procedures} nel gergo di Scheme --- sono dichiarate con il termine @code{lambda}:
pt_br: Funções anônimas ---@dfn{procedimentos} na linguagem do Scheme --- são declaradas com o termo @code{lambda}:
ru: Анонимные функции --@dfn{procedures} на жаргоне Scheme ---определены с помощью @code{lambda}:
sk: Bezmenné funkcie, alebo @dfn{postupy}, vo výrazive jazyka Scheme, sa zadávajú pomocou člena @code{lambda}:

source: The above procedure returns the square of its argument. Since everything is an expression, the @code{lambda} expression returns an anonymous procedure, which can in turn be applied to an argument:
es: El procedimiento anterior devuelve el cuadrado de su argumento. Como todo es una expresión, la expresión @code{lambda} devuelve un procedimiento anónimo, que a su vez puede aplicarse a un argumento:
it: La procedura sopra restituisce il quadrato del suo argomento. Poiché tutto è un'espressione, l'espressione @code{lambda} restituisce una procedura anonima, che a sua volta può essere applicata a un argomento:
pt_br: O procedimento acima retorna o quadrado do seu argumento. Como tudo é uma expressão, a expressão @code{lambda} retorna um procedimento anônimo, que por sua vez pode ser aplicado a um argumento:
ru: Вышеприведенная процедура возвращает квадрат его аргумента. Поскольку все это выражение, @code{lambda} выражение возвращает анонимную процедуру, которая в свою очередь может быть применена к аргументу:
sk: Vyššie uvedená funkcia vracia druhú mocninu hodnoty jej parametra. Keďže všetko sa považuje za výraz, aj výraz @code{lambda} vracia bezmennú funkciu, ktorú je následne možné uplatniť na nejaký parameter:

source: Procedures are regular values just like numbers, strings, Booleans, and so on.
es: Procedimientos son valores usuales tan solo como números, cadenas, booleanos, y así todo.
it: Le procedure sono valori regolari proprio come numeri, stringhe, booleani e così via.
pt_br: Os procedimentos são valores regulares, assim como números, strings, booleanos e assim por diante.
ru: Процедуры - это обычные значения, такие как числа, строки, логические значения и так далее.
sk: Postupy sú pravidelné hodnoty, rovnako ako čísla, reťazce, logické veličiny a pod.

source: Anything can be assigned a global name with @code{define}:
es: Se puede asignar un nombre global a cualquier cosa con @code{define}:
it: A qualsiasi cosa può essere assegnato un nome globale con @code{define}:
pt_br: Qualquer coisa pode receber um nome global com @code{define}:
ru: Что угодно может быть присвоено в глобальное имя с помощью @code{define}:
sk: Všetkému je možné prideliť globálny názov pomocou @code{define}:

source: Procedures can be defined more concisely with the following syntax:
es: Los procedimientos pueden definirse de forma más concisa con la siguiente sintaxis:
it: Le procedure possono essere definite in modo più conciso con la seguente sintassi:
pt_br: Os procedimentos podem ser definidos de forma mais concisa com a seguinte sintaxe:
ru: Процедуры могут быть определены более кратко с помощью следующего синтаксиса:
sk: Funkcie možno zadávať aj v kratšom tvare s použitím nasledovnej skladby:

source: A list structure can be created with the @code{list} procedure:
es: Se puede crear una estructura de lista con el procedimiento @code{list}:
it: Una struttura di lista può essere creata con la procedura @code{list}:
pt_br: Uma estrutura de lista pode ser criada com o procedimento @code{list}:
ru: Списочная структура может быть создана с помощью процедуры @code{list}:
sk: Zoznam je možné vytvoriť pomocou funkcie @code{list}:

source: Standard procedures are provided by the @code{(srfi srfi-1)} module to create and process lists (@pxref{SRFI-1, list processing,, guile, GNU Guile Reference Manual}). Here are some of the most useful ones in action:
es: Se proporcionan procedimientos estándar por medio del módulo @code{(srfi srfi-1)} para crear y procesar listados (@pxref{SRFI-1, proceso de listado,, guile, Manual de referencia de GNU Guile}). Aquí están algunos de los más útiles en acción:
it: Le procedure standard sono fornite dal modulo @code{(srfi srfi-1)} per creare ed elaborare liste (@pxref{SRFI-1, elaborazione di liste,, guile, Manuale di riferimento di GNU Guile}). Ecco alcune delle più utili in azione:
pt_br: Os procedimentos padrão são fornecidos pelo módulo @code{(srfi srfi-1)} para criar e processar listas (@pxref{SRFI-1, processamento de listas,, guile, Manual de referência do GNU Guile}). Aqui estão alguns dos mais úteis em ação:
ru: Стандартные процедуры предоставляются модулем @code{(srfi srfi-1)} для создания и обработки списков (@pxref{SRFI-1,, list processing,, GNU Guile Reference Manual}). Вот некоторые из наиболее полезных в работе:
sk: Modul @code{(srfi srfi-1)} ponúka obvyklé postupy na vytváranie a spracovanie zoznamov (@pxref{SRFI-1, list processing,, guile, GNU Guile Reference Manual}). Viď príklady použitia tých najužitočnejších:

source: (use-modules (srfi srfi-1)) ;import list processing procedures
es: (use-modules (srfi srfi-1)) ;importa listado procesando procedimientos
it: (use-modules (srfi srfi-1)) ;importa procedure di elaborazione di liste
pt_br: (use-modules (srfi srfi-1)) ;importar procedimentos de processamento de lista
ru: (use-modules (srfi srfi-1)) ;импортировать процедуры для работы со списками
sk: (use-modules (srfi srfi-1)) ;načítať postupy na spracovanie zoznamov

source: Notice how the first argument to @code{map}, @code{filter}, @code{remove}, and @code{find} is a procedure!
es: Notifique como el primer argumento a @code{map}, @code{filter}, @code{remove}, y @code{find} es un procedimiento.
it: Notare come il primo argomento di @code{map}, @code{filter}, @code{remove} e @code{find} sia una procedura!
pt_br: Observe como o primeiro argumento para @code{map}, @code{filter}, @code{remove} e @code{find} é um procedimento!
ru: Обратите внимание, что первый аргумент @code{map}, @code{filter}, @code{remove} и @code{find} это процедура!
sk: Všimnite si, že prvým parametrom @code{map}, @code{filter}, @code{remove}, a @code{find} je postup!

source: The @dfn{quote} disables evaluation of a parenthesized expression, also called an S-expression or ``s-exp'': the first term is not called over the other terms (@pxref{Expression Syntax, quote,, guile, GNU Guile Reference Manual}). Thus it effectively returns a list of terms.
es: La comilla @dfn{quote} desactiva la evaluación de una expresión entre paréntesis: también invocado como expresión-S o ``s-exp'' (S-expression) en inglés: el primer término ahora es invocado sobre el otro términos (@pxref{Expression Syntax, quote,, guile, Manual de referencia GNU Guile}). Por tanto efectivamente devuelve una lista de términos.
it: Il @dfn{quote} disabilita la valutazione di un'espressione tra parentesi, chiamata anche S-expression o "s-exp": il primo termine non viene chiamato sugli altri termini (@pxref{Expression Syntax, quote,, guile, Manuale di riferimento di GNU Guile}). Quindi restituisce effettivamente una lista di termini.
pt_br: O @dfn{quote} desativa a avaliação de uma expressão entre parênteses, também chamada de expressão S ou ``s-exp'': o primeiro termo não é chamado sobre os outros termos (@pxref{Expression Syntax, quote,, guile, Manual de referência do GNU Guile}). Assim, ele efetivamente retorna uma lista de termos.
sk: @dfn{quote} (jednoduchá úvodzovka) zabraňuje vykonaniu výrazu v zátvorke, ktorému sa tiež hovorí S-výraz alebo „s-exp“: prvá položka sa nevykoná ako volanie funkcie s ostatnými položkami ako parametrami (@pxref{Expression Syntax, quote,, guile, GNU Guile Reference Manual}). Výsledkom je teda zoznam výrazov.

source: '(display (string-append "Hello " "Guix" "\n")) @result{} (display (string-append "Hello " "Guix" "\n"))
es: '(display (string-append "Hola " "Guix" "\n")) @result{} (display (string-append "Hola " "Guix" "\n"))
it: '(display (string-append "Ciao " "Guix" "\n")) @result{} (display (string-append "Ciao " "Guix" "\n"))
sk: '(display (string-append "Ahoj " "Guix" "\n")) @result{} (display (string-append "Ahoj " "Guix" "\n"))

source: The @code{quasiquote} (@code{`}, a backquote) disables evaluation of a parenthesized expression until @code{unquote} (@code{,}, a comma) re-enables it. Thus it provides us with fine-grained control over what is evaluated and what is not.
es: El @code{quasiquote} (@code{`}, una comilla hacia atrás) desactiva evaluación de una expresión entre paréntesis hasta retirar la comilla con @code{unquote} (una coma @code{,}) la vuelve a activar. Por lo tanto, nos proporciona un control fino sobre lo que se evalúa y lo que no.
it: Il @code{quasiquote} (@code{`}, un apice inverso) disabilita la valutazione di un'espressione tra parentesi finché @code{unquote} (@code{,}, una virgola) non la riabilita. Quindi ci fornisce un controllo preciso su cosa viene valutato e cosa no.
pt_br: O @code{quasiquote} (@code{`}, uma crase) desativa a avaliação de uma expressão entre parênteses até que @code{unquote} (@code{,}, uma vírgula) a reative. Assim, nos fornece um controle refinado sobre o que é avaliado e o que não é.
ru: @code{quasiquote} (@code{`}, обратная кавычка) запрещает вычисление выражения в круглых скобках, пока @code{unquote} (@code{,}, запятая) повторно его не включит. Таким образом, он обеспечивает нам четкий контроль над тем, что вычисляется и что нет.
sk: @code{quasiquote} (@code{`}, obrátená jednoduchá úvodzovka) zabraňuje vykonaniu výrazu v zátvorke dovtedy, kým nie je jeho vykonanie opätovne povolené pomocou @dfn{unquote} (@code{,}, čiarky). Týmto spôsobom dopodrobna rozhodujeme o tom, čo sa vykoná a čo nie.

source: Note that the above result is a list of mixed elements: numbers, symbols (here @code{a}) and the last element is a list itself.
es: Nótese que el resultado anterior es una lista de elementos mixtos: números, símbolos (aquí @code{a}) y el último elemento es una lista propiamente dicha.
it: Notare che il risultato sopra è una lista di elementi misti: numeri, simboli (qui @code{a}) e l'ultimo elemento è una lista stessa.
pt_br: Observe que o resultado acima é uma lista de elementos mistos: números, símbolos (aqui @code{a}) e o último elemento é uma lista em si.
ru: Обратите внимание, что приведенный выше результат - это смешанный список элементов: чисел, символов (здесь @code{a}), а последний элемент сам по себе список.
sk: Všimnite si, že hore uvedený výsledok je zoznam rôznorodých položiek: čísel, znakov (@code{a}) a posledná položka je tiež zoznam.

source: G-expressions, syntax
es: Expresiones-G, sintaxis
it: G-expressions, sintassi
pt_br: G-expressions, sintaxe
ru: G-выражения, синтаксис
sk: G-výrazy, skladba

source: gexps, syntax
es: gexps, sintaxis
it: gexps, sintassi
pt_br: gexps, sintaxe
sk: gvýrazy, skladba

source: Guix defines a variant of S-expressions on steroids called @dfn{G-expressions} or ``gexps'', which come with a variant of @code{quasiquote} and @code{unquote}: @code{#~} (or @code{gexp}) and @code{#$} (or @code{ungexp}). They let you @emph{stage code for later execution}.
es: Guix define una variante de expresiones-S sobre esteroides llamdados @dfn{expresiones-G} o ``gexps'', la cual viene con una variante de @code{quasiquote} y @code{unquote}: @code{#~} (o @code{gexp}) y @code{#$} (o @code{ungexp}). Le permite @emph{representar código para ejecución posterior}.
it: Guix definisce una variante delle S-expression con gli steroidi chiamata @dfn{G-expressions} o "gexps", che viene fornita con una variante di @code{quasiquote} e @code{unquote}: @code{#~} (o @code{gexp}) e @code{#$} (o @code{ungexp}). Ti permettono di @emph{mettere in scena il codice per un'esecuzione successiva}.
pt_br: Guix define uma variante de expressões simbólicas (S-expressions) com esteróides chamada @dfn{G-expressions} ou ``gexps'', que vem com uma variante de @code{quasiquote} e @code{unquote}: @code{#~} ( ou @code{gexp}) e @code{#$} (ou @code{ungexp}). Eles permitem @emph{preparar código para execução posterior}.
ru: Guix определяет вариант S-выражений "на стероидах" под названием @dfn{G-expressions} или ``gexps'', которые приходят с вариантом @code{quasiquote} и @code{unquote}: @code{#~} (или @code{gexp}) и @code{#$} (или @code{ungexp}). Они позволяют вам @emph{stage code for later execution}.
sk: Guix zavádza steroidmi napumpovanú podobu S-výrazov, takzvané @dfn{G-výrazy}, alebo „gvýrazy“ (pôvodne „gexps“), prichádzajúce s odnožou @code{quasiquote} a @code{unquote}, teda @code{#~} (alebo @code{gexp}) a @code{#$} (alebo @code{ungexp}), ktoré umožňujú @emph{zaradiť kód na neskoršie vykonanie}.

source: For example, you'll encounter gexps in some package definitions where they provide code to be executed during the package build process. They look like this:
es: Por ejemplo, encontrará gexps en algunas definiciones de paquete donde proporcionen código a ser ejecutado durante el proceso de construcción del paquete. Parecido esto:
it: Ad esempio, incontrerai le gexps in alcune definizioni di pacchetto dove forniscono codice da eseguire durante il processo di compilazione del pacchetto. Appaiono così:
pt_br: Por exemplo, você encontrará gexps em algumas definições de pacotes onde eles fornecem código a ser executado durante o processo de construção do pacote. Eles se parecem com isto:
ru: Например, вы столкнетесь с gexps в некоторых определениях пакетов, где они предоставляют код для выполнения во время процесса сборки пакетов. Они выглядят следующим образом:
sk: S gvýrazmi sa stretnete, napríklad, v zadaniach niektorých balíkov, kde poskytujú kód, ktorý sa má vykonať až pri zostavovaní balíka. Vyzerajú takto:

source: (use-modules (guix gexp) ;so we can write gexps (gnu packages base)) ;for 'coreutils'
es: (use-modules (guix gexp) ;por tanto pudemos escribir gexps (gnu packages base)) ;para 'coreutils'
it: (use-modules (guix gexp) ;così possiamo scrivere gexps (gnu packages base)) ;per 'coreutils'
pt_br: (use-modules (guix gexp) ; para que possamos escrever gexps (gnu packages base)) ; para 'coreutils'
sk: (use-modules (guix gexp) ;aby sme mohli používať gvýrazy (gnu packages base)) ;kvôli „coreutils“

source: ;; Below is a G-expression representing staged code. #~(begin ;; Invoke 'ls' from the package defined by the 'coreutils' ;; variable. (system* #$(file-append coreutils "/bin/ls") "-l")
es: ;; Debajo es una expresión-G representando código escenificado. #~(begin ;; Invoca 'ls' desde el paquete definido por la variable ;; 'coreutils'. (system* #$(file-append coreutils "/bin/ls") "-l")
it: ;; Di seguito una G-expression che rappresenta codice messo in scena. #~(begin ;; Invoca 'ls' dal package definito dalla variabile 'coreutils'. (system* #$(file-append coreutils "/bin/ls") "-l")
pt_br: ;; Abaixo está uma expressão G representando código preparado. #~(begin ;; Invoca 'ls' do pacote definido pela variável 'coreutils'. (system* #$(file-append coreutils "/bin/ls") "-l")
sk: ;; Nasleduje G-výraz zaradzujúci kód na neskoršie vykonanie. #~(begin ;; Vykoná „ls“ z balíka určeného premennou ;; „coreutils“. (system* #$(file-append coreutils "/bin/ls") "-l")

source: ;; Create this package's output directory. (mkdir #$output))
es: ;; Crea esta directorio salida del paquete. (mkdir #$output))
it: ;; Crea la directory di output di questo pacchetto. (mkdir #$output))
pt_br: ;; Crie o diretório de saída deste pacote. (mkdir #$output))
sk: ;; Vytvoriť výstupný priečinok tohto balíka. (mkdir #$output))

source: @xref{G-Expressions,,, guix, GNU Guix Reference Manual}, for more on gexps.
es: @xref{Expresiones-G,,, guix.es, Manual de referencia de GNU Guix}, para más en gexps.
it: @xref{G-expression,,, guix.it, Manuale di riferimento di GNU Guix}, per maggiori informazioni sulle gexps.
pt_br: @xref{Expressões-G,,, guix.pt_BR, Manual de Referência do GNU Guix}, para saber mais sobre gexps.
sk: Viď @ref{G-Expressions,,, guix, GNU Guix Reference Manual}, pre viac podrobností o gvýrazoch.

source: Multiple variables can be named locally with @code{let} (@pxref{Local Bindings,,, guile, GNU Guile Reference Manual}):
es: Pueden ser nombradas múltiples variables localmente con @code{let} (@pxref{Local Bindings,,, guile, Manual de referencia GNU Guile}):
it: È possibile nominare più variabili localmente con @code{let} (@pxref{Local Bindings,,, guile, Manuale di Riferimento di GNU Guile}):
pt_br: Múltiplas variáveis podem ser nomeadas localmente com @code{let} (@pxref{Local Bindings,,, guile, Manual de referência do GNU Guile}):
ru: Множественные переменные могут быть названы локально с помощью @code{let} (@pxref{Local Bindings,,, guile, GNU Guile Reference Manual}):
sk: Pomocou @code{let} (@pxref{Local Bindings,,, guile, GNU Guile Reference Manual}) môžeme zadať a pomenovať viacero miestnych premenných:

source: y @error{} In procedure module-lookup: Unbound variable: y
es: y @error{} En el procedimiento module-lookup: Variable no vinculada: y
it: y @error{} In procedure module-lookup: Variabile non legata: y
pt_br: y @error{} No procedimento module-lookup: Variável não vinculada: y

source: Use @code{let*} to allow later variable declarations to refer to earlier definitions.
es: Utilice @code{let*} para permitir que las declaraciones de variables posteriores hagan referencia a definiciones anteriores.
it: Usa @code{let*} per permettere alle dichiarazioni di variabili successive di fare riferimento a definizioni precedenti.
pt_br: Use @code{let*} para permitir que declarações de variáveis posteriores se refiram a definições anteriores.
sk: Ak chcete, aby bolo možné v neskorších zadaniach premenných odkazovať na predtým zadané premenné, použite @code{let*}.

source: @dfn{Keywords} are typically used to identify the named parameters of a procedure. They are prefixed by @code{#:} (hash, colon) followed by alphanumeric characters: @code{#:like-this}. @xref{Keywords,,, guile, GNU Guile Reference Manual}.
es: @dfn{Palabras clave} son utilizados típicamente para identificar los parámetros nombrados de un procedimiento. Están prefijados por @code{#:} (hash, dos puntos) seguidos por caracteres alfanuméricos: @code{#:como-este}. @xref{Keywords,,, guile, Manual referencial de GNU Guile}.
it: Le @dfn{Parole Chiave} sono tipicamente usate per identificare i parametri nominati di una procedura. Sono precedute da @code{#:} (cancelletto, due punti) seguito da caratteri alfanumerici: @code{#:in-questo-modo}. @xref{Keywords,,, guile, Manuale di riferimento di GNU Guile}.
pt_br: @dfn{Palavras-chave} normalmente são usados para identificar os parâmetros nomeados de um procedimento. Eles são prefixados por @code{#:} (hash, dois pontos) seguido por caracteres alfanuméricos: @code{#:like-this}. @xref{Keywords,,, guile, Manual de referência do GNU Guile}.
sk: @dfn{Kľúčové slová} sa bežne používajú na stotožnenie pomenovaných parametrov funkcie. Začínajú sa @code{#:} (mriežkou a dvojbodkou), po ktorých nasledujú písmenové či číselné znaky: @code{#:takto}. @xref{Keywords,,, guile, GNU Guile Reference Manual}.
