Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: export MANPATH=/path/to/profile$@{MANPATH:+:@}$MANPATH
it: export MANPATH=/percorso/al/profilo$@{MANPATH:+:@}$MANPATH
pt_br: export MANPATH=/caminho/para/perfil$@{MANPATH:+:@}$MANPATH
sk: export MANPATH=/cesta/ku/profilu$@{MANPATH:+:@}$MANPATH

source: Or include @samp{man-db} to the profile manifest.
it: Oppure includi @samp{man-db} nel manifest del profilo.
pt_br: Ou inclua @samp{man-db} no manifesto do perfil.
sk: Alebo pridajte @samp{man-db} do balíkospisu profilu.

source: The same is true for @samp{INFOPATH} (you can install @samp{info-reader}), @samp{PKG_CONFIG_PATH} (install @samp{pkg-config}), etc.
it: Lo stesso vale per @samp{INFOPATH} (puoi installare @samp{info-reader}), @samp{PKG_CONFIG_PATH} (installa @samp{pkg-config}), ecc.
pt_br: O mesmo vale para @samp{INFOPATH} (você pode instalar @samp{info-reader}), @samp{PKG_CONFIG_PATH} (instale @samp{pkg-config}), etc.
sk: To isté platí aj pre @samp{INFOPATH} (môžete nainštalovať @samp{info-reader}), @samp{PKG_CONFIG_PATH} (nainštalujte @samp{pkg-config}), atď.

source: What about the default profile that Guix keeps in @file{~/.guix-profile}?
it: Che dire del profilo predefinito che Guix mantiene in @file{~/.guix-profile}?
pt_br: E quanto ao perfil padrão que o Guix mantém em @file{~/.guix-profile}?
sk: A čo s predvoleným profilom, ktorý Guix uchováva v @file{~/.guix-profile}?

source: You can assign it the role you want. Typically you would install the manifest of the packages you want to use all the time.
it: Puoi assegnargli il ruolo che desideri. Tipicamente installeresti il manifest dei pacchetti che vuoi usare sempre.
pt_br: Você pode atribuir a ele o papel que quiser. Normalmente, você instalaria o manifesto dos pacotes que deseja usar o tempo todo.
sk: Môžete mu prideliť ľubovoľnú úlohu. Mohli by ste doň nainštalovať balíkospis balíkov, ktoré chcete mať stále poruke.

source: Alternatively, you could keep it ``manifest-less'' for throw-away packages that you would just use for a couple of days. This way makes it convenient to run
it: In alternativa, potresti mantenerlo ``senza manifest'' per pacchetti usa-e-getta che useresti solo per un paio di giorni. In questo modo è comodo eseguire
pt_br: Alternativamente, você pode mantê-lo ``sem manifesto'' para pacotes descartáveis que você usaria apenas por alguns dias. Dessa forma, é conveniente executar
sk: Ďalšia možnosť je, že doň nebudete inštalovať žiaden balíkospis a profil vám poslúži len pre dočasné balíky. V tomto prípade môžete jednoducho vykonať

source: without having to specify the path to a profile.
it: senza dover specificare il percorso di un profilo.
pt_br: sem precisar especificar o caminho para um perfil.
sk: bez nutnosti uvádzať cestu k profilu.

source: Manifests let you @dfn{declare} the set of packages you'd like to have in a profile (@pxref{Writing Manifests,,, guix, GNU Guix Reference Manual}). They are a convenient way to keep your package lists around and, say, to synchronize them across multiple machines using a version control system.
it: I manifest ti permettono di @dfn{declare} l'insieme di pacchetti che vorresti avere in un profilo (@pxref{Scrivere manifesti,,, guix.it, Manuale di riferimento GNU Guix}). Sono un modo conveniente per tenere a portata di mano gli elenchi dei pacchetti e, ad esempio, sincronizzarli su più macchine utilizzando un sistema di controllo versione.
pt_br: Manifestos permitem que você @dfn{declare} o conjunto de pacotes que você gostaria de ter em um perfil (@pxref{Escrevendo manifestos,,, guix.pt_BR, Manual de Referência do GNU Guix}). Eles são uma maneira conveniente de manter suas listas de pacotes por perto e, digamos, sincronizá-las em várias máquinas usando um sistema de controle de versão.

source: A common complaint about manifests is that they can be slow to install when they contain large number of packages. This is especially cumbersome when you just want get an upgrade for one package within a big manifest.
it: Una lamentela comune sui manifest è che possono essere lenti da installare quando contengono un gran numero di pacchetti. Questo è particolarmente ingombrante quando si desidera solo un aggiornamento per un pacchetto all'interno di un manifest grande.
pt_br: Uma reclamação comum sobre manifestos é que eles podem ser lentos para instalar quando contêm um grande número de pacotes. Isso é especialmente trabalhoso quando você só quer obter uma atualização para um pacote dentro de um grande manifesto.
sk: Medzi časté sťažnosti používateľov patrí, že inštalácia balíkospisov obsahujúcich veľké množstvo balíkov môže trvať veľmi dlho. Je to otravné hlavne vtedy, keď potrebujete aktualizovať iba jeden balík vrámci dlhého balíkospisu.

source: This is one more reason to use multiple profiles, which happen to be just perfect to break down manifests into multiple sets of semantically connected packages. Using multiple, small profiles provides more flexibility and usability.
it: Questo è un motivo in più per utilizzare più profili, che si rivelano perfetti per suddividere i manifest in più insiemi di pacchetti semanticamente collegati. L'utilizzo di più profili piccoli offre maggiore flessibilità e usabilità.
pt_br: Esse é mais um motivo para usar múltiplos perfis, que são perfeitos para dividir manifestos em múltiplos conjuntos de pacotes semanticamente conectados. Usar múltiplos perfis pequenos fornece mais flexibilidade e usabilidade.
sk: Je to ďalší dôvod pre používanie viacerých profilov, čo umožňuje rozdelenie balíkospisov do viacerých množín významovo prepojených balíkov. Používanie viacerých, menších profilov tiež vedie k väčšej prispôsobiteľnosti a pohodlnejšej práci.

source: Manifests come with multiple benefits. In particular, they ease maintenance:
it: I manifest offrono numerosi vantaggi. In particolare, facilitano la manutenzione:
pt_br: Os manifestos vêm com múltiplos benefícios. Em particular, eles facilitam a manutenção:
sk: Balíkospisy prinášajú mnoho výhod. Predovšetkým, zjednodušujú údržbu:

source: When a profile is set up from a manifest, the manifest itself is self-sufficient to keep a ``package listing'' around and reinstall the profile later or on a different system. For ad-hoc profiles, we would need to generate a manifest specification manually and maintain the package versions for the packages that don't use the default version.
it: Quando un profilo viene configurato da un manifest, il manifest stesso è autosufficiente per mantenere un ``elenco di pacchetti'' e reinstallare il profilo in seguito o su un sistema diverso. Per i profili ad-hoc, dovremmo generare manualmente una specifica di manifest e mantenere le versioni dei pacchetti per i pacchetti che non utilizzano la versione predefinita.
pt_br: Quando um perfil é configurado a partir de um manifesto, o manifesto em si é autossuficiente para manter uma ``listagem de pacotes'' por perto e reinstalar o perfil mais tarde ou em um sistema diferente. Para perfis ad-hoc, precisaríamos gerar uma especificação de manifesto manualmente e manter as versões de pacote para os pacotes que não usam a versão padrão.
sk: Pri nastavení profilu z balíkospisu, on samotný stačí na uschovanie zoznamu balíkov poruke a na opätovnú inštaláciu profilu niekedy inokedy alebo na inom systéme. V prípade dočasných účelových profilov by sme museli vytvoriť zadanie balíkospisu ručne a udržiavať správne verzie tých balíkov, pri ktorých nebola použitá ich predvolená verzia.

source: @code{guix package --upgrade} always tries to update the packages that have propagated inputs, even if there is nothing to do. Guix manifests remove this problem.
it: @code{guix package --upgrade} tenta sempre di aggiornare i pacchetti che hanno input propagati, anche se non c'è nulla da fare. I manifest di Guix rimuovono questo problema.
pt_br: @code{guix package --upgrade} sempre tenta atualizar os pacotes que propagaram entradas, mesmo que não haja nada a fazer. Os manifestos Guix removem esse problema.
sk: @code{guix package --upgrade} sa pokúša o aktualizáciu balíkov s rozšírenými vstupmi aj vtedy, keď to nie je potrebné. Guixové balíkospisy touto nevýhodou netrpia.

source: When partially upgrading a profile, conflicts may arise (due to diverging dependencies between the updated and the non-updated packages) and they can be annoying to resolve manually. Manifests remove this problem altogether since all packages are always upgraded at once.
it: Quando si aggiorna parzialmente un profilo, possono sorgere conflitti (a causa di dipendenze divergenti tra i pacchetti aggiornati e quelli non aggiornati) e possono essere fastidiosi da risolvere manualmente. I manifest eliminano del tutto questo problema, poiché tutti i pacchetti vengono sempre aggiornati contemporaneamente.
pt_br: Ao atualizar parcialmente um perfil, podem surgir conflitos (devido a dependências divergentes entre os pacotes atualizados e não atualizados) e eles podem ser irritantes para resolver manualmente. Manifestos removem esse problema completamente, já que todos os pacotes são sempre atualizados de uma vez.
sk: Pri čiastočnej aktualizácii profilu sa môžu vyskytnúť rozpory (kvôli rozličným závislostiam medzi aktualizovanými a neaktualizovanými balíkmi), ktoré je obvykle náročné vyriešiť ručne. Pri balíkospisoch k tomu nedochádza, keďže všetky balíky sa aktualizujú súčasne.

source: As mentioned above, manifests allow for reproducible profiles, while the imperative @code{guix install}, @code{guix upgrade}, etc. do not, since they produce different profiles every time even when they hold the same packages. See @uref{https://issues.guix.gnu.org/issue/33285, the related discussion on the matter}.
it: Come accennato in precedenza, i manifest consentono profili riproducibili, mentre i comandi imperativi @code{guix install}, @code{guix upgrade}, ecc. non lo fanno, poiché producono profili diversi ogni volta anche quando contengono gli stessi pacchetti. Vedi @uref{https://issues.guix.gnu.org/issue/33285, la discussione correlata sull'argomento}.
pt_br: Conforme mencionado acima, manifestos permitem perfis reproduzíveis, enquanto os imperativos @code{guix install}, @code{guix upgrade}, etc. não, pois eles produzem perfis diferentes a cada vez, mesmo quando contêm os mesmos pacotes. Veja @uref{https://issues.guix.gnu.org/issue/33285, a discussão relacionada sobre o assunto}.
sk: Ako už bolo spomenuté, balíkospisy umožňujú napodobniteľné profily, zatiaľčo príkazy @code{guix install}, @code{guix upgrade}, a pod. nie, pretože zakaždým vytvárajú nové profily, aj keď obsahujú rovnaké balíky. Viď @uref{https://issues.guix.gnu.org/issue/33285, súvisiacu rozpravu}.

source: Manifest specifications are usable by other @samp{guix} commands. For example, you can run @code{guix weather -m manifest.scm} to see how many substitutes are available, which can help you decide whether you want to try upgrading today or wait a while. Another example: you can run @code{guix pack -m manifest.scm} to create a pack containing all the packages in the manifest (and their transitive references).
it: Le specifiche dei manifest sono utilizzabili da altri comandi @samp{guix}. Ad esempio, puoi eseguire @code{guix weather -m manifest.scm} per vedere quanti sostituti sono disponibili, il che può aiutarti a decidere se vuoi provare ad aggiornare oggi o aspettare un po'. Un altro esempio: puoi eseguire @code{guix pack -m manifest.scm} per creare un pacchetto contenente tutti i pacchetti nel manifest (e i loro riferimenti transitivi).
pt_br: As especificações do manifesto podem ser usadas por outros comandos @samp{guix}. Por exemplo, você pode executar @code{guix weather -m manifest.scm} para ver quantos substitutos estão disponíveis, o que pode ajudar você a decidir se quer tentar atualizar hoje ou esperar um pouco. Outro exemplo: você pode executar @code{guix pack -m manifest.scm} para criar uma embalagem contenda todos os pacotes no manifesto (e suas referências transitivas).
sk: Zadania balíkospisov môžu využiť aj iné príkazy @samp{guix}. Napríklad, pomocou @code{guix weather -m balikospis.scm} môžete zistiť dostupné množstvo náhrad a lepšie sa rozhodnúť, či chcete vykonať aktualizáciu už dnes, alebo chvíľu počkáte. Ďalší príklad: @code{guix pack -m balikospis.scm} vám umožní vytvoriť súpravu obsahujúcu všetky balíky balíkospisu (a ich závislosti).

source: Finally, manifests have a Scheme representation, the @samp{<manifest>} record type. They can be manipulated in Scheme and passed to the various Guix @uref{https://en.wikipedia.org/wiki/Api, APIs}.
it: Infine, i manifest hanno una rappresentazione Scheme, il tipo di record @samp{<manifest>}. Possono essere manipolati in Scheme e passati alle varie @uref{https://it.wikipedia.org/wiki/Application_programming_interface, API} di Guix.
pt_br: Finalmente, manifestos têm uma representação Scheme, o tipo de registro @samp{<manifest>}. Eles podem ser manipulados no Scheme e passados para as várias Guix @uref{https://pt.wikipedia.org/wiki/Interface_de_programa%C3%A7%C3%A3o_de_aplica%C3%A7%C3%B5es, APIs}.
sk: Nakoniec, balíkospisy sú zapísané v jazyku Scheme, ako záznamy druhu @samp{<manifest>}. Možno s nimi, teda, v Scheme aj narábať a používať ich s rozličnými @uref{https://sk.wikipedia.org/wiki/Application_programming_interface, API} Guixu.

source: It's important to understand that while manifests can be used to declare profiles, they are not strictly equivalent: profiles have the side effect that they ``pin'' packages in the store, which prevents them from being garbage-collected (@pxref{Invoking guix gc,,, guix, GNU Guix Reference Manual}) and ensures that they will still be available at any point in the future. The @command{guix shell} command also protects recently-used profiles from garbage collection; profiles that have not been used for a while may be garbage-collected though, along with the packages they refer to.
it: È importante capire che, sebbene i manifest possano essere usati per dichiarare i profili, non sono strettamente equivalenti: i profili hanno l'effetto collaterale di ``fissare'' i pacchetti nello store, il che impedisce che vengano raccolti dalla spazzatura (@pxref{Invocare guix gc,,, guix.it, Manuale di riferimento GNU Guix}) e assicura che saranno ancora disponibili in qualsiasi momento in futuro. Il comando @command{guix shell} protegge anche i profili usati di recente dalla raccolta della spazzatura; i profili che non sono stati usati per un po' possono essere comunque raccolti dalla spazzatura, insieme ai pacchetti a cui si riferiscono.
pt_br: É importante entender que, embora manifestos possam ser usados para declarar perfis, eles não são estritamente equivalentes: perfis têm o efeito colateral de ``fixar'' pacotes no armazém, o que os impede de serem coletados como lixo (@pxref{Invocando guix gc,,, guix.pt_BR, Manual de Referência do GNU Guix}) e garante que eles ainda estarão disponíveis em qualquer ponto no futuro. O comando @command{guix shell} também protege perfis usados recentemente da coleta de lixo; perfis que não foram usados por um tempo podem ser coletados como lixo, junto com os pacotes aos quais eles se referem.

source: To be 100% sure that a given profile will never be collected, install the manifest to a profile and use @code{GUIX_PROFILE=/the/profile; . "$GUIX_PROFILE"/etc/profile} as explained above: this guarantees that our hacking environment will be available at all times.
it: Per essere sicuri al 100% che un dato profilo non verrà mai raccolto, installare il manifest in un profilo e usare @code{GUIX_PROFILE=/il/profilo; . "$GUIX_PROFILE"/etc/profile} come spiegato sopra: questo garantisce che il nostro ambiente di hacking sarà sempre disponibile.
pt_br: Para ter 100% de certeza de que um determinado perfil nunca será coletado, instale o manifesto em um perfil e use @code{GUIX_PROFILE=/o/perfil; . "$GUIX_PROFILE"/etc/profile} conforme explicado acima: isso garante que nosso ambiente de hacking estará disponível o tempo todo.

source: @emph{Security warning:} While keeping old profiles around can be convenient, keep in mind that outdated packages may not have received the latest security fixes.
it: @emph{Avviso di sicurezza:} Sebbene mantenere i vecchi profili possa essere comodo, tieni presente che i pacchetti obsoleti potrebbero non aver ricevuto le ultime correzioni di sicurezza.
pt_br: @emph{Aviso de segurança:} Embora manter perfis antigos possa ser conveniente, tenha em mente que pacotes desatualizados podem não ter recebido as correções de segurança mais recentes.
sk: @emph{Bezpečnostné upozornenie:} Napriek tomu, že je uchovávanie starých profilov šikovné, zapamätajte si, že zastarané balíky nemusia obsahovať najnovšie bezpečnostné záplaty.
sv: @emph{Säkerhetsvarning:} Kom ihåg att medan gamla profiler kan vara bekvämt att behålla kan det vara så att föråldrade paket inte har fått de senaste säkerhetsfixarna.

source: To reproduce a profile bit-for-bit, we need two pieces of information:
it: Per riprodurre un profilo bit per bit, abbiamo bisogno di due informazioni:
pt_br: Para reproduzir um perfil bit por bit, precisamos de duas informações:
sk: Napodobnenie profilu bit-po-bite vyžaduje dva údaje:

source: a manifest (@pxref{Writing Manifests,,, guix, GNU Guix Reference Manual});
it: un manifest (@pxref{Scrivere manifesti,,, guix.it, Manuale di riferimento GNU Guix});
pt_br: um manifesto (@pxref{Escrevendo manifestos,,, guix.pt_BR, Manual de referência do GNU Guix});

source: a Guix channel specification (@pxref{Replicating Guix,,, guix, GNU Guix Reference Manual}).
it: una specifica di canale Guix (@pxref{Replicare Guix,,, guix.it, Manuale di riferimento GNU Guix}).
pt_br: uma especificação de canal Guix (@pxref{Replicando Guix,,, guix.pt_BR, Manual de referência do GNU Guix}).

source: Indeed, manifests alone might not be enough: different Guix versions (or different channels) can produce different outputs for a given manifest.
it: Infatti, i soli manifest potrebbero non essere sufficienti: diverse versioni di Guix (o diversi canali) possono produrre output diversi per un dato manifest.
pt_br: De fato, manifestos por si só podem não ser suficientes: diferentes versões do Guix (ou diferentes canais) podem produzir saídas diferentes para um determinado manifesto.
sk: Vskutku, samotný balíkospis nestačí: rozdielne verzie Guixu (alebo rozdielne kanály) môžu viesť k odlišných výsledkom pre daný balíkospis.

source: You can output the Guix channel specification with @samp{guix describe --format=channels} (@pxref{Invoking guix describe,,, guix, GNU Guix Reference Manual}). Save this to a file, say @samp{channel-specs.scm}.
it: È possibile generare la specifica del canale Guix con @samp{guix describe --format=channels} (@pxref{Invocare guix describe,,, guix, Manuale di riferimento GNU Guix}). Salva questo in un file, ad esempio @samp{channel-specs.scm}.
pt_br: Você pode emitir a especificação do canal Guix com @samp{guix describe --format=channels} (@pxref{Invocando guix describe,,, guix.pt_BR, Manual de referência do GNU Guix}). Salve isso em um arquivo, digamos @samp{channel-specs.scm}.

source: On another computer, you can use the channel specification file and the manifest to reproduce the exact same profile:
it: Su un altro computer, è possibile utilizzare il file di specifica del canale e il manifest per riprodurre lo stesso identico profilo:
pt_br: Em outro computador, você pode usar o arquivo de especificação de canal e o manifesto para reproduzir exatamente o mesmo perfil:
sk: Na inom počítači môžete toto určenie kanálov spolu s balíkospisom použiť na napodobnenie presne toho istého profilu:

source: mkdir -p "$GUIX_EXTRA_PROFILES/my-project" "$GUIX_EXTRA"/my-project/guix/bin/guix package \ --manifest=/path/to/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project
it: mkdir -p "$GUIX_EXTRA_PROFILES/my-project" "$GUIX_EXTRA"/my-project/guix/bin/guix package \ --manifest=/percorso/a/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project
pt_br: mkdir -p "$GUIX_EXTRA_PROFILES/meu-projeto" "$GUIX_EXTRA"/meu-projeto/guix/bin/guix package \ --manifest=/caminho/para/guix-meu-projeto-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/meu-projeto/meu-projeto
sk: mkdir -p "$GUIX_DOPLNKOVE_PROFILY/moj-projekt" "$GUIX_DOPLNKY"/moj-projekt/guix/bin/guix package \ --manifest=/cesta/ku/guix-balikospis-mojho-projektu.scm \ --profile="$GUIX_DOPLNKOVE_PROFILY"/moj-projekt/moj-projekt

source: It's safe to delete the Guix channel profile you've just installed with the channel specification, the project profile does not depend on it.
it: È sicuro eliminare il profilo del canale Guix che hai appena installato con la specifica del canale, il profilo del progetto non dipende da esso.
pt_br: É seguro excluir o perfil de canal Guix que você acabou de instalar com a especificação do canal, o perfil do projeto não depende dele.
sk: Profil kanálu Guix, ktorý ste práve nainštalovali môžete bezpečne odstrániť, profil projektu na ňom nezávisí.

source: development, with Guix
it: sviluppo, con Guix
pt_br: desenvolvimento, com Guix
sv: utveckling, med Guix

source: software development, with Guix
it: sviluppo software, con Guix
pt_br: desenvolvimento de software, com Guix
sv: programutveckling, med Guix

source: Guix is a handy tool for developers; @command{guix shell}, in particular, gives a standalone development environment for your package, no matter what language(s) it's written in (@pxref{Invoking guix shell,,, guix, GNU Guix Reference Manual}). To benefit from it, you have to initially write a package definition and have it either in Guix proper, or in a channel, or directly in your project's source tree as a @file{guix.scm} file. This last option is appealing: all developers have to do to get set up is clone the project's repository and run @command{guix shell}, with no arguments.
it: Guix è uno strumento utile per gli sviluppatori; @command{guix shell}, in particolare, fornisce un ambiente di sviluppo autonomo per il tuo pacchetto, indipendentemente dal linguaggio/i in cui è scritto (@pxref{Invocare guix shell,,, guix.it, Manuale di riferimento GNU Guix}). Per beneficiarne, devi inizialmente scrivere una definizione di pacchetto e averla in Guix stesso, o in un canale, o direttamente nell'albero sorgente del tuo progetto come file @file{guix.scm}. Quest'ultima opzione è allettante: tutto ciò che gli sviluppatori devono fare per iniziare è clonare il repository del progetto ed eseguire @command{guix shell}, senza argomenti.
pt_br: Guix é uma ferramenta útil para desenvolvedores; @command{guix shell}, em particular, fornece um ambiente de desenvolvimento autônomo para seu pacote, não importa em qual(is) idioma(s) ele foi escrito (@pxref{Invocando guix shell,,, guix.pt_BR, Manual de referência do GNU Guix}). Para se beneficiar dele, você tem que inicialmente escrever uma definição de pacote e tê-la no Guix propriamente dito, ou em um canal, ou diretamente na árvore de código-fonte do seu projeto como um arquivo @file{guix.scm}. Esta última opção é atraente: tudo o que os desenvolvedores precisam fazer para configurar é clonar o repositório do projeto e executar @command{guix shell}, sem argumentos.
