Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Starting download of /tmp/guix-file.03tFfb From https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz.sig... following redirection to `https://ftp.igh.cnrs.fr/pub/gnu/hello/hello-2.10.tar.gz.sig'... ….tar.gz.sig 819B 1.2MiB/s 00:00 [##################] 100.0% /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig 0q0v86n3y38z17rl146gdakw9xc4mcscpk8dscs412j22glrv9jf $ gpg --verify /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz gpg: Signature made Sun 16 Nov 2014 01:08:37 PM CET gpg: using RSA key A9553245FDE9B739 gpg: Good signature from "Sami Kerola <kerolasa@@iki.fi>" [unknown] gpg: aka "Sami Kerola (http://www.iki.fi/kerolasa/) <kerolasa@@iki.fi>" [unknown] gpg: WARNING: This key is not certified with a trusted signature! gpg: There is no indication that the signature belongs to the owner. Primary key fingerprint: 8ED3 96E3 7E38 D471 A005 30D3 A955 3245 FDE9 B739
es: Inicio de la descarga de /tmp/guix-file.03tFfb Desde https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz.sig... tras la redirección a `https://ftp.igh.cnrs.fr/pub/gnu/hello/hello-2.10.tar.gz.sig'... ….tar.gz.sig 819B 1.2MiB/s 00:00 [##################] 100.0% /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig 0q0v86n3y38z17rl146gdakw9xc4mcscpk8dscs412j22glrv9jf $ gpg --verify /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz gpg: Firmado el dom 16 nov 2014 13:08:37 CET gpg: usando RSA clave A9553245FDE9B739 gpg: comprobando base de datos de confianza gpg: no se encuentran claves absolutamente fiables gpg: Firma correcta de "Sami Kerola <kerolasa@@iki.fi>" [desconocido] gpg: alias "Sami Kerola (http://www.iki.fi/kerolasa/) <kerolasa@@iki.fi>" [desconocido] gpg: ATENCIÓN: ¡Esta clave no está certificada por una firma de confianza! gpg: No hay indicios de que la firma pertenezca al propietario. Huellas dactilares de la clave primaria: 8ED3 96E3 7E38 D471 A005 30D3 A955 3245 FDE9 B739
it: Inizio download di /tmp/guix-file.03tFfb Da https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz.sig... redirezione a `https://ftp.igh.cnrs.fr/pub/gnu/hello/hello-2.10.tar.gz.sig'. .. ….tar.gz.sig 819B 1.2MiB/s 00:00 [##################] 100.0% /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig 0q0v86n3y38z17rl146gdakw9xc4mcscpk8dscs412j22glrv9jf $ gpg --verify /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz gpg: Firma creata dom 16 nov 2014 13:08:37 CET gpg: usando la chiave RSA A9553245FDE9B739 gpg: Buona firma da "Sami Kerola <kerolasa@@iki.fi>" [sconosciuto] gpg: alias "Sami Kerola (http://www.iki.fi/kerolasa/) <kerolasa@@iki.fi>" [sconosciuto] gpg: ATTENZIONE: Questa chiave non è certificata con una firma fidata! gpg: Non c'è alcuna indicazione che la firma appartenga al proprietario. Impronta della chiave primaria: 8ED3 96E3 7E38 D471 A005 30D3 A955 3245 FDE9 B739
pt_br: Iniciando download de /tmp/guix-file.03tFfb De https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz.sig... seguindo redirecionamento para `https://ftp.igh.cnrs.fr/pub/gnu/hello/hello-2.10.tar.gz.sig'... ….tar.gz.sig 819B 1,2 MiB/s 00:00 [#################] 100,0% /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig 0q0v86n3y38z17rl146gdakw9xc4mcscpk8dscs412j22glrv9jf $ gpg --verify /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz gpg: Assinatura feita em dom 16 nov 2014 01:08:37 PM CET gpg: usando RSA chave A9553245FDE9B739 gpg: Boa assinatura de "Sami Kerola <kerolasa@@iki.fi>" [desconhecido] gpg: também conhecido como "Sami Kerola (http://www.iki.fi/kerolasa/) <kerolasa@@iki.fi>" [desconhecido] gpg: AVISO: Esta chave não é certificada com uma assinatura confiável! gpg: Não há indicação de que a assinatura pertença ao proprietário. Impressão digital da chave primária: 8ED3 96E3 7E38 D471 A005 30D3 A955 3245 FDE9 B739
sk: Starting download of /tmp/guix-file.03tFfb From https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz.sig... following redirection to `https://ftp.igh.cnrs.fr/pub/gnu/hello/hello-2.10.tar.gz.sig'... ….tar.gz.sig 819B 1.2MiB/s 00:00 [##################] 100.0% /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig 0q0v86n3y38z17rl146gdakw9xc4mcscpk8dscs412j22glrv9jf $ gpg --verify /gnu/store/rzs8wba9ka7grrmgcpfyxvs58mly0sx6-hello-2.10.tar.gz.sig /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz gpg: Podpis vytvorený Ne 16. november 2014, 13:08:37 CET gpg: pomocou RSA kľúča A9553245FDE9B739 gpg: Dobrý podpis od "Sami Kerola <kerolasa@@iki.fi>" neznáme gpg: alias "Sami Kerola (http://www.iki.fi/kerolasa/) <kerolasa@@iki.fi>" neznáme gpg: VAROVANIE: Tento kľúč nie certifikovaný dôveryhodným podpisom! gpg: Nič nenaznačuje tomu, že tento podpis patrí vlastníkovi kľúča. Primárny fingerprint kľúča: 8ED3 96E3 7E38 D471 A005 30D3 A955 3245 FDE9 B739

source: You can then happily run
es: Entonces puede ejecutar felizmente
it: Puoi quindi eseguire felicemente
pt_br: Você pode então correr alegremente
sk: Potom môžete spokojne spustiť

source: You should now have @code{my-hello} in your profile!
es: ¡Ahora tendría @code{my-hello} en su perfil!
it: Ora dovresti avere @code{my-hello} nel tuo profilo!
pt_br: Agora você deve ter @code{my-hello} em seu perfil!
sk: Teraz by ste už mali mať @code{my-hello} vo vašom profile!

source: We've gone as far as we could without any knowledge of Scheme. Before moving on to more complex packages, now is the right time to brush up on your Scheme knowledge. @xref{A Scheme Crash Course} to get up to speed.
es: Hemos llegado tan lejos como hemos podido sin ningún conocimiento de Scheme. Antes de pasar a paquetes más complejos, ahora es el momento adecuado para repasar tus conocimientos de Scheme. @xref{A Scheme Crash Course} para ponerte al día.
it: Siamo andati il più lontano possibile senza alcuna conoscenza di Scheme. Prima di passare a pacchetti più complessi, ora è il momento giusto per rispolverare la tua conoscenza di Scheme. @xref{A Scheme Crash Course} per mettersi al passo.
pt_br: Fomos o mais longe que pudemos sem qualquer conhecimento do Scheme. Antes de passar para pacotes mais complexos, agora é o momento certo para aprimorar seus conhecimentos sobre o Scheme. @xref{A Scheme Crash Course} para se atualizar.
sk: Dostali sme sa tak ďaleko ako sa dalo bez znalosti Scheme. Predtým než prejdeme k zložitejším balíkom si dáme rýchlokurz jazyka Scheme. Na začiatok odporúčame @pxref{A Scheme Crash Course}.

source: In the rest of this chapter we will rely on some basic Scheme programming knowledge. Now let's detail the different possible setups for working on Guix packages.
es: En el resto de este capítulo nos basaremos en algunos conocimientos básicos de programación en Scheme. Ahora vamos a detallar las diferentes configuraciones posibles para trabajar con paquetes Guix.
it: Nel resto di questo capitolo faremo affidamento su alcune conoscenze di base di programmazione in Scheme. Ora analizziamo le diverse possibili configurazioni per lavorare sui pacchetti Guix.
pt_br: No restante deste capítulo contaremos com alguns conhecimentos básicos de programação de Scheme. Agora vamos detalhar as diferentes configurações possíveis para trabalhar em pacotes Guix.
sk: V ďalších častiach tohto oddielu sa budeme spoliehať na vašu základnú znalosť jazyka Scheme. Teraz si predstavíme rôzne možnosti práce s balíkmi Guix.

source: There are several ways to set up a Guix packaging environment.
es: Hay varias maneras de configurar un entorno de empaquetando para Guix.
it: Ci sono diversi modi per configurare un ambiente di pacchettizzazione Guix.
pt_br: Existem várias maneiras de configurar um ambiente de empacotamento Guix.
sk: Jestvuje viacero spôsobov nastavenia prostredia pre zadávanie balíkov Guix.

source: We recommend you work directly on the Guix source checkout since it makes it easier for everyone to contribute to the project.
es: Recomendado trabajar directamente en la copia de trabajo de código Guix desde que lo hizo más fácil para cada uno de contribuir al proyecto.
it: Ti consigliamo di lavorare direttamente sul checkout del sorgente di Guix poiché rende più facile per tutti contribuire al progetto.
pt_br: Recomendamos que você trabalhe diretamente no checkout do código-fonte do Guix, pois facilita a contribuição de todos para o projeto.
sk: Odporúčame vám pracovať priamo v repozitári zdrojových súborov Guixu za účelom jednoduchšieho prispievania do projektu.

source: But first, let's look at other possibilities.
es: Pero primero, miremos en otras posibilidades.
it: Ma prima, diamo un'occhiata ad altre possibilità.
pt_br: Mas primeiro, vamos examinar outras possibilidades.
sk: Ale najprv sa pozrime na ostatné možnosti.

source: This is what we previously did with @samp{my-hello}. With the Scheme basics we've covered, we are now able to explain the leading chunks. As stated in @code{guix package --help}:
es: Esto es lo que hicimos anteriormente con @samp{my-hello}. Con los fundamentos de Scheme que hemos cubierto, ahora estamos en condiciones de explicar los trozos principales. Como se indica en @code{guix package --help}:
it: Questo è quello che abbiamo fatto in precedenza con @samp{my-hello}. Con le basi di Scheme che abbiamo trattato, siamo ora in grado di spiegare i blocchi iniziali. Come indicato in @code{guix package --help}:
pt_br: Isto é o que fizemos anteriormente com @samp{my-hello}. Com os princípios básicos do Scheme que cobrimos, agora podemos explicar os principais pedaços. Conforme declarado em @code{guix package --help}:
sk: Toto je spôsob, ktorý sme práve použili v prípade @samp{my-hello}. Vďaka základom Scheme, ktoré sme si predstavili, vám teraz môžeme vysvetliť tie najdôležitejšie časti. Ako je uvedené v @code{guix package --help}:

source: -f, --install-from-file=FILE install the package that the code within FILE evaluates to
es: -f, --install-from-file=ARCHIVO instala el paquete al que el código en ARCHIVO evalúa
it: -f, --install-from-file=FILE installa il pacchetto a cui il codice all'interno di FILE valuta
pt_br: -f, --install-from-file=ARQUIVO instala o pacote para o qual o código dentro do ARQUIVO avalia
sk: -f, --install-from-file=SÚBOR inštalovať balíky, ktoré sú výsledkom vyhodnotenia kódu v SÚBORE
sv: -f, --install-from-file=FIL installera paketet som koden inuti FIL utvärderas till

source: Thus the last expression @emph{must} return a package, which is the case in our earlier example.
es: Por tanto la última expresión @emph{debe} devolver un paquete, el cual es el caso en su ejemplo anterior.
it: Quindi l'ultima espressione @emph{must} restituire un pacchetto, che è il caso del nostro esempio precedente.
pt_br: Assim, a última expressão @emph{deve} retornar um pacote, que é o caso do nosso exemplo anterior.
sk: Teda, posledný výraz @emph{musí} vracať balík, čo pre náš skorší príklad aj platí.

source: The @code{use-modules} expression tells which of the modules we need in the file. Modules are a collection of values and procedures. They are commonly called ``libraries'' or ``packages'' in other programming languages.
es: La expresión @code{use-modules} indica cuáles de los módulos necesitamos en el archivo. Los módulos son una colección de valores y procedimientos. En otros lenguajes de programación suelen denominarse ``bibliotecas'' o ``paquetes''.
it: L'espressione @code{use-modules} indica quali moduli ci servono nel file. I moduli sono una raccolta di valori e procedure. Sono comunemente chiamati "librerie" o "pacchetti" in altri linguaggi di programmazione.
pt_br: A expressão @code{use-modules} informa quais módulos precisamos no arquivo. Módulos são uma coleção de valores e procedimentos. Eles são comumente chamados de ``bibliotecas'' ou ``pacotes'' em outras linguagens de programação.
sk: Výraz @code{use-modules} nám hovorí, ktoré moduly potrebujeme. Moduly predstavujú zbierky hodnôt a funkcií. V iných programovacích jazykoch sa všeobecne označujú ako „knižnice“ alebo „balíky“.

source: channel
es: canal
it: canale
pt_br: Canal
ru: канал
sk: kanál
sv: kanal

source: Guix and its package collection can be extended through @dfn{channels}. A channel is a Git repository, public or not, containing @file{.scm} files that provide packages (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}) or services (@pxref{Defining Services,,, guix, GNU Guix Reference Manual}).
es: Guix y su colección de paquetes pueden ampliarse a través de @dfn{canales}. Un canal es un repositorio Git, público o no, que contiene archivos @file{.scm} que proporcionan paquetes (@pxref{Definición de paquetes,,, guix.es, Manual referencial GNU Guix}) o servicios (@pxref{Definición de servicios,,, guix.es, Manual referencial GNU Guix}).
it: Guix e la sua collezione di pacchetti possono essere estesi tramite @dfn{canali}. Un canale è un repository Git, pubblico o meno, contenente file @file{.scm} che forniscono pacchetti (@pxref{Definire i pacchetti,,, guix.it, Manuale di riferimento di GNU Guix}) o servizi (@pxref{Definire i servizi,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: Guix e sua coleção de pacotes podem ser estendidos através de @dfn{canais}. Um canal é um repositório Git, público ou não, contendo arquivos @file{.scm} que fornecem pacotes (@pxref{Definindo pacotes,,, guix.pt_BR, Manual de Referência do GNU Guix}) ou serviços (@pxref{Definindo serviços,,, guix.pt_BR, Manual de Referência GNU Guix}).
sk: Guix a jeho zbierku balíkov možno rozšíriť pomocou @dfn{kanálov}. Kanál je Git repozitár, či už verejný alebo nie, obsahujúci @file{.scm} súbory poskytujúce balíky (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}) alebo služby (@pxref{Defining Services,,, guix, GNU Guix Reference Manual}).

source: How would you go about creating a channel? First, create a directory that will contain your @file{.scm} files, say @file{~/my-channel}:
es: ¿Como pudiste ir a crear un canal? Primero, cree un directorio que contendrá su archivos @file{.scm}, dicho @file{~/mi-canal}:
it: Come si crea un canale? Innanzitutto, crea una directory che conterrà i tuoi file @file{.scm}, diciamo @file{~/my-channel}:
pt_br: Como você criaria um canal? Primeiro, crie um diretório que conterá seus arquivos @file{.scm}, digamos @file{~/my-channel}:
sk: Ako vytvoriť kanál? Najprv vytvorte priečinok, ktorý bude obsahovať vaše @file{.scm} súbory, napríklad @file{~/moj-kanal}:

source: Suppose you want to add the @samp{my-hello} package we saw previously; it first needs some adjustments:
es: Suponga que quiere añadir el paquete @samp{my-hello} que vimos previamente; primero necesita algunos ajustes:
it: Supponiamo che tu voglia aggiungere il pacchetto @samp{my-hello} che abbiamo visto in precedenza; prima ha bisogno di alcune modifiche:
pt_br: Suponha que você queira adicionar o pacote @samp{my-hello} que vimos anteriormente; primeiro precisa de alguns ajustes:
sk: Predpokladajme, že chcete pridať balík @samp{my-hello}, s ktorým sme sa už stretli. Bude však potrebovať niekoľko úprav:

source: (define-public my-hello (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hello, Guix world: An example custom Guix package") (description "GNU Hello prints the message \"Hello, world!\" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))
es: (define-public my-hello (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hola, mundo Guix: Un ejemplo personalizado de paquete Guix") (description "GNU Hello imprime el mensaje \"Hello, world!\" y después sale. Sirve como un ejemplo de prácticas de codificación GNU estándar. Por tanto, admite argumentos de línea comando, múltiples lenguajes, y más.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))
it: (define-public my-hello (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Ciao, mondo Guix: Un esempio di pacchetto Guix personalizzato") (description "GNU Hello stampa il messaggio \"Ciao, mondo!\" e poi esce. Serve come esempio delle pratiche di codifica standard di GNU. Come tale, supporta argomenti da riga di comando, più linguaggi, e così via.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))
pt_br: (define-public my-hello (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Olá, mundo Guix: Um exemplo de pacote Guix personalizado") (description "GNU Hello imprime a mensagem \"Olá, mundo!\" e então sai. Ele serve como um exemplo de práticas de codificação GNU padrão. Como tal, ele suporta argumentos de linha de comando, vários idiomas e assim por diante.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))

source: Note that we have assigned the package value to an exported variable name with @code{define-public}. This is effectively assigning the package to the @code{my-hello} variable so that it can be referenced, among other as dependency of other packages.
es: Observe que hemos asignado el valor del paquete a un nombre de variable exportado con @code{define-public}. Esto es efectivamente asignar el paquete a la variable @code{my-hello} para que pueda ser referenciado, entre otros como dependencia de otros paquetes.
it: Nota che abbiamo assegnato il valore del pacchetto a un nome di variabile esportato con @code{define-public}. Questo assegna effettivamente il pacchetto alla variabile @code{my-hello} in modo che possa essere referenziato, tra l'altro come dipendenza di altri pacchetti.
pt_br: Observe que atribuímos o valor do pacote a um nome de variável exportado com @code{define-public}. Isso é efetivamente atribuir o pacote à variável @code{my-hello} para que ele possa ser referenciado, entre outras coisas, como dependência de outros pacotes.
sk: Všimnite si, že sme tentokrát zadanie balíka uložili do verejnej premennej @code{my-hello} pomocou @code{define-public}, na ktorú je možné odkazovať, medzi iným aj ako na závislosť v rámci zadania nejakého ďalšieho balíka.

source: If you use @code{guix package --install-from-file=my-hello.scm} on the above file, it will fail because the last expression, @code{define-public}, does not return a package. If you want to use @code{define-public} in this use-case nonetheless, make sure the file ends with an evaluation of @code{my-hello}:
es: Si utiliza @code{guix package --install-from-file=my-hello.scm} sobre el archivo de arriba, fallará porque la última expresión, @code{define-public}, no devuelve un paquete. Si quiere utilizar @code{define-public} en este caso de uso sin embargo, asegura los finales de archivo con una evaluación de @code{my-hello}:
it: Se usi @code{guix package --install-from-file=my-hello.scm} sul file precedente, fallirà perché l'ultima espressione, @code{define-public}, non restituisce un pacchetto. Se vuoi comunque usare @code{define-public} in questo caso, assicurati che il file termini con una valutazione di @code{my-hello}:
pt_br: Se você usar @code{guix package --install-from-file=my-hello.scm} no arquivo acima, ele falhará porque a última expressão, @code{define-public}, não retorna um pacote. Mesmo assim, se você quiser usar @code{define-public} neste caso de uso, certifique-se de que o arquivo termine com uma avaliação de @code{my-hello}:
sk: Ak spustíte @code{guix package --install-from-file=my-hello.scm} s použitím vyššie uvedeného súboru, tak príkaz zlyhá, pretože posledný výraz, @code{define-public}, nevracia balík. Ak aj napriek tomu chcete v tomto prípade použiť @code{define-public}, uistite sa, že súbor končí vykonaním @code{my-hello}:

source: This last example is not very typical.
es: Este último ejemplo no es muy típico.
it: Quest'ultimo esempio non è molto tipico.
pt_br: Este último exemplo não é muito típico.
sk: Tento posledný príklad nie je veľmi bežný.

source: Now how do you make that package visible to @command{guix} commands so you can test your packages? You need to add the directory to the search path using the @option{-L} command-line option, as in these examples:
es: ¿Ahora como haces que el paquete visible a comandos @command{guix} por tanto puede privar sus paquetes? Necesita añadir el directorio para la ruta de búsqueda utilizando la opción de línea de instrucción @option{-L}, como en estos ejemplos:
it: Ora come si rende quel pacchetto visibile ai comandi @command{guix} in modo da poter testare i pacchetti? È necessario aggiungere la directory al percorso di ricerca usando l'opzione della riga di comando @option{-L}, come in questi esempi:
pt_br: Agora, como você torna esse pacote visível para os comandos @command{guix} para poder testar seus pacotes? Você precisa adicionar o diretório ao caminho de pesquisa usando a opção de linha de comando @option{-L}, como nestes exemplos:
sk: A teraz, ako možno tento balík zviditeľniť pre @command{guix} príkazy, aby ste ho mohli vyskúšať? Musíte pridať priečinok @file{~/moj-kanal} k prehľadávaným cestám pomocou voľby @option{-L} ako v týchto príkladoch:

source: The final step is to turn @file{~/my-channel} into an actual channel, making your package collection seamlessly available @i{via} any @command{guix} command. To do that, you first need to make it a Git repository:
es: El paso final es convertir @file{~/my-channel} en un canal real, haciendo que tu colección de paquetes esté disponible sin problemas vía cualquier comando @command{guix}. Para ello, primero tienes que convertirlo en un repositorio Git:
it: Il passo finale è trasformare @file{~/my-channel} in un canale vero e proprio, rendendo la tua collezione di pacchetti disponibile senza problemi @i{via} qualsiasi comando @command{guix}. Per farlo, devi prima renderlo un repository Git:
pt_br: A etapa final é transformar @file{~/my-channel} em um canal real, disponibilizando sua coleção de pacotes perfeitamente @i{via} qualquer comando @command{guix}. Para fazer isso, primeiro você precisa torná-lo um repositório Git:
sk: Posledným krokom je pretvoriť @file{~/moj-kanal} na ozajstný kanál sprístupňujúc tak vašu zbierku balíkov akémukoľvek @command{guix} príkazu. V prvom rade musíte z tohto priečinka spraviť Git repozitár:

source: cd ~/my-channel git init git add my-hello.scm git commit -m "First commit of my channel."
es: cd ~/mi-canal git init git add my-hello.scm git commit -m "Primer commit de mi canal."
it: cd ~/my-channel git init git add my-hello.scm git commit -m "Primo commit del mio canale."
pt_br: cd ~/my-channel git init git add my-hello.scm git commit -m "Primeiro commit do meu canal."
sk: cd ~/moj-kanal git init git add my-hello.scm git commit -m "Prvá úprava môjho kanála."
