Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Guix uses these kernel features to provide fully isolated environments and even complete Guix System containers, lightweight virtual machines that share the host system's kernel. This feature comes in especially handy when using Guix on a foreign distribution to prevent interference from foreign libraries or configuration files that are available system-wide.
es: Guix utiliza estas características del kernel para proporcionar entornos totalmente aislados e incluso contenedores completos de Guix System, máquinas virtuales ligeras que comparten el kernel del sistema anfitrión. Esta característica es especialmente útil cuando se utiliza Guix en una distribución extranjera para evitar la interferencia de bibliotecas extranjeras o archivos de configuración que están disponibles en todo el sistema.
it: Guix utilizza queste funzionalità del kernel per fornire ambienti completamente isolati e anche contenitori Guix System completi, macchine virtuali leggere che condividono il kernel del sistema host. Questa funzionalità è particolarmente utile quando si utilizza Guix su una distribuzione esterna per prevenire interferenze da librerie o file di configurazione esterni disponibili a livello di sistema.
pt_br: O Guix usa esses recursos do kernel para fornecer ambientes totalmente isolados e até mesmo contêineres Guix System completos, máquinas virtuais leves que compartilham o kernel do sistema host. Esse recurso é especialmente útil ao usar o Guix em uma distribuição estrangeira para evitar interferência de bibliotecas estrangeiras ou arquivos de configuração que estão disponíveis em todo o sistema.
sk: Guix tieto schopnosti jadra využíva pre poskytovanie úplne oddelených prostredí a tiež kontajnerov s plným systémom Guix, teda odľahčených virtuálnych strojov zdieľajúcich jadro s hostiteľským systémom. Táto vlastnosť je užitočná predovšetkým pri používaní Guixu na cudzích distribúciách pre zabránenie vplyvu cudzích knižníc a súborov nastavení, ktoré sú dostupné celosystémovo.

source: The easiest way to get started is to use @command{guix shell} with the @option{--container} option. @xref{Invoking guix shell,,, guix, GNU Guix Reference Manual} for a reference of valid options.
es: La forma más fácil de empezar es usar @command{guix shell} con la opción @option{--container}. @xref{Invocar guix shell,,, guix, Manual de Referencia de GNU Guix} para una referencia de opciones válidas.
it: Il modo più semplice per iniziare è usare @command{guix shell} con l'opzione @option{--container}. @xref{Invocare guix shell,,, guix.it, Manuale di riferimento di GNU Guix} per un riferimento delle opzioni valide.
pt_br: A maneira mais fácil de começar é usar @command{guix shell} com a opção @option{--container}. @xref{Invocando guix shell,,, guix.pt_BR, Manual de Referência GNU Guix} para uma referência de opções válidas.
sk: Najľahším spôsobom ako začať je použitie príkazu @code{proc} s voľbou @option{--container}. @xref{Invoking guix shell,,, guix, GNU Guix Reference Manual} pre popis dostupných volieb.

source: The following snippet spawns a minimal shell process with most namespaces unshared from the system. The current working directory is visible to the process, but anything else on the file system is unavailable. This extreme isolation can be very useful when you want to rule out any sort of interference from environment variables, globally installed libraries, or configuration files.
es: El siguiente fragmento genera un proceso shell mínimo con la mayoría de los espacios de nombres no compartidos con el sistema. El directorio de trabajo actual es visible para el proceso, pero cualquier otra cosa en el sistema de archivos no está disponible. Este aislamiento extremo puede ser muy útil cuando se quiere descartar cualquier tipo de interferencia de variables de entorno, bibliotecas instaladas globalmente o archivos de configuración.
it: Il seguente frammento avvia un processo shell minimale con la maggior parte dei namespace non condivisi dal sistema. La directory di lavoro corrente è visibile al processo, ma qualsiasi altra cosa sul file system non è disponibile. Questa estrema isolazione può essere molto utile quando si desidera escludere qualsiasi tipo di interferenza da variabili d'ambiente, librerie installate globalmente o file di configurazione.
pt_br: O snippet a seguir gera um processo de shell mínimo com a maioria dos namespaces não compartilhados do sistema. O diretório de trabalho atual é visível para o processo, mas qualquer outra coisa no sistema de arquivos não está disponível. Esse isolamento extremo pode ser muito útil quando você deseja descartar qualquer tipo de interferência de variáveis de ambiente, bibliotecas instaladas globalmente ou arquivos de configuração.
sk: Nasledovný úryvok kódu spúšťa jednoduchý proces shellu s väčšinou oblastí mien nezdieľaných so systémom. Proces vidí súčasný pracovný priečinok, ale zvyšok súborového systému je mu nedostupný. Toto mimoriadne oddelenie sa môže hodiť keď sa chcete zbaviť všetkých nechcených zásahov premenných prostredia, celosystémovo nainštalovaných knižníc alebo súborov nastavení.

source: It is a bleak environment, barren, desolate. You will find that not even the GNU coreutils are available here, so to explore this deserted wasteland you need to use built-in shell commands. Even the usually gigantic @file{/gnu/store} directory is reduced to a faint shadow of itself.
es: Es un entorno sombrío, estéril, desolado. Encontrará que ni siquiera los coreutils de GNU están disponibles aquí, así que para explorar este páramo desierto necesita usar comandos de shell incorporados. Incluso el normalmente gigantesco directorio @file{/gnu/store} está reducido a una débil sombra de sí mismo.
it: È un ambiente desolato, sterile, deserto. Scoprirai che nemmeno i coreutils GNU sono disponibili qui, quindi per esplorare questa landa deserta devi usare i comandi shell integrati. Anche la di solito gigantesca directory @file{/gnu/store} è ridotta a una flebile ombra di se stessa.
pt_br: O trecho a seguir gera um processo de shell mínimo como a maioria dos namespaces não compartilhados do sistema. O diretório de trabalho atual é visível para o processo, mas qualquer outra coisa no sistema de arquivos não está disponível. Esse extremo de isolamento pode ser muito útil quando você deseja descartar qualquer tipo de interferência de variáveis de ambiente, bibliotecas instaladas globalmente ou arquivos de configuração.
sk: Je to čisté, holé a vyprahnuté prostredie. Zistíte, že neobsahuje ani GNU coreutils, takže pre prebádanie tejto pustiny musíte použiť vstavané príkazy shellu. Aj z obvykle obrovského priečinka @file{/gnu/store} zostal iba tieň.

source: exiting a container
es: abandonando un contenedor
it: uscire da un contenitore
pt_br: saindo de um contêiner
sk: opúšťanie kontajnera

source: There isn't much you can do in an environment like this other than exiting it. You can use @key{^D} or @command{exit} to terminate this limited shell environment.
es: No hay mucho que se pueda hacer en un entorno así, aparte de salir de él. Puede utilizar @key{^D} o @command{exit} para finalizar este entorno de shell limitado.
it: Non c'è molto che tu possa fare in un ambiente come questo oltre a uscirne. Puoi usare @key{^D} o @command{exit} per terminare questo ambiente shell limitato.
pt_br: Não há muito que você possa fazer em um ambiente como esse além de sair dele. Você pode usar @key{^D} ou @command{exit} para encerrar esse ambiente de shell limitado.
sk: V podobnom prostredí sa toho veľa urobiť nedá okrem toho, že ho opustíte. Na to vám poslúži klávesová skratka @key{^D} alebo príkaz @command{exit}.

source: exposing directories, container
es: exponer directorios, contenedor
it: esporre directory, contenitore
pt_br: expondo diretórios, contêiner
sk: sprístupnenie priečinkov, kontajner

source: sharing directories, container
es: compartir directorios, contenedor
it: condividere directory, contenitore
pt_br: compartilhamento de diretórios, contêiner
sk: zdieľanie priečinkov, kontajner

source: mapping locations, container
es: ubicaciones cartográficas, contenedor
it: mappare posizioni, contenitore
pt_br: localizações de mapeamento, contêiner
sk: mapovanie umiestnení, kontajner

source: You can make other directories available inside of the container environment; use @option{--expose=DIRECTORY} to bind-mount the given directory as a read-only location inside the container, or use @option{--share=DIRECTORY} to make the location writable. With an additional mapping argument after the directory name you can control the name of the directory inside the container. In the following example we map @file{/etc} on the host system to @file{/the/host/etc} inside a container in which the GNU coreutils are installed.
es: Puede hacer que otros directorios estén disponibles dentro del entorno del contenedor; utilice @option{--expose=DIRECTORY} para montar el directorio dado como una ubicación de sólo lectura dentro del contenedor, o utilice @option{--share=DIRECTORY} para hacer que la ubicación sea de escritura. Con un argumento de asignación adicional después del nombre del directorio puede controlar el nombre del directorio dentro del contenedor. En el siguiente ejemplo mapeamos @file{/etc} en el sistema anfitrión a @file{/el/host/etc} dentro de un contenedor en el que están instalados los coreutils de GNU.
it: È possibile rendere disponibili altre directory all'interno dell'ambiente del contenitore; utilizzare @option{--expose=DIRECTORY} per montare con bind la directory specificata come posizione di sola lettura all'interno del contenitore, o utilizzare @option{--share=DIRECTORY} per rendere la posizione scrivibile. Con un argomento di mappatura aggiuntivo dopo il nome della directory è possibile controllare il nome della directory all'interno del contenitore. Nell'esempio seguente mappiamo @file{/etc} sul sistema host a @file{/the/host/etc} all'interno di un contenitore in cui sono installati i coreutils GNU.
pt_br: Você pode tornar outros diretórios disponíveis dentro do ambiente do contêiner; use @option{--expose=DIRECTORY} para montar o diretório fornecido como um local somente leitura dentro do contêiner, ou use @option{--share=DIRECTORY} para tornar o local gravável. Com um argumento de mapeamento adicional após o nome do diretório, você pode controlar o nome do diretório dentro do contêiner. No exemplo a seguir, mapeamos @file{/etc} no sistema host para @file{/the/host/etc} dentro de um contêiner no qual os GNU coreutils estão instalados.
sk: V kontajneri môžete sprístupniť aj iné priečinky. Použite @option{--expose=PRIEČINOK} pre podvojné pripojenie daného priečinka ku kontajneru len na čítanie, alebo použite @option{--share=PRIEČINOK}, aby sa do daného priečinka dalo aj zapisovať. Pridaním dodatočného parametra za cestou k priečinku môžete ovládať názov priečinka vrámci kontajnera. V nasledovnom príklade mapujeme @file{/etc} hostiteľského systému ako @file{/hosť/etc} v kontajneri obsahujúcom GNU coreutils.

source: Similarly, you can prevent the current working directory from being mapped into the container with the @option{--no-cwd} option. Another good idea is to create a dedicated directory that will serve as the container's home directory, and spawn the container shell from that directory.
es: Del mismo modo, puede evitar que el directorio de trabajo actual se asigne al contenedor con la opción @option{--no-cwd}. Otra buena idea es crear un directorio dedicado que servirá como directorio de inicio del contenedor, y generar el shell del contenedor desde ese directorio.
it: Allo stesso modo, puoi impedire che la directory di lavoro corrente venga mappata nel contenitore con l'opzione @option{--no-cwd}. Un'altra buona idea è creare una directory dedicata che fungerà da directory home del contenitore, e avviare la shell del contenitore da quella directory.
pt_br: Da mesma forma, você pode evitar que o diretório de trabalho atual seja mapeado para o contêiner com a opção @option{--no-cwd}. Outra boa ideia é criar um diretório dedicado que servirá como o diretório home do contêiner e gerar o shell do contêiner a partir desse diretório.
sk: Tiež je možné zabrániť mapovaniu súčasného pracovného priečinka v kontajneri pomocou voľby @option{--no-cwd}. Ďalším dobrým nápadom je vytvorenie vyhradeného priečinka, ktorý kontajneru poslúži ako domovský priečinok, v ktorom sa spustí shell kontajnera.

source: hide system libraries, container
es: ocultar las bibliotecas del sistema, contenedor
it: nascondi librerie di sistema, contenitore
pt_br: ocultar bibliotecas do sistema, contêiner
sk: skryť systémové knižnice, kontajner

source: avoid ABI mismatch, container
es: evitar el desajuste ABI, contenedor
it: evitare disallineamento ABI, contenitore
pt_br: evitar incompatibilidade de ABI, contêiner
sk: vyhnúť sa rozporom v ABI, kontajner

source: On a foreign system a container environment can be used to compile software that cannot possibly be linked with system libraries or with the system's compiler toolchain. A common use-case in a research context is to install packages from within an R session. Outside of a container environment there is a good chance that the foreign compiler toolchain and incompatible system libraries are found first, resulting in incompatible binaries that cannot be used by R. In a container shell this problem disappears, as system libraries and executables simply aren't available due to the unshared @code{mount} namespace.
es: En un sistema ajeno se puede utilizar un entorno contenedor para compilar software que no se puede enlazar con las bibliotecas del sistema o con la cadena de herramientas del compilador del sistema. Un caso de uso común en un contexto de investigación es instalar paquetes desde una sesión de R. Fuera de un entorno de contenedor hay una buena probabilidad de que la cadena de herramientas del compilador extranjero y las bibliotecas del sistema incompatibles se encuentren primero, lo que resulta en binarios incompatibles que no pueden ser utilizados por R. En un shell de contenedor este problema desaparece, ya que las bibliotecas del sistema y los ejecutables simplemente no están disponibles debido al espacio de nombres @code{mount} no compartido.
it: Su un sistema esterno, un ambiente container può essere utilizzato per compilare software che non può essere collegato a librerie di sistema o alla toolchain del compilatore del sistema. Un caso d'uso comune in un contesto di ricerca è l'installazione di pacchetti da una sessione R. Al di fuori di un ambiente container è molto probabile che la toolchain del compilatore esterno e le librerie di sistema incompatibili vengano trovate per prime, risultando in binari incompatibili che non possono essere utilizzati da R. In una shell container questo problema scompare, poiché le librerie di sistema e gli eseguibili semplicemente non sono disponibili a causa del namespace @code{mount} non condiviso.
pt_br: Em um sistema estrangeiro, um ambiente de contêiner pode ser usado para compilar software que não pode ser vinculado a bibliotecas do sistema ou à cadeia de ferramentas do compilador do sistema. Um caso de uso comum em um contexto de pesquisa é instalar pacotes de dentro de uma sessão R. Fora de um ambiente de contêiner, há uma boa chance de que a cadeia de ferramentas do compilador estrangeiro e bibliotecas de sistema incompatíveis sejam encontradas primeiro, resultando em binários incompatíveis que não podem ser usados pelo R. Em um shell de contêiner, esse problema desaparece, pois as bibliotecas e executáveis do sistema simplesmente não estão disponíveis devido ao namespace @code{mount} não compartilhado.
sk: Na cudzom systéme možno kontajnerové prostredie využiť na preklad programov, ktoré nemožno spojiť so systémovými knižnicami alebo so systémovým vývojovým reťazcom. Obvyklým príkladom je oblasť výskumu, kde používatelia často inštalujú balíky vrámci sedenia R. Mimo kontajnerového prostredia je pravdepodobné, že cudzí vývojový reťazec či nevhodné systémové knižnice budú nájdené ako prvé. Výsledkom sú potom nevyhovujúce binárne súbory, ktoré R nemôže využiť. V kontajneri tento problém zaniká, keďže systémové knižnice a spustiteľné súbory jednoducho nie sú prístupné kvôli nezdieľanej oblasti mien pripojení @code{mount}.

source: Let's take a comprehensive manifest providing a comfortable development environment for use with R:
es: Tomemos un manifiesto exhaustivo que proporciona un entorno de desarrollo cómodo para su uso con R:
it: Prendiamo un manifesto completo che fornisce un ambiente di sviluppo confortevole per l'uso con R:
pt_br: Vamos pegar um manifesto abrangente que fornece um ambiente de desenvolvimento confortável para uso com R:
sk: Vezmime si zrozumiteľný balíkospis poskytujúci pohodlné vývojové prostredie pre použitie s R:

source: ;; base packages "bash-minimal" "glibc-locales" "nss-certs"
it: ;; pacchetti base "bash-minimal" "glibc-locales" "nss-certs"
pt_br: ;; pacote base "bash-minimal" "glibc-locales" "nss-certs"
sk: ;; základné balíky "bash-minimal" "glibc-locales" "nss-certs"

source: ;; Common command line tools lest the container is too empty. "coreutils" "grep" "which" "wget" "sed"
es: ;; Herramientas habituales de la línea de comandos, no sea que el contenedor esté demasiado vacío. "coreutils" "grep" "which" "wget" "sed"
it: ;; Strumenti comuni da riga di comando per evitare che il contenitore sia troppo vuoto. "coreutils" "grep" "which" "wget" "sed"
pt_br: ;; Ferramentas comuns de linha de comando para o caso de o contêiner ficar muito vazio. "coreutils" "grep" "which" "wget" "sed"
sk: ;; Všeobecné nástroje príkazového riadka, bez ktorých by bol kontajner pripustý. "coreutils" "grep" "which" "wget" "sed"

source: ;; R markdown tools "pandoc"
es: ;; Herramientas R markdown "pandoc"
it: ;; Strumenti R markdown "pandoc"
pt_br: ;; Ferramenta de marcação R "pandoc"
sk: ;; Nástroje značkovacieho jazyka R "pandoc"

source: ;; Toolchain and common libraries for "install.packages" "gcc-toolchain@@10" "gfortran-toolchain" "gawk" "tar" "gzip" "unzip" "make" "cmake" "pkg-config" "cairo" "libxt" "openssl" "curl" "zlib"))
es: ;;Toolchain y bibliotecas comunes para "install.packages" "gcc-toolchain@@10" "gfortran-toolchain" "gawk" "tar" "gzip" "unzip" "make" "cmake" "pkg-config" "cairo" "libxt" "openssl" "curl" "zlib"))
it: ;; Toolchain e librerie comuni per "install.packages" "gcc-toolchain@@10" "gfortran-toolchain" "gawk" "tar" "gzip" "unzip" "make" "cmake" "pkg-config" "cairo" "libxt" "openssl" "curl" "zlib"))
pt_br: ;; Cadeia de ferramentas e bibliotecas comuns para "install.packages" "gcc-toolchain@@10" "gfortran-toolchain" "gawk" "tar" "gzip" "unzip" "make" "cmake" "pkg-config" "cairo" "libxt" "openssl" "curl" "zlib"))
sk: ;; Vývojový reťazec a všeobecné knižnice pre „install.packages“ "gcc-toolchain@@10" "gfortran-toolchain" "gawk" "tar" "gzip" "unzip" "make" "cmake" "pkg-config" "cairo" "libxt" "openssl" "curl" "zlib"))

source: Let's use this to run R inside a container environment. For convenience we share the @code{net} namespace to use the host system's network interfaces. Now we can build R packages from source the traditional way without having to worry about ABI mismatch or incompatibilities.
es: Vamos a utilizar esto para ejecutar R dentro de un entorno de contenedor. Por conveniencia compartimos el espacio de nombres @code{net} para usar las interfaces de red del sistema anfitrión. Ahora podemos construir paquetes de R desde el código fuente de la forma tradicional sin tener que preocuparnos por desajustes ABI o incompatibilidades.
it: Utilizziamolo per eseguire R all'interno di un ambiente container. Per comodità, condividiamo il namespace @code{net} per utilizzare le interfacce di rete del sistema host. Ora possiamo compilare i pacchetti R dal sorgente nel modo tradizionale senza doverci preoccupare di disallineamenti ABI o incompatibilità.
pt_br: Vamos usar isso para executar o R dentro de um ambiente de contêiner. Por conveniência, compartilhamos o namespace @code{net} para usar as interfaces de rede do sistema host. Agora podemos construir pacotes R a partir da fonte da maneira tradicional, sem ter que nos preocupar com incompatibilidades ou incompatibilidades de ABI.
sk: Použime tento balíkospis pre spustenie R v kontajnerovom prostredí. Pre zjednodušenie zdieľame sieťovú oblasť mien @code{net} pre prístup k sieťovým rozhraniam hostiteľského systému. Teraz môžeme zostavovať balíky R zo zdrojového kódu obvyklým spôsobom bez obáv o rozpory týkajúce sa ABI alebo o iné ťažkosti.

source: The downloaded source packages are in '/tmp/RtmpCuwdwM/downloaded_packages' > library("Cairo", lib=getwd()) > # success!
es: Los paquetes origien descargados están en '/tmp/RtmpCuwdwM/downloaded_packages' > library("Cairo", lib=getwd()) > # logrado!
it: I pacchetti sorgente scaricati si trovano in '/tmp/RtmpCuwdwM/downloaded_packages' > library("Cairo", lib=getwd()) > # successo!
pt_br: The downloaded source packages are in '/tmp/RtmpCuwdwM/downloaded_packages' > library("Cairo", lib=getwd()) > # sucesso!

source: Using container shells is fun, but they can become a little cumbersome when you want to go beyond just a single interactive process. Some tasks become a lot easier when they sit on the rock solid foundation of a proper Guix System and its rich set of system services. The next section shows you how to launch a complete Guix System inside of a container.
es: Usar shells contenedores es divertido, pero pueden volverse un poco engorrosos cuando quieres ir más allá de un único proceso interactivo. Algunas tareas se vuelven mucho más fáciles cuando se asientan sobre la sólida base de un Sistema Guix adecuado y su rico conjunto de servicios de sistema. La siguiente sección muestra cómo lanzar un Sistema Guix completo dentro de un contenedor.
it: L'uso delle shell container è divertente, ma possono diventare un po' complicate quando si vuole andare oltre un singolo processo interattivo. Alcuni compiti diventano molto più facili quando si basano sulla solida fondazione di un vero sistema Guix e del suo ricco set di servizi di sistema. La prossima sezione ti mostrerà come avviare un sistema Guix completo all'interno di un container.
pt_br: Usar shells de contêiner é divertido, mas eles podem se tornar um pouco trabalhosos quando você quer ir além de apenas um único processo interativo. Algumas tarefas se tornam muito mais fáceis quando se assentam na fundação sólida de um Sistema Guix adequado e seu rico conjunto de serviços de sistema. A próxima seção mostra como iniciar um Sistema Guix completo dentro de um contêiner.
sk: Používanie kontajnerov je zábavné, ale pri viac ako jednom interaktívnom procese sa môžu zdať ťažkopádne. Niektoré úlohy sú oveľa ľahšie zvládnuteľné ak sú založené na skalopevnom základe plného systému Guix a jeho bohatej množine systémových služieb. V ďalšom oddieli si ukážeme ako spustiť plný systém Guix v kontajneri.
