Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Renaming of variables related to service, home, or system configuration must be communicated for at least six months before removal using the @code{(guix deprecation)} mechanisms. For example, renaming of @code{murmur-configuration} to @code{mumble-server-configuration} was communicated through a series of definitions like this one:
it: La ridenominazione di variabili relative a servizi, home o configurazione di sistema deve essere comunicata per almeno sei mesi prima della rimozione utilizzando i meccanismi @code{(guix deprecation)}. Ad esempio, la ridenominazione di @code{murmur-configuration} in @code{mumble-server-configuration} è stata comunicata tramite una serie di definizioni come questa:
pt_br: A renomeação de variáveis relacionadas a configuração de serviço, home ou sistema deve ser comunicada por pelo menos seis meses antes da remoção usando os mecanismos @code{(guix deprecation)}. Por exemplo, a renomeação de @code{murmur-configuration} para @code{mumble-server-configuration} foi comunicada por meio de uma série de definições como esta:

source: Procedures slated for removal may be defined like this:
it: Le procedure destinate alla rimozione possono essere definite così:
pt_br: Os procedimentos previstos para remoção podem ser definidos assim:

source: Record fields, notably fields of service configuration records, must follow a similar deprecation period. This is usually achieved through @i{ad hoc} means though. For example, the @code{hosts-file} field of @code{operating-system} was deprecated by adding a @code{sanitized} property that would emit a warning:
it: I campi dei record, in particolare i campi dei record di configurazione dei servizi, devono seguire un periodo di deprecazione simile. Tuttavia, questo di solito è ottenuto tramite mezzi @i{ad hoc}. Ad esempio, il campo @code{hosts-file} di @code{operating-system} è stato deprecato aggiungendo una proprietà @code{sanitized} che emetteva un avviso:
pt_br: Campos de registro, notavelmente campos de registros de configuração de serviço, devem seguir um período de depreciação similar. Isso geralmente é obtido por meio de @i{ad hoc}. Por exemplo, o campo @code{hosts-file} de @code{operating-system} foi depreciado pela adição de uma propriedade @code{sanitized} que emitiria um aviso:

source: When deprecating interfaces in @code{operating-system}, @code{home-environment}, @code{(gnu services)}, or any popular service, the deprecation must come with an entry in @code{etc/news.scm}.
it: Quando si deprecano interfacce in @code{operating-system}, @code{home-environment}, @code{(gnu services)} o qualsiasi servizio popolare, la deprecazione deve includere una voce in @code{etc/news.scm}.
pt_br: Ao descontinuar interfaces em @code{operating-system}, @code{home-environment}, @code{(gnu services)} ou qualquer serviço popular, a descontinuação deve vir com uma entrada em @code{etc/news.scm}.

source: deprecation of programming interfaces
it: deprecazione delle interfacce di programmazione
pt_br: depreciação de interface de programação

source: Core interfaces
pt_br: Interfaces principais

source: Core programming interfaces, in particular the @code{(guix ...)} modules, may be relied on by a variety of external tools and channels. Any incompatible change must be formally deprecated with @code{define-deprecated}, as shown above, for @b{at least one year} before removal. The manual must clearly document the new interface and, except in obvious cases, explain how to migrate from the old one.
it: Le interfacce di programmazione principali, in particolare i moduli @code{(guix ...)}, possono essere utilizzate da vari strumenti e canali esterni. Qualsiasi modifica incompatibile deve essere formalmente deprecata con @code{define-deprecated}, come mostrato sopra, per @b{almeno un anno} prima della rimozione. Il manuale deve documentare chiaramente la nuova interfaccia e, tranne nei casi ovvi, spiegare come migrare dalla vecchia.
pt_br: Interfaces de programação principais, em particular os módulos @code{(guix ...)}, podem ser confiáveis por uma variedade de ferramentas e canais externos. Qualquer alteração incompatível deve ser formalmente descontinuada com @code{define-deprecated}, como mostrado acima, por @b{pelo menos um ano} antes da remoção. O manual deve documentar claramente a nova interface e, exceto em casos óbvios, explicar como migrar da antiga.

source: As an example, the @code{build-expression->derivation} procedure was superseded by @code{gexp->derivation} and remained available as a deprecated symbol:
it: Ad esempio, la procedura @code{build-expression->derivation} è stata sostituita da @code{gexp->derivation} ed è rimasta disponibile come simbolo deprecato:
pt_br: Como exemplo, o procedimento @code{build-expression->derivation} foi substituído por @code{gexp->derivation} e permaneceu disponível como um símbolo obsoleto:

source: Sometimes bindings are moved from one module to another. In those cases, bindings must be reexported from the original module for at least one year.
it: A volte i binding vengono spostati da un modulo a un altro. In questi casi, i binding devono essere riesportati dal modulo originale per almeno un anno.
pt_br: Às vezes, bindings são movidos de um módulo para outro. Nesses casos, bindings devem ser reexportados do módulo original por pelo menos um ano.

source: This section does not cover all possible situations but hopefully allows users to know what to expect and developers to stick to its spirit. Please email @email{guix-devel@@gnu.org} for any questions.
it: Questa sezione non copre tutte le possibili situazioni ma si spera permetta agli utenti di sapere cosa aspettarsi e agli sviluppatori di attenersi al suo spirito. Per qualsiasi domanda, inviare un'email a @email{guix-devel@@gnu.org}.
pt_br: Esta seção não cobre todas as situações possíveis, mas espera-se que permita que os usuários saibam o que esperar e que os desenvolvedores se mantenham fiéis ao seu espírito. Por favor, envie um e-mail para @email{guix-devel@@gnu.org} para quaisquer perguntas.

source: Guix is documented using the Texinfo system. If you are not yet familiar with it, we accept contributions for documentation in most formats. That includes plain text, Markdown, Org, etc.
it: Guix è documentato utilizzando il sistema Texinfo. Se non lo conosci ancora, accettiamo contributi per la documentazione nella maggior parte dei formati. Ciò include testo semplice, Markdown, Org, ecc.
pt_br: Guix é documentado usando o sistema Texinfo. Se você ainda não está familiarizado com ele, aceitamos contribuições para documentação na maioria dos formatos. Isso inclui texto simples, Markdown, Org, etc.

source: Documentation contributions can be sent to @email{guix-patches@@gnu.org}. Prepend @samp{[DOCUMENTATION]} to the subject.
it: I contributi alla documentazione possono essere inviati a @email{guix-patches@@gnu.org}. Anteporre @samp{[DOCUMENTATION]} all'oggetto.
pt_br: Contribuições de documentação podem ser enviadas para @email{guix-patches@@gnu.org}. Adicione @samp{[DOCUMENTATION]} ao assunto.

source: When you need to make more than a simple addition to the documentation, we prefer that you send a proper patch as opposed to sending an email as described above. @xref{Submitting Patches} for more information on how to send your patches.
it: Quando devi apportare più di una semplice aggiunta alla documentazione, preferiamo che invii una patch corretta invece di inviare un'email come descritto sopra. @xref{Submitting Patches} per maggiori informazioni su come inviare le tue patch.
pt_br: Quando você precisar fazer mais do que uma simples adição à documentação, preferimos que você envie um patch adequado em vez de enviar um e-mail como descrito acima. @xref{Submitting Patches} para obter mais informações sobre como enviar seus patches.

source: To modify the documentation, you need to edit @file{doc/guix.texi} and @file{doc/contributing.texi} (which contains this documentation section), or @file{doc/guix-cookbook.texi} for the cookbook. If you compiled the Guix repository before, you will have many more @file{.texi} files that are translations of these documents. Do not modify them, the translation is managed through @uref{https://translate.codeberg.org/projects/guix, Weblate}. @xref{Translating Guix} for more information.
it: Per modificare la documentazione, devi modificare @file{doc/guix.texi} e @file{doc/contributing.texi} (che contiene questa sezione di documentazione) o @file{doc/guix-cookbook.texi} per il cookbook. Se hai compilato il repository Guix in precedenza, avrai molti altri file @file{.texi} che sono traduzioni di questi documenti. Non modificarli, la traduzione è gestita tramite @uref{https://translate.codeberg.org/projects/guix, Weblate}. @xref{Translating Guix} per maggiori informazioni.
pt_br: Para modificar a documentação, você precisa editar @file{doc/guix.texi} e @file{doc/contributing.texi} (que contém esta seção de documentação), ou @file{doc/guix-cookbook.texi} para o livro de receitas. Se você compilou o repositório Guix antes, você terá muito mais arquivos @file{.texi} que são traduções desses documentos. Não os modifique, a tradução é gerenciada através de @uref{https://translate.codeberg.org/projects/guix, Weblate}. @xref{Translating Guix} para mais informações.

source: To render documentation, you must first make sure that you ran @command{./configure} in your source tree (@pxref{Running Guix Before It Is Installed}). After that you can run one of the following commands:
it: Per generare la documentazione, devi prima assicurarti di aver eseguito @command{./configure} nel tuo albero sorgente (@pxref{Running Guix Before It Is Installed}). Dopodiché puoi eseguire uno dei seguenti comandi:
pt_br: Para renderizar a documentação, você deve primeiro certificar-se de que executou @command{./configure} na sua árvore de origem (@pxref{Running Guix Before It Is Installed}). Depois disso, você pode executar um dos seguintes comandos:

source: @samp{make doc/guix.info} to compile the Info manual.
it: @samp{make doc/guix.info} per compilare il manuale Info.
pt_br: @samp{make doc/guix.info} para compilar o manual de informações.

source: You can check it with @command{info doc/guix.info}.
it: Puoi controllarlo con @command{info doc/guix.info}.
pt_br: Você pode verificar com @command{info doc/guix.info}.

source: @samp{make doc/guix.html} to compile the HTML version.
it: @samp{make doc/guix.html} per compilare la versione HTML.
pt_br: @samp{make doc/guix.html} para compilar a versão HTML.

source: You can point your browser to the relevant file in the @file{doc/guix.html} directory.
it: Puoi puntare il tuo browser al file pertinente nella directory @file{doc/guix.html}.
pt_br: Você pode apontar seu navegador para o arquivo relevante no diretório @file{doc/guix.html}.

source: @samp{make doc/guix-cookbook.info} for the cookbook Info manual.
it: @samp{make doc/guix-cookbook.info} per il manuale Info del cookbook.
pt_br: @samp{make doc/guix-cookbook.info} para o manual de informações do livro de receitas.

source: @samp{make doc/guix-cookbook.html} for the cookbook HTML version.
it: @samp{make doc/guix-cookbook.html} per la versione HTML del cookbook.
pt_br: @samp{make doc/guix-cookbook.html} para a versão HTML do livro de receitas.

source: translation
pt_br: tradução

source: native language support
it: supporto per la lingua nativa
pt_br: suporte a idioma nativo

source: Writing code and packages is not the only way to provide a meaningful contribution to Guix. Translating to a language you speak is another example of a valuable contribution you can make. This section is designed to describe the translation process. It gives you advice on how you can get involved, what can be translated, what mistakes you should avoid and what we can do to help you!
it: Scrivere codice e pacchetti non è l'unico modo per fornire un contributo significativo a Guix. Tradurre in una lingua che conosci è un altro esempio di contributo prezioso che puoi dare. Questa sezione è progettata per descrivere il processo di traduzione. Ti dà consigli su come puoi coinvolgerti, cosa puoi tradurre, quali errori dovresti evitare e cosa possiamo fare per aiutarti!
pt_br: Escrever código e pacotes não é a única maneira de fornecer uma contribuição significativa para o Guix. Traduzir para um idioma que você fala é outro exemplo de uma contribuição valiosa que você pode fazer. Esta seção foi criada para descrever o processo de tradução. Ela dá conselhos sobre como você pode se envolver, o que pode ser traduzido, quais erros você deve evitar e o que podemos fazer para ajudar você!

source: Guix is a big project that has multiple components that can be translated. We coordinate the translation effort on a @uref{https://translate.codeberg.org/projects/guix/,Weblate instance} hosted by Codeberg. You will need an account to submit translations.
it: Guix è un grande progetto con più componenti che possono essere tradotti. Coordiniamo lo sforzo di traduzione su un @uref{https://translate.codeberg.org/projects/guix/,istanza Weblate} ospitata da Codeberg. Avrai bisogno di un account per inviare traduzioni.
pt_br: Guix é um grande projeto que tem vários componentes que podem ser traduzidos. Nós coordenamos o esforço de tradução em uma instância @uref{https://translate.codeberg.org/projects/guix/,Weblate} hospedada por Codeberg. Você precisará de uma conta para enviar traduções.

source: Some of the software packaged in Guix also contain translations. We do not host a translation platform for them. If you want to translate a package provided by Guix, you should contact their developers or find the information on their website. As an example, you can find the homepage of the @code{hello} package by typing @command{guix show hello}. On the ``homepage'' line, you will see @url{https://www.gnu.org/software/hello/} as the homepage.
it: Alcuni dei software impacchettati in Guix contengono anche traduzioni. Non ospitiamo una piattaforma di traduzione per loro. Se vuoi tradurre un pacchetto fornito da Guix, dovresti contattare i suoi sviluppatori o trovare le informazioni sul loro sito web. Ad esempio, puoi trovare la homepage del pacchetto @code{hello} digitando @command{guix show hello}. Sulla riga ``homepage'', vedrai @url{https://www.gnu.org/software/hello/} come homepage.
pt_br: Alguns dos softwares empacotados no Guix também contêm traduções. Não hospedamos uma plataforma de tradução para eles. Se você quiser traduzir um pacote fornecido pelo Guix, entre em contato com os desenvolvedores ou encontre as informações no site deles. Como exemplo, você pode encontrar a homepage do pacote @code{hello} digitando @command{guix show hello}. Na linha "homepage'', você verá @url{https://www.gnu.org/software/hello/} como a homepage.

source: Many GNU and non-GNU packages can be translated on the @uref{https://translationproject.org,Translation Project}. Some projects with multiple components have their own platform. For instance, GNOME has its own platform, @uref{https://l10n.gnome.org/,Damned Lies}.
it: Molti pacchetti GNU e non GNU possono essere tradotti su @uref{https://translationproject.org,Translation Project}. Alcuni progetti con più componenti hanno la loro piattaforma. Ad esempio, GNOME ha la sua piattaforma, @uref{https://l10n.gnome.org/,Damned Lies}.
pt_br: Muitos pacotes GNU e não-GNU podem ser traduzidos no @uref{https://translationproject.org,Translation Project}. Alguns projetos com múltiplos componentes têm sua própria plataforma. Por exemplo, o GNOME tem sua própria plataforma, @uref{https://l10n.gnome.org/,Damned Lies}.

source: Guix has five components hosted on Weblate.
it: Guix ha cinque componenti ospitati su Weblate.
pt_br: O Guix tem cinco componentes hospedados no Weblate.

source: @code{guix} contains all the strings from the Guix software (the
it: @code{guix} contiene tutte le stringhe del software Guix (il
pt_br: @code{guix} contém todas as strings do software Guix (o

source: guided system installer, the package manager, etc), excluding packages.
it: installer guidato del sistema, il gestore di pacchetti, ecc.), escludendo i pacchetti.
pt_br: instalador de sistema guiado, gerenciador de pacotes, etc.), excluindo pacotes.

source: @code{packages} contains the synopsis (single-sentence description
it: @code{packages} contiene la sinossi (descrizione di una frase)
pt_br: @code{packages} contém a sinopse (descrição de uma única frase

source: of a package) and description (longer description) of packages in Guix.
it: di un pacchetto) e la descrizione (descrizione più lunga) dei pacchetti in Guix.
pt_br: de um pacote) e descrição (descrição mais longa) de pacotes no Guix.

source: @code{website} contains the official Guix website, except for
it: @code{website} contiene il sito web ufficiale di Guix, eccetto per
pt_br: @code{website} contém o site oficial do Guix, exceto para

source: blog posts and multimedia content.
it: post del blog e contenuti multimediali.
pt_br: postagens de blog e conteúdo multimídia.

source: @code{documentation-manual} corresponds to this manual.
it: @code{documentation-manual} corrisponde a questo manuale.
pt_br: @code{documentation-manual} corresponde a este manual.

source: @code{documentation-cookbook} is the component for the cookbook.
it: @code{documentation-cookbook} è il componente per il cookbook.
pt_br: @code{documentation-cookbook} é o componente do livro de receitas.

source: General Directions
it: Indicazioni Generali
pt_br: Direções gerais

source: Once you get an account, you should be able to select a component from @uref{https://translate.codeberg.org/projects/guix/,the guix project}, and select a language. If your language does not appear in the list, go to the bottom and click on the ``Start new translation'' button. Select the language you want to translate to from the list, to start your new translation.
it: Una volta ottenuto un account, dovresti essere in grado di selezionare un componente da @uref{https://translate.codeberg.org/projects/guix/,il progetto guix} e selezionare una lingua. Se la tua lingua non appare nell'elenco, vai in fondo e clicca sul pulsante ``Start new translation''. Seleziona la lingua in cui vuoi tradurre dall'elenco per iniziare la tua nuova traduzione.
pt_br: Depois de obter uma conta, você deve conseguir selecionar um componente do @uref{https://translate.codeberg.org/projects/guix/, o projeto guix} e selecionar um idioma. Se seu idioma não aparecer na lista, vá até o final e clique no botão "niciar nova tradução''. Selecione o idioma para o qual deseja traduzir na lista para iniciar sua nova tradução.

source: Like lots of other free software packages, Guix uses @uref{https://www.gnu.org/software/gettext,GNU Gettext} for its translations, with which translatable strings are extracted from the source code to so-called PO files.
it: Come molti altri pacchetti software libero, Guix utilizza @uref{https://www.gnu.org/software/gettext,GNU Gettext} per le sue traduzioni, con cui le stringhe traducibili vengono estratte dal codice sorgente in file cosiddetti PO.
pt_br: Como muitos outros pacotes de software livre, o Guix usa @uref{https://www.gnu.org/software/gettext,GNU Gettext} para suas traduções, com as quais sequências traduzíveis são extraídas do código-fonte para os chamados arquivos PO.

source: Even though PO files are text files, changes should not be made with a text editor but with PO editing software. Weblate integrates PO editing functionality. Alternatively, translators can use any of various free-software tools for filling in translations, of which @uref{https://poedit.net/,Poedit} is one example, and (after logging in) @uref{https://docs.weblate.org/en/latest/user/files.html,upload} the changed file. There is also a special @uref{https://www.emacswiki.org/emacs/PoMode,PO editing mode} for users of GNU Emacs. Over time translators find out what software they are happy with and what features they need.
it: Anche se i file PO sono file di testo, le modifiche non dovrebbero essere fatte con un editor di testo ma con software di editing PO. Weblate integra la funzionalità di editing PO. In alternativa, i traduttori possono utilizzare uno dei vari strumenti software libero per compilare le traduzioni, tra cui @uref{https://poedit.net/,Poedit} è un esempio, e (dopo aver effettuato l'accesso) @uref{https://docs.weblate.org/en/latest/user/files.html,caricare} il file modificato. C'è anche un @uref{https://www.emacswiki.org/emacs/PoMode,modalità di editing PO} speciale per gli utenti di GNU Emacs. Nel tempo i traduttori scoprono con quale software sono soddisfatti e di quali funzionalità hanno bisogno.
pt_br: Embora os arquivos PO sejam arquivos de texto, as alterações não devem ser feitas com um editor de texto, mas com um software de edição PO. O Weblate integra a funcionalidade de edição PO. Como alternativa, os tradutores podem usar qualquer uma das várias ferramentas de software livre para preencher traduções, das quais @uref{https://poedit.net/,Poedit} é um exemplo, e (após efetuar login) @uref{https://docs.weblate.org/en/latest/user/files.html,upload} o arquivo alterado. Há também um @uref{https://www.emacswiki.org/emacs/PoMode,modo de edição PO} especial para usuários do GNU Emacs. Com o tempo, os tradutores descobrem com qual software estão satisfeitos e quais recursos precisam.

source: On Weblate, you will find various links to the editor, that will show various subsets (or all) of the strings. Have a look around and at the @uref{https://docs.weblate.org/en/latest/,documentation} to familiarize yourself with the platform.
it: Su Weblate, troverai vari collegamenti all'editor, che mostreranno vari sottoinsiemi (o tutte) le stringhe. Dai un'occhiata in giro e alla @uref{https://docs.weblate.org/en/latest/,documentazione} per familiarizzare con la piattaforma.
pt_br: No Weblate, você encontrará vários links para o editor, que mostrarão vários subconjuntos (ou todos) das strings. Dê uma olhada ao redor e na @uref{https://docs.weblate.org/en/latest/,documentation} para se familiarizar com a plataforma.

source: Translation Components
it: Componenti della Traduzione
pt_br: Componentes de tradução

source: In this section, we provide more detailed guidance on the translation process, as well as details on what you should or should not do. When in doubt, please contact us, we will be happy to help!
it: In questa sezione, forniamo indicazioni più dettagliate sul processo di traduzione, nonché dettagli su cosa dovresti o non dovresti fare. In caso di dubbio, contattaci, saremo felici di aiutare!
pt_br: Nesta seção, fornecemos orientações mais detalhadas sobre o processo de tradução, bem como detalhes sobre o que você deve ou não fazer. Em caso de dúvida, entre em contato conosco, ficaremos felizes em ajudar!

source: Guix is written in the Guile programming language, and some strings contain special formatting that is interpreted by Guile. These special formatting should be highlighted by Weblate. They start with @code{~} followed by one or more characters.
it: Guix è scritto nel linguaggio di programmazione Guile e alcune stringhe contengono formattazioni speciali interpretate da Guile. Queste formattazioni speciali dovrebbero essere evidenziate da Weblate. Iniziano con @code{~} seguito da uno o più caratteri.
pt_br: Guix é escrito na linguagem de programação Guile, e algumas strings contêm formatação especial que é interpretada pelo Guile. Essas formatações especiais devem ser destacadas pelo Weblate. Elas começam com @code{~} seguido por um ou mais caracteres.
