Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: And that's it, you have a channel! From there on, you can add this channel to your channel configuration in @file{~/.config/guix/channels.scm} (@pxref{Specifying Additional Channels,,, guix, GNU Guix Reference Manual}); assuming you keep your channel local for now, the @file{channels.scm} would look something like this:
es: ¡Eso es, tiene un canal! Desde ese activo, puede añadir este canal a su configuración de canal en @file{~/.config/guix/channels.scm} (@pxref{Especificación de canales adicionales,,, guix.es, Manual de referencia de GNU Guix}); asumiendo conserva su canal local para ahora, el @file{channels.scm} parecería algo como esto:
it: E questo è tutto, hai un canale! Da qui in poi, puoi aggiungere questo canale alla configurazione dei tuoi canali in @file{~/.config/guix/channels.scm} (@pxref{Specificare canali aggiuntivi,,, guix.it, Manuale di riferimento di GNU Guix}); supponendo che per ora tu mantenga il tuo canale locale, il file @file{channels.scm} assomiglierebbe a qualcosa del genere:
pt_br: E pronto, você tem um canal! A partir daí, você pode adicionar este canal à configuração do seu canal em @file{~/.config/guix/channels.scm} (@pxref{Especificando canais adicionais,,, guix.pt_BR, Manual de Referência do GNU Guix}); supondo que você mantenha seu canal local por enquanto, o @file{channels.scm} ficaria mais ou menos assim:
sk: A to je všetko, práve ste vytvorili kanál! Teraz už môžete tento kanál pridať do vášho nastavenia kanálov v @file{~/.config/guix/channels.scm} (@pxref{Specifying Additional Channels,,, guix, GNU Guix Reference Manual}). Predpokladajúc, že si váš kanál nateraz ponecháte vo vašom počítači, bude súbor @file{channels.scm} vyzerať asi takto:

source: Next time you run @command{guix pull}, your channel will be picked up and the packages it defines will be readily available to all the @command{guix} commands, even if you do not pass @option{-L}. The @command{guix describe} command will show that Guix is, indeed, using both the @code{my-channel} and the @code{guix} channels.
es: La próxima vez que ejecute @command{guix pull}, su canal será recogido y los paquetes que defina estarán disponibles para todos los comandos @command{guix}, incluso si no pasa @option{-L}. El comando @command{guix describe} mostrará que Guix está, de hecho, usando tanto el canal @code{mi-canal} como el canal @code{guix}.
it: La prossima volta che eseguirai @command{guix pull}, il tuo canale verrà rilevato e i pacchetti che definisce saranno prontamente disponibili per tutti i comandi @command{guix}, anche se non passerai @option{-L}. Il comando @command{guix describe} mostrerà che Guix sta, effettivamente, usando sia i canali @code{my-channel} che @code{guix}.
pt_br: Da próxima vez que você executar @command{guix pull}, seu canal será selecionado e os pacotes que ele definir estarão prontamente disponíveis para todos os comandos @command{guix}, mesmo se você não passar @option{-L}. O comando @command{guix description} mostrará que o Guix está, de fato, usando os canais @code{my-channel} e @code{guix}.
sk: Nabudúce, keď spustíte @command{guix pull}, sa váš kanál vyzdvihne a balíky, ktoré obsahuje sa sprístupnia pre všetky @command{guix} príkazy, a to aj bez použitia voľby @option{-L}. Príkaz @command{guix describe} potvrdí, že Guix vskutku používa aj kanál @code{my-channel}, aj kanál @code{guix}.

source: @xref{Creating a Channel,,, guix, GNU Guix Reference Manual}, for details.
es: @xref{Creación de un canal,,, guix.es, Manual de referencia de GNU Guix}, para más detalles.
it: @xref{Creare un canale,,, guix.it, Manuale di riferimento di GNU Guix}, per i dettagli.
pt_br: @xref{Criando um canal,,, guix.pt_BR, Manual de Referência do GNU Guix}, para detalhes.
sk: Viď @ref{Creating a Channel,,, guix, GNU Guix Reference Manual}, pre viac podrobností.

source: Working directly on the Guix project is recommended: it reduces the friction when the time comes to submit your changes upstream to let the community benefit from your hard work!
es: Se recomienda trabajar directamente en el proyecto Guix: reduce la fricción cuando llega el momento de enviar los cambios a la comunidad para que ésta se beneficie de tu duro trabajo.
it: Lavorare direttamente sul progetto Guix è consigliato: riduce l'attrito quando arriva il momento di inviare le tue modifiche upstream per far sì che la comunità benefici del tuo duro lavoro!
pt_br: É recomendado trabalhar diretamente no projeto Guix: isso reduz o atrito quando chega a hora de enviar suas alterações ao upstream para permitir que a comunidade se beneficie de seu trabalho árduo!
sk: Odporúčame vám pracovať priamo v rámci projektu Guix: znižuje to čas potrebný na odoslanie a zapracovanie vašich zmien do oficiálnej verzie Guixu, aby aj ostatní mali úžitok z vašej ťažkej práce!

source: Unlike most software distributions, the Guix repository holds in one place both the tooling (including the package manager) and the package definitions. This choice was made so that it would give developers the flexibility to modify the API without breakage by updating all packages at the same time. This reduces development inertia.
es: A diferencia de la mayoría de las distribuciones de software, el repositorio Guix contiene en un solo lugar tanto las herramientas (incluido el gestor de paquetes) como las definiciones de los paquetes. Esta elección se hizo para dar a los desarrolladores la flexibilidad de modificar la API sin rupturas, actualizando todos los paquetes al mismo tiempo. Esto reduce la inercia del desarrollo.
it: A differenza della maggior parte delle distribuzioni software, il repository di Guix contiene in un unico posto sia gli strumenti (incluso il gestore di pacchetti) che le definizioni dei pacchetti. Questa scelta è stata fatta per dare agli sviluppatori la flessibilità di modificare l'API senza rotture, aggiornando tutti i pacchetti contemporaneamente. Ciò riduce l'inerzia dello sviluppo.
pt_br: Ao contrário da maioria das distribuições de software, o repositório Guix mantém em um só lugar as ferramentas (incluindo o gerenciador de pacotes) e as definições dos pacotes. Essa escolha foi feita para dar aos desenvolvedores a flexibilidade de modificar a API sem quebras, atualizando todos os pacotes ao mesmo tempo. Isto reduz a inércia do desenvolvimento.
sk: Na rozdiel od väčšiny softvérových distribúcií, repozitár Guixu obsahuje aj nástroje (vrátane správcu balíkov) aj zadania balíkov. Vývojárom je takto možné zaistiť pružnosť potrebnú pre upravovanie API bez toho, aby niečo pokazili. Všetky zadania balíkov sa po každej úprave samy aktualizujú, čím sa predíde zdržaniam vo vývoji.

source: Check out the official @uref{https://git-scm.com/, Git} repository:
es: Revise el repositorio @uref{https://git-scm.com/, Git} oficial:
it: Dai un'occhiata al repository @uref{https://git-scm.com/, Git} ufficiale:
pt_br: Confira o repositório oficial @uref{https://git-scm.com/, Git}:
sk: Vytvorte si kópiu oficiálneho @uref{https://git-scm.com/, Git} repozitára:

source: In the rest of this article, we use @samp{$GUIX_CHECKOUT} to refer to the location of the checkout.
es: En el resto de este artículo, utilice @samp{$GUIX_CHECKOUT} para referir al lugar del código.
it: Nel resto di questo articolo, useremo @samp{$GUIX_CHECKOUT} per fare riferimento alla posizione del checkout.
pt_br: No restante deste artigo, usamos @samp{$GUIX_CHECKOUT} para nos referir ao local do checkout.
sk: Vo zvyšku tohto príspevku použijeme pri odkazovaní na túto kópiu premennú @samp{$GUIX_CHECKOUT}.

source: Follow the instructions in the manual (@pxref{Contributing,,, guix, GNU Guix Reference Manual}) to set up the repository environment.
es: Siga las instrucciones en el manual (@pxref{Contribución,,, guix.es, Manual de referencia de GNU Guix}) para configurar el entorno del repositorio.
it: Segui le istruzioni nel manuale (@pxref{Contribuire,,, guix.it, Manuale di riferimento di GNU Guix}) per configurare l'ambiente del repository.
pt_br: Siga as instruções no manual (@pxref{Contribuindo,,, guix.pt_BR, Manual de Referência do GNU Guix}) para configurar o ambiente do repositório.
sk: Pre nastavenie prostredia repozitára postupujte podľa pokynov v príručke (@pxref{Contributing,,, guix, GNU Guix Reference Manual}).

source: Once ready, you should be able to use the package definitions from the repository environment.
es: Una vez que esté dispuesto, sería capaz de utilizar las definiciones del paquete desde el entorno del repositorio.
it: Una volta pronto, dovresti essere in grado di utilizzare le definizioni dei pacchetti dall'ambiente del repository.
pt_br: Quando estiver pronto, você poderá usar as definições de pacote do ambiente do repositório.
sk: Keď budete pripravení, mali by ste byť schopní použiť zadania balíkov z prostredia repozitára.

source: Feel free to edit package definitions found in @samp{$GUIX_CHECKOUT/gnu/packages}.
es: Siéntase libre de editar definiciones de paquete encontrada en @samp{$GUIX_CHECKOUT/gnu/packages}.
it: Sentiti libero di modificare le definizioni dei pacchetti che si trovano in @samp{$GUIX_CHECKOUT/gnu/packages}.
pt_br: Sinta-se à vontade para editar as definições de pacotes encontradas em @samp{$GUIX_CHECKOUT/gnu/packages}.
sk: Nebojte sa upravovať zadania balíkov v @samp{$GUIX_CHECKOUT/gnu/packages}.

source: The @samp{$GUIX_CHECKOUT/pre-inst-env} script lets you use @samp{guix} over the package collection of the repository (@pxref{Running Guix Before It Is Installed,,, guix, GNU Guix Reference Manual}).
es: El guion @samp{$GUIX_CHECKOUT/pre-inst-env} le permite utilizar @samp{guix} sobre la colección del paquete del repositorio (@pxref{Ejecutar Guix antes de instalarlo,,, guix.es, Manual de referencia de GNU Guix}).
it: Lo script @samp{$GUIX_CHECKOUT/pre-inst-env} ti consente di usare @samp{guix} sulla collezione di pacchetti del repository (@pxref{Eseguire Guix prima di installarlo,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: O script @samp{$GUIX_CHECKOUT/pre-inst-env} permite usar @samp{guix} sobre a coleção de pacotes do repositório (@pxref{Executando guix antes dele ser instalado,,, guix.pt_BR, Manual de Referência do GNU Guix}) .
sk: Skript @samp{$GUIX_CHECKOUT/pre-inst-env} vám umožňuje použiť @samp{guix} so zbierkou balíkov v repozitári (@pxref{Running Guix Before It Is Installed,,, guix, GNU Guix Reference Manual}).

source: Search packages, such as Ruby:
es: Busque paquetes, tales como Ruby:
it: Cerca pacchetti, come Ruby:
pt_br: Pesquisa de pacotes, como Ruby:
sk: Vyhľadávajte balíky, napríklad Ruby:

source: Build a package, here Ruby version 2.1:
es: Construye un paquete, aquí Ruby versión 2.1:
it: Compila un pacchetto, qui Ruby versione 2.1:
pt_br: Construa um pacote, como Ruby versão 2.1:
sk: Zostavte balík, v tomto prípade Ruby vo verzii 2.1:

source: Install it to your user profile:
es: Instalarlo a su perfil de usuario:
it: Installalo nel tuo profilo utente:
pt_br: Instale-o em seu perfil de usuário:
sk: Nainštaluje ho do vášho používateľského profilu:

source: Check for common mistakes:
es: Comprobar equivocaciones usuales:
it: Controlla errori comuni:
pt_br: Verifique se há erros comuns:
sk: Overte si, či ste neurobili niektorú z častých chýb:

source: Guix strives at maintaining a high packaging standard; when contributing to the Guix project, remember to
es: Guix se esfuerza en mantenimiento de un empaquetado estándar alto; cuando contribuya al proyecto Guix, recuerde que
it: Guix si impegna a mantenere uno standard di pacchettizzazione elevato; quando contribuisci al progetto Guix, ricorda di
pt_br: Guix se esforça para manter um alto padrão de empacotamento; ao contribuir para o projeto Guix, lembre-se de
sk: Guix sa usiluje udržať vysokú úroveň zadávania balíkov; pri prispievaní do projektu Guix si zapamätajte, že je potrebné

source: follow the coding style (@pxref{Coding Style,,, guix, GNU Guix Reference Manual}),
es: siga el estilo de codificación (@pxref{Estilo de codificación,,, guix.es, Manual de referencia de GNU Guix}),
it: seguire lo stile di codifica (@pxref{Stile del codice,,, guix.it, Manuale di riferimento di GNU Guix}),
pt_br: seguir o estilo de codificação (@pxref{Estilo de código,,, guix.pt_BR, Manual de Referência do GNU Guix}),
sk: dodržiavať spôsob kódovania (@pxref{Coding Style,,, guix, GNU Guix Reference Manual}),

source: and review the check list from the manual (@pxref{Submitting Patches,,, guix, GNU Guix Reference Manual}).
es: y revise el listado de comprobación desde el manual (@pxref{Envío de parches,,, guix.es, Manual de referencia de GNU Guix}).
it: e rivedere la lista di controllo dal manuale (@pxref{Invia delle patches,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: e revise a lista de verificação do manual (@pxref{Enviando patches,,, guix.pt_BR, Manual de Referência do GNU Guix}).
sk: a prejsť si kontrolný zoznam z príručky (@pxref{Submitting Patches,,, guix, GNU Guix Reference Manual}).

source: Once you are happy with the result, you are welcome to send your contribution to make it part of Guix. This process is also detailed in the manual. (@pxref{Contributing,,, guix, GNU Guix Reference Manual})
es: Una vez que sea feliz con el resultado, es bienvenido para enviar su contribución para hacerla parte de Guix. Este proceso además está detallado en el manual. (@pxref{Contribución,,, guix.es, Manual de referencia de GNU Guix})
it: Una volta che sei soddisfatto del risultato, sei il benvenuto a inviare il tuo contributo per renderlo parte di Guix. Questo processo è anche dettagliato nel manuale. (@pxref{Contribuire,,, guix.it, Manuale di riferimento di GNU Guix})
pt_br: Quando estiver satisfeito com o resultado, você pode enviar sua contribuição para torná-lo parte do Guix. Este processo também é detalhado no manual. (@pxref{Contribuindo,,, guix.pt_BR, Manual de Referência GNU Guix})
sk: Keď ste spokojní s výsledkom, privítame, ak nám zašlete váš príspevok, aby sa mohol stať súčasťou Guixu. Tento postup je tiež opísaný v príručke. (@pxref{Contributing,,, guix, GNU Guix Reference Manual})

source: It's a community effort so the more join in, the better Guix becomes!
es: ¡Es un esfuerzo de la comunidad tal que más se unan, lo mejor de vuelve Guix!
it: È uno sforzo della comunità, quindi più persone si uniscono, migliore diventa Guix!
pt_br: É um esforço da comunidade, então quanto mais participar, melhor o Guix se torna!
sk: Guix závisí od spoločného úsilia, preto čím viac ľudí prispeje, tým bude Guix lepší!

source: The above ``Hello World'' example is as simple as it goes. Packages can be more complex than that and Guix can handle more advanced scenarios. Let's look at another, more sophisticated package (slightly modified from the source):
es: El ejemplo ``Hola Mundo'' de arriba es tan simple como va. Los paquetes pueden ser más complejos que eso y Guix puede manipular más escenarios avanzados. Miremos en otro paquete, más sofisticado (ligeramente modificado desde la fuente):
it: L'esempio "Ciao Mondo" sopra è il più semplice possibile. I pacchetti possono essere più complessi di così e Guix può gestire scenari più avanzati. Diamo un'occhiata a un altro pacchetto più sofisticato (leggermente modificato dalla fonte):
pt_br: O exemplo ``Hello World'' acima é tão simples quanto parece. Os pacotes podem ser mais complexos do que isso e o Guix pode lidar com cenários mais avançados. Vejamos outro pacote mais sofisticado (ligeiramente modificado em relação à fonte):
sk: Vyššie uvedený príklad zadania balíka „Ahoj svet“ je taký jednoduchý ako sa len dá. Avšak, zadania balíkov môžu byť zložitejšie a Guix si poradí aj s omnoho náročnejšími balíkmi. Pozrime sa teda na iné, zložitejšie zadanie balíka (mierne upravené v porovnaní s pôvodným zadaním):
