Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: (file-system ;; Make sure "source-directory" matches your earlier definition. (device (%source-directory)) (mount-point "/tmp") ;; We are mounting a folder, not a partition, so this type needs to be "none" (type "none") (flags '(bind-mount)) ;; Ensure "source-drive" matches what you've named the variable for the drive. (dependencies (list source-drive)) )
es: (file-system ;; Asegúrese de que "directorio-fuente" coincide con su definición anterior. (device (%source-directory)) (mount-point "/tmp") ;; Estamos montando una carpeta, no una partición, por lo que este tipo debe ser "none" (type "none") (flags '(bind-mount)) ;; Asegúrese de que "source-drive" coincide con el nombre que ha dado a la variable de la unidad.. (dependencies (list source-drive)) )
it: (file-system ;; Assicurati che "source-directory" corrisponda alla tua definizione precedente. (device (%source-directory)) (mount-point "/tmp") ;; Stiamo montando una cartella, non una partizione, quindi questo tipo deve essere "none" (type "none") (flags '(bind-mount)) ;; Assicurati che "source-drive" corrisponda al nome che hai dato alla variabile per l'unità. (dependencies (list source-drive)) )
pt_br: (file-system ;; Certifique-se de que "source-directory" corresponde ;; à sua definição anterior. (device (%source-directory)) (mount-point "/tmp") ;; Estamos montando uma pasta, não uma partição, então ;; esse tipo precisa ser "none" (type "none") (flags '(bind-mount)) ;; Certifique-se de que "source-drive" corresponde ao ;; nome que você deu à variável para a unidade (dependencies (list source-drive)) )
sk: (file-system ;; „zdrojovy-priecinok“ sa musí zhodovať s predošlým zadaním. (device (%zdrojovy-priecinok)) (mount-point "/tmp") ;; Pripájame priečinok, nie zväzok, takže tento druh ;; musí byť „none“ (žiadny) (type "none") (flags '(bind-mount)) ;; „zdrojove-zariadenie“ sa musí zhodovať s predošlým zadaním. (dependencies (list zdrojove-zariadenie)) )

source: ...<other drives omitted for clarity>...
es: ...<otras unidades omitidas para mayor claridad>...
it: ...<altre unità omesse per chiarezza>...
pt_br: ...<outras unidades omitidas para maior clareza>...
sk: ...<ostatné pripojenia sme vynechali>...

source: Guix daemon can use a HTTP proxy to get substitutes, here we are configuring it to get them via Tor.
es: El daemon Guix puede usar un proxy HTTP para obtener sustituciones, aquí lo estamos configurando para obtenerlos vía Tor.
it: Il demone Guix può usare un proxy HTTP per ottenere i sostituti, qui lo stiamo configurando per ottenerli tramite Tor.
pt_br: O daemon Guix pode usar um proxy HTTP para obter substitutos, aqui estamos configurando-o para obtê-los via Tor.
sk: Démon Guixu môže na získavanie náhrad využívať HTTP proxy server. V tomto prípade ho nastavíme tak, aby ich získaval cez Tor.
sv: Guix-demon kan använda en HTTP-proxy för att få ersättningar, här konfigurerar vi den för få dem via Tor.

source: Warning
es: Aviso
it: Avviso
pt_br: Aviso
ru: Предупреждение
sk: Upozornenie
sv: Varning

source: @emph{Not all} Guix daemon's traffic will go through Tor! Only HTTP/HTTPS will get proxied; FTP, Git protocol, SSH, etc connections will still go through the clearnet. Again, this configuration isn't foolproof some of your traffic won't get routed by Tor at all. Use it at your own risk.
es: @emph{No todos} ¡El tráfico del daemon Guix irá a través de Tor! Sólo conexiones proxy HTTP/HTTPS; FTP, protocolo Git, SSH, etc seguirá pasando por la clearnet. De nuevo, esta configuración no es infalible, parte de su tráfico no será enrutado por Tor en absoluto. Utilícelo bajo su propia responsabilidad.
it: @emph{Non tutto} il traffico del demone Guix passerà attraverso Tor! Solo HTTP/HTTPS sarà proxato; FTP, protocollo Git, SSH, ecc. le connessioni passeranno comunque attraverso il clearnet. Ancora una volta, questa configurazione non è a prova di errore, parte del tuo traffico non sarà affatto instradato da Tor. Usala a tuo rischio e pericolo.
pt_br: @emph{Nem todo} o tráfego do daemon Guix passará pelo Tor! Somente HTTP/HTTPS será encaminhado ao proxy; As conexões FTP, o protocolo Git, SSH, etc. ainda passarão pela rede aberta. Novamente, esta configuração não é infalível, pois parte do seu tráfego não será roteado pelo Tor. Use-o por sua conta e risco.
sk: @emph{Nie všetka} sieťová prevádzka démona Guixu bude prechádzať cez Tor! Presmerované bude len HTTP/HTTPS; protokol Git, SSH, atď. pôjdu aj naďalej cez otvorenú sieť. Znova, toto nastavenie nie je dokonalé a časť vašej prevádzky poputuje aj naďalej mimo siete Tor. Použite ho na vlastné riziko.

source: Also note that the procedure described here applies only to package substitution. When you update your guix distribution with @command{guix pull}, you still need to use @command{torsocks} if you want to route the connection to guix's git repository servers through Tor.
es: Tenga en cuenta también que el procedimiento aquí descrito sólo se aplica a la sustitución de paquetes. Cuando actualice su distribución guix con @command{guix pull}, todavía necesitas usar @command{torsocks} si quieres enrutar la conexión a los servidores de repositorios git de guix a través de Tor.
it: Si noti inoltre che la procedura qui descritta si applica solo alla sostituzione di pacchetti. Quando si aggiorna la distribuzione guix con @command{guix pull}, è comunque necessario utilizzare @command{torsocks} se si desidera instradare la connessione ai server del repository git di guix tramite Tor.
pt_br: Observe também que o procedimento descrito aqui se aplica apenas à substituição de pacotes. Ao atualizar sua distribuição guix com @command{guix pull}, você ainda precisará usar @command{torsocks} se quiser rotear a conexão para os servidores de repositório git do guix através do Tor.
sk: Vedzte tiež, že opísaný postup sa vzťahuje len na náhrady balíkov. Ak chcete pri aktualizovaní vašej distribúcie pomocou @command{guix pull} presmerovať pripojenie ku git repozitáru Guixu cez Tor , budete musieť použiť @command{torsocks}.

source: Guix's substitute server is available as a Onion service, if you want to use it to get your substitutes through Tor configure your system as follow:
es: El servidor de sustitutos de Guix está disponible como un servicio Onion, si quiere usarlo para obtener sus sustitutos a través de Tor configure su sistema como sigue:
it: Il server di sostituzione di Guix è disponibile come servizio Onion, se vuoi usarlo per ottenere i tuoi sostituti tramite Tor, configura il tuo sistema come segue:
pt_br: O servidor substituto do Guix está disponível como um serviço Onion, se você quiser usá-lo para obter seus substitutos através do Tor, configure seu sistema da seguinte forma:
sk: Server náhrad Guixu je dostupný ako Onion služba. Ak chcete náhrady získavať cez Tor, nastavte váš systém nasledovne:
sv: Guix ersättningsserver är tillgänglig som en Onion-tjänst, om du vill använda den för att få dina ersättningar genom Tor konfigurerar du ditt system enligt följande:

source: (operating-system … (services (cons (service tor-service-type (tor-configuration (config-file (plain-file "tor-config" "HTTPTunnelPort 127.0.0.1:9250")))) (modify-services %base-services (guix-service-type config => (guix-configuration (inherit config) ;; ci.guix.gnu.org's Onion service (substitute-urls "\ @value{SUBSTITUTE-TOR-URL}") (http-proxy "http://localhost:9250")))))))
it: (operating-system … (services (cons (service tor-service-type (tor-configuration (config-file (plain-file "tor-config" "HTTPTunnelPort 127.0.0.1:9250")))) (modify-services %base-services (guix-service-type config => (guix-configuration (inherit config) ;; servizio Onion di ci.guix.gnu.org (substitute-urls "\ @value{SUBSTITUTE-TOR-URL}") (http-proxy "http://localhost:9250")))))))
pt_br: (operating-system … (services (cons (service tor-service-type (tor-configuration (config-file (plain-file "tor-config" "HTTPTunnelPort 127.0.0.1:9250")))) (modify-services %base-services (guix-service-type config => (guix-configuration (inherit config) ;; ci.guix.gnu.org's Serviço onion (substitute-urls "@value{SUBSTITUTE-TOR-URL}") (http-proxy "http://localhost:9250")))))))
sk: (operating-system … (services (cons (service tor-service-type (tor-configuration (config-file (plain-file "tor-config" "HTTPTunnelPort 127.0.0.1:9250")))) (modify-services %base-services (guix-service-type config => (guix-configuration (inherit config) ;; Onion služba na ci.guix.gnu.org (substitute-urls "\ @value{SUBSTITUTE-TOR-URL}") (http-proxy "http://localhost:9250")))))))

source: This will keep a tor process running that provides a HTTP CONNECT tunnel which will be used by @command{guix-daemon}. The daemon can use other protocols than HTTP(S) to get remote resources, request using those protocols won't go through Tor since we are only setting a HTTP tunnel here. Note that @code{substitutes-urls} is using HTTPS and not HTTP or it won't work, that's a limitation of Tor's tunnel; you may want to use @command{privoxy} instead to avoid such limitations.
es: Esto mantendrá un proceso Tor en ejecución que proporciona un túnel HTTP CONNECT que será utilizado por @command{guix-daemon}. El daemon puede usar otros protocolos que HTTP(S) para obtener recursos remotos, las peticiones que usen esos protocolos no pasarán por Tor ya que aquí sólo estamos configurando un túnel HTTP. Tenga en cuenta que @code{substitutes-urls} está usando HTTPS y no HTTP o no funcionará, es una limitación del túnel de Tor; puede que quiera usar @command{privoxy} en su lugar para evitar tales limitaciones.
it: Questo manterrà un processo tor in esecuzione che fornisce un tunnel HTTP CONNECT che sarà usato da @command{guix-daemon}. Il demone può usare altri protocolli oltre a HTTP(S) per ottenere risorse remote, le richieste che usano tali protocolli non passeranno attraverso Tor poiché stiamo impostando solo un tunnel HTTP qui. Si noti che @code{substitutes-urls} sta usando HTTPS e non HTTP o non funzionerà, questa è una limitazione del tunnel di Tor; potresti voler usare @command{privoxy} invece per evitare tali limitazioni.
pt_br: Isso manterá um processo tor em execução que fornece um túnel HTTP CONNECT que será usado por @command{guix-daemon}. O daemon pode usar outros protocolos além do HTTP(S) para obter recursos remotos. A solicitação usando esses protocolos não passará pelo Tor, pois estamos apenas configurando um túnel HTTP aqui. Observe que @code{substitutes-urls} está usando HTTPS e não HTTP ou não funcionará, isso é uma limitação do túnel do Tor; você pode querer usar @command{privoxy} para evitar tais limitações.
sk: Toto udrží spustený proces tor poskytujúci tunel HTTP CONNECT, ktorý použije @command{guix-daemon}. Démon môže využívať aj iné protokoly ako HTTP(S) pre získavanie vzdialených zdrojov. Avšak požiadavky spoliehajúce sa na iné protokoly nebudú prechádzať cez Tor, keďže tu nastavujeme len HTTP tunel. Vedzte, že @code{substitutes-urls} využíva HTTPS. Kvôli obmedzeniu spojenému s Tor tunelom by to cez HTTP nefungovalo. Takýmto obmedzeniam sa môžete vyhnúť použitím @command{privoxy}.

source: If you don't want to always get substitutes through Tor but using it just some of the times, then skip the @code{guix-configuration}. When you want to get a substitute from the Tor tunnel run:
es: Si no quiere obtener sustitutos siempre a través de Tor sino usarlo sólo algunas veces, entonces omita el @code{guix-configuration}. Cuando desee obtener un sustituto del túnel Tor ejecute:
it: Se non vuoi ottenere sempre sostituti tramite Tor ma usarlo solo a volte, allora salta la @code{guix-configuration}. Quando vuoi ottenere un sostituto dal tunnel Tor esegui:
pt_br: Se você não deseja sempre obter substitutos através do Tor, mas usá-lo apenas algumas vezes, pule o @code{guix-configuration}. Quando você deseja obter um substituto da execução do túnel Tor:
sk: Ak nechcete pre získavanie náhrad prechádzať cez Tor neustále ale iba niekedy, preskočte @code{guix-configuration}. Keď budete chcieť získať náhradu cez tunel Tor, spustite:

source: NGINX could be extended with Lua scripts.
es: NGINX podría ampliarse con scripts Lua.
it: NGINX potrebbe essere esteso con script Lua.
pt_br: O NGINX pode ser estendido com scripts Lua.
sk: NGINX možno rozšíriť pomocou Lua skriptov.

source: Guix provides NGINX service with ability to load Lua module and specific Lua packages, and reply to requests by evaluating Lua scripts.
es: Guix proporciona al servicio NGINX la capacidad de cargar el módulo Lua y paquetes Lua específicos, y responder a las peticiones evaluando scripts Lua.
it: Guix fornisce il servizio NGINX con la capacità di caricare il modulo Lua e specifici pacchetti Lua, e di rispondere alle richieste valutando gli script Lua.
pt_br: Guix fornece serviço NGINX com capacidade de carregar módulos Lua e pacotes Lua específicos, e responder a solicitações avaliando scripts Lua.
sk: Guix poskytuje NGINX službu so schopnosťou načítať Lua moduly a určité Lua balíky ako aj odpovedať na požiadavky vyhodnocovaním Lua skriptov.

source: The following example demonstrates system definition with configuration to evaluate @file{index.lua} Lua script on HTTP request to @uref{http://localhost/hello} endpoint:
es: El siguiente ejemplo demuestra la definición del sistema con la configuración para evaluar @file{index.lua} Lua en una petición HTTP al punto final @uref{http://localhost/hello}:
it: Il seguente esempio dimostra la definizione del sistema con la configurazione per valutare lo script Lua @file{index.lua} su richiesta HTTP all'endpoint @uref{http://localhost/hello}:
pt_br: O exemplo a seguir demonstra a definição do sistema com configuração para avaliar o script Lua @file{index.lua} na solicitação HTTP para o endpoint @uref{http://localhost/hello}:
sk: Nasledovný príklad znázorňuje zadanie systému s nastavením, ktoré vyhodnotí Lua skript @file{index.lua} pri HTTP požiadavke na koncový bod @uref{http://localhost/ahoj}:

source: music server, headless
es: servidor de música, sin cabeza
it: server musicale, headless
pt_br: servidor de música, headless
sk: hudobný server, bezobrazovkový

source: bluetooth, ALSA configuration
es: bluetooth, configuración ALSA
it: bluetooth, configurazione ALSA
pt_br: Bluetooth, configuração ALSA
sk: bluetooth, nastavenie ALSA

source: MPD, the Music Player Daemon, is a flexible server-side application for playing music. Client programs on different machines on the network --- a mobile phone, a laptop, a desktop workstation --- can connect to it to control the playback of audio files from your local music collection. MPD decodes the audio files and plays them back on one or many outputs.
es: MPD, Music Player Daemon, es una aplicación de servidor flexible para reproducir música. Los programas cliente de distintas máquinas de la red -un teléfono móvil, un portátil, una estación de trabajo de sobremesa- pueden conectarse a él para controlar la reproducción de archivos de audio de tu colección de música local. MPD descodifica los archivos de audio y los reproduce en una o varias salidas.
it: MPD, il Music Player Daemon, è un'applicazione flessibile lato server per riprodurre musica. I programmi client su diverse macchine della rete --- un telefono cellulare, un laptop, una workstation desktop --- possono connettersi ad esso per controllare la riproduzione di file audio dalla tua collezione musicale locale. MPD decodifica i file audio e li riproduce su una o più uscite.
pt_br: MPD, o Music Player Daemon, é um aplicativo flexível do lado do servidor para tocar música. Programas clientes em diferentes máquinas na rede --- um telefone celular, um laptop, uma estação de trabalho de mesa --- podem se conectar a ele para controlar a reprodução de arquivos de áudio da sua coleção de música local. O MPD decodifica os arquivos de áudio e os reproduz em uma ou muitas saídas.
sk: MPD, démon hudobného prehrávača, je pružná serverová aplikácia na prehrávanie hudby. Klientske programy na rôznych strojoch na sieti --- mobilný telefón, prenosný počítač, stolný počítač --- sa k nej môžu pripojiť a ovládať prehrávanie zvukových súborov z vašej miestnej hudobnej zbierky. MPD číta zvukové súbory a prehráva ich na jednom alebo viacerých výstupoch.

source: By default MPD will play to the default audio device. In the example below we make things a little more interesting by setting up a headless music server. There will be no graphical user interface, no Pulseaudio daemon, and no local audio output. Instead we will configure MPD with two outputs: a bluetooth speaker and a web server to serve audio streams to any streaming media player.
es: Por defecto MPD reproducirá en el dispositivo de audio por defecto. En el siguiente ejemplo hacemos las cosas un poco más interesantes configurando un servidor de música sin cabeza. No habrá interfaz gráfica de usuario, ni daemon Pulseaudio, ni salida de audio local. En su lugar configuraremos MPD con dos salidas: un altavoz bluetooth y un servidor web para servir flujos de audio a cualquier reproductor multimedia de streaming.
it: Per impostazione predefinita MPD riprodurrà sul dispositivo audio predefinito. Nell'esempio seguente rendiamo le cose un po' più interessanti impostando un server musicale headless. Non ci sarà interfaccia grafica utente, nessun demone Pulseaudio, e nessuna uscita audio locale. Invece configureremo MPD con due uscite: un altoparlante bluetooth e un server web per servire flussi audio a qualsiasi lettore multimediale in streaming.
pt_br: Por padrão, o MPD reproduzirá no dispositivo de áudio padrão. No exemplo abaixo, tornamos as coisas um pouco mais interessantes configurando um servidor de música headless. Não haverá interface gráfica de usuário, nenhum daemon Pulseaudio e nenhuma saída de áudio local. Em vez disso, configuraremos o MPD com duas saídas: um alto-falante bluetooth e um servidor web para servir fluxos de áudio para qualquer reprodutor de mídia de streaming.
sk: Ak nie je nastavené inak, MPD prehráva na predvolenom zvukovom zariadení. V nižšie uvedenom príklade to spravíme trochu zaujímavejšie a nastavíme si bezobrazovkový hudobný server. Nepoužijeme grafické používateľské rozhranie, démona Pulseaudio ani miestny zvukový výstup. Namiesto toho nastavíme MPD s dvomi výstupmi: s bluetooth reproduktorom a webovým serverom poskytujúcim zvukové toky ľubovoľnému prehrávaču hudby.

source: Bluetooth is often rather frustrating to set up. You will have to pair your Bluetooth device and make sure that the device is automatically connected as soon as it powers on. The Bluetooth system service returned by the @code{bluetooth-service} procedure provides the infrastructure needed to set this up.
es: La configuración de Bluetooth suele ser bastante frustrante. Tendrás que emparejar tu dispositivo Bluetooth y asegurarte que se conecta automáticamente en cuanto se enciende. El servicio del sistema Bluetooth devuelto por el procedimiento @code{bluetooth-service} proporciona la infraestructura necesaria para configurar esto.
it: Il Bluetooth è spesso piuttosto frustrante da configurare. Dovrai accoppiare il tuo dispositivo Bluetooth e assicurarti che il dispositivo sia connesso automaticamente non appena si accende. Il servizio di sistema Bluetooth restituito dalla procedura @code{bluetooth-service} fornisce l'infrastruttura necessaria per configurarlo.
pt_br: O Bluetooth costuma ser bastante frustrante de configurar. Você terá que parear seu dispositivo Bluetooth e certificar-se de que o dispositivo seja conectado automaticamente assim que for ligado. O serviço do sistema Bluetooth retornado pelo procedimento @code{bluetooth-service} fornece a infraestrutura necessária para configurar isso.
sk: Nastavenie Bluetooth býva otravné. Budete musieť spárovať vaše Bluetooth zariadenie a zabezpečiť, aby sa po zapnutí samo pripájalo. Systémová Bluetooth služba vrátená funkciou @code{bluetooth-service} poskytuje podklady potrebné pre toto nastavenie.

source: Reconfigure your system with at least the following services and packages:
es: Reconfigura su sistema con al menos los siguientes servicios y paquetes:
it: Riconfigura il tuo sistema con almeno i seguenti servizi e pacchetti:
pt_br: Reconfigure seu sistema com pelo menos os seguintes serviços e pacotes:
sk: Znovunastavte váš systém s aspoň týmito službami a balíkmi:
sv: Omkonfigurera ditt system med åtminstone följande tjänster och paket:

source: Start the @code{bluetooth} service and then use @command{bluetoothctl} to scan for Bluetooth devices. Try to identify your Bluetooth speaker and pick out its device ID from the resulting list of devices that is indubitably dominated by a baffling smorgasbord of your neighbors' home automation gizmos. This only needs to be done once:
es: Inicia el servicio @code{bluetoooth} y después utilice @command{bluetoothctl} para analizar dispositivos Bluetooth. Intente identificar su altavoz Bluetooth y extraer el ID de dispositivo desde el listado del resultado de dispositivos que estén indubitables por variedad desconcertante de automatización del inicio de vecinos. Esto solo necesita ser realizado una vez:
it: Avvia il servizio @code{bluetooth} e poi usa @command{bluetoothctl} per scandire i dispositivi Bluetooth. Prova a identificare il tuo altoparlante Bluetooth e ricava il suo ID dispositivo dalla lista risultante di dispositivi che è indubbiamente dominata da un'incredibile varietà di gadget di automazione domestica dei tuoi vicini. Questo deve essere fatto solo una volta:
pt_br: Inicie o serviço @code{bluetooth} e então use @command{bluetoothctl} para escanear dispositivos Bluetooth. Tente identificar seu alto-falante Bluetooth e escolher seu ID de dispositivo na lista resultante de dispositivos que é indubitavelmente dominada por uma desconcertante miscelânea de engenhocas de automação residencial de seus vizinhos. Isso só precisa ser feito uma vez:
sk: Spustite službu @code{bluetooth} a zistite Bluetooth zariadenia pomocou @command{bluetoothctl}. Pokúste sa stotožniť váš Bluetooth reproduktor a vyberte jeho označenie z výsledného zoznamu zariadení, ktorý je nepochybne plný rôznych hračičiek vašich susedov. Toto je potrebné urobiť iba raz:

source: [bluetooth]# agent on [bluetooth]# Agent registered
es: [bluetooth]# agent on [bluetooth]# Agente registrado
it: [bluetooth]# agent on [bluetooth]# Agente registrato

source: [bluetooth]# default-agent [bluetooth]# Default agent request successful
es: [bluetooth]# default-agent [bluetooth]# Solicitud de agente por defecto solicita correcta
it: [bluetooth]# default-agent [bluetooth]# Richiesta agente predefinito riuscita

source: [bluetooth]# scan on [bluetooth]# Discovery started [CHG] Controller 00:11:22:33:95:7F Discovering: yes [NEW] Device AA:BB:CC:A4:AA:CD My Bluetooth Speaker [NEW] Device 44:44:FF:2A:20:DC My Neighbor's TV @dots{}
it: [bluetooth]# scan on [bluetooth]# Rilevamento avviato [CHG] Controller 00:11:22:33:95:7F Rilevamento: sì [NEW] Dispositivo AA:BB:CC:A4:AA:CD Il mio altoparlante Bluetooth [NEW] Dispositivo 44:44:FF:2A:20:DC TV del mio vicino @dots{}
sk: [bluetooth]# scan on [bluetooth]# Discovery started [CHG] Controller 00:11:22:33:95:7F Discovering: yes [NEW] Device AA:BB:CC:A4:AA:CD Môj Bluetooth reproduktor [NEW] Device 44:44:FF:2A:20:DC TV môjho suseda @dots{}

source: [bluetooth]# pair AA:BB:CC:A4:AA:CD Attempting to pair with AA:BB:CC:A4:AA:CD [CHG] Device AA:BB:CC:A4:AA:CD Connected: yes
it: [bluetooth]# pair AA:BB:CC:A4:AA:CD Tentativo di accoppiamento con AA:BB:CC:A4:AA:CD [CHG] Dispositivo AA:BB:CC:A4:AA:CD Connesso: sì
