Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Setting up network interfaces.
it: Impostazione delle interfacce di rete.
pt_br: Configurando interfaces de rede.

source: Networking Services
it: Servizi di rete
pt_br: Serviços de Rede

source: Unattended Upgrades
it: Aggiornamenti non presidiati
pt_br: Atualizações sem supervisão

source: Automated system upgrades.
it: Aggiornamenti di sistema automatici.
pt_br: Atualizações automatizadas do sistema.

source: Graphical display.
it: Schermo grafico.
pt_br: Exibição gráfica.

source: Printing Services
it: Servizi di stampa
pt_br: Serviços de impressão

source: Local and remote printer support.
it: Supporto per stampanti locali e remote.
pt_br: Suporte a impressora local e remota.

source: Desktop Services
it: Servizi desktop
pt_br: Serviços de desktop

source: D-Bus and desktop services.
it: D-Bus e servizi desktop.
pt_br: Serviços de D-Bus e desktop.

source: Sound Services
it: Servizi suono
pt_br: Serviços de som

source: ALSA and Pulseaudio services.
it: Servizi ALSA e Pulseaudio.
pt_br: Serviços ALSA e Pulseaudio.

source: Tools to search for files.
it: Strumenti per cercare file.
pt_br: Ferramentas para procurar arquivos.

source: Database Services
it: Servizi di database
pt_br: Serviços de bancos de dados

source: SQL databases, key-value stores, etc.
it: Database SQL, archivi chiave-valore, ecc.
pt_br: Banco de dados SQL, armazenamentos de valor chave, etc.

source: Mail Services
it: Servizi di posta
pt_br: Serviços de correio

source: IMAP, POP3, SMTP, and all that.
it: IMAP, POP3, SMTP e tutto il resto.
pt_br: IMAP, POP3, SMTP e tudo isso.

source: Messaging Services
it: Servizi di messaggistica
pt_br: Serviços de mensageria

source: Messaging services.
it: Servizi di messaggistica.
pt_br: Serviços de mensageria.

source: Telephony Services
it: Servizi di telefonia
pt_br: Serviços de telefonia

source: Telephony services.
it: Servizi di telefonia.
pt_br: Serviços de telefonia.

source: File-Sharing Services
it: Servizi di condivisione file
pt_br: Serviços de compartilhamento de arquivos

source: File-sharing services.
it: Servizi di condivisione file.
pt_br: Serviços de compartilhamento de arquivos.

source: Monitoring Services
it: Servizi di monitoraggio
pt_br: Serviços de monitoramento

source: Monitoring services.
it: Servizi di monitoraggio.
pt_br: Serviços de monitoramento.

source: Kerberos Services
it: Servizi Kerberos
pt_br: Serviços Kerberos

source: Kerberos services.
it: Servizi Kerberos.
pt_br: Serviços Kerberos.

source: LDAP Services
it: Servizi LDAP
pt_br: Serviços LDAP

source: LDAP services.
it: Servizi LDAP.
pt_br: Serviços LDAP.

source: Web Services
it: Servizi web
pt_br: Serviços web

source: Web servers.
it: Server web.
pt_br: Servidores Web.

source: Certificate Services
it: Servizi di certificati
pt_br: Serviços de certificado

source: TLS certificates via Let's Encrypt.
it: Certificati TLS tramite Let's Encrypt.
pt_br: Certificados TLS via Let's Encrypt.

source: DNS Services
it: Servizi DNS
pt_br: Serviços DNS

source: DNS daemons.
it: Demoni DNS.
pt_br: Deamons DNS.

source: VPN Services
it: Servizi VPN
pt_br: Serviços VPN

source: VPN daemons.
it: Demoni VPN.
pt_br: Deamons VPN.

source: Network File System
it: Filesystem di rete
pt_br: Sistema de arquivos de rede

source: NFS related services.
it: Servizi correlati a NFS.
pt_br: Serviços relacionados a NFS.

source: Samba services.
it: Servizi Samba.
pt_br: Serviços Samba.

source: Continuous Integration
it: Integrazione continua
pt_br: Integração Contínua

source: Cuirass and Laminar services.
it: Servizi Cuirass e Laminar.
pt_br: Os serviços Cuirass e Laminar.

source: Power Management Services
it: Servizi di gestione energetica
pt_br: Serviços de gerenciamento de energia

source: Audio Services
it: Servizi audio
pt_br: Serviços de áudio

source: The MPD.
it: L'MPD.
pt_br: O MPD.

source: Virtualization Services
it: Servizi di virtualizzazione
pt_br: Serviços de virtualização

source: Virtualization services.
it: Servizi di virtualizzazione.
pt_br: Serviços de virtualização.

source: Version Control Services
it: Servizi di controllo versione
pt_br: Serviços de controlando versão

source: Providing remote access to Git repositories.
it: Fornire accesso remoto ai repository Git.
pt_br: Fornecendo acesso remoto a repositórios Git.

source: Game Services
it: Servizi di gioco
pt_br: Serviços de jogos

source: Game servers.
it: Server di gioco.
pt_br: Servidores de jogos.

source: PAM Mount Service
it: Servizio PAM Mount
pt_br: Serviço de montagem PAM

source: Service to mount volumes when logging in.
it: Servizio per montare volumi al momento del login.
pt_br: Serviço para montar volumes ao efetuar login.

source: Guix Services
it: Servizi Guix
pt_br: Serviços Guix

source: Services relating specifically to Guix.
it: Servizi relativi specificamente a Guix.
pt_br: Serviços relacionados especificamente ao Guix.

source: Linux Services
it: Servizi Linux
pt_br: Serviços Linux

source: Services tied to the Linux kernel.
it: Servizi legati al kernel Linux.
pt_br: Serviços vinculados ao kernel Linux.

source: Hurd Services
it: Servizi Hurd
pt_br: Serviços Hurd

source: Services specific for a Hurd System.
it: Servizi specifici per un sistema Hurd.
pt_br: Serviços específicos para um Sistema Hurd.

source: Miscellaneous Services
it: Servizi vari
pt_br: Serviços diversos

source: Other services.
it: Altri servizi.
pt_br: Outros serviços.

source: Service Composition
it: Composizione dei servizi
pt_br: Composição de serviço

source: The model for composing services.
it: Il modello per la composizione dei servizi.
pt_br: O modelo para serviços de composição.

source: Service Types and Services
it: Tipi di servizio e servizi
pt_br: Tipos de Service e Serviços

source: Types and services.
it: Tipi e servizi.
pt_br: Tipos e serviços.

source: Service Reference
it: Riferimenti per i servizi
pt_br: Referência de Service

source: API reference.
it: Riferimenti API.
pt_br: Referência de API.

source: Shepherd Services
it: Servizi Shepherd
pt_br: Serviços de Shepherd

source: A particular type of service.
it: Un tipo particolare di servizio.
pt_br: Um tipo em particular de serviço.

source: Chrooting into an existing system
it: Fare chroot in un sistema esistente
pt_br: Acessando um sistema existente via chroot

source: Declaring the Home Environment
it: Dichiarare l'ambiente home
pt_br: Declarando o ambiente pessoal

source: Customizing your Home.
it: Personalizzare la tua home.
pt_br: Personalizando seu ambiente pessoal.

source: Configuring the Shell
it: Configurare la shell
pt_br: Configurando o "Shell"

source: Enabling home environment.
it: Abilitare l'ambiente home.
pt_br: Habilitando o ambiente pessoal.

source: Home Services
pt_br: Serviços pessoais

source: Specifying home services.
it: Specificare i servizi home.
pt_br: Especificando serviços pessoais.

source: Invoking guix home
it: Invocare guix home
pt_br: Invocando guix home

source: Instantiating a home configuration.
it: Instanziare una configurazione home.
pt_br: Inicializando uma configuração pessoal.

source: Essential Home Services
pt_br: Serviços essenciais pessoais

source: Environment variables, packages, on-* scripts.
it: Variabili d'ambiente, pacchetti, script on-*.
pt_br: Variáveis de ambiente, pacotes, scripts on-*.

source: Scheduled User's Job Execution.
it: Esecuzione pianificata di lavori dell'utente.
pt_br: Execução de trabalho do Usuário agendado.

source: Setting up the secure shell client.
it: Impostazione del client secure shell.
pt_br: Configurando o cliente de shell seguro.

source: Setting up GPG and related tools.
it: Impostazione di GPG e strumenti correlati.
pt_br: Configurando GPG e ferramentas relacionadas.

source: Services for graphical environments.
it: Servizi per ambienti grafici.
pt_br: Serviços para ambientes gráficos.

source: Dealing with audio.
it: Gestione dell'audio.
pt_br: Lidando com áudio.

source: Sway: Sway window manager
it: Sway: Window manager Sway
pt_br: Sway: Gerenciador de janelas Sway

source: platform Reference
it: Riferimenti per 'platform'
pt_br: Referência do platform

source: Creating System Images
it: Creare immagini di sistema
pt_br: Criando imagens do sistema

source: Instantiate an Image
it: Instanziare un'immagine
pt_br: Instanciar uma imagem

source: How to instantiate an image record.
it: Come instanziare un record di immagine.
pt_br: Como instanciar um registro de imagem.

source: Image Modules
pt_br: Módulos de imagem

source: Definition of image modules.
it: Definizione dei moduli di immagine.
pt_br: Definição de módulos de imagem.

source: partition Reference
it: Riferimenti per 'partition'
pt_br: Referência do partition

source: Separate Debug Info
it: Informazioni di debug separate
pt_br: Informações de depuração separadas

source: Installing 'debug' outputs.
it: Installare output di 'debug'.
pt_br: Instalando saídas de 'depuração'.

source: Rebuilding Debug Info
it: Ricompilare le informazioni di debug
pt_br: Reconstruindo informações de depuração

source: Building missing debug info.
it: Compilare le informazioni di debug mancanti.
pt_br: Informações de depuração ausentes no edifício.

source: Full-Source Bootstrap
it: Bootstrap completo da sorgente
pt_br: Bootstrap de código fonte completo

source: A Bootstrap worthy of GNU.
it: Un bootstrap degno di GNU.
pt_br: Um Bootstrap digno do GNU.

source: Preparing to Use the Bootstrap Binaries
it: Preparazione all'uso dei binari di bootstrap
pt_br: Preparando para usar os binários do Bootstrap

source: Building that what matters most.
it: Compilare ciò che conta di più.
pt_br: Construindo o que mais importa.

source: purpose
it: scopo
pt_br: propósito

source: GNU Guix@footnote{``Guix'' is pronounced like ``geeks'', or ``ɡiːks'' using the international phonetic alphabet (IPA).} is a package management tool for and distribution of the GNU system. Guix makes it easy for unprivileged users to install, upgrade, or remove software packages, to roll back to a previous package set, to build packages from source, and generally assists with the creation and maintenance of software environments.
it: GNU Guix@footnote{``Guix'' si pronuncia come «ghiks», o «ɡiːks» usando l'alfabeto fonetico internazionale (IPA).} è uno strumento di gestione dei pacchetti e una distribuzione del sistema GNU. Guix rende facile per gli utenti non privilegiati installare, aggiornare o rimuovere pacchetti software, tornare a un insieme di pacchetti precedente, compilare pacchetti dai sorgenti, e in generale assiste con la creazione e la manutenzione di ambienti software.
pt_br: GNU Guix@footnote{``Guix'' é pronunciado como ``geeks'', ou ``ɡiːks'' usando o alfabeto fonético internacional (IPA).} é uma ferramenta de gerenciamento de pacotes e distribuição do sistema GNU. O Guix facilita a instalação, a atualização ou a remoção de pacotes de software, a reversão para um conjunto de pacotes anterior, a compilação de pacotes a partir do código-fonte e geralmente ajuda na criação e manutenção de ambientes de software.

source: Guix System
pt_br: Sistema Guix

source: GuixSD, now Guix System
it: GuixSD, ora Guix System
pt_br: GuixSD, agora Guix System

source: Guix System Distribution, now Guix System
it: Guix System Distribution, ora Guix System
pt_br: Guix System Distribution, agora Guix System

source: You can install GNU@tie{}Guix on top of an existing GNU/Linux system where it complements the available tools without interference (@pxref{Installation}), or you can use it as a standalone operating system distribution, @dfn{Guix@tie{}System}@footnote{We used to refer to Guix System as ``Guix System Distribution'' or ``GuixSD''. We now consider it makes more sense to group everything under the ``Guix'' banner since, after all, Guix System is readily available through the @command{guix system} command, even if you're using a different distro underneath!}. @xref{GNU Distribution}.
it: È possibile installare GNU@tie{}Guix su un sistema GNU/Linux esistente, dove completa gli strumenti disponibili senza interferenze (@pxref{Installation}), oppure si può usare come una distribuzione di sistema operativo autonoma, @dfn{Guix@tie{}System}@footnote{In passato ci riferivamo a Guix System come ``Guix System Distribution'' o ``GuixSD''. Ora riteniamo che abbia più senso raggruppare tutto sotto l'insegna di ``Guix'' poiché, dopotutto, Guix System è prontamente disponibile tramite il comando @command{guix system}, anche se si sta usando una distro diversa sotto!}. @xref{GNU Distribution}.
pt_br: Você pode instalar o GNU@tie{}Guix sobre um sistema GNU/Linux existente, onde ele complementa as ferramentas disponíveis sem interferência (@pxref{Installation}) ou você pode usá-lo como uma distribuição de sistema operacional independente, @dfn{Guix@tie{}System}@footnote{Costumávamos nos referir ao Guix System como ``Guix System Distribution'' ou ``GuixSD''. Agora consideramos que faz mais sentido agrupar tudo sob o banner ``Guix'', pois, afinal, o Guix System está prontamente disponível através do comando @command{guix system}, mesmo se você estiver usando uma distribuição diferente por baixo!}. @xref{GNU Distribution}.

source: user interfaces
it: interfacce utente
pt_br: interfaces de usuário

source: Guix provides a command-line package management interface (@pxref{Package Management}), tools to help with software development (@pxref{Development}), command-line utilities for more advanced usage (@pxref{Utilities}), as well as Scheme programming interfaces (@pxref{Programming Interface}).
it: Guix fornisce un'interfaccia di gestione dei pacchetti da riga di comando (@pxref{Package Management}), strumenti per aiutare nello sviluppo software (@pxref{Development}), utilità da riga di comando per un uso più avanzato (@pxref{Utilities}), così come interfacce di programmazione Scheme (@pxref{Programming Interface}).
pt_br: O Guix fornece uma interface de gerenciamento de pacotes de linha de comando (@pxref{Package Management}), ferramentas para ajudar no desenvolvimento de software (@pxref{Development}), utilitários de linha de comando para uso mais avançado (@pxref{Utilities}), bem como interfaces de programação Scheme (@pxref{Programming Interface}).

source: Its @dfn{build daemon} is responsible for building packages on behalf of users (@pxref{Setting Up the Daemon}) and for downloading pre-built binaries from authorized sources (@pxref{Substitutes}).
it: Il suo @dfn{demone di build} è responsabile della compilazione dei pacchetti per conto degli utenti (@pxref{Setting Up the Daemon}) e dello scaricamento di binari precompilati da fonti autorizzate (@pxref{Substitutes}).
pt_br: O @dfn{build daemon} é responsável por compilar pacotes em nome dos usuários (@pxref{Setting Up the Daemon}) e por baixar binários pré-compilados de fontes autorizados (@pxref{Substitutes}).

source: extensibility of the distribution
it: estensibilità della distribuzione
pt_br: extensibilidade da distribuição

source: customization, of packages
it: personalizzazione, dei pacchetti
pt_br: personalização, de pacotes

source: Guix includes package definitions for many GNU and non-GNU packages, all of which @uref{https://www.gnu.org/philosophy/free-sw.html, respect the user's computing freedom}. It is @emph{extensible}: users can write their own package definitions (@pxref{Defining Packages}) and make them available as independent package modules (@pxref{Package Modules}). It is also @emph{customizable}: users can @emph{derive} specialized package definitions from existing ones, including from the command line (@pxref{Package Transformation Options}).
it: Guix include definizioni di pacchetti per molti pacchetti GNU e non-GNU, tutti i quali @uref{https://www.gnu.org/philosophy/free-sw.html, rispettano la libertà informatica dell'utente}. È @emph{estensibile}: gli utenti possono scrivere le proprie definizioni di pacchetto (@pxref{Defining Packages}) e renderle disponibili come moduli di pacchetti indipendenti (@pxref{Package Modules}). È anche @emph{customizable}: gli utenti possono @emph{derivare} definizioni di pacchetti specializzate da quelle esistenti, anche da riga di comando (@pxref{Package Transformation Options}).
pt_br: Guix inclui definições de pacotes para muitos pacotes GNU e não-GNU, todos os quais @uref{https://www.gnu.org/philosophy/free-sw.html, respeitam a liberdade de computação do usuário}. É @emph{extensível}: os usuários podem escrever suas próprias definições de pacotes (@pxref{Defining Packages}) e disponibilizá-los como módulos de pacotes independentes (@pxref{Package Modules}). Também é @emph{personalizável}: os usuários podem @emph{derivar} definições de pacotes especializados das existentes, incluindo da linha de comando (@pxref{Package Transformation Options}).

source: functional package management
it: gestione funzionale dei pacchetti
pt_br: gerenciamento de pacotes funcional

source: isolation
it: isolamento
pt_br: isolação

source: Under the hood, Guix implements the @dfn{functional package management} discipline pioneered by Nix (@pxref{Acknowledgments}). In Guix, the package build and installation process is seen as a @emph{function}, in the mathematical sense. That function takes inputs, such as build scripts, a compiler, and libraries, and returns an installed package. As a pure function, its result depends solely on its inputs---for instance, it cannot refer to software or scripts that were not explicitly passed as inputs. A build function always produces the same result when passed a given set of inputs. It cannot alter the environment of the running system in any way; for instance, it cannot create, modify, or delete files outside of its build and installation directories. This is achieved by running build processes in isolated environments (or @dfn{containers}), where only their explicit inputs are visible.
it: Sotto il cofano, Guix implementa la disciplina di @dfn{gestione funzionale dei pacchetti} introdotta da Nix (@pxref{Acknowledgments}). In Guix, il processo di build e installazione di un pacchetto è visto come una @emph{funzione}, nel senso matematico. Tale funzione prende degli input, come script di build, un compilatore e delle librerie, e restituisce un pacchetto installato. Come funzione pura, il suo risultato dipende unicamente dai suoi input - ad esempio, non può fare riferimento a software o script che non sono stati passati esplicitamente come input. Una funzione di build produce sempre lo stesso risultato quando le viene fornito un dato insieme di input. Non può alterare in alcun modo l'ambiente del sistema in esecuzione; ad esempio, non può creare, modificare o eliminare file al di fuori delle sue directory di build e installazione. Questo si ottiene eseguendo i processi di build in ambienti isolati (o @dfn{containers}), dove sono visibili solo i loro input espliciti.
pt_br: Nos bastidores, a Guix implementa a disciplina @dfn{gerenciamento de pacotes funcional} pioneira da Nix (@pxref{Acknowledgments}). No Guix, o processo de compilação e instalação de pacotes é visto como uma @emph{função}, no sentido matemático. Essa função recebe entradas, como scripts de compilação, um compilador e bibliotecas, e retorna um pacote instalado. Como uma função pura, seu resultado depende apenas de suas entradas – por exemplo, não pode fazer referência a um software ou scripts que não foram explicitamente passados como entradas. Uma função de compilação sempre produz o mesmo resultado ao passar por um determinado conjunto de entradas. Não pode alterar o ambiente do sistema em execução de qualquer forma; por exemplo, ele não pode criar, modificar ou excluir arquivos fora de seus diretórios de compilação e instalação. Isto é conseguido através da execução de processos de compilação em ambientes isolados (ou @dfn{containers}), onde somente suas entradas explícitas são visíveis.

source: The result of package build functions is @dfn{cached} in the file system, in a special directory called @dfn{the store} (@pxref{The Store}). Each package is installed in a directory of its own in the store---by default under @file{/gnu/store}. The directory name contains a hash of all the inputs used to build that package; thus, changing an input yields a different directory name.
it: Il risultato delle funzioni di build dei pacchetti viene @dfn{cached} nel file system, in una directory speciale chiamata @dfn{lo store} (@pxref{The Store}). Ogni pacchetto è installato in una propria directory nello store - per impostazione predefinita sotto @file{/gnu/store}. Il nome della directory contiene un hash di tutti gli input usati per compilare quel pacchetto; quindi, cambiare un input produce un nome di directory diverso.
pt_br: O resultado das funções de compilação do pacote é mantido (@dfn{cached}) no sistema de arquivos, em um diretório especial chamado @dfn{armazém} (@pxref{The Store}). Cada pacote é instalado em um diretório próprio no armazém – por padrão, em @file{/gnu/store}. O nome do diretório contém um hash de todas as entradas usadas para compilar esse pacote; Assim, a alteração uma entrada gera um nome de diretório diferente.

source: This approach is the foundation for the salient features of Guix: support for transactional package upgrade and rollback, per-user installation, and garbage collection of packages (@pxref{Features}).
it: Questo approccio è la base per le caratteristiche salienti di Guix: supporto per aggiornamenti e rollback transazionali dei pacchetti, installazione per utente e garbage collection dei pacchetti (@pxref{Features}).
pt_br: Essa abordagem é a fundação para os principais recursos do Guix: suporte para atualização transacional de pacotes e reversão, instalação por usuário e coleta de lixo de pacotes (@pxref{Features}).

source: Guix comes with a distribution of the GNU system consisting entirely of free software@footnote{The term ``free'' here refers to the @url{https://www.gnu.org/philosophy/free-sw.html,freedom provided to users of that software}.}. The distribution can be installed on its own (@pxref{System Installation}), but it is also possible to install Guix as a package manager on top of an installed GNU/Linux system (@pxref{Installation}). When we need to distinguish between the two, we refer to the standalone distribution as Guix@tie{}System.
it: Guix viene fornito con una distribuzione del sistema GNU composta interamente da software libero@footnote{Il termine ``libero'' qui si riferisce alla @url{https://www.gnu.org/philosophy/free-sw.html,libertà fornita agli utenti di quel software}.}. La distribuzione può essere installata da sola (@pxref{System Installation}), ma è anche possibile installare Guix come gestore di pacchetti su un sistema GNU/Linux già installato (@pxref{Installation}). Quando abbiamo bisogno di distinguere tra i due, ci riferiamo alla distribuzione autonoma come Guix@tie{}System.
pt_br: O Guix vem com uma distribuição do sistema GNU que consiste inteiramente de software livre@footnote{O termo ``free'' em ``free software`` se refere à @url{https://www.gnu.org/philosophy/free-sw.html,liberdade fornecida aos usuários desse software}. A ambiguidade no termo em inglês não ocorre na tradução para português ``livre``.}. A distribuição pode ser instalada por conta própria (@pxref{System Installation}), mas também é possível instalar o Guix como um gerenciador de pacotes em cima de um sistema GNU/Linux instalado (@pxref{Installation}). Quando precisamos distinguir entre os dois, nos referimos à distribuição independente como Guix@tie{}System.
