Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Optionally, @code{--localstatedir} and @code{--sysconfdir} can also be provided as arguments. By default, @code{localstatedir} is @file{/var} (@pxref{The Store}, for information about this) and @code{sysconfdir} is @file{/etc}. Note that you will probably not run @command{make install} at the end (you don't have to) but it's still important to pass the right @code{localstatedir} and @code{sysconfdir} values, which get recorded in the @code{(guix config)} Guile module.
it: Opzionalmente, @code{--localstatedir} e @code{--sysconfdir} possono essere forniti come argomenti. Per impostazione predefinita, @code{localstatedir} è @file{/var} (@pxref{The Store}, per informazioni a riguardo) e @code{sysconfdir} è @file{/etc}. Nota che probabilmente non eseguirai @command{make install} alla fine (non è necessario), ma è comunque importante passare i valori corretti di @code{localstatedir} e @code{sysconfdir}, che vengono registrati nel modulo Guile @code{(guix config)}.
pt_br: Opcionalmente, @code{--localstatedir} e @code{--sysconfdir} podem também ser providenciados como argumentos. Por padrão, @code{localstatedir} é @file{/var} (@pxref{The Store}, para obter informações sobre isso) e @file{/etc} é o valor normal de @code{sysconfdir}. Observe que você provavelmente não executará @command{make install} no final (não é necessário), mas ainda é importante passar os valores @code{localstatedir} e @code{sysconfdir} corretos, que são registrados no módulo @code{(guix config)} do Guile.

source: Finally, you can build Guix and, if you feel so inclined, run the tests (@pxref{Running the Test Suite}):
it: Infine, puoi costruire Guix e, se te la senti, eseguire i test (@pxref{Running the Test Suite}):
pt_br: Finalmente, você pode construir o Guix e, se desejar, executar os testes (@pxref{Running the Test Suite}):

source: If anything fails, take a look at installation instructions (@pxref{Installation}) or send a message to the @email{guix-devel@@gnu.org, mailing list}.
it: Se qualcosa va storto, dai un'occhiata alle istruzioni di installazione (@pxref{Installation}) o invia un messaggio alla @email{guix-devel@@gnu.org, mailing list}.
pt_br: Se alguma coisa falhar, dê uma olhada nas instruções de instalação (@pxref{Installation}) ou envie uma mensagem para a @email{guix-devel@@gnu.org, a lista de discussão}.

source: From there on, you can authenticate all the commits included in your checkout by running:
it: Da qui in poi, puoi autenticare tutti i commit inclusi nel tuo checkout eseguendo:
pt_br: A partir daí, você pode autenticar todos os commits incluídos no seu checkout executando:

source: The first run takes a couple of minutes, but subsequent runs are faster. On subsequent runs, you can run the command without any arguments since the @dfn{introduction} (the commit ID and OpenPGP fingerprints above) will have been recorded@footnote{This requires a recent version of Guix, from May 2024 or more recent.}:
it: La prima esecuzione richiede un paio di minuti, ma le esecuzioni successive sono più veloci. Nelle esecuzioni successive, puoi eseguire il comando senza argomenti poiché l'@dfn{introduction} (l'ID del commit e le impronte OpenPGP sopra) sarà stata registrata@footnote{Questo richiede una versione recente di Guix, da maggio 2024 o successiva.}:
pt_br: A primeira execução leva alguns minutos, mas as execuções subsequentes são mais rápidas. Em execuções subsequentes, você pode executar o comando sem argumentos, já que o @dfn{introduction} (o ID de confirmação e as impressões digitais do OpenPGP acima) terão sido registrados@footnote{Isso requer uma versão recente do Guix, de maio de 2024 ou mais recente.}:

source: When your configuration for your local Git repository doesn't match the default one, you can provide the reference for the @code{keyring} branch @i{via} the @option{-k} option. The following example assumes that you have a Git remote called @samp{myremote} pointing to the official repository:
it: Quando la configurazione del tuo repository Git locale non corrisponde a quella predefinita, puoi fornire il riferimento per il ramo @code{keyring} @i{via} l'opzione @option{-k}. L'esempio seguente presume che tu abbia un remote Git chiamato @samp{myremote} che punta al repository ufficiale:
pt_br: Quando sua configuração para seu repositório Git local não corresponde ao padrão, você pode fornecer a referência para o branch @code{keyring} @i{via} a opção @option{-k}. O exemplo a seguir pressupõe que você tenha um Git remoto chamado @samp{myremote} apontando para o repositório oficial:

source: @xref{Invoking guix git authenticate}, for more information on this command.
it: @xref{Invoking guix git authenticate}, per maggiori informazioni su questo comando.
pt_br: @xref{Invoking guix git authenticate}, para mais informações sobre este comando.

source: Note
it: Nota
pt_br: Nota

source: By default, hooks are installed such that @command{guix git authenticate} is invoked anytime you run @command{git pull} or @command{git push}.
it: Per impostazione predefinita, gli hook sono installati in modo che @command{guix git authenticate} venga invocato ogni volta che esegui @command{git pull} o @command{git push}.
pt_br: Por padrão, os hooks são instalados de forma que @command{guix git authenticate} seja invocado sempre que você executar @command{git pull} ou @command{git push}.

source: After updating the repository, @command{make} might fail with an error similar to the following example:
it: Dopo aver aggiornato il repository, @command{make} potrebbe fallire con un errore simile al seguente esempio:
pt_br: Após atualizar o repositório, @command{make} pode falhar com um erro semelhante ao exemplo a seguir:

source: This means that one of the record types that Guix defines (in this example, the @code{origin} record) has changed, and all of guix needs to be recompiled to take that change into account. To do so, run @command{make clean-go} followed by @command{make}.
it: Questo significa che uno dei tipi di record che Guix definisce (in questo esempio, il record @code{origin}) è cambiato, e tutto guix deve essere ricompilato per tenere conto di questa modifica. Per farlo, esegui @command{make clean-go} seguito da @command{make}.
pt_br: Isso significa que um dos tipos de registro que o Guix define (neste exemplo, o registro @code{origin}) foi alterado e todo o guix precisa ser recompilado para levar essa mudança em consideração. Para fazer isso, execute @command{make clean-go} seguido de @command{make}.

source: Should @command{make} fail with an Automake error message after updating, you need to repeat the steps outlined in this section, commencing with @command{./bootstrap}.
it: Se @command{make} fallisce con un messaggio di errore di Automake dopo un aggiornamento, è necessario ripetere i passaggi descritti in questa sezione, a partire da @command{./bootstrap}.
pt_br: Caso @command{make} falhe com uma mensagem de erro do Automake após a atualização, você precisará repetir as etapas descritas nesta seção, começando com @command{./bootstrap}.

source: test suite
it: suite di test
pt_br: suíte/conjunto de testes

source: After a successful @command{configure} and @code{make} run, it is a good idea to run the test suite. It can help catch issues with the setup or environment, or bugs in Guix itself---and really, reporting test failures is a good way to help improve the software. To run the test suite, type:
it: Dopo un'esecuzione di successo di @command{configure} e @code{make}, è una buona idea eseguire la suite di test. Può aiutare a individuare problemi con la configurazione o l'ambiente, o bug in Guix stesso --- e, in realtà, segnalare i fallimenti dei test è un buon modo per contribuire a migliorare il software. Per eseguire la suite di test, digita:
pt_br: Depois que um @command{configure} e @code{make} bem-sucedido forem executados, é uma boa ideia executar o conjunto de testes. Ele pode ajudar a detectar problemas com a configuração ou o ambiente, ou com bugs no próprio Guix – e realmente, relatar falhas de teste é uma boa maneira de ajudar a melhorar o software. Para executar o conjunto de testes, digite:

source: Test cases can run in parallel: you can use the @code{-j} option of GNU@tie{}make to speed things up. The first run may take a few minutes on a recent machine; subsequent runs will be faster because the store that is created for test purposes will already have various things in cache.
it: I casi di test possono essere eseguiti in parallelo: puoi usare l'opzione @code{-j} di GNU@tie{}make per velocizzare. La prima esecuzione potrebbe richiedere alcuni minuti su una macchina recente; le esecuzioni successive saranno più veloci perché lo store creato per i test avrà già diverse cose in cache.
pt_br: Os casos de teste podem ser executados em paralelo: você pode usar a opção @code{-j} do GNU@tie{}make para acelerar as coisas. A primeira execução pode levar alguns minutos em uma máquina recente; as execuções subsequentes serão mais rápidas porque o armazém criado para fins de teste já terá vários itens no cache.

source: It is also possible to run a subset of the tests by defining the @code{TESTS} makefile variable as in this example:
it: È anche possibile eseguire un sottoinsieme dei test definendo la variabile del makefile @code{TESTS} come in questo esempio:
pt_br: Também é possível executar um subconjunto dos testes definindo a variável makefile @code{TESTS} como neste exemplo:

source: By default, tests results are displayed at a file level. In order to see the details of every individual test cases, it is possible to define the @code{SCM_LOG_DRIVER_FLAGS} makefile variable as in this example:
it: Per impostazione predefinita, i risultati dei test sono visualizzati a livello di file. Per vedere i dettagli di ogni singolo caso di test, è possibile definire la variabile del makefile @code{SCM_LOG_DRIVER_FLAGS} come in questo esempio:
pt_br: Por padrão, os resultados dos testes são exibidos em um nível de arquivo. Para ver os detalhes de cada caso de teste individual, é possível definir a variável makefile @code{SCM_LOG_DRIVER_FLAGS} como neste exemplo:

source: The underlying SRFI 64 custom Automake test driver used for the 'check' test suite (located at @file{build-aux/test-driver.scm}) also allows selecting which test cases to run at a finer level, via its @option{--select} and @option{--exclude} options. Here's an example, to run all the test cases from the @file{tests/packages.scm} test file whose names start with ``transaction-upgrade-entry'':
it: Il driver di test personalizzato Automake SRFI 64 sottostante, utilizzato per la suite di test 'check' (che si trova in @file{build-aux/test-driver.scm}), consente anche di selezionare quali casi di test eseguire a un livello più fine, tramite le sue opzioni @option{--select} e @option{--exclude}. Ecco un esempio per eseguire tutti i casi di test dal file di test @file{tests/packages.scm} i cui nomi iniziano con ``transaction-upgrade-entry'':
pt_br: O driver de teste Automake personalizado SRFI 64 subjacente usado para o conjunto de testes 'check' (localizado em @file{build-aux/test-driver.scm}) também permite selecionar quais casos de teste executar em um nível mais fino, por meio de suas opções @option{--select} e @option{--exclude}. Aqui está um exemplo, para executar todos os casos de teste do arquivo de teste @file{tests/packages.scm} cujos nomes começam com ``transaction-upgrade-entry'':

source: Those wishing to inspect the results of failed tests directly from the command line can add the @option{--errors-only=yes} option to the @code{SCM_LOG_DRIVER_FLAGS} makefile variable and set the @code{VERBOSE} Automake makefile variable, as in:
it: Coloro che desiderano ispezionare i risultati dei test falliti direttamente dalla riga di comando possono aggiungere l'opzione @option{--errors-only=yes} alla variabile del makefile @code{SCM_LOG_DRIVER_FLAGS} e impostare la variabile del makefile di Automake @code{VERBOSE}, come in:
pt_br: Aqueles que desejam inspecionar os resultados de testes com falha diretamente da linha de comando podem adicionar a opção @option{--errors-only=yes} à variável makefile @code{SCM_LOG_DRIVER_FLAGS} e definir a variável makefile do Automake @code{VERBOSE}, como em:

source: The @option{--show-duration=yes} option can be used to print the duration of the individual test cases, when used in combination with @option{--brief=no}:
it: L'opzione @option{--show-duration=yes} può essere usata per stampare la durata dei singoli casi di test, se usata in combinazione con @option{--brief=no}:
pt_br: A opção @option{--show-duration=yes} pode ser usada para imprimir a duração dos casos de teste individuais, quando usada em combinação com @option{--brief=no}:

source: @xref{Parallel Test Harness,,,automake,GNU Automake} for more information about the Automake Parallel Test Harness.
it: @xref{Parallel Test Harness,,,automake,GNU Automake} per maggiori informazioni sull'Automake Parallel Test Harness.
pt_br: @xref{Parallel Test Harness,,,automake,GNU Automake} para mais informações sobre o Automake Parallel Test Harness.

source: Upon failure, please email @email{bug-guix@@gnu.org} and attach the @file{test-suite.log} file. Please specify the Guix version being used as well as version numbers of the dependencies (@pxref{Requirements}) in your message.
it: In caso di fallimento, invia un'email a @email{bug-guix@@gnu.org} e allega il file @file{test-suite.log}. Specifica nel tuo messaggio la versione di Guix utilizzata e i numeri di versione delle dipendenze (@pxref{Requirements}).
pt_br: Em caso de falha, envie um e-mail para @email{bug-guix@@gnu.org} e anexe o arquivo @file{test-suite.log}. Por favor, especifique a versão do Guix que está sendo usada, bem como os números de versão das dependências (@pxref{Requirements}) em sua mensagem.

source: Guix also comes with a whole-system test suite that tests complete Guix System instances. It can only run on systems where Guix is already installed, using:
it: Guix include anche una suite di test a livello di sistema che testa istanze complete di Guix System. Può essere eseguita solo su sistemi dove Guix è già installato, usando:
pt_br: O Guix também vem com um conjunto de testes de sistema completo que testa instâncias completas do Guix System. Ele só pode ser executado em sistemas nos quais o Guix já está instalado, usando:

source: or, again, by defining @code{TESTS} to select a subset of tests to run:
it: o, di nuovo, definendo @code{TESTS} per selezionare un sottoinsieme di test da eseguire:
pt_br: ou, novamente, definindo @code{TESTS} para selecionar um subconjunto de testes a serem executados:

source: These system tests are defined in the @code{(gnu tests @dots{})} modules. They work by running the operating systems under test with lightweight instrumentation in a virtual machine (VM). They can be computationally intensive or rather cheap, depending on whether substitutes are available for their dependencies (@pxref{Substitutes}). Some of them require a lot of storage space to hold VM images.
it: Questi test di sistema sono definiti nei moduli @code{(gnu tests @dots{})}. Funzionano eseguendo i sistemi operativi in prova con una strumentazione leggera in una macchina virtuale (VM). Possono essere computazionalmente intensivi o piuttosto economici, a seconda della disponibilità di sostituti per le loro dipendenze (@pxref{Substitutes}). Alcuni di essi richiedono molto spazio di archiviazione per contenere le immagini della VM.
pt_br: Esses testes de sistema são definidos nos módulos @code{(gnu tests @dots{})}. Eles trabalham executando os sistemas operacionais em teste com instrumentação leve em uma máquina virtual (VM). Eles podem ser computacionalmente intensivos ou bastante baratos, dependendo se os substitutos estão disponíveis para suas dependências (@pxref{Substitutes}). Alguns deles exigem muito espaço de armazenamento para armazenar imagens de VM.

source: If you encounter an error like:
it: Se incontri un errore come:
pt_br: Se você encontrar um erro como:

source: Compiling Scheme modules... ice-9/eval.scm:142:16: In procedure compile-top-call: error: all-system-tests: unbound variable hint: Did you forget `(use-modules (gnu tests))'?
pt_br: Compiling Scheme modules... ice-9/eval.scm:142:16: In procedure compile-top-call: error: all-system-tests: unbound variable dica: Você se esqueceu de `(use-modules (gnu tests))'?

source: there may be inconsistencies in the work tree from previous builds. To resolve this, try running @command{make clean-go} followed by @command{make}.
it: potrebbero esserci delle incongruenze nell'albero di lavoro dovute a compilazioni precedenti. Per risolvere, prova a eseguire @command{make clean-go} seguito da @command{make}.
pt_br: pode haver inconsistências na árvore de trabalho de compilações anteriores. Para resolver isso, tente executar @command{make clean-go} seguido por @command{make}.

source: Again in case of test failures, please send @email{bug-guix@@gnu.org} all the details.
it: Ancora una volta, in caso di fallimento dei test, invia tutti i dettagli a @email{bug-guix@@gnu.org}.
pt_br: Novamente, em caso de falhas nos testes, por favor envie @email{bug-guix@@gnu.org} todos os detalhes.

source: In order to keep a sane working environment, you will find it useful to test the changes made in your local source tree checkout without actually installing them. So that you can distinguish between your ``end-user'' hat and your ``motley'' costume.
it: Per mantenere un ambiente di lavoro sano, troverai utile testare le modifiche apportate nel tuo checkout locale dell'albero dei sorgenti senza installarle effettivamente. Così puoi distinguere tra il tuo ruolo di ``utente finale'' e il tuo costume ``arlecchino''.
pt_br: Para manter um ambiente de trabalho saudável, você achará útil testar as alterações feitas na árvore local de fontes sem realmente instalá-las. Para que você possa distinguir entre o seu chapéude ''usuário final'' e sua fantasia ''misturada''.

source: To that end, all the command-line tools can be used even if you have not run @code{make install}. To do that, you first need to have an environment with all the dependencies available (@pxref{Building from Git}), and then simply prefix each command with @command{./pre-inst-env} (the @file{pre-inst-env} script lives in the top build tree of Guix; @pxref{Building from Git} to generate it). As an example, here is how you would build the @code{hello} package as defined in your working tree (this assumes @command{guix-daemon} is already running on your system; it's OK if it's a different version):
it: A tal fine, tutti gli strumenti a riga di comando possono essere usati anche se non hai eseguito @code{make install}. Per farlo, devi prima avere un ambiente con tutte le dipendenze disponibili (@pxref{Building from Git}), e poi semplicemente anteporre a ogni comando @command{./pre-inst-env} (lo script @file{pre-inst-env} si trova nella directory di compilazione principale di Guix; @pxref{Building from Git} per generarlo). Ad esempio, ecco come costruiresti il pacchetto @code{hello} come definito nel tuo albero di lavoro (questo presume che @command{guix-daemon} sia già in esecuzione sul tuo sistema; non importa se è una versione diversa):
pt_br: Para esse fim, todas as ferramentas de linha de comando podem ser usadas mesmo se você não tiver executado @code{make install}. Para fazer isso, primeiro você precisa ter um ambiente com todas as dependências disponíveis (@pxref{Building from Git}) e, em seguida, simplesmente prefixar cada comando com @command{./pre-inst-env} (o @file{pre-inst-env} fica na árvore de construção superior do Guix; @pxref{Building from Git} para gerá-lo). Como exemplo, aqui está como você construiria o pacote @code{hello} conforme definido em sua árvore de trabalho (isso pressupõe que @command{guix-daemon} já esteja em execução em seu sistema; não há problema se for uma versão diferente):

source: Similarly, an example for a Guile session using the Guix modules:
it: Allo stesso modo, un esempio per una sessione Guile che usa i moduli Guix:
pt_br: Da mesma forma, um exemplo para uma sessão do Guile usando os módulos Guix:

source: @dots{} and for a REPL (@pxref{Using Guix Interactively}):
it: @dots{} e per un REPL (@pxref{Using Guix Interactively}):
pt_br: @dots{} e para um REPL (@pxref{Using Guix Interactively}):

source: If you are hacking on the daemon and its supporting code or if @command{guix-daemon} is not already running on your system, you can launch it straight from the build tree@footnote{The @option{-E} flag to @command{sudo} guarantees that @code{GUILE_LOAD_PATH} is correctly set such that @command{guix-daemon} and the tools it uses can find the Guile modules they need.}:
it: Se stai hackerando il demone e il suo codice di supporto o se @command{guix-daemon} non è già in esecuzione sul tuo sistema, puoi lanciarlo direttamente dall'albero di compilazione@footnote{Il flag @option{-E} a @command{sudo} garantisce che @code{GUILE_LOAD_PATH} sia impostato correttamente in modo che @command{guix-daemon} e gli strumenti che usa possano trovare i moduli Guile di cui hanno bisogno.}:
pt_br: Se você estiver hackeando o daemon e seu código de suporte ou se @command{guix-daemon} ainda não estiver em execução no seu sistema, você pode iniciá-lo diretamente da build tree@footnote{O sinalizador @option{-E} para @command{sudo} garante que @code{GUILE_LOAD_PATH} esteja configurado corretamente para que @command{guix-daemon} e as ferramentas que ele usa possam encontrar os módulos Guile necessários.}:

source: The @command{pre-inst-env} script sets up all the environment variables necessary to support this, including @env{PATH} and @env{GUILE_LOAD_PATH}.
it: Lo script @command{pre-inst-env} imposta tutte le variabili d'ambiente necessarie per supportare questo, incluse @env{PATH} e @env{GUILE_LOAD_PATH}.
pt_br: O script @command{pre-inst-env} configura todas as variáveis de ambiente necessárias para prover suporte a isso, incluindo @env{PATH} e @env{GUILE_LOAD_PATH}.

source: Note that @command{./pre-inst-env guix pull} does @emph{not} upgrade the local source tree; it simply updates the @file{~/.config/guix/current} symlink (@pxref{Invoking guix pull}). Run @command{git pull} instead if you want to upgrade your local source tree.
it: Nota che @command{./pre-inst-env guix pull} @emph{not} aggiorna l'albero dei sorgenti locale; aggiorna semplicemente il collegamento simbolico @file{~/.config/guix/current} (@pxref{Invoking guix pull}). Esegui invece @command{git pull} se vuoi aggiornare il tuo albero dei sorgenti locale.
pt_br: Observe que @command{./pre-inst-env guix pull} @emph{não} atualiza a área de fontes local; ele simplesmente atualiza a ligação simbólica @file{~/.config/guix/current} (@pxref{Invoking guix pull}). Execute @command{git pull} em vez disso, se você quiser atualizar sua árvore de fontes local.

source: Sometimes, especially if you have recently updated your repository, running @command{./pre-inst-env} will print a message similar to the following example:
it: A volte, specialmente se hai aggiornato di recente il tuo repository, l'esecuzione di @command{./pre-inst-env} stamperà un messaggio simile al seguente esempio:
pt_br: Às vezes, especialmente se você atualizou seu repositório recentemente, executar @command{./pre-inst-env} imprimirá uma mensagem semelhante ao exemplo a seguir:
