Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Read the list of channels from @var{file}. @var{file} must contain Scheme code that evaluates to a list of channel objects. @xref{Channels} for more information.
pt_br: Leia a lista de canais de @var{arquivo}. @var{arquivo} deve conter código Scheme que avalia uma lista de objetos de canal. @xref{Channels} para mais informações.

source: Thus, @command{guix time-machine -q} is equivalent to the following Bash command, using the ``process substitution'' syntax (@pxref{Process Substitution,,, bash, The GNU Bash Reference Manual}):
pt_br: Portanto, @command{guix time-machine -q} é equivalente ao seguinte comando Bash, usando a sintaxe "substituição de processo" (@pxref{Process Substitution,,, bash, Manual de referência do GNU Bash}):

source: Note that @command{guix time-machine} can trigger builds of channels and their dependencies, and these are controlled by the standard build options (@pxref{Common Build Options}).
pt_br: Observe que @command{guix time-machine} pode acionar compilações de canais e suas dependências, e elas são controladas pelas opções de compilação padrão (@pxref{Common Build Options}).

source: If @command{guix time-machine} is executed without any command, it prints the file name of the profile that would be used to execute the command. This is sometimes useful if you need to get store file name of the profile---e.g., when you want to @command{guix copy} it.
pt_br: Se @command{guix time-machine} for executado sem nenhum comando, ele imprime o nome do arquivo do perfil que seria usado para executar o comando. Isso às vezes é útil se você precisa obter o nome do arquivo de armazém do perfil --- por exemplo, quando você quer @command{guix copy} ele.

source: The functionality described here is a ``technology preview'' as of version @value{VERSION}. As such, the interface is subject to change.
pt_br: A funcionalidade descrita aqui é uma ``prévia de tecnologia'' da versão @value{VERSION}. Como tal, a interface está sujeita a alterações.

source: inferiors
pt_br: inferiores

source: composition of Guix revisions
pt_br: composição das revisões do Guix

source: Sometimes you might need to mix packages from the revision of Guix you're currently running with packages available in a different revision of Guix. Guix @dfn{inferiors} allow you to achieve that by composing different Guix revisions in arbitrary ways.
pt_br: Às vezes, você pode precisar misturar pacotes da revisão do Guix que você está executando atualmente com pacotes disponíveis em uma revisão diferente do Guix. Os @dfn{inferiores} do Guix permite que você consiga isso compondo diferentes revisões do Guix de maneiras arbitrárias.

source: inferior packages
pt_br: pacotes inferiores

source: Technically, an ``inferior'' is essentially a separate Guix process connected to your main Guix process through a REPL (@pxref{Invoking guix repl}). The @code{(guix inferior)} module allows you to create inferiors and to communicate with them. It also provides a high-level interface to browse and manipulate the packages that an inferior provides---@dfn{inferior packages}.
pt_br: Tecnicamente, um ``inferior'' é essencialmente um processo Guix separado conectado ao seu processo Guix principal por meio de um REPL (@pxref{Invoking guix repl}). O módulo @code{(guix inferior)} permite que você crie inferiores e se comunique com eles. Ele também fornece uma interface de alto nível para navegar e manipular os pacotes que um inferior fornece---@dfn{pacotes inferiores}.

source: When combined with channels (@pxref{Channels}), inferiors provide a simple way to interact with a separate revision of Guix. For example, let's assume you want to install in your profile the current @code{guile} package, along with the @code{guile-json} as it existed in an older revision of Guix---perhaps because the newer @code{guile-json} has an incompatible API and you want to run your code against the old API@. To do that, you could write a manifest for use by @code{guix package --manifest} (@pxref{Writing Manifests}); in that manifest, you would create an inferior for that old Guix revision you care about, and you would look up the @code{guile-json} package in the inferior:
pt_br: Quando combinados com canais (@pxref{Channels}), os inferiores fornecem uma maneira simples de interagir com uma revisão separada do Guix. Por exemplo, vamos supor que você queira instalar em seu perfil o pacote @code{guile} atual, junto com o @code{guile-json} como ele existia em uma revisão mais antiga do Guix---talvez porque o mais novo @code{guile-json} tenha uma API incompatível e você queira executar seu código contra a API antiga. Para fazer isso, você pode escrever um manifesto para uso por @code{guix package --manifest} (@pxref{Writing Manifests}); nesse manifesto, você criaria um inferior para aquela revisão antiga do Guix que você se importa, e você procuraria o pacote @code{guile-json} no inferior:

source: (use-modules (guix inferior) (guix channels) (srfi srfi-1)) ;for 'first'
pt_br: (use-modules (guix inferior) (guix channels) (srfi srfi-1)) ;para 'first'

source: (define channels ;; This is the old revision from which we want to ;; extract guile-json. (list (channel (name 'guix) (url "https://git.guix.gnu.org/guix.git") (commit "65956ad3526ba09e1f7a40722c96c6ef7c0936fe"))))
pt_br: (define canais ;; Esta é a revisão antiga da qual queremos ;; extrair guile-json. (list (channel (name 'guix) (url "https://git.guix.gnu.org/guix.git") (commit "65956ad3526ba09e1f7a40722c96c6ef7c0936fe"))))

source: (define inferior ;; An inferior representing the above revision. (inferior-for-channels channels))
pt_br: (define inferior ;; Um inferior representando a revisão acima. (inferior-for-channels canais))

source: ;; Now create a manifest with the current "guile" package ;; and the old "guile-json" package. (packages->manifest (list (first (lookup-inferior-packages inferior "guile-json")) (specification->package "guile")))
pt_br: ;; Agora crie um manifesto com o pacote "guile" atual ;; e o antigo pacote "guile-json". (packages->manifest (list (first (lookup-inferior-packages inferior "guile-json")) (specification->package "guile")))

source: On its first run, @command{guix package --manifest} might have to build the channel you specified before it can create the inferior; subsequent runs will be much faster because the Guix revision will be cached.
pt_br: Na primeira execução, @command{guix package --manifest} pode ter que construir o canal que você especificou antes de poder criar o inferior; execuções subsequentes serão muito mais rápidas porque a revisão do Guix será armazenada em cache.

source: The @code{(guix inferior)} module provides the following procedures to open an inferior:
pt_br: O módulo @code{(guix inferior)} fornece os seguintes procedimentos para abrir um inferior:

source: {Procedure} inferior-for-channels channels [#:cache-directory] [#:ttl]
pt_br: {Procedimento} inferior-for-channels canais [#:cache-directory] [#:ttl]

source: Return an inferior for @var{channels}, a list of channels. Use the cache at @var{cache-directory}, where entries can be reclaimed after @var{ttl} seconds. This procedure opens a new connection to the build daemon.
pt_br: Retorna um inferior para @var{canais}, uma lista de canais. Use o cache em @var{cache-directory}, onde as entradas podem ser recuperadas após @var{ttl} segundos. Este procedimento abre uma nova conexão com o daemon de construção.

source: As a side effect, this procedure may build or substitute binaries for @var{channels}, which can take time.
pt_br: Como efeito colateral, esse procedimento pode criar ou substituir binários para @var{canais}, o que pode levar tempo.

source: {Procedure} open-inferior directory [#:command "bin/guix"]
pt_br: {Procedimento} open-inferior diretório [#:command "bin/guix"]

source: Open the inferior Guix in @var{directory}, running @code{@var{directory}/@var{command} repl} or equivalent. Return @code{#f} if the inferior could not be launched.
pt_br: Abra o Guix inferior em @var{diretório}, executando o comando @code{@var{diretório}/@var{command} repl} ou equivalente. Retorne @code{#f} se o inferior não puder ser iniciado.

source: The procedures listed below allow you to obtain and manipulate inferior packages.
pt_br: Os procedimentos listados abaixo permitem que você obtenha e manipule pacotes inferiores.

source: {Procedure} inferior-packages inferior
pt_br: {Procedimento} inferior-packages inferior

source: Return the list of packages known to @var{inferior}.
pt_br: Retorna a lista de pacotes conhecidos por @var{inferior}.

source: {Procedure} lookup-inferior-packages inferior name [version]
pt_br: {Procedimento} lookup-inferior-packages inferior nome [versão]

source: Return the sorted list of inferior packages matching @var{name} in @var{inferior}, with highest version numbers first. If @var{version} is true, return only packages with a version number prefixed by @var{version}.
pt_br: Retorna a lista ordenada de pacotes inferiores que correspondem a @var{nome} em @var{inferior}, com os números de versão mais altos primeiro. Se @var{versão} for true, retorna apenas pacotes com um número de versão prefixado por @var{versão}.

source: {Procedure} inferior-package? obj
pt_br: {Procedimento} inferior-package? obj

source: Return true if @var{obj} is an inferior package.
pt_br: Retorna verdadeiro se @var{obj} for um pacote inferior.

source: {Procedure} inferior-package-name package
pt_br: {Procedimento} inferior-package-name pacote

source: {Procedure} inferior-package-version package
pt_br: {Procedimento} inferior-package-version pacote

source: {Procedure} inferior-package-synopsis package
pt_br: {Procedimento} inferior-package-synopsis pacote

source: {Procedure} inferior-package-description package
pt_br: {Procedimento} inferior-package-description pacote

source: {Procedure} inferior-package-home-page package
pt_br: {Procedimento} inferior-package-home-page pacote

source: {Procedure} inferior-package-location package
pt_br: {Procedimento} inferior-package-location pacote

source: {Procedure} inferior-package-inputs package
pt_br: {Procedimento} inferior-package-inputs pacote

source: {Procedure} inferior-package-native-inputs package
pt_br: {Procedimento} inferior-package-native-inputs pacote

source: {Procedure} inferior-package-propagated-inputs package
pt_br: {Procedimento} inferior-package-propagated-inputs pacote

source: {Procedure} inferior-package-transitive-propagated-inputs package
pt_br: {Procedimento} inferior-package-transitive-propagated-inputs pacote

source: {Procedure} inferior-package-native-search-paths package
pt_br: {Procedimento} inferior-package-native-search-paths pacote

source: {Procedure} inferior-package-transitive-native-search-paths package
pt_br: {Procedimento} inferior-package-transitive-native-search-paths pacote

source: {Procedure} inferior-package-search-paths package
pt_br: {Procedimento} inferior-package-search-paths pacote

source: These procedures are the counterpart of package record accessors (@pxref{package Reference}). Most of them work by querying the inferior @var{package} comes from, so the inferior must still be live when you call these procedures.
pt_br: Esses procedimentos são a contrapartida dos acessadores de registro de pacote (@pxref{package Reference}). A maioria deles funciona consultando o inferior de onde @var{pacote} vem, então o inferior ainda deve estar ativo quando você chamar esses procedimentos.

source: Inferior packages can be used transparently like any other package or file-like object in G-expressions (@pxref{G-Expressions}). They are also transparently handled by the @code{packages->manifest} procedure, which is commonly used in manifests (@pxref{Invoking guix package, the @option{--manifest} option of @command{guix package}}). Thus you can insert an inferior package pretty much anywhere you would insert a regular package: in manifests, in the @code{packages} field of your @code{operating-system} declaration, and so on.
pt_br: Pacotes inferiores podem ser usados transparentemente como qualquer outro pacote ou objeto tipo arquivo em expressões-G (@pxref{G-Expressions}). Eles também são manipulados transparentemente pelo procedimento @code{packages->manifest}, que é comumente usado em manifestos (@pxref{Invoking guix package, a opção @option{--manifest} de @command{guix package}}). Assim, você pode inserir um pacote inferior praticamente em qualquer lugar em que inseriria um pacote regular: em manifestos, no campo @code{packages} da sua declaração @code{operating-system} e assim por diante.

source: Invoking @command{guix describe}
pt_br: Invocando @command{guix describe}

source: Often you may want to answer questions like: ``Which revision of Guix am I using?'' or ``Which channels am I using?'' This is useful information in many situations: if you want to @emph{replicate} an environment on a different machine or user account, if you want to report a bug or to determine what change in the channels you are using caused it, or if you want to record your system state for reproducibility purposes. The @command{guix describe} command answers these questions.
pt_br: Frequentemente você pode querer responder perguntas como: ``Qual revisão do Guix estou usando?'' ou ``Quais canais estou usando?'' Essas são informações úteis em muitas situações: se você quiser @emph{replicar} um ambiente em uma máquina ou conta de usuário diferente, se quiser relatar um bug ou determinar qual alteração nos canais que você está usando o causou, ou se quiser registrar o estado do seu sistema para fins de reprodutibilidade. O comando @command{guix describe} responde a essas perguntas.

source: When run from a @command{guix pull}ed @command{guix}, @command{guix describe} displays the channel(s) that it was built from, including their repository URL and commit IDs (@pxref{Channels}):
pt_br: Quando executado a partir de um @command{guix} obtido com @command{guix pull}, @command{guix describe} exibe o(s) canal(ais) dos quais foi criado, incluindo a URL do repositório e os IDs de confirmação (@pxref{Channels}):

source: $ guix describe Generation 10 Sep 03 2018 17:32:44 (current) guix e0fa68c repository URL: https://git.guix.gnu.org/guix.git branch: master commit: e0fa68c7718fffd33d81af415279d6ddb518f727
pt_br: $ guix describe Geração 10 03 set 2018 17:32:44 (atual) guix e0fa68c URL do repositório: https://git.guix.gnu.org/guix.git ramo: master commit: e0fa68c7718fffd33d81af415279d6ddb518f727

source: If you're familiar with the Git version control system, this is similar in spirit to @command{git describe}; the output is also similar to that of @command{guix pull --list-generations}, but limited to the current generation (@pxref{Invoking guix pull, the @option{--list-generations} option}). Because the Git commit ID shown above unambiguously refers to a snapshot of Guix, this information is all it takes to describe the revision of Guix you're using, and also to replicate it.
pt_br: Se você estiver familiarizado com o sistema de controle de versão do Git, isso é similar em espírito a @command{git describe}; a saída também é similar à de @command{guix pull --list-generations}, mas limitada à geração atual (@pxref{Invoking guix pull, a opção @option{--list-generations}}). Como o ID de commit do Git mostrado acima se refere inequivocamente a um snapshot do Guix, essa informação é tudo o que é preciso para descrever a revisão do Guix que você está usando e também para replicá-la.

source: To make it easier to replicate Guix, @command{guix describe} can also be asked to return a list of channels instead of the human-readable description above:
pt_br: Para facilitar a replicação do Guix, @command{guix describe} também pode ser solicitado a retornar uma lista de canais em vez da descrição legível acima:

source: You can save this to a file and feed it to @command{guix pull -C} on some other machine or at a later point in time, which will instantiate @emph{this exact Guix revision} (@pxref{Invoking guix pull, the @option{-C} option}). From there on, since you're able to deploy the same revision of Guix, you can just as well @emph{replicate a complete software environment}. We humbly think that this is @emph{awesome}, and we hope you'll like it too!
pt_br: Você pode salvar isso em um arquivo e alimentá-lo com @command{guix pull -C} em alguma outra máquina ou em um momento posterior, o que instanciará @emph{esta revisão exata do Guix} (@pxref{Invoking guix pull, a opção @option{-C}}). A partir daí, já que você consegue implementar a mesma revisão do Guix, você pode muito bem @emph{replicar um ambiente de software completo}. Humildemente achamos isso @emph{incrível}, e esperamos que você goste também!

source: The details of the options supported by @command{guix describe} are as follows:
pt_br: Os detalhes das opções suportadas por @command{guix describe} são os seguintes:

source: --format=@var{format}
pt_br: --format=@var{formato}

source: -f @var{format}
pt_br: -f @var{formato}

source: Produce output in the specified @var{format}, one of:
pt_br: Produza saída no @var{formato} especificado, um dos seguintes:

source: produce human-readable output;
pt_br: produzir resultados legíveis por humanos;

source: produce a list of channel specifications that can be passed to @command{guix pull -C} or installed as @file{~/.config/guix/channels.scm} (@pxref{Invoking guix pull});
pt_br: produz uma lista de especificações de canal que podem ser passadas para @command{guix pull -C} ou instaladas como @file{~/.config/guix/channels.scm} (@pxref{Invoking guix pull});

source: like @code{channels}, but omit the @code{introduction} field; use it to produce a channel specification suitable for Guix version 1.1.0 or earlier---the @code{introduction} field has to do with channel authentication (@pxref{Channels, Channel Authentication}) and is not supported by these older versions;
pt_br: como @code{channels}, mas omita o campo @code{introduction}; use-o para produzir uma especificação de canal adequada para a versão 1.1.0 do Guix ou anterior --- o campo @code{introduction} tem a ver com autenticação de canal (@pxref{Channels, Autenticação de canal}) e não é suportado por essas versões mais antigas;

source: produce a list of channel specifications in JSON format;
pt_br: produzir uma lista de especificações de canal no formato JSON;

source: produce a list of channel specifications in Recutils format.
pt_br: produzir uma lista de especificações de canais no formato Recutils.

source: Display available formats for @option{--format} option.
pt_br: Exibir formatos disponíveis para a opção @option{--format}.

source: Display information about @var{profile}.
pt_br: Exibir informações sobre @var{perfil}.

source: Invoking @command{guix archive}
pt_br: Invocando @command{guix archive}

source: archive
it: archivio
pt_br: arquivo

source: exporting files from the store
pt_br: exportando arquivos do armazém

source: importing files to the store
pt_br: importando arquivos para o armazém

source: The @command{guix archive} command allows users to @dfn{export} files from the store into a single archive, and to later @dfn{import} them on a machine that runs Guix. In particular, it allows store files to be transferred from one machine to the store on another machine.
pt_br: O comando @command{guix archive} permite que os usuários @dfn{exportem} arquivos do armazém para um único arquivamento e depois @dfn{importem} eles em uma máquina que execute o Guix. Em particular, ele permite que os arquivos do armazém sejam transferidos de uma máquina para o store em outra máquina.

source: If you're looking for a way to produce archives in a format suitable for tools other than Guix, @pxref{Invoking guix pack}.
pt_br: Se você estiver procurando uma maneira de produzir arquivamentos em um formato adequado para outras ferramentas além do Guix, @pxref{Invoking guix pack}.

source: exporting store items
pt_br: exportando itens do armazém

source: To export store files as an archive to standard output, run:
pt_br: Para exportar arquivos de armazém como um arquivamento para saída padrão, execute:

source: guix archive --export @var{options} @var{specifications}...
pt_br: guix archive --export @var{opções} @var{especificações}...

source: @var{specifications} may be either store file names or package specifications, as for @command{guix package} (@pxref{Invoking guix package}). For instance, the following command creates an archive containing the @code{gui} output of the @code{git} package and the main output of @code{emacs}:
pt_br: @var{especificações} pode ser nomes de arquivos de armazém ou especificações de pacotes, como para @command{guix package} (@pxref{Invoking guix package}). Por exemplo, o comando a seguir cria um arquivo contendo a saída @code{gui} do pacote @code{git} e a saída principal de @code{emacs}:

source: If the specified packages are not built yet, @command{guix archive} automatically builds them. The build process may be controlled with the common build options (@pxref{Common Build Options}).
pt_br: Se os pacotes especificados ainda não foram construídos, @command{guix archive} os constrói automaticamente. O processo de construção pode ser controlado com as opções comuns de construção (@pxref{Common Build Options}).

source: To transfer the @code{emacs} package to a machine connected over SSH, one would run:
pt_br: Para transferir o pacote @code{emacs} para uma máquina conectada via SSH, execute:

source: guix archive --export -r emacs | ssh the-machine guix archive --import
pt_br: guix archive --export -r emacs | ssh a-máquina guix archive --import

source: Similarly, a complete user profile may be transferred from one machine to another like this:
pt_br: Da mesma forma, um perfil de usuário completo pode ser transferido de uma máquina para outra assim:

source: guix archive --export -r $(readlink -f ~/.guix-profile) | \ ssh the-machine guix archive --import
pt_br: guix archive --export -r $(readlink -f ~/.guix-profile) | \ ssh a-máquina guix archive --import

source: However, note that, in both examples, all of @code{emacs} and the profile as well as all of their dependencies are transferred (due to @option{-r}), regardless of what is already available in the store on the target machine. The @option{--missing} option can help figure out which items are missing from the target store. The @command{guix copy} command simplifies and optimizes this whole process, so this is probably what you should use in this case (@pxref{Invoking guix copy}).
pt_br: No entanto, observe que, em ambos os exemplos, todos os @code{emacs} e o perfil, bem como todas as suas dependências são transferidos (devido a @option{-r}), independentemente do que já esteja disponível no armazém na máquina de destino. A opção @option{--missing} pode ajudar a descobrir quais itens estão faltando no armazém de destino. O comando @command{guix copy} simplifica e otimiza todo esse processo, então é provavelmente isso que você deve usar neste caso (@pxref{Invoking guix copy}).

source: nar, archive format
pt_br: nar, formato de arquivamento

source: normalized archive (nar)
pt_br: arquivamento normalizado (nar)

source: nar bundle, archive format
pt_br: embalagem nar, formato de arquivamento

source: Each store item is written in the @dfn{normalized archive} or @dfn{nar} format (described below), and the output of @command{guix archive --export} (and input of @command{guix archive --import}) is a @dfn{nar bundle}.
pt_br: Cada item do armazém é escrito no formato @dfn{arquivamento normalizado} ou @dfn{nar} (descrito abaixo), e a saída de @command{guix archive --export} (e entrada de @command{guix archive --import}) é uma @dfn{embalagem nar}.
