Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Here is a configuration example for Linux-Libre < 5.6, where the module is out of tree and need to be loaded manually---following revisions of the kernel have it built-in and so don't need such configuration:
es: Aquí hay un ejemplo de configuración para Linux-Libre &lt; 5.6, donde el módulo está fuera del árbol y necesita ser cargado manualmente---siguientes revisiones del kernel lo tienen incorporado y por lo tanto no necesitan dicha configuración:
it: Ecco un esempio di configurazione per Linux-Libre < 5.6, dove il modulo è esterno all'albero e deve essere caricato manualmente---le revisioni successive del kernel lo hanno integrato e quindi non necessitano di tale configurazione:
pt_br: Aqui está um exemplo de configuração para Linux-Libre versão menor que 5.6, onde o módulo está fora da árvore e precisa ser carregado manualmente --- as seguintes revisões do kernel o possuem integrado e, portanto, não precisam de tal configuração:
sk: Nasleduje príklad nastavenia pre jadrá Linux-Libre < 5.6, ktoré príslušný modul nezahŕňajú a vyžadujú jeho ručné načítanie. V novších vydaniach jadra je modul už zabudovaný a takéto nastavenie nie je potrebné:

source: After reconfiguring and restarting your system you can either use Wireguard tools or NetworkManager to connect to a VPN server.
es: Después de reconfigurar y reiniciar el sistema, puede utilizar las herramientas Wireguard o NetworkManager para conectarse a un servidor VPN.
it: Dopo aver riconfigurato e riavviato il sistema, puoi usare gli strumenti Wireguard o NetworkManager per connetterti a un server VPN.
pt_br: Após reconfigurar e reiniciar seu sistema, você pode usar as ferramentas Wireguard ou NetworkManager para conectar-se a um servidor VPN.
sk: Po znovunastavení a opätovnom spustení systému môžete použiť buď nástroje Wireguard alebo NetworkManager pre pripojenie k VPN serveru.

source: Using Wireguard tools
es: Uso de las herramientas Wireguard
it: Utilizzo degli strumenti Wireguard
pt_br: Usando ferramentas Wireguard
sk: Použitie nástrojov Wireguard

source: To test your Wireguard setup it is convenient to use @command{wg-quick}. Just give it a configuration file @command{wg-quick up ./wg0.conf}; or put that file in @file{/etc/wireguard} and run @command{wg-quick up wg0} instead.
es: Para probar la configuración de Wireguard es conveniente utilizar @command{wg-quick}. Sólo tiene que darle un archivo de configuración @command{wg-quick up ./wg0.conf}; o poner ese archivo en @file{/etc/wireguard} y ejecutar @command{wg-quick up wg0} en su lugar.
it: Per testare la tua configurazione Wireguard è comodo usare @command{wg-quick}. Basta dargli un file di configurazione @command{wg-quick up ./wg0.conf}; o metterlo in @file{/etc/wireguard} ed eseguire @command{wg-quick up wg0} invece.
pt_br: Para testar a configuração do Wireguard é conveniente usar @command{wg-quick}. Basta fornecer um arquivo de configuração @command{wg-quick up ./wg0.conf}; ou coloque esse arquivo em @file{/etc/wireguard} e execute @command{wg-quick up wg0}.
sk: Pre vyskúšanie nastavenia Wireguard je vhodné použiť @command{wg-quick}. Stačí mu poskytnúť súbor nastavení @command{wg-quick up ./wg0.conf}. Súbor tiež môžete umiestniť do @file{/etc/wireguard} a namiesto predošlého príkazu vykonať @command{wg-quick up wg0}.

source: Be warned that the author described this command as a: “[…] very quick and dirty bash script […]”.
es: Se advierte que el autor describió este comando como un: "[...] script bash muy rápido y sucio [...]".
it: Si noti che l'autore ha descritto questo comando come: “[…] uno script bash molto veloce e sporco […]”.
pt_br: Esteja avisado que o autor descreveu este comando como um: “[…] script bash muito rápido e sujo […]”.
sk: Vedzte však, že autor tento príkaz opísal ako „[…] veľmi narýchlo napísaný bash skript […]“.

source: Using NetworkManager
es: Uso de NetworkManager
it: Utilizzo di NetworkManager
pt_br: Usando o NetworkManager
sk: Použitie nástroja NetworkManager

source: Thanks to NetworkManager support for Wireguard we can connect to our VPN using @command{nmcli} command. Up to this point this guide assumes that you're using Network Manager service provided by @code{%desktop-services}. Ortherwise you need to adjust your services list to load @code{network-manager-service-type} and reconfigure your Guix system.
es: Gracias al soporte de NetworkManager para Wireguard podemos conectarnos a nuestra VPN usando el comando @command{nmcli}. Hasta este punto, esta guía asume que está utilizando el servicio Network Manager proporcionado por @code{%desktop-services}. De lo contrario, necesitará ajustar su lista de servicios para cargar @code{network-manager-service-type} y reconfigurar su sistema Guix.
it: Grazie al supporto di NetworkManager per Wireguard, possiamo connetterci alla nostra VPN usando il comando @command{nmcli}. Fino a questo punto, questa guida presuppone che stai usando il servizio Network Manager fornito da @code{%desktop-services}. Altrimenti devi regolare l'elenco dei tuoi servizi per caricare @code{network-manager-service-type} e riconfigurare il tuo sistema Guix.
pt_br: Graças ao suporte do NetworkManager para Wireguard, podemos conectar-nos à nossa VPN usando o comando @command{nmcli}. Até este ponto, este guia pressupõe que você esteja usando o serviço Network Manager fornecido por @code{%desktop-services}. Caso contrário, você precisará ajustar sua lista de serviços para carregar @code{network-manager-service-type} e reconfigurar seu sistema Guix.
sk: Vďaka podpore nástroja NetworkManager pre Wireguard sa môžeme k našej VPN sieti pripojiť pomocou príkazu @command{nmcli}. Tento návod predpokladá, že používate službu NetworkManager, ktorú poskytujú @code{%desktop-services}. V opačnom prípade budete musieť rozšíriť váš zoznam služieb o @code{network-manager-service-type} a znovunastaviť váš systém Guix.

source: To import your VPN configuration execute nmcli import command:
es: Para importar su configuración VPN ejecute el comando nmcli import:
it: Per importare la tua configurazione VPN, esegui il comando nmcli import:
pt_br: Para importar sua configuração VPN, execute o comando "nmcli import":
sk: Pre načítanie vášho nastavenia VPN vykonajte nasledovný nmcli príkaz:

source: # nmcli connection import type wireguard file wg0.conf Connection 'wg0' (edbee261-aa5a-42db-b032-6c7757c60fde) successfully added
es: # nmcli connection import type wireguard file wg0.conf Conexión 'wg0' (edbee261-aa5a-42db-b032-6c7757c60fde) añadida correctamente
it: # nmcli connection import type wireguard file wg0.conf Connessione 'wg0' (edbee261-aa5a-42db-b032-6c7757c60fde) aggiunta con successo

source: This will create a configuration file in @file{/etc/NetworkManager/wg0.nmconnection}. Next connect to the Wireguard server:
es: Esto creará un archivo de configuración en @file{/etc/NetworkManager/wg0.nmconnection}. A continuación, conéctese al servidor Wireguard:
it: Questo creerà un file di configurazione in @file{/etc/NetworkManager/ wg0.nmconnection}. Quindi connettiti al server Wireguard:
pt_br: Isso criará um arquivo de configuração em @file{/etc/NetworkManager/wg0.nmconnection}. Em seguida, conecte-se ao servidor Wireguard:
sk: Týmto sa vytvorí súbor nastavení @file{/etc/NetworkManager/wg0.nmconnection}. Potom sa pripojte k serveru Wireguard:

source: $ nmcli connection up wg0 Connection successfully activated (D-Bus active path: /org/freedesktop/NetworkManager/ActiveConnection/6)
es: $ nmcli connection up wg0 Conexión activada con éxito (ruta activa D-Bus: /org/freedesktop/NetworkManager/ActiveConnection/6)
it: $ nmcli connection up wg0 Connessione attivata con successo (percorso attivo D-Bus: /org/freedesktop/ NetworkManager/ActiveConnection/6)

source: By default NetworkManager will connect automatically on system boot. To change that behaviour you need to edit your config:
es: Por defecto NetworkManager se conectará automáticamente al arrancar el sistema. Para cambiar este comportamiento es necesario editar la configuración:
it: Per impostazione predefinita, NetworkManager si connetterà automaticamente all'avvio del sistema. Per modificare questo comportamento, devi modificare la tua configurazione:
pt_br: Por padrão, o NetworkManager se conectará automaticamente na inicialização do sistema. Para mudar esse comportamento você precisa editar sua configuração:
sk: Predvolene sa NetworkManager sám pripojí pri spustení systému. Toto správanie môžete zmeniť v nastaveniach:

source: For more specific information about NetworkManager and wireguard @uref{https://blogs.gnome.org/thaller/2019/03/15/wireguard-in-networkmanager/,see this post by thaller}.
it: Per informazioni più specifiche su NetworkManager e Wireguard, @uref{https://blogs.gnome.org/thaller/2019/03/15/wireguard-in-networkmanager/, vedi questo post di Thaller}.
pt_br: Para obter informações mais específicas sobre NetworkManager e wireguard @uref{https://blogs.gnome.org/thaller/2019/03/15/wireguard-in-networkmanager/, consulte este artigo}.
sk: Podrobnejšie poznatky o nástroji NetworkManager a wireguard získate v @uref{https://blogs.gnome.org/thaller/2019/03/15/wireguard-in-networkmanager/,tomto príspevku od thallera}.

source: You could install StumpWM with a Guix system by adding @code{stumpwm} and optionally @code{`(,stumpwm "lib")} packages to a system configuration file, e.g.@: @file{/etc/config.scm}.
es: Puedes instalar StumpWM con un sistema Guix añadiendo los paquetes @code{stumpwm} y opcionalmente @code{`(,stumpwm "lib")} a un fichero de configuración del sistema, p.ej. @: @file{/etc/config.scm}.
it: Potresti installare StumpWM con un sistema Guix aggiungendo i pacchetti @code{stumpwm} e opzionalmente @code{`(,stumpwm "lib")} a un file di configurazione di sistema, ad esempio: @file{/etc/config.scm}.
pt_br: Você pode instalar o StumpWM com um sistema Guix adicionando pacotes @code{stumpwm} e opcionalmente @code{`(,stumpwm "lib")} a um arquivo de configuração do sistema, por exemplo, @file{/etc/config.scm}.
sk: StumpWM so systémom Guix môžete nainštalovať pridaním @code{stumpwm} a nepovinne aj @code{`(,stumpwm "lib")} balíkov do súboru nastavení systému, napr.@: @file{/etc/config.scm}.

source: An example configuration can look like this:
es: Un ejemplo de configuración puede ser similar a esto:
it: Una configurazione di esempio può apparire così:
pt_br: Um exemplo de configuração pode ser assim:
sk: Príklad nastavenia:

source: stumpwm fonts
es: letras stumpwm
it: caratteri stumpwm
pt_br: fontes stumpwm
sk: písma stumpwm

source: By default StumpWM uses X11 fonts, which could be small or pixelated on your system. You could fix this by installing StumpWM contrib Lisp module @code{sbcl-ttf-fonts}, adding it to Guix system packages:
es: Por defecto StumpWM utiliza fuentes X11, que podrían ser pequeñas o pixeladas en su sistema. Puede solucionarlo instalando el módulo @code{sbcl-ttf-fonts} de StumpWM contrib Lisp y añadiéndolo a los paquetes del sistema Guix:
it: Per impostazione predefinita StumpWM utilizza i font X11, che potrebbero essere piccoli o pixelati sul tuo sistema. Puoi risolvere questo problema installando il modulo Lisp di StumpWM contrib @code{sbcl-ttf-fonts}, aggiungendolo ai pacchetti di sistema Guix:
pt_br: Por padrão, o StumpWM usa fontes X11, que podem ser pequenas ou pixeladas em seu sistema. Você pode corrigir isso instalando o módulo StumpWM contrib Lisp @code{sbcl-ttf-fonts}, adicionando-o aos pacotes do sistema Guix:
sk: StumpWM predvolene používa písma X11, ktoré môžu byť primalé alebo nedostatočne ostré. Lepšie zobrazenie môžete docieliť nainštalovaním Lisp modulu @code{sbcl-ttf-fonts} pre StumpWM, teda jeho pridaním k balíkom systému Guix:

source: Then you need to add the following code to a StumpWM configuration file @file{~/.stumpwm.d/init.lisp}:
es: A continuación, debe añadir el siguiente código a un archivo de configuración de StumpWM @file{~/.stumpwm.d/init.lisp}:
it: Quindi devi aggiungere il seguente codice a un file di configurazione di StumpWM @file{~/.stumpwm.d/init.lisp}:
pt_br: Então você precisa adicionar o seguinte código a um arquivo de configuração do StumpWM @file{~/.stumpwm.d/init.lisp}:
sk: Potom musíte pridať nasledovný kód do súboru nastavení StumpWM @file{~/.stumpwm.d/init.lisp}:

source: Depending on your environment, locking the screen of your session might come built in or it might be something you have to set up yourself. If you use a desktop environment like GNOME or KDE, it's usually built in. If you use a plain window manager like StumpWM or EXWM, you might have to set it up yourself.
es: Dependiendo de tu entorno, bloquear la pantalla de tu sesión puede venir incorporado o puede ser algo que tengas que configurar tú mismo. Si usas un entorno de escritorio como GNOME o KDE, normalmente viene incorporado. Si usas un gestor de ventanas sencillo como StumpWM o EXWM, puede que tengas que configurarlo tú mismo.
it: A seconda del tuo ambiente, il blocco dello schermo della tua sessione potrebbe essere integrato o potresti doverlo configurare tu stesso. Se usi un ambiente desktop come GNOME o KDE, di solito è integrato. Se usi un semplice window manager come StumpWM o EXWM, potresti doverlo configurare tu stesso.
pt_br: Dependendo do seu ambiente, o bloqueio da tela da sua sessão pode ser incorporado ou pode ser algo que você mesmo precisa configurar. Se você usa um ambiente de área de trabalho como GNOME ou KDE, ele geralmente está integrado. Se você usa um gerenciador de janelas simples como StumpWM ou EXWM, talvez seja necessário configurá-lo você mesmo.
sk: V závislosti na vašom prostredí, uzamykanie obrazovky môže byť zabudované alebo ho je potrebné nastaviť ručne. Ak používate prostredie pracovnej plochy ako GNOME alebo KDE, uzamykanie je v ňom pravdepodobne zabudované. Ak používate správcu okien ako StumpWM alebo EXWM, budete ho musieť nastaviť ručne.

source: If you use Xorg, you can use the utility @uref{https://www.mankier.com/1/xss-lock, xss-lock} to lock the screen of your session. xss-lock is triggered by DPMS which since Xorg 1.8 is auto-detected and enabled if ACPI is also enabled at kernel runtime.
es: Si usas Xorg, puedes usar la utilidad @uref{https://www.mankier.com/1/xss-lock, xss-lock} para bloquear la pantalla de tu sesión. xss-lock es activado por DPMS que desde Xorg 1.8 es auto-detectado y activado si ACPI también está activado en tiempo de ejecución del kernel.
it: Se usi Xorg, puoi usare l'utility @uref{https://www.mankier.com/1/xss-lock, xss-lock} per bloccare lo schermo della tua sessione. xss-lock è attivato da DPMS che da Xorg 1.8 è auto-rilevato e abilitato se ACPI è anche abilitato durante l'esecuzione del kernel.
pt_br: Se você usa Xorg, você pode usar o utilitário @uref{https://www.mankier.com/1/xss-lock, xss-lock} para bloquear a tela da sua sessão. xss-lock é acionado pelo DPMS que, desde o Xorg 1.8, é detectado automaticamente e habilitado se o ACPI também estiver habilitado no tempo de execução do kernel.
sk: Ak používate Xorg, môžete využiť nástroj @uref{https://www.mankier.com/1/xss-lock, xss-lock} pre uzamykanie vášho sedenia. xss-lock je vyvolaný DPMS, ktoré sa od Xorg 1.8 zisťuje a zapína samo, ak je pri spúšťaní jadra povolené aj ACPI.

source: To use xss-lock, you can simple execute it and put it into the background before you start your window manager from e.g. your @file{~/.xsession}:
es: Para usar xss-lock, puedes simplemente ejecutarlo y ponerlo en segundo plano antes de iniciar tu gestor de ventanas desde, por ejemplo, su @file{~/.xsession}:
it: Per usare xss-lock, puoi semplicemente eseguirlo e metterlo in background prima di avviare il tuo window manager da, ad esempio, il tuo @file{~/.xsession}:
pt_br: Para usar o xss-lock, você pode simplesmente executá-lo e colocá-lo em segundo plano antes de iniciar o gerenciador de janelas, por exemplo, seu @file{~/.xsession}:
sk: Použiť xss-lock môžete tak, že ho jednoducho spustíte na pozadí ešte pred spustením vášho správcu okien, napríklad z vášho @file{~/.xsession}:

source: In this example, xss-lock uses @code{slock} to do the actual locking of the screen when it determines it's appropriate, like when you suspend your device.
es: En este ejemplo, xss-lock utiliza @code{slock} para realizar el bloqueo real de la pantalla cuando determina que es apropiado, como cuando suspendes tu dispositivo.
it: In questo esempio, xss-lock usa @code{slock} per bloccare effettivamente lo schermo quando lo ritiene opportuno, ad esempio quando sospendi il tuo dispositivo.
pt_br: Neste exemplo, xss-lock usa @code{slock} para fazer o bloqueio real da tela quando determina que é apropriado, como quando você suspende seu dispositivo.
sk: V tomto príklade sa xss-lock spolieha na @code{slock} pre uzamknutie obrazovky, keď je to vhodné, napríklad, pri uspaní zariadenia.

source: For slock to be allowed to be a screen locker for the graphical session, it needs to be made setuid-root so it can authenticate users, and it needs a PAM service. This can be achieved by adding the following service to your @file{config.scm}:
es: Para que slock pueda ser un casillero de pantalla para la sesión gráfica, necesita ser hecho setuid-root para que pueda autenticar usuarios, y necesita un servicio PAM. Esto se puede lograr añadiendo el siguiente servicio a su @file{config.scm}:
it: Affinché slock possa essere un blocco schermo per la sessione grafica, deve essere reso setuid-root in modo da poter autenticare gli utenti, e ha bisogno di un servizio PAM. Ciò può essere ottenuto aggiungendo il seguente servizio al tuo @file{config.scm}:
pt_br: Para que o slock possa ser um bloqueador de tela para a sessão gráfica, ele precisa ser definido como setuid-root para poder autenticar usuários e precisa de um serviço PAM. Isso pode ser conseguido adicionando o seguinte serviço ao seu @file{config.scm}:
sk: Aby mohol slock uzamknúť obrazovku grafického sedenia, musí mať nastavený setuid-root príznak pre potreby overenia totožnosti používateľov. slock tiež vyžaduje službu PAM. Toto je možné zabezpečiť pridaním nasledovnej služby do vášho @file{config.scm}:

source: If you manually lock your screen, e.g. by directly calling slock when you want to lock your screen but not suspend it, it's a good idea to notify xss-lock about this so no confusion occurs. This can be done by executing @code{xset s activate} immediately before you execute slock.
es: Si bloquea manualmente su pantalla, por ejemplo, llamando directamente a slock cuando desea bloquear su pantalla pero no suspenderla, es una buena idea notificar a xss-lock sobre esto para que no se produzcan confusiones. Esto puede hacerse ejecutando @code{xset s activate} inmediatamente antes de ejecutar slock.
it: Se blocchi manualmente lo schermo, ad esempio chiamando direttamente slock quando vuoi bloccare lo schermo ma non sospenderlo, è una buona idea notificare xss-lock in modo che non si crei confusione. Ciò può essere fatto eseguendo @code{xset s activate} immediatamente prima di eseguire slock.
pt_br: Se você bloquear sua tela manualmente, por exemplo, chamando slock diretamente quando quiser bloquear sua tela, mas não suspendê-la, é uma boa ideia notificar xss-lock sobre isso para que não ocorra confusão. Isso pode ser feito executando @code{xset s activate} imediatamente antes de executar o slock.
sk: Pri ručnom uzamknutí obrazovky, napr. pri priamom vyvolaní slocku, keď chcete uzamknúť obrazovku ale nechcete uspať počítač, je dobré o tom oboznámiť aj xss-lock, aby nedošlo k omylu. Môžete tak urobiť vyvolaním @code{xset s activate} tesne pred spustením slocku.

source: To run Guix on a server hosted by @uref{https://www.linode.com, Linode}, start with a recommended Debian server. We recommend using the default distro as a way to bootstrap Guix. Create your SSH keys.
es: Para ejecutar Guix en un servidor alojado en @uref{https://www.linode.com, Linode}, comience con un servidor Debian recomendado. Recomendamos usar la distribución por defecto para arrancar Guix. Crea tus claves SSH.
it: Per eseguire Guix su un server ospitato da @uref{https://www.linode.com, Linode}, inizia con un server Debian consigliato. Consigliamo di usare la distro predefinita come modo per avviare Guix. Crea le tue chiavi SSH.
pt_br: Para executar o Guix num servidor hospedado por @uref{https://www.linode.com, Linode}, comece com um servidor Debian recomendado. Recomendamos usar a distribuição padrão como forma de inicializar o Guix. Crie suas chaves SSH.
sk: Ak chcete spustiť Guix na serveri hosťovanom na @uref{https://www.linode.com, Linode}, začnite s odporúčaným Debianovým serverom. Na zavedenie Guixu vám odporúčame použiť predvolenú distribúciu. Vytvorte si kľúče SSH.

source: Be sure to add your SSH key for easy login to the remote server. This is trivially done via Linode's graphical interface for adding SSH keys. Go to your profile and click add SSH Key. Copy into it the output of:
es: Asegúrese de añadir su clave SSH para facilitar el inicio de sesión en el servidor remoto. Esto se hace trivialmente a través de la interfaz gráfica de Linode para añadir claves SSH. Vaya a su perfil y pulse en añadir clave SSH. Copie en él la salida de:
it: Assicurati di aggiungere la tua chiave SSH per un facile accesso al server remoto. Questo è facilmente fatto tramite l'interfaccia grafica di Linode per l'aggiunta di chiavi SSH. Vai al tuo profilo e clicca su aggiungi chiave SSH. Copia al suo interno l'output di:
pt_br: Certifique-se de adicionar sua chave SSH para facilitar o login no servidor remoto. Isto é feito trivialmente através da interface gráfica do Linode para adicionar chaves SSH. Vá para o seu perfil e clique em adicionar chave SSH. Copie nele a saída de:
sk: Pridajte si SSH kľúč pre rýchle prihlasovanie na vzdialený server. Vďaka grafickému rozhraniu Linode je pridávanie SSH kľúčov veľmi jednoduché. Choďte do vášho profilu a kliknite na Pridať SSH kľúč. Tam potom skopírujte výstup príkazu:

source: cat ~/.ssh/<username>_rsa.pub
es: cat ~/.ssh/<nombre-usuario>_rsa.pub
it: cat ~/.ssh/<nomeutente>_rsa.pub
sk: cat ~/.ssh/<pouzivatel>_rsa.pub

source: Power the Linode down.
es: Apaga el Linode.
it: Spegni il Linode.
pt_br: Desligue o Linode.
sk: Vypnite Linode.

source: In the Linode's Storage tab, resize the Debian disk to be smaller. 30 GB free space is recommended. Then click "Add a disk", and fill out the form with the following:
es: En la pestaña Almacenamiento del Linode, re-dimensione el disco de Debian para que sea más pequeño. Se recomiendan 30 GB de espacio libre. A continuación, haga clic en "Añadir un disco", y rellene el formulario con lo siguiente:
it: Nella scheda Storage di Linode, ridimensiona il disco Debian per renderlo più piccolo. Si consigliano 30 GB di spazio libero. Quindi clicca su "Aggiungi un disco" e compila il modulo con quanto segue:
pt_br: Na aba Armazenamento do Linode, redimensione o disco Debian para ser menor. Recomenda-se 30 GB de espaço livre. Em seguida, clique em "Adicionar um disco" e preencha o formulário com o seguinte:
sk: Na karte „Storage“ (úložisko) v Linode zmenšite disk s Debianom. Odporúča sa 30 GB voľného priestoru. Potom kliknite na „Add a disk“ (pridať disk) a vyplňte formulár nasledujúcimi údajmi:

source: Label: "Guix"
es: Etiqueta: «Guix»
it: Etichetta: "Guix"
sk: Label (menovka): "Guix"

source: Set it to the remaining size
es: Ajústalo al tamaño restante
it: Impostalo alla dimensione rimanente
pt_br: Defina-o para o tamanho restante
sk: Využite zvyšné voľné miesto
