Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Alternatively, run @command{info info} in another tty to keep the manual available.
pt_br: Alternativamente, execute @command{info info} em outro tty para manter o manual disponível.

source: We consider Guix System to be ready for a wide range of ``desktop'' and server use cases. The reliability guarantees it provides---transactional upgrades and rollbacks, reproducibility---make it a solid foundation.
pt_br: Consideramos que o Guix System está pronto para uma ampla gama de casos de uso de "desktop'' e servidores. As garantias de confiabilidade que ele fornece – atualizações e reversões transacionais, reprodutibilidade – tornam-no uma base sólida.

source: More and more system services are provided (@pxref{Services}).
pt_br: Cada vez mais serviços de sistema são fornecidos (@pxref{Services}).

source: Nevertheless, before you proceed with the installation, be aware that some services you rely on may still be missing from version @value{VERSION}.
pt_br: No entanto, antes de prosseguir com a instalação, esteja ciente de que alguns serviços dos quais você depende ainda podem estar faltando na versão @value{VERSION}.

source: More than a disclaimer, this is an invitation to report issues (and success stories!), and to join us in improving it. @xref{Contributing}, for more info.
pt_br: Mais do que um aviso de isenção de responsabilidade, este é um convite para relatar problemas (e histórias de sucesso!) e se juntar a nós para melhorá-los. @xref{Contributing}, para mais informações.

source: hardware support on Guix System
pt_br: suporte a hardware no Guix System

source: GNU@tie{}Guix focuses on respecting the user's computing freedom. It builds around the kernel Linux-libre, which means that only hardware for which free software drivers and firmware exist is supported. Nowadays, a wide range of off-the-shelf hardware is supported on GNU/Linux-libre---from keyboards to graphics cards to scanners and Ethernet controllers. Unfortunately, there are still areas where hardware vendors deny users control over their own computing, and such hardware is not supported on Guix System.
pt_br: GNU@tie{}Guix se concentra em respeitar a liberdade computacional do usuário. Ele é construído em torno do kernel Linux-libre, o que significa que apenas o hardware para o qual existem drivers e firmware de software livre é suportado. Hoje em dia, uma ampla gama de hardware disponível no mercado é suportada no GNU/Linux-libre – de teclados a placas gráficas, scanners e controladores Ethernet. Infelizmente, ainda existem áreas onde os fornecedores de hardware negam aos usuários o controle sobre sua própria computação, e tal hardware não é suportado no Guix System.

source: WiFi, hardware support
pt_br: Wi-Fi, suporte de hardware

source: One of the main areas where free drivers or firmware are lacking is WiFi devices. WiFi devices known to work include those using Atheros chips (AR9271 and AR7010), which corresponds to the @code{ath9k} Linux-libre driver, and those using Broadcom/AirForce chips (BCM43xx with Wireless-Core Revision 5), which corresponds to the @code{b43-open} Linux-libre driver. Free firmware exists for both and is available out-of-the-box on Guix System, as part of @code{%base-firmware} (@pxref{operating-system Reference, @code{firmware}}).
pt_br: Uma das principais áreas onde faltam drivers ou firmware gratuitos são os dispositivos WiFi. Os dispositivos WiFi que funcionam incluem aqueles que usam chips Atheros (AR9271 e AR7010), que corresponde ao driver @code{ath9k} Linux-libre, e aqueles que usam chips Broadcom/AirForce (BCM43xx com Wireless-Core Revisão 5), que corresponde a o driver livre Linux @code{b43-open}. Existe firmware livre para ambos e está disponível imediatamente no Guix System, como parte do @code{%base-firmware} (@pxref{operating-system Reference, @code{firmware}}).

source: The installer warns you early on if it detects devices that are known @emph{not} to work due to the lack of free firmware or free drivers.
pt_br: O instalador avisa você antecipadamente se detectar dispositivos que @emph{não} funcionam devido à falta de firmware ou drivers gratuitos.

source: RYF, Respects Your Freedom
pt_br: RYF, respeita sua liberdade

source: The @uref{https://www.fsf.org/, Free Software Foundation} runs @uref{https://www.fsf.org/ryf, @dfn{Respects Your Freedom}} (RYF), a certification program for hardware products that respect your freedom and your privacy and ensure that you have control over your device. We encourage you to check the list of RYF-certified devices.
pt_br: A @uref{https://www.fsf.org/, Free Software Foundation} administra @uref{https://www.fsf.org/ryf, @dfn{Respects Your Freedom}} (RYF), um programa de certificação para produtos de hardware que respeitem sua liberdade e privacidade e garantam que você tenha controle sobre seu dispositivo. Recomendamos que você verifique a lista de dispositivos certificados RYF.

source: Another useful resource is the @uref{https://www.h-node.org/, H-Node} web site. It contains a catalog of hardware devices with information about their support in GNU/Linux.
pt_br: Outro recurso útil é o site @uref{https://www.h-node.org/, H-Node}. Ele contém um catálogo de dispositivos de hardware com informações sobre seu suporte no GNU/Linux.

source: An ISO-9660 installation image that can be written to a USB stick or burnt to a DVD can be downloaded from @indicateurl{@value{BASE-URL}/guix-system-install-@value{VERSION}.x86_64-linux.iso}, where you can replace @code{x86_64-linux} with one of:
pt_br: Uma imagem de instalação ISO-9660 que pode ser gravada em um pendrive ou gravada em um DVD pode ser baixada em @indicateurl{@value{BASE-URL}/guix-system-install-@value{VERSION}.x86_64-linux.iso}, onde você pode substituir @code{x86_64-linux} por um dos seguintes:

source: for a GNU/Linux system on Intel/AMD-compatible 64-bit CPUs;
pt_br: para um sistema GNU/Linux em CPUs de 64 bits compatíveis com Intel/AMD;

source: for a 32-bit GNU/Linux system on Intel-compatible CPUs.
pt_br: para um sistema GNU/Linux de 32 bits em CPUs compatíveis com Intel.

source: Make sure to download the associated @file{.sig} file and to verify the authenticity of the image against it, along these lines:
pt_br: Certifique-se de baixar o arquivo @file{.sig} associado e verificar a autenticidade da imagem em relação a ele, seguindo estas linhas:

source: If that command fails because you do not have the required public key, then run this command to import it:
pt_br: Se esse comando falhar porque você não possui a chave pública requerida, execute este comando para importá-lo:

source: and rerun the @code{gpg --verify} command.
pt_br: e execute novamente o comando @code{gpg --verify}.

source: Take note that a warning like ``This key is not certified with a trusted signature!'' is normal.
pt_br: Observe que um aviso como "Esta chave não está certificada com uma assinatura confiável!'' é normal.

source: This image contains the tools necessary for an installation. It is meant to be copied @emph{as is} to a large-enough USB stick or DVD.
pt_br: Esta imagem contém as ferramentas necessárias para uma instalação. Ele deve ser copiado @emph{como está} para um pendrive ou DVD grande o suficiente.

source: Copying to a USB Stick
pt_br: Copiando para um pendrive

source: Insert a USB stick of 1@tie{}GiB or more into your machine, and determine its device name. Assuming that the USB stick is known as @file{/dev/sdX}, copy the image with:
pt_br: Insira um pendrive de 1@tie{}GiB ou mais em sua máquina e determine o nome do dispositivo. Supondo que o pendrive seja conhecido como @file{/dev/sdX}, copie a imagem com:

source: Access to @file{/dev/sdX} usually requires root privileges.
pt_br: O acesso a @file{/dev/sdX} geralmente requer privilégios de root.

source: Burning on a DVD
pt_br: Gravando em um DVD

source: Insert a blank DVD into your machine, and determine its device name. Assuming that the DVD drive is known as @file{/dev/srX}, copy the image with:
pt_br: Insira um DVD virgem em sua máquina e determine o nome do dispositivo. Supondo que a unidade de DVD seja conhecida como @file{/dev/srX}, copie a imagem com:

source: Access to @file{/dev/srX} usually requires root privileges.
pt_br: O acesso a @file{/dev/srX} geralmente requer privilégios de root.

source: Booting
pt_br: Inicializando

source: Once this is done, you should be able to reboot the system and boot from the USB stick or DVD@. The latter usually requires you to get in the BIOS or UEFI boot menu, where you can choose to boot from the USB stick. In order to boot from Libreboot, switch to the command mode by pressing the @kbd{c} key and type @command{search_grub usb}.
pt_br: Feito isso, você poderá reiniciar o sistema e inicializar a partir do pendrive ou DVD@. O último geralmente requer que você entre no menu de inicialização do BIOS ou UEFI, onde você pode optar por inicializar a partir do pendrive. Para inicializar a partir do Libreboot, mude para o modo de comando pressionando a tecla @kbd{c} e digite @command{search_grub usb}.

source: Sadly, on some machines, the installation medium cannot be properly booted and you only see a black screen after booting even after you waited for ten minutes. This may indicate that your machine cannot run Guix System; perhaps you instead want to install Guix on a foreign distro (@pxref{Binary Installation}). But don't give up just yet; a possible workaround is pressing the @kbd{e} key in the GRUB boot menu and appending @option{nomodeset} to the Linux bootline. Sometimes the black screen issue can also be resolved by connecting a different display.
pt_br: Infelizmente, em algumas máquinas, o meio de instalação não pode ser inicializado corretamente e você só verá uma tela preta após a inicialização, mesmo depois de esperar dez minutos. Isto pode indicar que sua máquina não consegue executar o Sistema Guix; talvez você queira instalar o Guix em uma distribuição estrangeira (@pxref{Binary Installation}). Mas não desista ainda; uma possível solução alternativa é pressionar a tecla @kbd{e} no menu de inicialização do GRUB e anexar @option{nomodeset} à linha de inicialização do Linux. Às vezes, o problema da tela preta também pode ser resolvido conectando um monitor diferente.

source: @xref{Installing Guix in a VM}, if, instead, you would like to install Guix System in a virtual machine (VM).
pt_br: @xref{Installing Guix in a VM}, se, em vez disso, você quiser instalar o Guix System em uma máquina virtual (VM).

source: Once you have booted, you can use the guided graphical installer, which makes it easy to get started (@pxref{Guided Graphical Installation}). Alternatively, if you are already familiar with GNU/Linux and if you want more control than what the graphical installer provides, you can choose the ``manual'' installation process (@pxref{Manual Installation}).
pt_br: Depois de inicializar, você pode usar o instalador gráfico guiado, o que facilita o início (@pxref{Guided Graphical Installation}). Alternativamente, se você já está familiarizado com GNU/Linux e deseja mais controle do que o instalador gráfico oferece, você pode escolher o processo de instalação "manual'' (@pxref{Manual Installation}).

source: The graphical installer is available on TTY1. You can obtain root shells on TTYs 3 to 6 by hitting @kbd{ctrl-alt-f3}, @kbd{ctrl-alt-f4}, etc. TTY2 shows this documentation and you can reach it with @kbd{ctrl-alt-f2}. Documentation is browsable using the Info reader commands (@pxref{Top,,, info-stnd, Stand-alone GNU Info}). The installation system runs the GPM mouse daemon, which allows you to select text with the left mouse button and to paste it with the middle button.
pt_br: O instalador gráfico está disponível em TTY1. Você pode obter shells root em TTYs 3 a 6 pressionando @kbd{ctrl-alt-f3}, @kbd{ctrl-alt-f4}, etc. TTY2 mostra esta documentação e você pode acessá-la com @kbd{ctrl-alt -f2}. A documentação pode ser navegada usando os comandos do leitor de informações (@pxref{Top,,, info-stnd, Stand-alone GNU Info}). O sistema de instalação executa o daemon do mouse GPM, que permite selecionar texto com o botão esquerdo do mouse e colá-lo com o botão do meio.

source: Installation requires access to the Internet so that any missing dependencies of your system configuration can be downloaded. See the ``Networking'' section below.
pt_br: A instalação requer acesso à Internet para que quaisquer dependências ausentes na configuração do sistema possam ser baixadas. Consulte a seção "Rede" abaixo.

source: The graphical installer is a text-based user interface. It will guide you, with dialog boxes, through the steps needed to install GNU@tie{}Guix System.
pt_br: O instalador gráfico é uma interface de usuário baseada em texto. Ele guiará você, com caixas de diálogo, pelas etapas necessárias para instalar o GNU@tie{}Guix System.

source: The first dialog boxes allow you to set up the system as you use it during the installation: you can choose the language, keyboard layout, and set up networking, which will be used during the installation. The image below shows the networking dialog.
pt_br: As primeiras caixas de diálogo permitem que você configure o sistema conforme você o utiliza durante a instalação: você pode escolher o idioma, o layout do teclado e configurar a rede que será usada durante a instalação. A imagem abaixo mostra a caixa de diálogo de rede.

source: @image{images/installer-network,5in,, networking setup with the graphical installer}
pt_br: @image{images/installer-network,5in,, configuração de rede com o instalador gráfico}

source: Later steps allow you to partition your hard disk, as shown in the image below, to choose whether or not to use encrypted file systems, to enter the host name and root password, and to create an additional account, among other things.
pt_br: As etapas posteriores permitem particionar seu disco rígido, conforme mostrado na imagem abaixo, escolher se deseja ou não usar sistemas de arquivos criptografados, inserir o nome do host e a senha root e criar uma conta adicional, entre outras coisas.

source: @image{images/installer-partitions,5in,, partitioning with the graphical installer}
pt_br: @image{images/installer-partitions,5in,, particionando com o instalador gráfico}

source: Note that, at any time, the installer allows you to exit the current installation step and resume at a previous step, as show in the image below.
pt_br: Observe que, a qualquer momento, o instalador permite sair da etapa de instalação atual e retomar uma etapa anterior, conforme imagem abaixo.

source: @image{images/installer-resume,5in,, resuming the installation process}
pt_br: @image{images/installer-resume,5in,, retomando o processo de instalação}

source: Once you're done, the installer produces an operating system configuration and displays it (@pxref{Using the Configuration System}). At that point you can hit ``OK'' and installation will proceed. On success, you can reboot into the new system and enjoy. @xref{After System Installation}, for what's next!
pt_br: Quando terminar, o instalador produz uma configuração do sistema operacional e a exibe (@pxref{Using the Configuration System}). Nesse ponto você pode clicar em "OK'' e a instalação continuará. Se tiver sucesso, você pode reiniciar no novo sistema e aproveitar. @xref{After System Installation}, para saber o que vem a seguir!

source: This section describes how you would ``manually'' install GNU@tie{}Guix System on your machine. This option requires familiarity with GNU/Linux, with the shell, and with common administration tools. If you think this is not for you, consider using the guided graphical installer (@pxref{Guided Graphical Installation}).
pt_br: Esta seção descreve como você instalaria "manualmente'' o GNU@tie{}Guix System em sua máquina. Esta opção requer familiaridade com GNU/Linux, com o shell e com ferramentas de administração comuns. Se você acha que isso não é para você, considere usar o instalador gráfico guiado (@pxref{Guided Graphical Installation}).

source: The installation system provides root shells on TTYs 3 to 6; press @kbd{ctrl-alt-f3}, @kbd{ctrl-alt-f4}, and so on to reach them. It includes many common tools needed to install the system, but is also a full-blown Guix System. This means that you can install additional packages, should you need it, using @command{guix package} (@pxref{Invoking guix package}).
pt_br: O sistema de instalação fornece shells root nos TTYs 3 a 6; pressione @kbd{ctrl-alt-f3}, @kbd{ctrl-alt-f4} e assim por diante para alcançá-los. Inclui muitas ferramentas comuns necessárias para instalar o sistema, mas também é um sistema Guix completo. Isso significa que você pode instalar pacotes adicionais, caso precise, usando @command{guix package} (@pxref{Invoking guix package}).

source: Keyboard Layout, Networking, and Partitioning
pt_br: Layout de teclado, rede e particionamento

source: Before you can install the system, you may want to adjust the keyboard layout, set up networking, and partition your target hard disk. This section will guide you through this.
pt_br: Antes de instalar o sistema, você pode querer ajustar o layout do teclado, configurar a rede e particionar o disco rígido de destino. Esta seção irá guiá-lo através disso.

source: keyboard layout
pt_br: disposição do teclado

source: The installation image uses the US qwerty keyboard layout. If you want to change it, you can use the @command{loadkeys} command. For example, the following command selects the Dvorak keyboard layout:
pt_br: A imagem de instalação usa o layout de teclado qwerty dos EUA. Se quiser alterá-lo, você pode usar o comando @command{loadkeys}. Por exemplo, o comando a seguir seleciona o layout do teclado Dvorak:

source: See the files under @file{/run/current-system/profile/share/keymaps} for a list of available keyboard layouts. Run @command{man loadkeys} for more information.
pt_br: Consulte os arquivos em @file{/run/current-system/profile/share/keymaps} para obter uma lista de layouts de teclado disponíveis. Execute @command{man loadkeys} para obter mais informações.

source: Networking
it: Rete
pt_br: Rede

source: Run the following command to see what your network interfaces are called:
pt_br: Execute o seguinte comando para ver como são chamadas suas interfaces de rede:

source: @dots{} or, using the GNU/Linux-specific @command{ip} command:
pt_br: @dots{} ou, usando o comando @command{ip} específico do GNU/Linux:

source: Wired interfaces have a name starting with @samp{e}; for example, the interface corresponding to the first on-board Ethernet controller is called @samp{eno1}. Wireless interfaces have a name starting with @samp{w}, like @samp{w1p2s0}.
pt_br: As interfaces com fio têm um nome que começa com @samp{e}; por exemplo, a interface correspondente ao primeiro controlador Ethernet integrado é chamada @samp{eno1}. As interfaces sem fio têm um nome que começa com @samp{w}, como @samp{w1p2s0}.

source: Wired connection
pt_br: Conexão cabeada

source: To configure a wired network run the following command, substituting @var{interface} with the name of the wired interface you want to use.
pt_br: Para configurar uma rede com fio execute o seguinte comando, substituindo @var{interface} pelo nome da interface com fio que você deseja usar.

source: Wireless connection
pt_br: Conexão sem fio

source: wireless
pt_br: sem fio

source: To configure wireless networking, you can create a configuration file for the @command{wpa_supplicant} configuration tool (its location is not important) using one of the available text editors such as @command{nano}:
pt_br: Para configurar a rede sem fio, você pode criar um arquivo de configuração para a ferramenta de configuração @command{wpa_supplicant} (sua localização não é importante) usando um dos editores de texto disponíveis, como @command{nano}:

source: As an example, the following stanza can go to this file and will work for many wireless networks, provided you give the actual SSID and passphrase for the network you are connecting to:
pt_br: Como exemplo, a sub-rotina a seguir pode ir para este arquivo e funcionará para muitas redes sem fio, desde que você forneça o SSID e a senha reais da rede à qual está se conectando:

source: Start the wireless service and run it in the background with the following command (substitute @var{interface} with the name of the network interface you want to use):
pt_br: Inicie o serviço sem fio e execute-o em segundo plano com o seguinte comando (substitua @var{interface} pelo nome da interface de rede que deseja usar):

source: Run @command{man wpa_supplicant} for more information.
pt_br: Execute @command{man wpa_supplicant} para obter mais informações.

source: At this point, you need to acquire an IP address. On a network where IP addresses are automatically assigned @i{via} DHCP, you can run:
pt_br: Neste ponto, você precisa adquirir um endereço IP. Em uma rede onde os endereços IP são atribuídos automaticamente @i{via} DHCP, você pode executar:

source: Try to ping a server to see if networking is up and running:
pt_br: Tente executar ping em um servidor para ver se a rede está funcionando:

source: Setting up network access is almost always a requirement because the image does not contain all the software and tools that may be needed.
pt_br: Configurar o acesso à rede é quase sempre um requisito porque a imagem não contém todos os softwares e ferramentas que podem ser necessários.

source: proxy, during system installation
pt_br: proxy, durante a instalação do sistema

source: If you need HTTP and HTTPS access to go through a proxy, run the following command:
pt_br: Se você precisar de acesso HTTP e HTTPS para passar por um proxy, execute o seguinte comando:

source: where @var{URL} is the proxy URL, for example @code{http://example.org:8118}.
pt_br: onde @var{URL} é a URL do proxy, por exemplo @code{http://example.org:8118}.

source: installing over SSH
pt_br: instalando via SSH

source: If you want to, you can continue the installation remotely by starting an SSH server:
pt_br: Se desejar, você pode continuar a instalação remotamente iniciando um servidor SSH:

source: Make sure to either set a password with @command{passwd}, or configure OpenSSH public key authentication before logging in.
pt_br: Certifique-se de definir uma senha com @command{passwd} ou configurar a autenticação de chave pública OpenSSH antes de efetuar login.

source: Disk Partitioning
pt_br: Particionamento de disco

source: Unless this has already been done, the next step is to partition, and then format the target partition(s).
pt_br: A menos que isso já tenha sido feito, o próximo passo é particionar e então formatar a(s) partição(ões) de destino.

source: The installation image includes several partitioning tools, including Parted (@pxref{Overview,,, parted, GNU Parted User Manual}), @command{fdisk}, and @command{cfdisk}. Run it and set up your disk with the partition layout you want:
pt_br: A imagem de instalação inclui várias ferramentas de particionamento, incluindo Parted (@pxref{Overview,,, parted, GNU Parted User Manual}), @command{fdisk} e @command{cfdisk}. Execute-a e configure seu disco com o layout de partição que você deseja:

source: If your disk uses the GUID Partition Table (GPT) format and you plan to install BIOS-based GRUB (which is the default), make sure a BIOS Boot Partition is available (@pxref{BIOS installation,,, grub, GNU GRUB manual}).
pt_br: Se o seu disco usa o formato GUID Partition Table (GPT) e você planeja instalar o GRUB baseado em BIOS (que é o padrão), certifique-se de que uma partição de inicialização do BIOS esteja disponível (@pxref{BIOS installation,,, grub, manual do GNU GRUB}).

source: EFI, installation
pt_br: EFI, instalação

source: UEFI, installation
pt_br: UEFI, instalação

source: ESP, EFI system partition
pt_br: ESP, partição do sistema EFI
