Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Please note that this is a straight-forward way for smaller datasets. For larger databases @url{https://www.postgresql.org/docs/current/pgupgrade.html, @code{pg_upgrade}} may be the better choice. Handling the service and system upgrade as described in this guide still applies, though.
it: Si prega di notare che questo è un modo diretto per dataset più piccoli. Per database più grandi @url{https://www.postgresql.org/docs/current/pgupgrade.html, @code{pg_upgrade}} potrebbe essere la scelta migliore. La gestione del servizio e l'aggiornamento del sistema come descritto in questa guida si applicano comunque.
pt_br: Observe que esta é uma maneira simples para conjuntos de dados menores. Para bancos de dados maiores @url{https://www.postgresql.org/docs/current/pgupgrade.html, @code{pg_upgrade}} pode ser a melhor escolha. Contudo, a atualização do serviço e do sistema conforme descrito neste guia ainda se aplica.

source: Stop and disable cuirass.
it: Ferma e disabilita cuirass.
pt_br: Pare e desabilite cuirass.

source: Prevent the service from starting and failing after a reconfiguration:
it: Impedisci al servizio di avviarsi e fallire dopo una riconfigurazione:
pt_br: Evite que o serviço de iniciar e falhar após a reconfiguração:

source: Dump the database contents.
it: Scarica il contenuto del database.
pt_br: Exporte o conteúdo do banco de dados.

source: Add or alter the postgres service.
it: Aggiungi o modifica il servizio postgres.
pt_br: Adicione ou altere o serviço do postgres.

source: Depending on whether your postgres service is defined implicitly (through the dependency from the cuirass service) or its own entry in your operating system's @code{(services)} property, you need to either add or alter the already existing configuration to reflect your intended version upgrade.
it: A seconda che il tuo servizio postgres sia definito implicitamente (tramite la dipendenza dal servizio cuirass) o con una propria voce nella proprietà @code{(services)} del tuo sistema operativo, devi aggiungere o modificare la configurazione esistente per riflettere l'aggiornamento della versione desiderata.
pt_br: Dependendo se o seu serviço postgres é definido implicitamente (por meio da dependência do serviço cuirass) ou por meio de sua própria entrada na propriedade @code{(services)} do seu sistema operacional, você precisa adicionar ou alterar a configuração já existente para refletir a atualização de versão pretendida.

source: Be careful not to upgrade directly to postgres-16 -- cuirass service for some reason doesn't like that. I had to find and purge the relevant files and then re-initialize after a failed upgrade to postgres 16.
it: Fai attenzione a non aggiornare direttamente a postgres-16 -- il servizio cuirass per qualche motivo non lo gradisce. Ho dovuto trovare ed eliminare i file rilevanti e poi reinizializzare dopo un aggiornamento fallito a postgres 16.
pt_br: Tenha cuidado para não atualizar diretamente para o postgres-16 -- por algum motivo, o serviço cuirass não gosta disso. Tive que encontrar e limpar os arquivos relevantes e então reinicializar após uma atualização com falha para o postgres 16.

source: Note: If you for some reason didn't read the text here but somewhat blindly followed the examples and @emph{did upgrade to 16}, here's how you reset the state:
it: Nota: Se per qualche motivo non hai letto il testo qui ma hai seguito ciecamente gli esempi e @emph{hai aggiornato alla versione 16}, ecco come reimpostare lo stato:
pt_br: Observação: Se por algum motivo você não leu esse texto, mas seguiu cegamente os exemplos a seguir e @emph{atualizou para a versão 16}, aqui está como você redefine o estado:

source: Delete the database instance files.
it: Elimina i file dell'istanza del database.
pt_br: Apague os arquivos de instância de banco de dados.

source: They default to live under @file{/var/lib/postgres/data}.
it: Per impostazione predefinita si trovano in @file{/var/lib/postgres/data}.
pt_br: Por padrão eles ficam em @file{/var/lib/postgres/data}.

source: Re-initialize postgres.
it: Reinizializza postgres.
pt_br: Reinicialize o postgres.

source: Reconfigure your system.
it: Riconfigura il tuo sistema.
pt_br: Reconfigure seu sistema.

source: Restore database contents.
it: Ripristina il contenuto del database.
pt_br: Restaure o conteúdo do banco de dados.

source: Enable and start the service.
it: Abilita e avvia il servizio.
pt_br: Habilite e inicie o serviço.
sv: Aktivera och starta tjänsten.

source: Guix is based on the @uref{https://nixos.org/nix/, Nix package manager}, which was designed and implemented by Eelco Dolstra, with contributions from other people (see the @file{nix/AUTHORS} file in Guix.) Nix pioneered functional package management, and promoted unprecedented features, such as transactional package upgrades and rollbacks, per-user profiles, and referentially transparent build processes. Without this work, Guix would not exist.
it: Guix è basato sul @uref{https://nixos.org/nix/, gestore di pacchetti Nix}, progettato e implementato da Eelco Dolstra, con contributi di altre persone (vedi il file @file{nix/AUTHORS} in Guix). Nix ha aperto la strada alla gestione funzionale dei pacchetti e ha promosso funzionalità senza precedenti, come gli aggiornamenti e i rollback transazionali dei pacchetti, i profili per utente e i processi di costruzione referenzialmente trasparenti. Senza questo lavoro, Guix non esisterebbe.
pt_br: Guix é baseado no @uref{https://nixos.org/nix/, gerenciador de pacotes Nix}, que foi projetado e implementado por Eelco Dolstra, com contribuições de outras pessoas (veja o arquivo @file{nix/AUTHORS} no Guix.) O Nix foi pioneiro no gerenciamento funcional de pacotes e promoveu recursos sem precedentes, como atualizações e reversões de pacotes transacionais, perfis por usuário e processos de construção referencialmente transparentes. Sem esse trabalho, o Guix não existiria.
sk: Guix je založený na @uref{https://nixos.org/nix/, správcovi balíkov Nix}, ktorý navrhol a vytvoril Eelco Dolstra v spolupráci s ďalšími ľudmi (viď súbor @file{nix/AUTHORS} v Guixe). Nix je pionierom vo funkcionálnej správe balíkov a predstavil nebývalé možnosti akými sú nedeliteľne vykonávané aktualizácie a návraty do pôvodného stavu, profily pre každého používateľa zvlášť, jasné a pochopiteľné zostavovacie postupy. Bez tejto práce by Guix nevznikol.

source: The Nix-based software distributions, Nixpkgs and NixOS, have also been an inspiration for Guix.
it: Le distribuzioni software basate su Nix, Nixpkgs e NixOS, sono state anche un'ispirazione per Guix.
pt_br: As distribuições de software baseadas em Nix, Nixpkgs e NixOS, também foram uma inspiração para o Guix.
ru: Дистрибутивы, основанный на Nix, Nixpkgs and NixOS, также были источником вдохновения для Guix.
sk: Guix čerpá aj z na Nixe založených riešení, Nixpkgs a NixOS.
sv: De Nix-baserade programdistributionerna Nixpkgs och NixOS har också varit en inspiration för Guix.

source: GNU@tie{}Guix itself is a collective work with contributions from a number of people. See the @file{AUTHORS} file in Guix for more information on these fine people. The @file{THANKS} file lists people who have helped by reporting bugs, taking care of the infrastructure, providing artwork and themes, making suggestions, and more---thank you!
it: GNU@tie{}Guix stesso è un lavoro collettivo con contributi di diverse persone. Consulta il file @file{AUTHORS} in Guix per maggiori informazioni su queste persone. Il file @file{THANKS} elenca le persone che hanno contribuito segnalando bug, curando l'infrastruttura, fornendo grafica e temi, dando suggerimenti e altro ancora --- grazie!
pt_br: O GNU@tie{}Guix em si é um trabalho coletivo com contribuições de várias pessoas. Veja o arquivo @file{AUTHORS} no Guix para obter mais informações sobre essas pessoas legais. O arquivo @file{THANKS} lista as pessoas que ajudaram a relatar erros, cuidar da infraestrutura, fornecer ilustrações e temas, fazer sugestões e muito mais -- obrigado!
sk: Samotný GNU@tie{}Guix je spoločným úsilím, ku ktorému prispieva množstvo ľudí. Viď súbor @file{AUTHORS} v Guixe pre viac podrobností o týchto skvelých ľuďoch. Súbor @file{THANKS} obsahuje zoznam ľudí, ktorí pomohli nahlásením chýb, obstaraním technického vybavenia, vytvorením výtvarných prvkov a motívov, zaslaním návrhov, atď. Ďakujeme!
sv: GNU@tie{}Guix självt är ett kollektivt arbete med bidrag från åtskilliga människor. Se filen @file{AUTHORS} i Guix för mer information om dessa förtjusande människor. Filen @file{THANKS} listar alla personer som har hjälpt till med att rapportera fel, sköta om infrastrukturen, tillhandahålla konstverk och teman, komma med förslag med mera---tack ska ni ha!

source: This document includes adapted sections from articles that have previously been published on the Guix blog at @uref{https://guix.gnu.org/blog} and on the Guix-HPC blog at @uref{https://hpc.guix.info/blog}.
it: Questo documento include sezioni adattate da articoli precedentemente pubblicati sul blog di Guix all'indirizzo @uref{https://guix.gnu.org/blog} e sul blog di Guix-HPC all'indirizzo @uref{https://hpc.guix.info/blog}.
pt_br: Este documento inclui seções adaptadas de artigos que foram publicados anteriormente no blog Guix em @uref{https://guix.gnu.org/blog} e no blog Guix-HPC em @uref{https://hpc.guix.info/blog}.
sk: Tento receptár zahŕňa časti prevzaté z článkov zverejnených vrámci blogu Guix na @uref{https://guix.gnu.org/blog} a blogu Guix-HPC na @uref{https://hpc.guix.info/blog}.
sv: Det här dokumentet innehåller anpassade delar från artiklar som tidigare har publicerats på Guix-bloggen på @uref{https://guix.gnu.org/blog} och på bloggen Guix-HPC på @uref{https://hpc.guix.info/blog}.

source: license, GNU Free Documentation License
it: licenza, GNU Free Documentation License
pt_br: licença, Licença de Documentação Livre GNU
ru: лицензия, GNU Free Documentation License
sk: licencia, GNU Free Documentation License
sv: licens, GNU Free Documentation License

source: Copyright @copyright{} 2019, 2022 Ricardo Wurmus@* Copyright @copyright{} 2019 Efraim Flashner@* Copyright @copyright{} 2019 Pierre Neidhardt@* Copyright @copyright{} 2020 Oleg Pykhalov@* Copyright @copyright{} 2020 Matthew Brooks@* Copyright @copyright{} 2020 Marcin Karpezo@* Copyright @copyright{} 2020 Brice Waegeneire@* Copyright @copyright{} 2020 André Batista@* Copyright @copyright{} 2020 Christine Lemmer-Webber@* Copyright @copyright{} 2021 Joshua Branson@* Copyright @copyright{} 2022, 2023 Maxim Cournoyer@* Copyright @copyright{} 2023-2024 Ludovic Courtès@* Copyright @copyright{} 2023 Thomas Ieong@* Copyright @copyright{} 2024 Florian Pelz@* Copyright @copyright{} 2025 45mg@*
pt_br: Direitos autorais @copyright{} 2019, 2022 Ricardo Wurmus@* Direitos autorais @copyright{} 2019 Efraim Flashner@* Direitos autorais @copyright{} 2019 Pierre Neidhardt@* Direitos autorais @copyright{} 2020 Oleg Pykhalov@* Direitos autorais @copyright{} 2020 Matthew Brooks@* Direitos autorais @copyright{} 2020 Marcin Karpezo@* Direitos autorais @copyright{} 2020 Brice Waegeneire@* Direitos autorais @copyright{} 2020 André Batista@* Direitos autorais @copyright{} 2020 Christine Lemmer-Webber@* Direitos autorais @copyright{} 2021 Joshua Branson@* Direitos autorais @copyright{} 2022, 2023 Maxim Cournoyer@* Direitos autorais @copyright{} 2023-2024 Ludovic Courtès@* Direitos autorais @copyright{} 2023 Thomas Ieong@* Direitos autorais @copyright{} 2024 Florian Pelz@* Direitos autorais @copyright{} 2025 45mg@*

source: This manual is also available in French (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), German (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), Korean (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), Spanish (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), Brazilian Portuguese (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), Russian (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), Slovak (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}), and Swedish (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}). If you would like to translate this document in your native language, consider joining @uref{https://translate.fedoraproject.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Translating Guix,,, guix, GNU Guix Reference Manual}).
pt_br: Esse manual também está disponível em inglês (@pxref{Top,,, guix-cookbook, GNU Guix Cookbook}), francês (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), alemão (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), na língua coreana (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), em espanhol (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), russo (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), eslovaco (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}) e sueco (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}). Se você gostaria de contribuir com a tradução deste documento em sua língua nativa, considere se juntar a nós @uref{https://translate.fedoraproject.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Traduzindo o Guix,,, guix.pt_BR, Manual de referência do GNU Guix}).
sk: Táto príručka je dostupná aj v angličtine (@pxref{Top,,, guix-cookbook, GNU Guix Cookbook}), francúzštine (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), nemčine (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), kórejčine (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), španielčine (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), brazílskej portugalčine (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), ruštine (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}) a švédčine (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}). Ak chcete pomôcť s prekladom tohto dokumentu do vášho rodného jazyka, pripojte sa k @uref{https://translate.fedoraproject.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Translating Guix,,, guix, GNU Guix Reference Manual}).

source: "Hello World!" @result{} "Hello World!"
es: "¡Hola Mundo!" @result{} "¡Hola Mundo!"
pt_br: "Olá mundo!" @result{} "Olá mundo!"
ru: "Привет Мир!" @result{} "Привет Мир!"
sk: "Ahoj svet!" @result{} "Ahoj svet!"

source: (lambda (x) (* x x)) @result{} #<procedure 120e348 at <unknown port>:24:0 (x)>
pt_br: (lambda (x) (* x x)) @result{} #<procedimento 120e348 em <porta desconhecida>:24:0 (x)>

source: S-expression
es: expresión-S
pt_br: expressão simbólica ("S-expression")
ru: S-выражение
sk: S-výraz
sv: S-uttryck

source: mkdir ~/my-channel
es: mkdir ~/mi-canal
pt_br: mkdir ~/meu-canal
sk: mkdir ~/moj-kanal

source: guix show -L ~/my-channel my-hello guix build -L ~/my-channel my-hello
es: guix show -L ~/mi-canal my-hello guix build -L ~/mi-canal my-hello
pt_br: guix show -L ~/meu-canal my-hello guix build -L ~/meu-canal my-hello
sk: guix show -L ~/moj-kanal my-hello guix build -L ~/moj-kanal my-hello

source: (append (list (channel (name 'my-channel) (url (string-append "file://" (getenv "HOME") "/my-channel")))) %default-channels)
es: (append (list (channel (name 'mi-canal) (url (string-append "file://" (getenv "HOME") "/mi-canal")))) %default-channels)
pt_br: (append (list (channel (name 'meu-canal) (url (string-append "file://" (getenv "HOME") "/meu-canal")))) %default-channels)
sk: (append (list (channel (name 'moj-kanal) (url (string-append "file://" (getenv "HOME") "/moj-kanal")))) %default-channels)

source: Code staging
es: Puesta en escena del código
pt_br: Preparação de código
sk: Oddialené vykonanie

source: See the @uref{https://www.gnu.org/software/guix/contact/, Guix homepage} for information on the mailing lists, IRC, etc.
pt_br: Consulte @uref{https://www.gnu.org/software/guix/contact/, página inicial do Guix} para obter informações sobre listas de discussão, IRC, etc.
sk: Viď @uref{https://www.gnu.org/software/guix/contact/, Guix homepage} pre podrobnosti o elektronických konferenciách, IRC, atď.

source: The @uref{https://www.gnu.org/software/guix/manual/en/html_node/Defining-Packages.html, package reference in the manual}
pt_br: O @uref{https://www.gnu.org/software/guix/manual/en/html_node/Defining-Packages.html, referência do pacote no manual}
sk: @uref{https://www.gnu.org/software/guix/manual/en/html_node/Defining-Packages.html, odvolávka na „package“ v príručke}

source: @uref{https://www.gnu.org/software/guix/guix-ghm-andreas-20130823.pdf, ``GNU Guix: Package without a scheme!''}, by Andreas Enge
pt_br: @uref{https://www.gnu.org/software/guix/guix-ghm-andreas-20130823.pdf, ``GNU Guix: Pacote sem Scheme!''}, por Andreas Enge
sk: @uref{https://www.gnu.org/software/guix/guix-ghm-andreas-20130823.pdf, „GNU Guix: Package without a scheme!“}, od Andreasa Engeho

source: There are two ways to create a kernel with a custom kernel configuration. The first is to provide a standard @file{defconfig} to @code{customize-linux} procedure. To produce such file you need to obtain Linux source code, create a @file{.config} file (using @code{make menuconfig} command, for example) or provide one you already have. After that you will need to run @code{make savedefconfig} command within the kernel source tree---this will produce the @file{defconfig} file which we can be used to build a custom kernel.
pt_br: Há duas maneiras de criar um kernel com configuração customizada. A primeira é provendo um arquivo padrão @file{defconfig} para que @code{customize-linux} o processe. Para produzir tal arquivo, você precisa obter o código fonte do Linux, criar um arquivo @file{.config} (usando o comando @code{make menuconfig}, por exemplo) ou prover um arquivo que você já tenha. Depois disso você precisará rodar o comando @code{make savedefconfig} dentro do diretório do código fonte do Linux---isso irá produzir o arquivo @file{defconfig} que podemos usar para compilar um kernel customizado.

source: In the same directory as the file defining @code{my-linux-libre} is a file named @file{defconfig}. This way you way you can provide kernel options you want to have in the result kernel.
pt_br: No mesmo diretório do arquivo definindo @code{my-linux-libre} há um arquivo chamado @file{defconfig}. Dessa maneira você pode fornecer opções de kernel que você queira que o kernel resultante tenha.

source: (define %macbook41-full-config (append %macbook41-config-options %file-systems %efi-support %emulation ((@@@@ (gnu packages linux) default-extra-linux-options) version)))
pt_br: (define %macbook41-full-config (append %macbook41-config-options %file-systems %efi-support %emulation (@@@@ (gnu packages linux) %default-extra-linux-options)))

source: sessionlock
es: bloqueo de sesión
pt_br: bloqueio de sessão
sk: uzamykanie sedenia
sv: sessionslås

source: $ guix shell --container --share=/etc=/the/host/etc coreutils $ ls /the/host/etc
pt_br: $ guix shell --container --share=/etc=/etc/do/hospedeiro coreutils $ ls /etc/do/hospedeiro
sk: $ guix shell --container --share=/etc=/hosť/etc coreutils $ ls /hosť/etc

source: networking, bridge
es: redes, puente
pt_br: rede, ponte

source: lan
pt_br: rede local

source: (service dnsmasq-service-type (dnsmasq-configuration ;; You can have multiple instances of `dnsmasq-service-type` as long ;; as each one has a different provision. (provision '(dnsmasq-virbr0)) (extra-options (list ;; Only bind to the virtual bridge. This ;; avoids conflicts with other running ;; dnsmasq instances. "--except-interface=lo" "--interface=virbr0" "--bind-dynamic" ;; IPv4 addresses to offer to VMs. This ;; should match the chosen subnet. "--dhcp-range=192.168.10.2,192.168.10.254"))))
pt_br: (service dnsmasq-service-type (dnsmasq-configuration ;; Você pode ter múltiplas instâncias de `dnsmasq-service-type` desde ;; que cada uma tenha um provisionamento (provision) diferente. (provision '(dnsmasq-virbr0)) (extra-options (list ;; Somente liga à ponte virtual. Isso ;; evita conflitos com outras instâncias ;; de dnsmasq em execução. "--except-interface=lo" "--interface=virbr0" "--bind-dynamic" ;; Endereços IPv4 oferecidos para VMs. ;; Isso deve corresponder à sub-rede escolhida. "--dhcp-range=192.168.10.2,192.168.10.254"))))

source: for i in "$GUIX_EXTRA_PROFILES"/my-project-1 "$GUIX_EXTRA_PROFILES"/my-project-2; do profile=$i/$(basename "$i") if [ -f "$profile"/etc/profile ]; then GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi unset profile done
pt_br: for i in "$GUIX_EXTRA_PROFILES"/meu-projeto-1 "$GUIX_EXTRA_PROFILES"/meu-projeto-2; do profile=$i/$(basename "$i") if [ -f "$profile"/etc/profile ]; then GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi unset profile done
sk: for i in "$GUIX_DOPLNKOVE_PROFILY"/moj-projekt-1 "$GUIX_DOPLNKOVE_PROFILY"/moj-projekt-2; do profile=$i/$(basename "$i") if [ -f "$profile"/etc/profile ]; then GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi unset profile done

source: guix package -p "$GUIX_EXTRA_PROFILES"/my-project/my-project --list-generations
pt_br: guix package -p "$GUIX_EXTRA_PROFILES"/meu-projeto/meu-projeto --list-generations
sk: guix package -p "$GUIX_DOPLNKOVE_PROFILY"/moj-projekt/moj-projekt --list-generations

source: guix package -p "$GUIX_EXTRA_PROFILES"/my-project/my-project --switch-generations=17
pt_br: guix package -p "$GUIX_EXTRA_PROFILES"/meu-projeto/meu-projeto --switch-generations=17
sk: guix package -p "$GUIX_DOPLNKOVE_PROFILY"/moj-projekt/moj-projekt --switch-generations=17

source: env -i $(which bash) --login --noprofile --norc . my-project/etc/profile
pt_br: env -i $(which bash) --login --noprofile --norc . meu-projeto/etc/profile
sk: env -i $(which bash) --login --noprofile --norc . moj-projekt/etc/profile

source: mkdir -p "$GUIX_EXTRA"/my-project guix pull --channels=channel-specs.scm --profile="$GUIX_EXTRA/my-project/guix"
pt_br: mkdir -p "$GUIX_EXTRA"/meu-projeto guix pull --channels=channel-specs.scm --profile="$GUIX_EXTRA/meu-projeto/guix"
sk: mkdir -p "$GUIX_DOPLNKY"/moj-projekt guix pull --channels=urcenie-kanalov.scm --profile="$GUIX_DOPLNKY/moj-projekt/guix"

source: (define a 3) (define square (lambda (x) (* x x))) (square a) @result{} 9
sk: (define a 3) (define druha-mocnina (lambda (x) (* x x))) (druha-mocnina a) @result{} 9

source: (define (square x) (* x x))
sk: (define (druha-mocnina x) (* x x))

source: gexp
sk: gvýraz

source: ungexp
sk: odgvýraziť

source: @code{(replace @var{phase} @var{procedure})}.
es: @code{(sustituye @var{phase} @var{procedure})}.
sk: @code{(replace @var{krok} @var{funkcia})}.

source: @code{(delete @var{phase})}.
es: @code{(elimina @var{phase})}.
sk: @code{(delete @var{krok})}.

source: guix system image my-os.scm
es: guix imagen del sistema my-os.scm
sk: guix system image moj-os.scm

source: guix system image --image-type=pine64-raw my-os.scm
sk: guix system image --image-type=pine64-raw moj-os.scm

source: (image (format 'disk-image) (target "aarch64-linux-gnu") (operating-system my-os) (partitions (list (partition (inherit root-partition) (offset root-offset)))))
sk: (image (format 'disk-image) (target "aarch64-linux-gnu") (operating-system moj-os) (partitions (list (partition (inherit root-partition) (offset root-offset)))))

source: (let ((base-os pine64-barebones-os)) (operating-system (inherit base-os) (timezone "America/Indiana/Indianapolis") (services (cons (service earlyoom-service-type (earlyoom-configuration (prefer-regexp "icecat|chromium"))) (operating-system-user-services base-os)))))
sk: (let ((base-os pine64-barebones-os)) (operating-system (inherit base-os) (timezone "Europe/Bratislava") (services (cons (service earlyoom-service-type (earlyoom-configuration (prefer-regexp "icecat|chromium"))) (operating-system-user-services base-os)))))

source: guix system image --image-type=pine64-raw my-pine-os.scm
sk: guix system image --image-type=pine64-raw moj-os.scm
