Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The sections below describe each of these two configurations in more detail and summarize the kind of build isolation they provide.
it: Le sezioni seguenti descrivono ciascuna di queste due configurazioni in modo più dettagliato e riassumono il tipo di isolamento di build che forniscono.

source: Daemon Running as Root
it: Demone in esecuzione come Root

source: The @code{guix-daemon} program may then be run as @code{root} with the following command@footnote{If your machine uses the systemd init system, copying the @file{@var{prefix}/lib/systemd/system/guix-daemon.service} file to @file{/etc/systemd/system} will ensure that @command{guix-daemon} is automatically started. Similarly, if your machine uses the Upstart init system, copy the @file{@var{prefix}/lib/upstart/system/guix-daemon.conf} file to @file{/etc/init}.}:
it: Il programma @code{guix-daemon} può quindi essere eseguito come @code{root} con il seguente comando@footnote{Se la tua macchina usa il sistema di init systemd, copiare il file @file{@var{prefix}/lib/systemd/system/guix-daemon.service} in @file{/etc/systemd/system} garantirà che @command{guix-daemon} venga avviato automaticamente. Allo stesso modo, se la tua macchina usa il sistema di init Upstart, copia il file @file{@var{prefix}/lib/upstart/system/guix-daemon.conf} in @file{/etc/init}.}:

source: In this setup, @file{/gnu/store} is owned by @code{root}.
it: In questa configurazione, @file{/gnu/store} è di proprietà di @code{root}.

source: Daemon Running Without Privileges
it: Demone in esecuzione senza privilegi

source: rootless build daemon
it: demone di build rootless

source: unprivileged build daemon
it: demone di build non privilegiato

source: build daemon, unprivileged
it: demone di build, non privilegiato

source: The second and preferred option is to run @command{guix-daemon} @emph{as an unprivileged user}. It has the advantage of reducing the harm that can be done should a build process manage to exploit a vulnerability in the daemon. This option requires the use of Linux's unprivileged user namespace mechanism; today it is available and enabled by most GNU/Linux distributions but can still be disabled. The installation script automatically determines whether this option is available on your system (@pxref{Binary Installation}).
it: La seconda e preferita opzione è eseguire @command{guix-daemon} @emph{come utente non privilegiato}. Ha il vantaggio di ridurre il danno che può essere fatto se un processo di build riesce a sfruttare una vulnerabilità nel demone. Questa opzione richiede l'uso del meccanismo di namespace utente non privilegiato di Linux; oggi è disponibile e abilitato sulla maggior parte delle distribuzioni GNU/Linux, ma può ancora essere disabilitato. Lo script di installazione determina automaticamente se questa opzione è disponibile sul tuo sistema (@pxref{Binary Installation}).

source: When using this option, you only need to create one user account, and @command{guix-daemon} will run with the authority of that account:
it: Quando si usa questa opzione, è necessario creare un solo account utente, e @command{guix-daemon} verrà eseguito con l'autorità di quell'account:

source: # groupadd --system guix-daemon # useradd -g guix-daemon -G guix-daemon \ -d /var/empty -s $(which nologin) \ -c "Guix daemon privilege separation user" \ --system guix-daemon
it: # groupadd --system guix-daemon # useradd -g guix-daemon -G guix-daemon \ -d /var/empty -s $(which nologin) \ -c "Utente separazione privilegi demone Guix" \ --system guix-daemon

source: In this configuration, @file{/gnu/store} is owned by the @code{guix-daemon} user.
it: In questa configurazione, @file{/gnu/store} è di proprietà dell'utente @code{guix-daemon}.

source: Migrating to the Unprivileged Daemon
it: Migrazione al demone non privilegiato

source: unprivileged daemon, migration
it: demone non privilegiato, migrazione

source: rootless daemon, migration
it: demone rootless, migrazione

source: To switch an existing installation to the unprivileged execution mode, a number of steps must be taken: creating a new dedicated @code{guix-daemon} user account, changing ownership of the relevant files to @code{guix-daemon}, and ensuring that the @command{guix-daemon} program runs as @code{guix-daemon}.
it: Per passare una installazione esistente alla modalità di esecuzione non privilegiata, devono essere eseguiti alcuni passaggi: creare un nuovo account utente dedicato @code{guix-daemon}, cambiare la proprietà dei file pertinenti a @code{guix-daemon}, e assicurarsi che il programma @command{guix-daemon} venga eseguito come @code{guix-daemon}.

source: On Guix System, these steps are carried out automatically when you set the @code{privileged?} field of the @code{guix-configuration} record to @code{#f} and reconfigure (@pxref{guix-configuration-type, @code{guix-configuration}}).
it: Su Guix System, questi passaggi vengono eseguiti automaticamente quando si imposta il campo @code{privileged?} del record @code{guix-configuration} su @code{#f} e si riconfigura (@pxref{guix-configuration-type, @code{guix-configuration}}).

source: However, on a foreign distribution, the process is manual. The following paragraphs describe what you need to do.
it: Tuttavia, su una distribuzione esterna, il processo è manuale. I seguenti paragrafi descrivono cosa è necessario fare.

source: Follow the instructions below only after making sure you have a recent version of @command{guix-daemon} with support for unprivileged execution.
it: Segui le istruzioni seguenti solo dopo esserti assicurato di avere una versione recente di @command{guix-daemon} con supporto per l'esecuzione non privilegiata.

source: File ownership can be changed, after stopping the daemon, by running the following commands as root (the @command{chown} can take a while if there are many files in @file{/gnu/store}):
it: La proprietà dei file può essere cambiata, dopo aver fermato il demone, eseguendo i seguenti comandi come root (il comando @command{chown} può richiedere del tempo se ci sono molti file in @file{/gnu/store}):

source: groupadd --system guix-daemon useradd -g guix-daemon -G guix-daemon,kvm \ -d /var/empty -s $(which nologin) \ -c "Guix daemon privilege separation user" \ --system guix-daemon
it: groupadd --system guix-daemon useradd -g guix-daemon -G guix-daemon,kvm \ -d /var/empty -s $(which nologin) \ -c "Utente separazione privilegi demone Guix" \ --system guix-daemon

source: # Make the store writable, in case the systemd 'gnu-store.mount' # unit made it read-only. mount -o remount,rw /gnu/store
it: # Rendi lo store scrivibile, nel caso l'unità systemd 'gnu-store.mount' # l'avesse reso di sola lettura. mount -o remount,rw /gnu/store

source: If your system uses the systemd service manager, running the daemon as @code{guix-daemon} will be a matter of copying the relevant configuration files---make sure to review any changes you might have made in your own @file{.service} files before overwriting them:
it: Se il tuo sistema usa il gestore di servizi systemd, eseguire il demone come @code{guix-daemon} sarà una questione di copiare i file di configurazione pertinenti - assicurati di rivedere eventuali modifiche che potresti aver fatto nei tuoi file @file{.service} prima di sovrascriverli:

source: The commands above assume that @command{guix pull} was run for the root user. You can check whether this is the case by running this command:
it: I comandi sopra assumono che @command{guix pull} sia stato eseguito per l'utente root. Puoi verificare se questo è il caso eseguendo questo comando:

source: If that command does not show the @code{User=guix-daemon} line, then run @command{guix pull} as the root user.
it: Se quel comando non mostra la riga @code{User=guix-daemon}, allora esegui @command{guix pull} come utente root.

source: The Isolated Build Environment
it: L'ambiente di build isolato

source: build environment isolation
it: isolamento dell'ambiente di build

source: isolated build environment
it: ambiente di build isolato

source: hermetic build environment
it: ambiente di build ermetico

source: In both cases, privileged and unprivileged, the daemon starts build processes without privileges in an @emph{isolated} or @emph{hermetic} build environment---a ``chroot''. On GNU/Linux, by default, the build environment contains nothing but:
it: In entrambi i casi, privilegiato e non privilegiato, il demone avvia i processi di build senza privilegi in un ambiente di build @emph{isolated} o @emph{hermetic} - un ``chroot''. Su GNU/Linux, per impostazione predefinita, l'ambiente di build non contiene altro che:

source: (list (build-machine (name "eightysix.example.org") (systems (list "x86_64-linux" "i686-linux")) (host-key "ssh-ed25519 AAAAC3Nza@dots{}") (user "bob") (speed 2.)) ;incredibly fast!
it: (list (build-machine (name "eightysix.example.org") (systems (list "x86_64-linux" "i686-linux")) (host-key "ssh-ed25519 AAAAC3Nza@dots{}") (user "bob") (speed 2.)) ;incredibilmente veloce!

source: systems
it: sistemi

source: The user account on the remote machine to use when connecting over SSH. Note that the SSH key pair must @emph{not} be passphrase-protected, to allow non-interactive logins.
it: L'account utente sulla macchina remota da usare per la connessione via SSH. Nota che la coppia di chiavi SSH @emph{not} deve essere protetta da passphrase, per consentire accessi non interattivi.

source: @code{overload-threshold} (default: @code{0.8})
it: @code{overload-threshold} (predefinito: @code{0.8})

source: offload test
it: test di offload

source: offload status
it: stato dell'offload

source: @code{guix_daemon_socket_t} isn’t actually used. None of the socket operations involve contexts that have anything to do with @code{guix_daemon_socket_t}. It doesn’t hurt to have this unused label, but it would be preferable to define socket rules for only this label.
it: @code{guix_daemon_socket_t} non è effettivamente utilizzato. Nessuna delle operazioni sulle socket coinvolge contesti che abbiano a che fare con @code{guix_daemon_socket_t}. Non fa male avere questa etichetta inutilizzata, ma sarebbe preferibile definire regole per le socket solo per questa etichetta.

source: socket activation, for @command{guix-daemon}
it: attivazione socket, per @command{guix-daemon}

source: Voilà!
it: Ecco fatto!

source: G-expression
it: espressione-G

source: Shells Home Services
it: Servizi Home per le Shell

source: Mcron Home Service
it: Servizio Home Mcron

source: Power Management Home Services
it: Servizi Home di gestione energetica

source: Shepherd Home Service
it: Servizio Home Shepherd
