Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: $ ./etc/teams.scm list-teams id: mentors name: Mentors description: A group of mentors who chaperone contributions by newcomers. members: + Charlie Smith <charlie@@example.org> @dots{}
it: $ ./etc/teams.scm list-teams id: mentors name: Mentors description: Un gruppo di mentori che accompagnano i contributi dei nuovi arrivati. members: + Charlie Smith <charlie@@example.org> @dots{}

source: Teams defined in @file{etc/teams.scm} are reflected @uref{https://codeberg.org/guix/guix, on Codeberg}; the ``Owners'' team on Codeberg, whose members have administration privileges over @uref{https://codeberg.org/guix, the entire ``organization''}, is the only one missing from this file. To synchronize team changes with Codeberg, a member of the ``Owners'' team can run:
it: I team definiti in @file{etc/teams.scm} sono riflessi su @uref{https://codeberg.org/guix/guix, Codeberg}; il team ``Owners'' su Codeberg, i cui membri hanno privilegi di amministrazione sull'intera ``organizzazione'' (@uref{https://codeberg.org/guix, intera 'organizzazione'}), è l'unico mancante da questo file. Per sincronizzare le modifiche dei team con Codeberg, un membro del team ``Owners'' può eseguire:

source: Reverting commits
it: Revert dei commit

source: Like normal commits, the commit message should state why the changes are being made, which in this case would be why the commits are being reverted.
it: Come i commit normali, il messaggio di commit dovrebbe dichiarare perché le modifiche vengono apportate, che in questo caso sarebbe perché i commit vengono revertati.

source: If the changes are being reverted because they led to excessive number of packages being affected, then a decision should be made whether to allow the build farms to build the changes, or whether to avoid this. For the bordeaux build farm, commits can be ignored by adding them to the @code{ignore-commits} list in the @code{build-from-guix-data-service} record, found in the bayfront machine configuration.
it: Se le modifiche vengono revertate perché hanno portato a un numero eccessivo di pacchetti interessati, allora dovrebbe essere presa una decisione se permettere alle build farm di costruire le modifiche o se evitarlo. Per la build farm di bordeaux, i commit possono essere ignorati aggiungendoli alla lista @code{ignore-commits} nel record @code{build-from-guix-data-service}, trovato nella configurazione della macchina bayfront.

source: Commit Revocation
it: Revoca dei Commit

source: Perhaps the biggest action you can do to help GNU Guix grow as a project is to review the work contributed by others. You do not need to be a committer to do so; applying, reading the source, building, linting and running other people's series and sharing your comments about your experience will give some confidence to committers. You must ensure the check list found in the @ref{Submitting Patches} section has been correctly followed. A reviewed patch series should give the best chances for the proposed change to be merged faster, so if a change you would like to see merged hasn't yet been reviewed, this is the most appropriate thing to do! If you would like to review changes in a specific area and to receive notifications for incoming patches relevant to that domain, consider joining the relevant team(s) (@pxref{Teams}).
it: Forse l'azione più grande che puoi fare per aiutare GNU Guix a crescere come progetto è revisionare il lavoro contribuito da altri. Non devi essere un committer per farlo; applicare, leggere il sorgente, costruire, lintare ed eseguire le serie di altre persone e condividere i tuoi commenti sulla tua esperienza darà una certa fiducia ai committer. Devi assicurarti che la lista di controllo trovata nella sezione @ref{Submitting Patches} sia stata seguita correttamente. Una serie di patch revisionata dovrebbe dare le migliori possibilità affinché la modifica proposta sia unita più velocemente, quindi se una modifica che vorresti vedere unita non è ancora stata revisionata, questa è la cosa più appropriata da fare! Se desideri revisionare modifiche in un'area specifica e ricevere notifiche per patch in arrivo rilevanti per quel dominio, considera di unirti ai team pertinenti (@pxref{Teams}).

source: reviewing, guidelines
it: revisione, linee guida

source: @emph{Review is a discussion.} The submitter's and reviewer's views on how to achieve a particular change may not always be aligned. To lead the discussion, remain focused, ensure progress and aim for finalization, spending time proportional to the stakes@footnote{The tendency to discuss minute details at length is often referred to as ``bikeshedding'', where much time is spent discussing each one's preference for the color of the shed at the expense of progress made on the project to keep bikes dry.}. As a reviewer, try hard to explain the rationale for suggestions you make, and to understand and take into account the submitter's motivation for doing things in a certain way. In other words, build consensus with everyone involved (@pxref{Making Decisions}).
it: @emph{La revisione è una discussione.} Le opinioni del mittente e del revisore su come ottenere un particolare cambiamento potrebbero non essere sempre allineate. Per guidare la discussione, rimani concentrato, assicura il progresso e mira alla finalizzazione, spendendo tempo proporzionale alla post@footnote{La tendenza a discutere a lungo di dettagli minuti è spesso chiamata ``bikeshedding'', dove si passa molto tempo a discutere la preferenza di ognuno per il colore del capanno a scapito del progresso fatto sul progetto per tenere le bici asciutte.}. Come revisore, sforzati di spiegare la logica dei suggerimenti che fai e di capire e tenere conto della motivazione del mittente nel fare le cose in un certo modo. In altre parole, costruisci consenso con tutti i coinvolti (@pxref{Making Decisions}).

source: When you deem the proposed change adequate and ready for inclusion in Guix, you can explicitly say so for pull requests on Codeberg, for example by selecting ``Approve changes'' in the ``Finish review'' dialog of the web interface.
it: Quando ritieni che la modifica proposta sia adeguata e pronta per l'inclusione in Guix, puoi dirlo esplicitamente per le pull request su Codeberg, ad esempio selezionando ``Approva modifiche'' nella finestra di dialogo ``Termina revisione'' dell'interfaccia web.

source: The following well understood/codified @samp{Reviewed-by:@tie{}Your@tie{}Name@tie{}<your-email@@example.com>} @footnote{The @samp{Reviewed-by} Git trailer is used by other projects such as Linux, and is understood by third-party tools such as the @samp{b4 am} sub-command, which is able to retrieve the complete submission email thread from a public-inbox instance and add the Git trailers found in replies to the commit patches.} line should be used to sign off as a reviewer, meaning you have reviewed the change and that it looks good to you:
it: La seguente riga @samp{Reviewed-by:@tie{}Tuo@tie{}Nome@tie{}<tua-email@@example.com>} ben compresa/codificata@footnote{Il trailer Git @samp{Reviewed-by} è usato da altri progetti come Linux, ed è compreso da strumenti di terze parti come il sottocomando @samp{b4 am}, che è in grado di recuperare l'intero thread di email di sottomissione da un'istanza public-inbox e aggiungere i trailer Git trovati nelle risposte alle patch dei commit.} dovrebbe essere usata per firmare come revisore, il che significa che hai revisionato la modifica e che per te va bene:

source: package-removal-policy
it: politica-di-rimozione-pacchetto

source: (define-record-type* <operating-system> ;; @dots{} (hosts-file %operating-system-hosts-file ;deprecated (default #f) (sanitize warn-hosts-file-field-deprecation)))
it: (define-record-type* <operating-system> ;; @dots{} (hosts-file %operating-system-hosts-file ;obsoleto (default #f) (sanitize warn-hosts-file-field-deprecation)))

source: website
it: sito web

source: #. TRANSLATORS: Defining Packages is a section name #. in the English (en) manual. #: apps/base/templates/about.scm:64 msgid "Packages are <1>defined<1.1>en</1.1><1.2>Defining-Packages.html</1.2></1> as native <2>Guile</2> modules." msgstr "Pakete werden als reine <2>Guile</2>-Module <1>definiert<1.1>de</1.1><1.2>Pakete-definieren.html</1.2></1>."
it: #. TRADUTTORI: Defining Packages è un nome di sezione #. nel manuale inglese (en). #: apps/base/templates/about.scm:64 msgid "Packages are <1>defined<1.1>en</1.1><1.2>Defining-Packages.html</1.2></1> as native <2>Guile</2> modules." msgstr "I pacchetti sono <1>definiti<1.1>it</1.1><1.2>Definizione-dei-pacchetti.html</1.2></1> come moduli nativi <2>Guile</2>."

source: The project runs many Guix-specific services; this is all lovely Scheme code but it tends to receive less attention than Guix itself:
it: Il progetto esegue molti servizi specifici di Guix; questo è tutto codice Scheme adorabile ma tende a ricevere meno attenzione di Guix stesso:

source: @url{https://codeberg.org/guix/maintenance/src/branch/master/hydra/goggles.scm, Goggles} (IRC logger)
it: @url{https://codeberg.org/guix/maintenance/src/branch/master/hydra/goggles.scm, Goggles} (logger IRC)

source: @url{https://codeberg.org/luis-felipe/guix-packages-website, Guix Packages Website}
it: @url{https://codeberg.org/luis-felipe/guix-packages-website, Sito Web dei Pacchetti Guix}

source: There is no time constraint on this coding activity: any improvement is welcome, whenever it comes. Most of these code bases are relatively small, which should make it easier to get started.
it: Non ci sono vincoli di tempo per questa attività di codifica: qualsiasi miglioramento è benvenuto, ogni volta che arriva. La maggior parte di queste basi di codice sono relativamente piccole, il che dovrebbe rendere più facile iniziare.

source: The two front-ends are @file{berlin.scm} (the machine behind ci.guix.gnu.org) and @file{bayfront.scm} (the machine behind bordeaux.guix.gnu.org, guix.gnu.org, hpc.guix.info, qa.guix.gnu.org, and more). Both connect to a number of build machines and helpers.
it: I due front-end sono @file{berlin.scm} (la macchina dietro ci.guix.gnu.org) e @file{bayfront.scm} (la macchina dietro bordeaux.guix.gnu.org, guix.gnu.org, hpc.guix.info, qa.guix.gnu.org e altro). Entrambi si connettono a una serie di macchine di compilazione e helper.

source: Improve infra monitoring: set up a dashboard to monitor all the infrastructure, and an out-of-band channel to communicate about downtime.
it: Migliorare il monitoraggio dell'infrastruttura: impostare una dashboard per monitorare tutta l'infrastruttura e un canale fuori banda per comunicare i tempi di inattività.

source: Implement web site redundancy: guix.gnu.org should be backed by several machines on different sites. Get in touch with us and/or send a patch!
it: Implementare la ridondanza del sito web: guix.gnu.org dovrebbe essere supportato da diverse macchine su siti diversi. Mettiti in contatto con noi e/o invia una patch!

source: Implement substitute redundancy: likewise, bordeaux.guix.gnu.org and ci.guix.gnu.org should be backed by several head nodes.
it: Implementare la ridondanza dei sostituti: allo stesso modo, bordeaux.guix.gnu.org e ci.guix.gnu.org dovrebbero essere supportati da diversi nodi head.

source: Improve backup: there's currently ad-hoc backup of selected pieces over rsync between the two head nodes; we can improve on that, for example with a dedicated backup site and proper testing of recoverability.
it: Migliorare il backup: attualmente c'è un backup ad-hoc di parti selezionate tramite rsync tra i due nodi head; possiamo migliorarlo, ad esempio con un sito di backup dedicato e un adeguato test di recuperabilità.

source: Support mirroring: We'd like to make it easy for others to mirror substitutes from ci.guix and bordeaux.guix, perhaps by offering public rsync access.
it: Supportare il mirroring: vorremmo rendere facile per altri fare mirror dei sostituti da ci.guix e bordeaux.guix, magari offrendo accesso rsync pubblico.

source: Optimize our web services: Monitor the performance of our services and tweak nginx config or whatever it takes to improve it.
it: Ottimizzare i nostri servizi web: monitorare le prestazioni dei nostri servizi e modificare la configurazione di nginx o qualsiasi cosa sia necessaria per migliorarla.

source: There is no time constraint on this activity: any improvement is welcome, whenever you can work on it.
it: Non ci sono vincoli di tempo per questa attività: qualsiasi miglioramento è benvenuto, ogni volta che puoi lavorarci.

source: Prerequisite: Familiarity with Guix System administration and ideally with the infrastructure handbook:
it: Prerequisito: Familiarità con l'amministrazione di Guix System e idealmente con il manuale dell'infrastruttura:

source: We're also looking for people who'd be willing to have SSH access to some of the infrastructure to help with day-to-day maintenance: restarting a build, restarting the occasional service that has gone wild (that can happen), reconfiguring/upgrading a machine, rebooting, etc.
it: Cerchiamo anche persone disposte ad avere accesso SSH ad alcune parti dell'infrastruttura per aiutare con la manutenzione giornaliera: riavviare una compilazione, riavviare il servizio occasionale che è impazzito (può succedere), riconfigurare/aggiornare una macchina, riavviare, ecc.

source: This day-to-day activity requires you to be available some of the time (during office hours or not, during the week-end or not), whenever is convenient for you, so you can react to issues reported on IRC, on the mailing list, or elsewhere, and synchronize with other sysadmins.
it: Questa attività giornaliera richiede che tu sia disponibile in alcuni momenti (durante l'orario d'ufficio o meno, durante il fine settimana o meno), ogni volta che è conveniente per te, in modo da poter reagire ai problemi segnalati su IRC, sulla mailing list o altrove, e sincronizzarti con altri amministratori di sistema.

source: Prerequisite: Being a ``known'' member of the community, familiarity with Guix System administration, with some of the services/web sites being run, and with the infrastructure handbook:
it: Prerequisito: Essere un membro ``noto'' della comunità, familiarità con l'amministrazione di Guix System, con alcuni dei servizi/siti web in esecuzione e con il manuale dell'infrastruttura:

source: The first front-end is currently generously hosted by the Max Delbrück Center (MDC), a research institute in Berlin, Germany. Only authorized personnel can physically access it.
it: Il primo front-end è attualmente generosamente ospitato dal Max Delbrück Center (MDC), un istituto di ricerca a Berlino, Germania. Solo il personale autorizzato può accedervi fisicamente.

source: The second one, bordeaux.guix.gnu.org, is hosted in Bordeaux, France, in a professional data center shared with non-profit ISP Aquilenet. If you live in the region of Bordeaux and would like to help out when we need to go on-site, please make yourself known by emailing @email{guix-sysadmin@@gnu.org}.
it: Il secondo, bordeaux.guix.gnu.org, è ospitato a Bordeaux, Francia, in un data center professionale condiviso con l'ISP no-profit Aquilenet. Se vivi nella regione di Bordeaux e vorresti aiutare quando dobbiamo intervenire in sito, fatti conoscere inviando un'email a @email{guix-sysadmin@@gnu.org}.

source: On-site interventions are rare, but they're usually in response to an emergency.
it: Gli interventi in sito sono rari, ma di solito sono in risposta a un'emergenza.

source: We're looking for people who can host machines and help out whenever physical access is needed. More specifically:
it: Cerchiamo persone che possano ospitare macchine e aiutare ogni volta che è necessario l'accesso fisico. Più specificamente:

source: We need hosting of ``small'' machines such as single-board computers (AArch64, RISC-V) for use as build machines.
it: Abbiamo bisogno di ospitare macchine ``piccole'' come computer single-board (AArch64, RISC-V) per usarle come macchine di compilazione.

source: We need hosting for front-ends and x86_64 build machines in a data center where they can be racked and where, ideally, several local Guix sysadmins can physically access them.
it: Abbiamo bisogno di ospitare front-end e macchine di compilazione x86_64 in un data center dove possono essere rackate e dove, idealmente, diversi amministratori di sistema Guix locali possono accedervi fisicamente.

source: The machines should be accessible over Wireguard VPN most of the time, so longer power or network interruptions should be the exception.
it: Le macchine dovrebbero essere accessibili tramite VPN Wireguard la maggior parte del tempo, quindi interruzioni più lunghe di alimentazione o rete dovrebbero essere l'eccezione.

source: Prerequisites: Familiarity with installing and remotely administering Guix System.
it: Prerequisiti: Familiarità con l'installazione e l'amministrazione remota di Guix System.

source: The infra remains up and running thanks to crucial administrative tasks, which includes:
it: L'infrastruttura rimane attiva e funzionante grazie a compiti amministrativi cruciali, che includono:

source: Selecting and purchasing hardware, for example build machines.
it: Selezionare e acquistare hardware, ad esempio macchine di compilazione.

source: Renewing domain names.
it: Rinnovare i nomi di dominio.

source: Securing funding, in particular via the Guix Foundation: @url{https://foundation.guix.info, Guix Foundation}
it: Assicurare i finanziamenti, in particolare tramite la Guix Foundation: @url{https://foundation.guix.info, Guix Foundation}

source: Prerequisites: Familiarity with hardware, and/or DNS registrars, and/or sponsorship, and/or crowdfunding.
it: Prerequisiti: Familiarità con l'hardware e/o registrar DNS e/o sponsorizzazioni e/o crowdfunding.

source: Creating software environments.
it: Creazione di ambienti software.

source: Home Configuration
it: Configurazione della Home

source: Configuring the home environment.
it: Configurazione dell'ambiente home.

source: Defining platforms.
it: Definizione delle piattaforme.

source: Creating system images.
it: Creazione di immagini di sistema.

source: Typesetting.
it: Composizione tipografica.

source: Official Substitute Servers
it: Server di sostituti ufficiali

source: Customizing the System-Wide Guix
it: Personalizzare il Guix di sistema

source: Default channels on Guix System.
it: Canali predefiniti su Guix System.

source: Spawning one-off software environments.
it: Generare ambienti software temporanei.

source: Declaring search path environment variables.
it: Dichiarare le variabili d'ambiente dei percorsi di ricerca.

source: Targeting another architecture through native builds.
it: Mirare a un'altra architettura tramite build nativi.

source: Privileged Programs
it: Programmi privilegiati

source: Programs running with elevated privileges.
it: Programmi eseguiti con privilegi elevati.

source: Archiving and deleting old logs.
it: Archiviazione ed eliminazione dei vecchi log.

source: Firewall, SSH daemon, etc.
it: Firewall, demone SSH, ecc.

source: VNC daemons.
it: Demoni VNC.

source: Extending battery life, etc.
it: Estendere la durata della batteria, ecc.

source: Defining bindings for complex configurations.
it: Definire collegamenti per configurazioni complesse.

source: Shells: Shells Home Services
it: Shell: Servizi Home per le Shell

source: POSIX shells, Bash, Zsh.
it: Shell POSIX, Bash, Zsh.

source: Mcron: Mcron Home Service
it: Mcron: Servizio Home Mcron

source: Power Management: Power Management Home Services
it: Gestione energetica: Servizi Home di gestione energetica

source: Services for battery power.
it: Servizi per l'alimentazione a batteria.

source: Shepherd: Shepherd Home Service
it: Shepherd: Servizio Home Shepherd

source: Managing User's Daemons.
it: Gestione dei demoni dell'utente.

source: Services for Guix.
it: Servizi per Guix.

source: Services for managing User's fonts.
it: Servizi per gestire i font dell'utente.

source: Services for managing mail.
it: Servizi per gestire la posta.

source: Services for managing messaging.
it: Servizi per gestire la messaggistica.

source: Services for managing media.
it: Servizi per gestire supporti e media.

source: Networking services.
it: Servizi di rete.

source: More services.
it: Altri servizi.

source: Detail of platform declarations.
it: Dettagli sulle dichiarazioni di piattaforma.

source: Supported Platforms
it: Piattaforme supportate

source: Description of the supported platforms.
it: Descrizione delle piattaforme supportate.

source: image Reference
it: Riferimenti per 'image'

source: Detail of image declarations.
it: Dettagli sulle dichiarazioni di immagine.

source: image-type Reference
it: Riferimenti per 'image-type'

source: Detail of image types declaration.
it: Dettagli sulla dichiarazione dei tipi di immagine.

source: @code{image} Reference
it: Riferimenti per @code{image}

source: build daemon
it: demone di build

source: @uref{https://hurd.gnu.org, GNU/Hurd} on the @code{x86_64} Intel/AMD 64-bit architecture.
it: @uref{https://hurd.gnu.org, GNU/Hurd} sull'architettura Intel/AMD a 64 bit @code{x86_64}.

source: This configuration is even more experimental and under heavy upstream development.
it: Questa configurazione è ancora più sperimentale e in forte sviluppo upstream.

source: Guix System is available on all the above platforms except @code{mips64el-linux}, @code{powerpc-linux}, @code{powerpc64le-linux} and @code{riscv64-linux}.
it: Guix System è disponibile su tutte le piattaforme sopra elencate eccetto @code{mips64el-linux}, @code{powerpc-linux}, @code{powerpc64le-linux} e @code{riscv64-linux}.

source: This section describes how to install Guix from a self-contained tarball providing binaries for Guix and for all its dependencies. This is often quicker than installing from source, described later (@pxref{Building from Git}).
it: Questa sezione descrive come installare Guix da un tarball auto-contenuto che fornisce i binari per Guix e per tutte le sue dipendenze. Questo è spesso più veloce dell'installazione dai sorgenti, descritta più avanti (@pxref{Building from Git}).

source: The script guides you through the following:
it: Lo script ti guiderà attraverso quanto segue:

source: Setting up the build daemon
it: Impostare il demone di build

source: Configuring substitute servers
it: Configurare i server di sostituti

source: daemon
it: demone

source: There are currently two ways to set up and run the build daemon:
it: Ci sono attualmente due modi per configurare ed eseguire il demone di build:

source: running @command{guix-daemon} as ``root'', letting it run build processes as unprivileged users taken from a pool of build users---this is the historical approach;
it: eseguire @command{guix-daemon} come ``root'', lasciandogli eseguire i processi di build come utenti non privilegiati presi da un pool di utenti di build - questo è l'approccio storico;

source: running @command{guix-daemon} as a separate unprivileged user, relying on Linux's @dfn{unprivileged user namespace} functionality to set up isolated environments---this is the option chosen when installing Guix on a systemd-based distribution with the installation script (@pxref{Binary Installation}).
it: eseguire @command{guix-daemon} come utente non privilegiato separato, affidandosi alla funzionalità @dfn{namespace utente non privilegiato} di Linux per impostare ambienti isolati - questa è l'opzione scelta quando si installa Guix su una distribuzione basata su systemd con lo script di installazione (@pxref{Binary Installation}).
