Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: In addition to these actions, @command{guix package} supports the following options to query the current state of a profile, or the availability of packages:
pt_br: Além dessas ações, @command{guix package} suporta as seguintes opções para consultar o estado atual de um perfil ou a disponibilidade de pacotes:

source: searching for packages
pt_br: procurando por pacotes

source: List the available packages whose name, synopsis, or description matches @var{regexp} (in a case-insensitive fashion), sorted by relevance. Print all the metadata of matching packages in @code{recutils} format (@pxref{Top, GNU recutils databases,, recutils, GNU recutils manual}).
pt_br: Liste os pacotes disponíveis cujo nome, sinopse ou descrição correspondem a @var{regexp} (sem distinção entre maiúsculas e minúsculas), classificados por relevância. Imprima todos os metadados dos pacotes correspondentes no formato @code{recutils} (@pxref{Top, bancos de dados GNU recutils,, recutils, manual GNU recutils}).

source: This allows specific fields to be extracted using the @command{recsel} command, for instance:
pt_br: Isso permite que campos específicos sejam extraídos usando o comando @command{recsel}, por exemplo:

source: Similarly, to show the name of all the packages available under the terms of the GNU@tie{}LGPL version 3:
pt_br: Da mesma forma, para mostrar o nome de todos os pacotes disponíveis sob os termos da GNU@tie{}LGPL versão 3:

source: It is also possible to refine search results using several @code{-s} flags to @command{guix package}, or several arguments to @command{guix search}. For example, the following command returns a list of board games (this time using the @command{guix search} alias):
pt_br: Também é possível refinar os resultados da pesquisa usando vários sinalizadores @code{-s} para @command{guix package}, ou vários argumentos para @command{guix search}. Por exemplo, o comando a seguir retorna uma lista de jogos de tabuleiro (desta vez usando o alias @command{guix search}):

source: If we were to omit @code{-s game}, we would also get software packages that deal with printed circuit boards; removing the angle brackets around @code{board} would further add packages that have to do with keyboards.
pt_br: Se omitissemos @code{-s game}, também teríamos pacotes de software que lidam com placas de circuito impresso; remover os colchetes angulares em torno de @code{board} adicionaria ainda mais pacotes relacionados a teclados.

source: And now for a more elaborate example. The following command searches for cryptographic libraries, filters out Haskell, Perl, Python, and Ruby libraries, and prints the name and synopsis of the matching packages:
pt_br: E agora um exemplo mais elaborado. O comando a seguir procura bibliotecas criptográficas, filtra as bibliotecas Haskell, Perl, Python e Ruby e imprime o nome e a sinopse dos pacotes correspondentes:

source: @xref{Selection Expressions,,, recutils, GNU recutils manual}, for more information on @dfn{selection expressions} for @code{recsel -e}.
pt_br: @xref{Selection Expressions,,, recutils, manual GNU recutils}, para obter mais informações sobre @dfn{expressões de seleção} para @code{recsel -e}.

source: --show=@var{package}
pt_br: --show=@var{pacote}

source: Show details about @var{package}, taken from the list of available packages, in @code{recutils} format (@pxref{Top, GNU recutils databases,, recutils, GNU recutils manual}).
pt_br: Exibe detalhes sobre @var{pacote}, retirados da lista de pacotes disponíveis, no formato @code{recutils} (@pxref{Top,GNU Recutils Databases,, recutils, GNU Recutils Manual}).

source: You may also specify the full name of a package to only get details about a specific version of it (this time using the @command{guix show} alias):
pt_br: Você também pode especificar o nome completo de um pacote para obter detalhes apenas sobre uma versão específica dele (desta vez usando o alias @command{guix show}):

source: List the currently installed packages in the specified profile, with the most recently installed packages shown last. When @var{regexp} is specified, list only installed packages whose name matches @var{regexp}.
pt_br: Lista os pacotes instalados mais recentemente no perfil especificado, com os pacotes instalados mais recentemente mostrados por último. Quando @var{regexp} for especificado, liste apenas os pacotes instalados cujo nome corresponda a @var{regexp}.

source: For each installed package, print the following items, separated by tabs: the package name, its version string, the part of the package that is installed (for instance, @code{out} for the default output, @code{include} for its headers, etc.), and the path of this package in the store.
pt_br: Para cada pacote instalado, imprima os seguintes itens, separados por tabulações: o nome do pacote, sua string de versão e a parte do pacote que está instalada (por exemplo, @code{out} para a saída predefinida, @code{include} para os seus cabeçalhos, etc.) e o caminho deste pacote no armazém.

source: List packages currently available in the distribution for this system (@pxref{GNU Distribution}). When @var{regexp} is specified, list only available packages whose name matches @var{regexp}.
pt_br: Lista de pacotes atualmente disponíveis na distribuição para este sistema (@pxref{GNU Distribution}). Quando @var{regexp} for especificado, liste apenas os pacotes disponíveis cujo nome corresponda a @var{regexp}.

source: For each package, print the following items separated by tabs: its name, its version string, the parts of the package (@pxref{Packages with Multiple Outputs}), and the source location of its definition.
pt_br: Para cada pacote, imprima os seguintes itens separados por tabulações: seu nome, sua string de versão, as partes do pacote (@pxref{Packages with Multiple Outputs}) e o local de origem de sua definição.

source: --list-generations[=@var{pattern}]
pt_br: --list-generations[=@var{padrão}]

source: -l [@var{pattern}]
pt_br: -l [@var{padrão}]

source: Return a list of generations along with their creation dates; for each generation, show the installed packages, with the most recently installed packages shown last. Note that the zeroth generation is never shown.
pt_br: Retorne uma lista de gerações junto com suas datas de criação; para cada geração, exiba os pacotes instalados, com os pacotes instalados mais recentemente mostrados por último. Observe que a geração zero nunca é mostrada.

source: For each installed package, print the following items, separated by tabs: the name of a package, its version string, the part of the package that is installed (@pxref{Packages with Multiple Outputs}), and the location of this package in the store.
pt_br: Para cada pacote instalado, mostre os seguintes itens, separados por tabulações: o nome de um pacote, sua string de versão, a parte do pacote que está instalada (@pxref{Packages with Multiple Outputs}) e a localização deste pacote em o armazém.

source: When @var{pattern} is used, the command returns only matching generations. Valid patterns include:
pt_br: Quando @var{padrão} é usado, o comando retorna apenas gerações correspondentes. Os padrões válidos incluem:

source: @emph{Integers and comma-separated integers}. Both patterns denote
pt_br: @emph{Inteiros e números inteiros separados por vírgula}. Ambos os padrões denotam

source: generation numbers. For instance, @option{--list-generations=1} returns the first one.
pt_br: números de geração. Por exemplo, @option{--list-generations=1} retorna o primeiro.

source: And @option{--list-generations=1,8,2} outputs three generations in the specified order. Neither spaces nor trailing commas are allowed.
pt_br: E @option{--list-generations=1,8,2} gera três gerações na ordem especificada. Não são permitidos espaços nem vírgulas finais.

source: @emph{Ranges}. @option{--list-generations=2..9} prints the
pt_br: @emph{Intervalos}. @option{--list-generations=2..9} mostra o

source: specified generations and everything in between. Note that the start of a range must be smaller than its end.
pt_br: gerações especificadas e tudo mais. Observe que o início de um intervalo deve ser menor que o seu final.

source: It is also possible to omit the endpoint. For example, @option{--list-generations=2..}, returns all generations starting from the second one.
pt_br: Também é possível omitir o ponto final. Por exemplo, @option{--list-generations=2..} retorna todas as gerações começando pela segunda.

source: @emph{Durations}. You can also get the last @emph{N}@tie{}days, weeks,
pt_br: @emph{Duração}. Você também pode visitar os últimos @emph{N}@tie{}dias, semanas,

source: or months by passing an integer along with the first letter of the duration. For example, @option{--list-generations=20d} lists generations that are up to 20 days old.
pt_br: ou meses passando um número inteiro junto com a primeira letra da duração. Por exemplo, @option{--list-generations=20d} lista gerações com até 20 dias.

source: --delete-generations[=@var{pattern}]
pt_br: --delete-generations[=@var{padrão}]

source: -d [@var{pattern}]
pt_br: -d [@var{padrão}]

source: When @var{pattern} is omitted, delete all generations except the current one.
pt_br: Quando @var{padrão} for omitido, exclua todas as gerações, exceto a atual.

source: This command accepts the same patterns as @option{--list-generations}. When @var{pattern} is specified, delete the matching generations. When @var{pattern} specifies a duration, generations @emph{older} than the specified duration match. For instance, @option{--delete-generations=1m} deletes generations that are more than one month old.
pt_br: Este comando aceita os mesmos padrões de @option{--list-Generations}. Quando @var{pattern} for especificado, exclua as gerações correspondentes. Quando @var{padrão} especifica uma duração, as gerações @emph{mais antigas} que a duração especificada correspondem. Por exemplo, @option{--delete-generations=1m} exclui gerações com mais de um mês.

source: If the current generation matches, it is @emph{not} deleted. Also, the zeroth generation is never deleted.
pt_br: Se a geração atual corresponder, ela será @emph{não} excluída. Além disso, a geração zero nunca é excluída.

source: Note that deleting generations prevents rolling back to them. Consequently, this command must be used with care.
pt_br: Observe que a exclusão de gerações impede a reversão para elas. Conseqüentemente, este comando deve ser usado com cuidado.

source: manifest, exporting
pt_br: manifesto, exportando

source: Write to standard output a manifest suitable for @option{--manifest} corresponding to the chosen profile(s).
pt_br: Escreva na saída padrão um manifesto adequado para @option{--manifest} correspondente ao(s) perfil(s) selecionado(s).

source: This option is meant to help you migrate from the ``imperative'' operating mode---running @command{guix install}, @command{guix upgrade}, etc.---to the declarative mode that @option{--manifest} offers.
pt_br: Esta opção destina-se a ajudá-lo a migrar do modo operacional "imperativo'' --- executando @command{guix install}, @command{guix upgrade}, etc.---para o modo declarativo que @option{--manifest} ofertas.

source: Be aware that the resulting manifest @emph{approximates} what your profile actually contains; for instance, depending on how your profile was created, it can refer to packages or package versions that are not exactly what you specified.
pt_br: Observe que o manifesto resultante @emph{aproxima} o que seu perfil realmente contém; por exemplo, dependendo de como seu perfil foi criado, ele pode se referir a pacotes ou versões de pacotes que não são exatamente o que você especificou.

source: Keep in mind that a manifest is purely symbolic: it only contains package names and possibly versions, and their meaning varies over time. If you wish to ``pin'' channels to the revisions that were used to build the profile(s), see @option{--export-channels} below.
pt_br: Tenha em mente que um manifesto é puramente simbólico: ele contém apenas nomes de pacotes e possivelmente versões, e seu significado varia com o tempo. Se você quiser ``fixar'' canais nas revisões que foram usadas para construir o(s) perfil(es), veja @option{--export-channels} abaixo.

source: pinning, channel revisions of a profile
pt_br: fixação, revisões de canal de um perfil

source: Write to standard output the list of channels used by the chosen profile(s), in a format suitable for @command{guix pull --channels} or @command{guix time-machine --channels} (@pxref{Channels}).
pt_br: Escreva na saída padrão a lista de canais usados pelo(s) perfil(s) selecionado(s), em um formato adequado para @command{guix pull --channels} ou @command{guix time-machine --channels} (@pxref{Channels}) . .

source: Together with @option{--export-manifest}, this option provides information allowing you to replicate the current profile (@pxref{Replicating Guix}).
pt_br: Juntamente com @option{--export-manifest}, esta opção fornece informações que permitem replicar o perfil atual (@pxref{Replicating Guix}).

source: However, note that the output of this command @emph{approximates} what was actually used to build this profile. In particular, a single profile might have been built from several different revisions of the same channel. In that case, @option{--export-manifest} chooses the last one and writes the list of other revisions in a comment. If you really need to pick packages from different channel revisions, you can use inferiors in your manifest to do so (@pxref{Inferiors}).
pt_br: No entanto, observe que a saída deste comando @emph{aproxima} o que foi realmente usado para construir este perfil. Em particular, um único perfil pode ter sido construído a partir de diversas revisões diferentes do mesmo canal. Nesse caso, @option{--export-manifest} escolhe a última e escreve a lista de outras revisões em um comentário. Se você realmente precisa escolher pacotes de análises de canais diferentes, você pode usar inferiores em seu manifesto para fazer isso (@pxref{Inferiors}).

source: Together with @option{--export-manifest}, this is a good starting point if you are willing to migrate from the ``imperative'' model to the fully declarative model consisting of a manifest file along with a channels file pinning the exact channel revision(s) you want.
pt_br: Juntamente com @option{--export-manifest}, este é um bom ponto de partida se você estiver disposto a migrar do modelo "imperativo" para o modelo totalmente declarativo que consiste em um arquivo de manifesto junto com um arquivo de canais fixando o canal exato revisão(ões) que você deseja.

source: Finally, since @command{guix package} may actually start build processes, it supports all the common build options (@pxref{Common Build Options}). It also supports package transformation options, such as @option{--with-source}, and preserves them across upgrades (@pxref{Package Transformation Options}).
pt_br: Finalmente, como @command{guix package} pode realmente iniciar processos de construção, ele suporta todas as opções de construção comuns (@pxref{Common Build Options}). Ele também oferece suporte a opções de transformação de pacotes, como @option{--with-source}, e as preserva em atualizações (@pxref{Package Transformation Options}).

source: pre-built binaries
pt_br: binários pré-construídos

source: Guix supports transparent source/binary deployment, which means that it can either build things locally, or download pre-built items from a server, or both. We call these pre-built items @dfn{substitutes}---they are substitutes for local build results. In many cases, downloading a substitute is much faster than building things locally.
pt_br: Guix suporta implantação transparente de origem/binário, o que significa que ele pode construir coisas localmente ou baixar itens pré-construídos de um servidor, ou ambos. Chamamos esses itens pré-construídos de @dfn{substitutos}---eles são substitutos para resultados de construção local. Em muitos casos, baixar um substituto é muito mais rápido do que construir coisas localmente.

source: Substitutes can be anything resulting from a derivation build (@pxref{Derivations}). Of course, in the common case, they are pre-built package binaries, but source tarballs, for instance, which also result from derivation builds, can be available as substitutes.
pt_br: Substitutos podem ser qualquer coisa resultante de uma construção de derivação (@pxref{Derivations}). Claro, no caso comum, eles são binários de pacotes pré-construídos, mas tarballs de origem, por exemplo, que também resultam de construções de derivação, podem estar disponíveis como substitutos.

source: build farm
pt_br: fazenda de compilação

source: @code{@value{SUBSTITUTE-SERVER-1}} and @code{@value{SUBSTITUTE-SERVER-2}} are both front-ends to official build farms that build packages from Guix continuously for some architectures, and make them available as substitutes. These are the default source of substitutes; which can be overridden by passing the @option{--substitute-urls} option either to @command{guix-daemon} (@pxref{daemon-substitute-urls,, @code{guix-daemon --substitute-urls}}) or to client tools such as @command{guix package} (@pxref{client-substitute-urls,, client @option{--substitute-urls} option}).
pt_br: @code{@value{SUBSTITUTE-SERVER-1}} e @code{@value{SUBSTITUTE-SERVER-2}} são ambos front-ends para farms de build oficiais que constroem pacotes do Guix continuamente para algumas arquiteturas e os disponibilizam como substitutos. Essas são a fonte padrão de substitutos; que podem ser substituídos passando a opção @option{--substitute-urls} para @command{guix-daemon} (@pxref{daemon-substitute-urls,, @code{guix-daemon --substitute-urls}}) ou para ferramentas de cliente como @command{guix package} (@pxref{client-substitute-urls,, client @option{--substitute-urls} option}).

source: Substitute URLs can be either HTTP or HTTPS. HTTPS is recommended because communications are encrypted; conversely, using HTTP makes all communications visible to an eavesdropper, who could use the information gathered to determine, for instance, whether your system has unpatched security vulnerabilities.
pt_br: URLs substitutos podem ser HTTP ou HTTPS. HTTPS é recomendado porque as comunicações são criptografadas; por outro lado, usar HTTP torna todas as comunicações visíveis para um bisbilhoteiro, que pode usar as informações coletadas para determinar, por exemplo, se seu sistema tem vulnerabilidades de segurança não corrigidas.

source: Substitutes from the official build farms are enabled by default when using Guix System (@pxref{GNU Distribution}). However, they are disabled by default when using Guix on a foreign distribution, unless you have explicitly enabled them via one of the recommended installation steps (@pxref{Installation}). The following paragraphs describe how to enable or disable substitutes for the official build farm; the same procedure can also be used to enable substitutes for any other substitute server.
pt_br: Substitutos das build farms oficiais são habilitados por padrão ao usar o Guix System (@pxref{GNU Distribution}). No entanto, eles são desabilitados por padrão ao usar o Guix em uma distribuição estrangeira, a menos que você os tenha habilitado explicitamente por meio de uma das etapas de instalação recomendadas (@pxref{Installation}). Os parágrafos a seguir descrevem como habilitar ou desabilitar substitutos para a build farm oficial; o mesmo procedimento também pode ser usado para habilitar substitutos para qualquer outro servidor substituto.

source: security
pt_br: segurança

source: access control list (ACL), for substitutes
pt_br: lista de controle de acesso (ACL), para substitutos

source: ACL (access control list), for substitutes
pt_br: ACL (lista de controle de acesso), para substitutos

source: To allow Guix to download substitutes from @code{@value{SUBSTITUTE-SERVER-1}}, @code{@value{SUBSTITUTE-SERVER-2}} or a mirror, you must add the relevant public key to the access control list (ACL) of archive imports, using the @command{guix archive} command (@pxref{Invoking guix archive}). Doing so implies that you trust the substitute server to not be compromised and to serve genuine substitutes.
pt_br: Para permitir que o Guix baixe substitutos de @code{@value{SUBSTITUTE-SERVER-1}}, @code{@value{SUBSTITUTE-SERVER-2}} ou um espelho, você deve adicionar a chave pública relevante à lista de controle de acesso (ACL) de importações de arquivo, usando o comando @command{guix archive} (@pxref{Invoking guix archive}). Fazer isso implica que você confia que o servidor substituto não será comprometido e servirá substitutos genuínos.

source: If you are using Guix System, you can skip this section: Guix System authorizes substitutes from @code{@value{SUBSTITUTE-SERVER-1}} and @code{@value{SUBSTITUTE-SERVER-2}} by default.
pt_br: Se você estiver usando o Guix System, pode pular esta seção: O Guix System autoriza substitutos de @code{@value{SUBSTITUTE-SERVER-1}} e @code{@value{SUBSTITUTE-SERVER-2}} por padrão.

source: The public keys for each of the project maintained substitute servers are installed along with Guix, in @code{@var{prefix}/share/guix/}, where @var{prefix} is the installation prefix of Guix. If you installed Guix from source, make sure you checked the GPG signature of @file{guix-@value{VERSION}.tar.gz}, which contains this public key file. Then, you can run something like this:
pt_br: As chaves públicas para cada um dos servidores substitutos mantidos pelo projeto são instaladas junto com o Guix, em @code{@var{prefix}/share/guix/}, onde @var{prefix} é o prefixo de instalação do Guix. Se você instalou o Guix a partir da fonte, certifique-se de verificar a assinatura GPG de @file{guix-@value{VERSION}.tar.gz}, que contém este arquivo de chave pública. Então, você pode executar algo como isto:

source: Once this is in place, the output of a command like @code{guix build} should change from something like:
pt_br: Uma vez que isso esteja pronto, a saída de um comando como @code{guix build} deve mudar de algo como:

source: $ guix build emacs --dry-run The following derivations would be built: /gnu/store/yr7bnx8xwcayd6j95r2clmkdl1qh688w-emacs-24.3.drv /gnu/store/x8qsh1hlhgjx6cwsjyvybnfv2i37z23w-dbus-1.6.4.tar.gz.drv /gnu/store/1ixwp12fl950d15h2cj11c73733jay0z-alsa-lib-1.0.27.1.tar.bz2.drv /gnu/store/nlma1pw0p603fpfiqy7kn4zm105r5dmw-util-linux-2.21.drv @dots{}
pt_br: $ guix build emacs --dry-run A seguinte derivações seriam compiladas: /gnu/store/yr7bnx8xwcayd6j95r2clmkdl1qh688w-emacs-24.3.drv /gnu/store/x8qsh1hlhgjx6cwsjyvybnfv2i37z23w-dbus-1.6.4.tar.gz.drv /gnu/store/1ixwp12fl950d15h2cj11c73733jay0z-alsa-lib-1.0.27.1.tar.bz2.drv /gnu/store/nlma1pw0p603fpfiqy7kn4zm105r5dmw-util-linux-2.21.drv @dots{}

source: to something like:
pt_br: para algo como:

source: $ guix build emacs --dry-run 112.3 MB would be downloaded: /gnu/store/pk3n22lbq6ydamyymqkkz7i69wiwjiwi-emacs-24.3 /gnu/store/2ygn4ncnhrpr61rssa6z0d9x22si0va3-libjpeg-8d /gnu/store/71yz6lgx4dazma9dwn2mcjxaah9w77jq-cairo-1.12.16 /gnu/store/7zdhgp0n1518lvfn8mb96sxqfmvqrl7v-libxrender-0.9.7 @dots{}
pt_br: $ guix build emacs --dry-run 112.3 MB seriam baixados: /gnu/store/pk3n22lbq6ydamyymqkkz7i69wiwjiwi-emacs-24.3 /gnu/store/2ygn4ncnhrpr61rssa6z0d9x22si0va3-libjpeg-8d /gnu/store/71yz6lgx4dazma9dwn2mcjxaah9w77jq-cairo-1.12.16 /gnu/store/7zdhgp0n1518lvfn8mb96sxqfmvqrl7v-libxrender-0.9.7 @dots{}
