Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: When printing the string, Guile replaces the special formatting symbols with actual values. For instance, the string @samp{ambiguous package specification `~a'} would be substituted to contain said package specification instead of @code{~a}. To properly translate this string, you must keep the formatting code in your translation, although you can place it where it makes sense in your language. For instance, the French translation says @samp{spécification du paquet « ~a » ambiguë} because the adjective needs to be placed in the end of the sentence.
it: Quando stampa la stringa, Guile sostituisce i simboli di formattazione speciali con valori effettivi. Ad esempio, la stringa @samp{ambiguous package specification `~a'} verrebbe sostituita per contenere la specifica del pacchetto anziché @code{~a}. Per tradurre correttamente questa stringa, devi mantenere il codice di formattazione nella tua traduzione, sebbene tu possa posizionarlo dove ha senso nella tua lingua. Ad esempio, la traduzione francese dice @samp{spécification du paquet « ~a » ambiguë} perché l'aggettivo deve essere posto alla fine della frase.
pt_br: Ao imprimir a string, Guile substitui os símbolos especiais de formatação por valores reais. Por exemplo, a string @samp{ambiguous package specification `~a'} seria substituída para conter a dita especificação de pacote em vez de @code{~a}. Para traduzir corretamente essa string, você deve manter o código de formatação em sua tradução, embora você possa colocá-lo onde fizer sentido em seu idioma. Por exemplo, a tradução francesa diz @samp{spécification du paquet « ~a » ambiguë} porque o adjetivo precisa ser colocado no final da frase.

source: If there are multiple formatting symbols, make sure to respect the order. Guile does not know in which order you intended the string to be read, so it will substitute the symbols in the same order as the English sentence.
it: Se ci sono più simboli di formattazione, assicurati di rispettare l'ordine. Guile non sa in quale ordine intendevi che la stringa fosse letta, quindi sostituirà i simboli nello stesso ordine della frase inglese.
pt_br: Se houver vários símbolos de formatação, certifique-se de respeitar a ordem. O Guile não sabe em qual ordem você pretendia que a string fosse lida, então ele substituirá os símbolos na mesma ordem da frase em inglês.

source: As an example, you cannot translate @samp{package '~a' has been superseded by '~a'} by @samp{'~a' supersedes package '~a'}, because the meaning would be reversed. If @var{foo} is superseded by @var{bar}, the translation would read @samp{'foo' supersedes package 'bar'}. To work around this problem, it is possible to use more advanced formatting to select a given piece of data, instead of following the default English order. @xref{Formatted Output,,, guile, GNU Guile Reference Manual}, for more information on formatting in Guile.
it: Ad esempio, non puoi tradurre @samp{package '~a' has been superseded by '~a'} con @samp{'~a' supersedes package '~a'}, perché il significato sarebbe invertito. Se @var{foo} è sostituito da @var{bar}, la traduzione dice @samp{'foo' supersedes package 'bar'}. Per aggirare questo problema, è possibile utilizzare una formattazione più avanzata per selezionare un dato pezzo di dati, invece di seguire l'ordine predefinito inglese. @xref{Formatted Output,,, guile, GNU Guile Reference Manual}, per maggiori informazioni sulla formattazione in Guile.
pt_br: Por exemplo, você não pode traduzir @samp{package '~a' has been superseded by '~a'} como @samp{'~a' supersedes package '~a'}, porque o significado seria invertido. Se @var{foo} for substituído por @var{bar}, a tradução seria @samp{'foo' supersedes package 'bar'}. Para contornar esse problema, é possível usar uma formatação mais avançada para selecionar um dado pedaço de dados, em vez de seguir a ordem padrão em inglês. @xref{Formatted Output,,, guile, GNU Guile Reference Manual}, para mais informações sobre formatação no Guile.

source: packages
it: pacchetti
pt_br: pacotes

source: Package descriptions occasionally contain Texinfo markup (@pxref{Synopses and Descriptions}). Texinfo markup looks like @samp{@@code@{rm -rf@}}, @samp{@@emph@{important@}}, etc. When translating, please leave markup as is.
it: Le descrizioni dei pacchetti occasionalmente contengono markup Texinfo (@pxref{Synopses and Descriptions}). Il markup Texinfo appare come @samp{@@code@{rm -rf@}}, @samp{@@emph@{important@}}, ecc. Durante la traduzione, per favore lascia il markup così com'è.
pt_br: As descrições de pacotes ocasionalmente contêm marcação Texinfo (@pxref{Synopses and Descriptions}). A marcação Texinfo se parece com @samp{@@code@{rm -rf@}}, @samp{@@emph@{important@}}, etc. Ao traduzir, deixe a marcação como está.

source: The characters after ``@@'' form the name of the markup, and the text between ``@{'' and ``@}'' is its content. In general, you should not translate the content of markup like @code{@@code}, as it contains literal code that do not change with language. You can translate the content of formatting markup such as @code{@@emph}, @code{@@i}, @code{@@itemize}, @code{@@item}. However, do not translate the name of the markup, or it will not be recognized. Do not translate the word after @code{@@end}, it is the name of the markup that is closed at this position (e.g.@: @code{@@itemize ... @@end itemize}).
it: I caratteri dopo ``@@'' formano il nome del markup, e il testo tra ``@{'' e ``@}'' è il suo contenuto. In generale, non dovresti tradurre il contenuto di markup come @code{@@code}, poiché contiene codice letterale che non cambia con la lingua. Puoi tradurre il contenuto del markup di formattazione come @code{@@emph}, @code{@@i}, @code{@@itemize}, @code{@@item}. Tuttavia, non tradurre il nome del markup, altrimenti non sarà riconosciuto. Non tradurre la parola dopo @code{@@end}, è il nome del markup che viene chiuso in questa posizione (es.@: @code{@@itemize ... @@end itemize}).
pt_br: Os caracteres após ``@@'' formam o nome da marcação, e o texto entre ``@{'' e ``@}'' é seu conteúdo. Em geral, você não deve traduzir o conteúdo de uma marcação como @code{@@code}, pois ela contém código literal que não muda com o idioma. Você pode traduzir o conteúdo de uma marcação de formatação como @code{@@emph}, @code{@@i}, @code{@@itemize}, @code{@@item}. No entanto, não traduza o nome da marcação, ou ela não será reconhecida. Não traduza a palavra após @code{@@end}, é o nome da marcação que é fechado nesta posição (por exemplo, @code{@@itemize ... @@end itemize}).

source: documentation-manual and documentation-cookbook
it: documentation-manual e documentation-cookbook
pt_br: documentation-manual e documentation-cookbook

source: The first step to ensure a successful translation of the manual is to find and translate the following strings @emph{first}:
it: Il primo passo per garantire una traduzione riuscita del manuale è trovare e tradurre @emph{first} le seguenti stringhe:
pt_br: O primeiro passo para garantir uma tradução bem-sucedida do manual é encontrar e traduzir as seguintes strings @emph{primeiro}:

source: @code{version.texi}: Translate this string as @code{version-xx.texi},
it: @code{version.texi}: Traduci questa stringa come @code{version-xx.texi},
pt_br: @code{version.texi}: Traduza esta string como @code{version-xx.texi},

source: where @code{xx} is your language code (the one shown in the URL on weblate).
it: dove @code{xx} è il tuo codice lingua (quello mostrato nell'URL su weblate).
pt_br: onde @code{xx} é o código do seu idioma (aquele mostrado na URL no weblate).

source: @code{contributing.texi}: Translate this string as
it: @code{contributing.texi}: Traduci questa stringa come
pt_br: @code{contributing.texi}: Traduzir esta string como

source: @code{contributing.xx.texi}, where @code{xx} is the same language code.
it: @code{contributing.xx.texi}, dove @code{xx} è lo stesso codice lingua.
pt_br: @code{contributing.xx.texi}, onde @code{xx} é o mesmo código de idioma.

source: @code{Top}: Do not translate this string, it is important for Texinfo.
it: @code{Top}: Non tradurre questa stringa, è importante per Texinfo.
pt_br: @code{Top}: Não traduza esta string, ela é importante para o Texinfo.

source: If you translate it, the document will be empty (missing a Top node). Please look for it, and register @code{Top} as its translation.
it: Se la traduci, il documento sarà vuoto (manca un nodo Top). Per favore cercala e registra @code{Top} come sua traduzione.
pt_br: Se você traduzi-lo, o documento estará vazio (faltando um nó Top). Por favor, procure por ele e registre @code{Top} como sua tradução.

source: Translating these strings first ensure we can include your translation in the guix repository without breaking the make process or the @command{guix pull} machinery.
it: Tradurre queste stringhe per prime garantisce che possiamo includere la tua traduzione nel repository guix senza interrompere il processo make o il meccanismo @command{guix pull}.
pt_br: Traduzir essas strings primeiro garante que podemos incluir sua tradução no repositório guix sem interromper o processo de criação ou a máquina @command{guix pull}.

source: The manual and the cookbook both use Texinfo. As for @code{packages}, please keep Texinfo markup as is. There are more possible markup types in the manual than in the package descriptions. In general, do not translate the content of @code{@@code}, @code{@@file}, @code{@@var}, @code{@@value}, etc. You should translate the content of formatting markup such as @code{@@emph}, @code{@@i}, etc.
it: Il manuale e il cookbook utilizzano entrambi Texinfo. Come per @code{packages}, per favore mantieni il markup Texinfo così com'è. Ci sono più tipi di markup possibili nel manuale che nelle descrizioni dei pacchetti. In generale, non tradurre il contenuto di @code{@@code}, @code{@@file}, @code{@@var}, @code{@@value}, ecc. Dovresti tradurre il contenuto del markup di formattazione come @code{@@emph}, @code{@@i}, ecc.
pt_br: O manual e o livro de receitas usam Texinfo. Quanto a @code{packages}, mantenha a marcação Texinfo como está. Há mais tipos de marcação possíveis no manual do que nas descrições de pacotes. Em geral, não traduza o conteúdo de @code{@@code}, @code{@@file}, @code{@@var}, @code{@@value}, etc. Você deve traduzir o conteúdo da marcação de formatação, como @code{@@emph}, @code{@@i}, etc.

source: The manual contains sections that can be referred to by name by @code{@@ref}, @code{@@xref} and @code{@@pxref}. We have a mechanism in place so you do not have to translate their content. If you keep the English title, we will automatically replace it with your translation of that title. This ensures that Texinfo will always be able to find the node. If you decide to change the translation of the title, the references will automatically be updated and you will not have to update them all yourself.
it: Il manuale contiene sezioni a cui si può fare riferimento per nome con @code{@@ref}, @code{@@xref} e @code{@@pxref}. Abbiamo un meccanismo in atto in modo che tu non debba tradurne il contenuto. Se mantieni il titolo inglese, lo sostituiremo automaticamente con la tua traduzione di quel titolo. Ciò garantisce che Texinfo sarà sempre in grado di trovare il nodo. Se decidi di cambiare la traduzione del titolo, i riferimenti verranno aggiornati automaticamente e non dovrai aggiornarli tutti tu stesso.
pt_br: O manual contém seções que podem ser referenciadas pelo nome por @code{@@ref}, @code{@@xref} e @code{@@pxref}. Temos um mecanismo em vigor para que você não tenha que traduzir o conteúdo delas. Se você mantiver o título em inglês, nós o substituiremos automaticamente pela sua tradução desse título. Isso garante que o Texinfo sempre será capaz de encontrar o nó. Se você decidir alterar a tradução do título, as referências serão atualizadas automaticamente e você não terá que atualizá-las todas sozinho.

source: When translating references from the cookbook to the manual, you need to replace the name of the manual and the name of the section. For instance, to translate @code{@@pxref@{Defining Packages,,, guix, GNU Guix Reference Manual@}}, you would replace @code{Defining Packages} with the title of that section in the translated manual @emph{only} if that title is translated. If the title is not translated in your language yet, do not translate it here, or the link will be broken. Replace @code{guix} with @code{guix.xx} where @code{xx} is your language code. @code{GNU Guix Reference Manual} is the text of the link. You can translate it however you wish.
it: Quando traduci riferimenti dal cookbook al manuale, devi sostituire il nome del manuale e il nome della sezione. Ad esempio, per tradurre @code{@@pxref@{Defining Packages,,, guix, GNU Guix Reference Manual@}}, sostituiresti @code{Defining Packages} con il titolo di quella sezione nel manuale tradotto @emph{solo} se quel titolo è tradotto. Se il titolo non è ancora tradotto nella tua lingua, non tradurlo qui, altrimenti il collegamento si interromperà. Sostituisci @code{guix} con @code{guix.xx} dove @code{xx} è il tuo codice lingua. @code{GNU Guix Reference Manual} è il testo del collegamento. Puoi tradurlo come preferisci.
pt_br: Ao traduzir referências do livro de receitas para o manual, você precisa substituir o nome do manual e o nome da seção. Por exemplo, para traduzir @code{@@pxref@{Defining Packages,,, guix, GNU Guix Reference Manual@}}, você substituiria @code{Defining Packages} pelo título daquela seção no manual traduzido @emph{somente} se aquele título estiver traduzido. Se o título ainda não estiver traduzido para o seu idioma, não o traduza aqui, ou o link será quebrado. Substitua @code{guix} por @code{guix.xx} onde @code{xx} é o código do seu idioma. @code{GNU Guix Reference Manual} é o texto do link. Você pode traduzi-lo como quiser.

source: The website pages are written using SXML, an s-expression version of HTML, the basic language of the web. We have a process to extract translatable strings from the source, and replace complex s-expressions with a more familiar XML markup, where each markup is numbered. Translators can arbitrarily change the ordering, as in the following example.
it: Le pagine del sito web sono scritte in SXML, una versione s-expression di HTML, il linguaggio di base del web. Abbiamo un processo per estrarre le stringhe traducibili dal sorgente e sostituire espressioni s complesse con un markup XML più familiare, dove ogni markup è numerato. I traduttori possono cambiare arbitrariamente l'ordine, come nell'esempio seguente.
pt_br: As páginas do site são escritas usando SXML, uma versão s-expression do HTML, a linguagem básica da web. Temos um processo para extrair strings traduzíveis da fonte e substituir s-expressions complexas por uma marcação XML mais familiar, onde cada marcação é numerada. Os tradutores podem alterar arbitrariamente a ordem, como no exemplo a seguir.

source: Note that you need to include the same markups. You cannot skip any.
it: Nota che devi includere gli stessi markup. Non puoi saltarne nessuno.
pt_br: Note que você precisa incluir as mesmas marcações. Você não pode pular nenhuma.

source: In case you make a mistake, the component might fail to build properly with your language, or even make guix pull fail. To prevent that, we have a process in place to check the content of the files before pushing to our repository. We will not be able to update the translation for your language in Guix, so we will notify you (through weblate and/or by email) so you get a chance to fix the issue.
it: In caso di errore, il componente potrebbe non essere compilato correttamente con la tua lingua, o addirittura far fallire guix pull. Per prevenire ciò, abbiamo un processo per controllare il contenuto dei file prima di inviarli al nostro repository. Non saremo in grado di aggiornare la traduzione per la tua lingua in Guix, quindi ti notificheremo (tramite weblate e/o email) in modo che tu abbia la possibilità di risolvere il problema.
pt_br: Caso você cometa um erro, o componente pode falhar ao construir corretamente com seu idioma, ou até mesmo fazer o guix pull falhar. Para evitar isso, temos um processo em vigor para verificar o conteúdo dos arquivos antes de enviar para nosso repositório. Não poderemos atualizar a tradução para seu idioma no Guix, então iremos notificá-lo (por meio do weblate e/ou por e-mail) para que você tenha a chance de corrigir o problema.

source: Outside of Weblate
it: Al di fuori di Weblate
pt_br: Fora do Weblate

source: Currently, some parts of Guix cannot be translated on Weblate, help wanted!
it: Attualmente, alcune parti di Guix non possono essere tradotte su Weblate, cercasi aiuto!
pt_br: Atualmente, algumas partes do Guix não podem ser traduzidas no Weblate. Precisamos de ajuda!

source: @command{guix pull} news can be translated in @file{news.scm}, but is not
it: Le notizie di @command{guix pull} possono essere tradotte in @file{news.scm}, ma non sono
pt_br: @command{guix pull} news pode ser traduzido em @file{news.scm}, mas não é

source: available from Weblate. If you want to provide a translation, you can prepare a patch as described above, or simply send us your translation with the name of the news entry you translated and your language. @xref{Writing Channel News}, for more information about channel news.
it: disponibili su Weblate. Se vuoi fornire una traduzione, puoi preparare una patch come descritto sopra, o semplicemente inviarci la tua traduzione con il nome della voce di notizie che hai tradotto e la tua lingua. @xref{Writing Channel News}, per maggiori informazioni sulle notizie del canale.
pt_br: disponível no Weblate. Se você quiser fornecer uma tradução, pode preparar um patch conforme descrito acima, ou simplesmente nos enviar sua tradução com o nome da entrada de notícias que você traduziu e seu idioma. @xref{Writing Channel News}, para mais informações sobre notícias do canal.

source: Guix blog posts cannot currently be translated.
it: I post del blog di Guix attualmente non possono essere tradotti.
pt_br: As postagens do blog Guix não podem ser traduzidas no momento.

source: The installer script (for foreign distributions) is entirely in English.
it: Lo script di installazione (per distribuzioni esterne) è interamente in inglese.
pt_br: O script do instalador (para distribuições estrangeiras) é inteiramente em inglês.

source: Some of the libraries Guix uses cannot be translated or are translated
it: Alcune delle librerie utilizzate da Guix non possono essere tradotte o sono tradotte
pt_br: Algumas das bibliotecas que o Guix usa não podem ser traduzidas ou são traduzidas

source: outside of the Guix project. Guile itself is not internationalized.
it: al di fuori del progetto Guix. Guile stesso non è internazionalizzato.
pt_br: fora do projeto Guix. O Guile em si não é internacionalizado.

source: Other manuals linked from this manual or the cookbook might not be
it: Altri manuali collegati da questo manuale o dal cookbook potrebbero non essere
pt_br: Outros manuais vinculados a este manual ou ao livro de receitas podem não estar disponíveis

source: translated.
it: tradotti.
pt_br: traduzido.

source: Conditions for Inclusion
it: Condizioni per l'Inclusione
pt_br: Condições de inclusão

source: There are no conditions for adding new translations of the @code{guix} and @code{guix-packages} components, other than they need at least one translated string. New languages will be added to Guix as soon as possible. The files may be removed if they fall out of sync and have no more translated strings.
it: Non ci sono condizioni per aggiungere nuove traduzioni dei componenti @code{guix} e @code{guix-packages}, se non che devono avere almeno una stringa tradotta. Le nuove lingue verranno aggiunte a Guix il prima possibile. I file potrebbero essere rimossi se cadono fuori sincronizzazione e non hanno più stringhe tradotte.
pt_br: Não há condições para adicionar novas traduções dos componentes @code{guix} e @code{guix-packages}, além de que eles precisam de pelo menos uma string traduzida. Novos idiomas serão adicionados ao Guix o mais rápido possível. Os arquivos podem ser removidos se ficarem fora de sincronia e não tiverem mais strings traduzidas.

source: Given that the web site is dedicated to new users, we want its translation to be as complete as possible before we include it in the language menu. For a new language to be included, it needs to reach at least 80% completion. When a language is included, it may be removed in the future if it stays out of sync and falls below 60% completion.
it: Dato che il sito web è dedicato ai nuovi utenti, vogliamo che la sua traduzione sia il più completa possibile prima di includerla nel menu lingua. Affinché una nuova lingua venga inclusa, deve raggiungere almeno l'80% di completamento. Quando una lingua è inclusa, potrebbe essere rimossa in futuro se rimane fuori sincronizzazione e scende sotto il 60% di completamento.
pt_br: Dado que o site é dedicado a novos usuários, queremos que sua tradução esteja o mais completa possível antes de incluí-la no menu de idiomas. Para que um novo idioma seja incluído, ele precisa atingir pelo menos 80% de conclusão. Quando um idioma é incluído, ele pode ser removido no futuro se ficar fora de sincronia e ficar abaixo de 60% de conclusão.

source: The manual and cookbook are automatically added in the default compilation target. Every time we synchronize translations, developers need to recompile all the translated manuals and cookbooks. This is useless for what is essentially the English manual or cookbook. Therefore, we will only include a new language when it reaches 10% completion in the component. When a language is included, it may be removed in the future if it stays out of sync and falls below 5% completion.
it: Il manuale e il cookbook vengono aggiunti automaticamente nel target di compilazione predefinito. Ogni volta che sincronizziamo le traduzioni, gli sviluppatori devono ricompilare tutti i manuali e i cookbook tradotti. Ciò è inutile per ciò che è essenzialmente il manuale o il cookbook inglese. Pertanto, includeremo una nuova lingua solo quando raggiunge il 10% di completamento nel componente. Quando una lingua è inclusa, potrebbe essere rimossa in futuro se rimane fuori sincronizzazione e scende sotto il 5% di completamento.
pt_br: O manual e o livro de receitas são adicionados automaticamente no destino de compilação padrão. Toda vez que sincronizamos traduções, os desenvolvedores precisam recompilar todos os manuais e livros de receitas traduzidos. Isso é inútil para o que é essencialmente o manual ou livro de receitas em inglês. Portanto, só incluiremos um novo idioma quando ele atingir 10% de conclusão no componente. Quando um idioma é incluído, ele pode ser removido no futuro se ficar fora de sincronia e cair abaixo de 5% de conclusão.

source: Translation Infrastructure
it: Infrastruttura di Traduzione
pt_br: Infraestrutura de tradução
