Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: ;; Appending works even when the option wasn't in the ;; file. The last one prevails if duplicated. (let ((port (open-file ".config" "a")) (extra-configuration ,(config->string extra-options))) (display extra-configuration port) (close-port port))
es: ;; La aplicación funciona incluso cuando la opción no estaba ;; en el archivo. El último prevalece si se duplica. (let ((port (open-file ".config" "a")) (extra-configuration ,(config->string extra-options))) (display extra-configuration port) (close-port port))
it: ;; L'aggiunta funziona anche se l'opzione non era presente nel ;; file. L'ultima prevale se duplicata. (let ((port (open-file ".config" "a")) (extra-configuration ,(config->string extra-options))) (display extra-configuration port) (close-port port))
pt_br: ;; A anexação funciona mesmo quando a opção não estava no arquivo. ;; A última prevalece se duplicada. (let ((port (open-file ".config" "a")) (extra-configuration ,(config->string extra-options))) (display extra-configuration port) (close-port port))
sk: ;; Vkladanie na koniec funguje aj keď voľba v súbore nebola. ;; Pri viacnásobnom uvedení prevažuje to posledné. (let ((port (open-file ".config" "a")) (extra-configuration ,(config->string extra-options))) (display extra-configuration port) (close-port port))

source: So by not providing a configuration-file the @file{.config} starts blank, and then we write into it the collection of flags that we want. Here's another custom kernel:
es: Así que al no proporcionar un archivo de configuración el @file{.config} comienza en blanco, y luego escribimos en él la colección de indicadores que queremos. Aquí hay otro kernel personalizado:
it: Quindi, non fornendo un file di configurazione, il @file{.config} inizia vuoto, e poi ci scriviamo la raccolta di flag che vogliamo. Ecco un altro kernel personalizzato:
pt_br: Portanto, ao não fornecer um arquivo de configuração, o @file{.config} começa em branco e então escrevemos nele a coleção de flags que desejamos. Aqui está outro kernel personalizado:
sk: Takže, neposkytnutie súboru nastavenia spôsobí, že je súbor @file{.config} spočiatku prázdny. Potom doň zapíšeme voľby, ktoré chceme. Viď ďalšie vlastné zadanie jadra:

source: (define-public linux-libre-macbook41 ;; XXX: Access the internal 'make-linux-libre*' procedure, which is ;; private and unexported, and is liable to change in the future. ((@@@@ (gnu packages linux) make-linux-libre*) (@@@@ (gnu packages linux) linux-libre-version) (@@@@ (gnu packages linux) linux-libre-gnu-revision) (@@@@ (gnu packages linux) linux-libre-source) '("x86_64-linux") #:extra-version "macbook41" #:extra-options %macbook41-config-options))
es: (define-public linux-libre-macbook41 ;; XXX: Accede al procedimiento interno 'make-linux-libre*', que es ;; privado y no tiene soporte, y es susceptible de cambiar en el futuro. ((@@@@ (gnu packages linux) make-linux-libre*) (@@@@ (gnu packages linux) linux-libre-version) (@@@@ (gnu packages linux) linux-libre-gnu-revision) (@@@@ (gnu packages linux) linux-libre-source) '("x86_64-linux") #:extra-version "macbook41" #:extra-options %macbook41-config-options))
it: (define-public linux-libre-macbook41 ;; XXX: Accedere alla procedura interna 'make-linux-libre*', che è ;; privata e non esportata, e soggetta a modifiche future. ((@@@@ (gnu packages linux) make-linux-libre*) (@@@@ (gnu packages linux) linux-libre-version) (@@@@ (gnu packages linux) linux-libre-gnu-revision) (@@@@ (gnu packages linux) linux-libre-source) '("x86_64-linux") #:extra-version "macbook41" #:extra-options %macbook41-config-options))
pt_br: (define-public linux-libre-macbook41 ;; XXX: Acesso ao procedimento interno 'make-linux-libre*', que é ;; privado e não exportado, e que pode mudar no futuro. ((@@@@ (gnu packages linux) make-linux-libre*) (@@@@ (gnu packages linux) linux-libre-version) (@@@@ (gnu packages linux) linux-libre-gnu-revision) (@@@@ (gnu packages linux) linux-libre-source) '("x86_64-linux") #:extra-version "macbook41" #:extra-options %macbook41-config-options))
sk: (define-public linux-libre-macbook41 ;; XXX: Prístup k funkcii „make-linux-libre*“, ktorá je súkromná, ;; neexportuje sa a v budúcnosti by sa mohla zmeniť. ((@@@@ (gnu packages linux) make-linux-libre*) (@@@@ (gnu packages linux) linux-libre-version) (@@@@ (gnu packages linux) linux-libre-gnu-revision) (@@@@ (gnu packages linux) linux-libre-source) '("x86_64-linux") #:extra-version "macbook41" #:extra-options %macbook41-config-options))

source: In the above example @code{%file-systems} is a collection of flags enabling different file system support, @code{%efi-support} enables EFI support and @code{%emulation} enables a x86_64-linux machine to act in 32-bit mode also. The @code{default-extra-linux-options} procedure is the one defined above, which had to be used to avoid losing the default configuration options of the @code{extra-options} keyword.
es: En el ejemplo anterior @code{%file-systems} es una colección de indicadores que habilitan el soporte de diferentes sistemas de archivos, @code{%efi-support} habilita el soporte EFI y @code{%emulation} permite que una máquina x86_64-linux actúe también en modo de 32 bits. El procedimiento @code{default-extra-linux-options} es el definido anteriormente, que tuvo que ser utilizado para evitar perder las opciones de configuración por defecto de la palabra clave @code{extra-options}.
it: Nell'esempio precedente @code{%file-systems} è una raccolta di flag che abilitano il supporto di diversi file system, @code{%efi-support} abilita il supporto EFI e @code{%emulation} abilita una macchina x86_64-linux a operare anche in modalità 32 bit. La procedura @code{default-extra-linux-options} è quella definita sopra, che è stata usata per evitare di perdere le opzioni di configurazione predefinite della parola chiave @code{extra-options}.
pt_br: No exemplo acima, @code{%file-systems} é uma coleção de sinalizadores que habilitam suporte a diferentes sistemas de arquivos, @code{%efi-support} habilita suporte a EFI e @code{%emulation} habilita uma máquina x86_64-linux para atuar no modo de 32 bits também. O procedimento @code{default-extra-linux-options} é o definido acima, que teve que ser usado para evitar a perda das opções de configuração padrão da palavra-chave @code{extra-options}.
sk: V hore uvedenom príklade je @code{%file-systems} zbierkou volieb povoľujúcich podporu rôznych súborových systémov, @code{%efi-support} povoľuje podporu EFI a @code{%emulation} povoľuje strojom x86_64-linux pracovať v 32-bitovom režime. Postup @code{default-extra-linux-options} je ten, ktorý sme zadali už predtým, aby sme zabránili strate prednastavených volieb kľúčového slova @code{extra-options}.

source: This all sounds like it should be doable, but how does one even know which modules are required for a particular system? Two places that can be helpful in trying to answer this question is the @uref{https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel, Gentoo Handbook} and the @uref{https://www.kernel.org/doc/html/latest/admin-guide/README.html?highlight=localmodconfig, documentation from the kernel itself}. From the kernel documentation, it seems that @code{make localmodconfig} is the command we want.
es: Todo esto suena como que debería ser factible, pero ¿cómo se sabe siquiera qué módulos son necesarios para un sistema en particular? Dos lugares que pueden ser útiles para intentar responder a esta pregunta son el @uref{https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel, Manual Gentoo} y el @uref{https://www.kernel.org/doc/html/latest/admin-guide/README.html?highlight=localmodconfig, documentación del propio kernel}. De la documentación del kernel, parece que @code{make localmodconfig} es el comando que queremos.
it: Tutto questo sembra fattibile, ma come si fa a sapere quali moduli sono richiesti per un sistema particolare? Due posti che possono essere utili nel tentativo di rispondere a questa domanda sono il @uref{https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel, Manuale Gentoo} e la @uref{https://www.kernel.org/doc/html/latest/admin-guide/README.html?highlight=localmodconfig, documentazione del kernel stesso}. Dalla documentazione del kernel, sembra che @code{make localmodconfig} sia il comando che vogliamo.
pt_br: Tudo isso parece viável, mas como saber quais módulos são necessários para um sistema específico? Dois lugares que podem ser úteis para tentar responder a esta pergunta são o @uref{https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel, Gentoo Handbook} e o @uref{https://www .kernel.org/doc/html/latest/admin-guide/README.html?highlight=localmodconfig, documentação do próprio kernel}. Pela documentação do kernel, parece que @code{make localmodconfig} é o comando que queremos.
sk: Všetko toto znie veľmi dobre, ale ako zistiť, ktoré moduly vyžaduje určitý systém? Na túto otázku nám môžu pomôcť odpovedať dva zdroje: @uref{https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Kernel, Príručka Gentoo} a @uref{https://www.kernel.org/doc/html/latest/admin-guide/README.html?highlight=localmodconfig, dokumentácia samotného jadra}. Podľa dokumentácie jadra sa zdá, že @code{make localmodconfig} je príkaz, ktorý hľadáme.

source: In order to actually run @code{make localmodconfig} we first need to get and unpack the kernel source code:
es: Para poder ejecutar @code{make localmodconfig} primero necesitamos obtener y desempaquetar el código fuente del kernel:
it: Per poter effettivamente eseguire @code{make localmodconfig}, dobbiamo prima ottenere e decomprimere il codice sorgente del kernel:
pt_br: Para realmente executar @code{make localmodconfig} primeiro precisamos obter e descompactar o código-fonte do kernel:
sk: Skôr ako budeme môcť spustiť @code{make localmodconfig}, musíme stiahnuť a rozbaliť zdrojové súbory jadra:

source: Once inside the directory containing the source code run @code{touch .config} to create an initial, empty @file{.config} to start with. @code{make localmodconfig} works by seeing what you already have in @file{.config} and letting you know what you're missing. If the file is blank then you're missing everything. The next step is to run:
es: Una vez dentro del directorio que contiene el código fuente ejecute @code{touch .config} para crear un @file{.config} inicial vacío con el que empezar. @code{make localmodconfig} funciona viendo lo que ya tiene en @file{.config} y le informa de lo que le falta. Si el archivo está en blanco entonces te falta todo. El siguiente paso es ejecutar:
it: Una volta all'interno della directory contenente il codice sorgente, esegui @code{touch .config} per creare un file @file{.config} iniziale e vuoto con cui iniziare. @code{make localmodconfig} funziona controllando ciò che hai già in @file{.config} e facendoti sapere cosa ti manca. Se il file è vuoto, ti manca tutto. Il passo successivo è eseguire:
pt_br: Uma vez dentro do diretório que contém o código-fonte, execute @code{touch .config} para criar um @file{.config} inicial e vazio para começar. @code{make localmodconfig} funciona vendo o que você já tem em @file{.config} e informando o que está faltando. Se o arquivo estiver em branco, você está perdendo tudo. O próximo passo é executar:
sk: V priečinku obsahujúcom zdrojové súbory spustite @code{touch .config} pre vytvorenie počiatočného prázdneho @file{.config} súboru. @code{make localmodconfig} funguje tak, že zistí, čo ste už zadali do @file{.config} a povie vám, čo vám ešte chýba. Ak je súbor prázdny, tak vám chýba všetko. Ďalším krokom je spustiť:

source: and note the output. Do note that the @file{.config} file is still empty. The output generally contains two types of warnings. The first start with "WARNING" and can actually be ignored in our case. The second read:
es: y observe la salida. Tenga en cuenta que el archivo @file{.config} sigue estando vacío. La salida contiene generalmente dos tipos de advertencias. La primera empieza por "WARNING" y puede ignorarse en nuestro caso. El segundo dice:
it: e annota l'output. Si noti che il file @file{.config} è ancora vuoto. L'output generalmente contiene due tipi di avvisi. I primi iniziano con "WARNING" e possono essere ignorati nel nostro caso. I secondi recitano:
pt_br: e observe a saída. Observe que o arquivo @file{.config} ainda está vazio. A saída geralmente contém dois tipos de avisos. O primeiro começa com "WARNING" e pode ser ignorado no nosso caso. A segunda leitura:
sk: a pozrite si výstup. Všimnite si, že súbor @file{.config} je stále prázdny. Výstup obvykle obsahuje dva druhy varovných správ. Prvá začína slovom „WARNING“ a v našom prípade si ju nemusíme všímať. Druhá správa nám hovorí, že:

source: module pcspkr did not have configs CONFIG_INPUT_PCSPKR
es: módulo pcspkr no tenía configuración CONFIG_INPUT_PCSPKR
it: il modulo pcspkr non aveva configurazioni CONFIG_INPUT_PCSPKR

source: For each of these lines, copy the @code{CONFIG_XXXX_XXXX} portion into the @file{.config} in the directory, and append @code{=m}, so in the end it looks like this:
es: Para cada una de estas líneas, copia la parte @code{CONFIG_XXXX_XXXX} en el @file{.config} del directorio, y añade @code{=m}, para que al final quede así:
it: Per ciascuna di queste righe, copia la porzione @code{CONFIG_XXXX_XXXX} nel @file{.config} nella directory, e aggiungi @code{=m}, così alla fine appare così:
pt_br: Para cada uma dessas linhas, copie a parte @code{CONFIG_XXXX_XXXX} para @file{.config} no diretório e anexe @code{=m}, para que no final fique assim:
sk: Pre každý z týchto riadkov skopírujte časť @code{CONFIG_XXXX_XXXX} do @file{.config} súboru priečinka a pridajte @code{=m} tak, aby nakoniec vyzeral takto:

source: After copying all the configuration options, run @code{make localmodconfig} again to make sure that you don't have any output starting with ``module''. After all of these machine specific modules there are a couple more left that are also needed. @code{CONFIG_MODULES} is necessary so that you can build and load modules separately and not have everything built into the kernel. @code{CONFIG_BLK_DEV_SD} is required for reading from hard drives. It is possible that there are other modules which you will need.
es: Después de copiar todas las opciones de configuración, ejecute @code{make localmodconfig} de nuevo para asegurarse de que no tiene ninguna salida que empiece por ``module''. Después de todos estos módulos específicos de la máquina quedan un par más que también son necesarios. @code{CONFIG_MODULES} es necesario para que pueda construir y cargar módulos por separado y no tener todo integrado en el núcleo. @code{CONFIG_BLK_DEV_SD} es necesario para leer de discos duros. Es posible que haya otros módulos que necesite.
it: Dopo aver copiato tutte le opzioni di configurazione, esegui di nuovo @code{make localmodconfig} per assicurarti di non avere output che iniziano con ``module''. Dopo tutti questi moduli specifici della macchina, ne rimangono un paio che sono anche necessari. @code{CONFIG_MODULES} è necessario affinché tu possa compilare e caricare i moduli separatamente e non avere tutto compilato nel kernel. @code{CONFIG_BLK_DEV_SD} è richiesto per la lettura da dischi rigidi. È possibile che tu abbia bisogno di altri moduli.
pt_br: Após copiar todas as opções de configuração, execute @code{make localmodconfig} novamente para ter certeza de que você não tem nenhuma saída começando com ``module''. Depois de todos esses módulos específicos da máquina, restam mais alguns que também são necessários. @code{CONFIG_MODULES} é necessário para que você possa construir e carregar módulos separadamente e não ter tudo embutido no kernel. @code{CONFIG_BLK_DEV_SD} é necessário para leitura de discos rígidos. É possível que existam outros módulos dos quais você precisará.
sk: Po skopírovaní všetkých volieb nastavenia znova spustite @code{make localmodconfig}, aby ste sa uistili, že výstup už neobsahuje žiadne správy začínajúce slovom „module“. Okrem všetkých týchto modulov vzťahujúcich sa k stroju nám ostáva ešte niekoľko ďalších dôležitých modulov. @code{CONFIG_MODULES} umožňuje zostavovať a načítavať moduly oddelene, aby nemuseli byť zabudované do jadra. @code{CONFIG_BLK_DEV_SD} umožňuje čítať pevné disky. Je tiež možné, že budete potrebovať aj iné moduly.

source: This post does not aim to be a guide to configuring your own kernel however, so if you do decide to build a custom kernel you'll have to seek out other guides to create a kernel which is just right for your needs.
es: Sin embargo, este post no pretende ser una guía para configurar tu propio kernel, así que si decides construir un kernel personalizado tendrás que buscar otras guías para crear un kernel que se ajuste a tus necesidades.
it: Questo post non intende tuttavia essere una guida alla configurazione del proprio kernel, quindi se decidi di compilare un kernel personalizzato dovrai cercare altre guide per creare un kernel adatto alle tue esigenze.
pt_br: Este post não pretende ser um guia para configurar seu próprio kernel, portanto, se você decidir construir um kernel personalizado, você terá que procurar outros guias para criar um kernel adequado às suas necessidades.
sk: Tento príspevok nemá za úlohu vás previesť nastavením vášho vlastného jadra. Ak sa rozhodnete zostaviť si vlastné jadro, budete si musieť nájsť iné návody na vytvorenie jadra, ktoré vám bude vyhovovať.

source: The second way to setup the kernel configuration makes more use of Guix's features and allows you to share configuration segments between different kernels. For example, all machines using EFI to boot have a number of EFI configuration flags that they need. It is likely that all the kernels will share a list of file systems to support. By using variables it is easier to see at a glance what features are enabled and to make sure you don't have features in one kernel but missing in another.
es: La segunda forma de configurar el kernel hace un mayor uso de las características de Guix y permite compartir segmentos de configuración entre diferentes kernels. Por ejemplo, todas las máquinas que utilizan EFI para arrancar tienen una serie de banderas de configuración EFI que necesitan. Es probable que todos los kernels compartan una lista de sistemas de ficheros a soportar. Mediante el uso de variables es más fácil ver de un vistazo qué características están habilitadas y asegurarse de no tener características en un núcleo pero que faltan en otro.
it: Il secondo modo per configurare il kernel sfrutta maggiormente le funzionalità di Guix e consente di condividere segmenti di configurazione tra kernel diversi. Ad esempio, tutte le macchine che usano EFI per l'avvio hanno una serie di flag di configurazione EFI di cui hanno bisogno. È probabile che tutti i kernel condividano un elenco di file system da supportare. Usando le variabili è più facile vedere a colpo d'occhio quali funzionalità sono abilitate e assicurarsi di non avere funzionalità in un kernel ma mancanti in un altro.
pt_br: A segunda maneira de definir a configuração do kernel faz mais uso dos recursos do Guix e permite compartilhar segmentos de configuração entre diferentes kernels. Por exemplo, todas as máquinas que usam EFI para inicializar possuem vários sinalizadores de configuração EFI necessários. É provável que todos os kernels compartilhem uma lista de sistemas de arquivos para suporte. Ao usar variáveis, é mais fácil ver rapidamente quais recursos estão habilitados e garantir que você não tenha recursos em um kernel, mas ausentes em outro.
sk: Druhý spôsob nastavenia jadra využíva funkcie Guixu vo väčšej miere a umožňuje vám zdieľať časti nastavenia medzi rôznymi jadrami. Napríklad, všetky stroje používajúce na zavádzanie EFI vyžadujú určitý počet volieb nastavenia EFI. Je tiež pravdepodobné, že viaceré jadrá budú zdieľať podporu niekoľkých súborových systémov. Použitím premenných je jednoduchšie spozorovať, ktoré súčasti sú povolené a uistiť sa, či nie sú niektoré z nich prítomné v jednom jadre ale v druhom chýbajú.

source: Left undiscussed however, is Guix's initrd and its customization. It is likely that you'll need to modify the initrd on a machine using a custom kernel, since certain modules which are expected to be built may not be available for inclusion into the initrd.
es: Sin embargo, no se ha hablado del initrd de Guix y su personalización. Es probable que tenga que modificar el initrd en una máquina que utilice un kernel personalizado, ya que ciertos módulos que se espera que se construyan pueden no estar disponibles para su inclusión en el initrd.
it: Rimane tuttavia non discusso il sistema initrd di Guix e la sua personalizzazione. È probabile che sia necessario modificare l'initrd su una macchina che utilizza un kernel personalizzato, poiché alcuni moduli che ci si aspetta siano compilati potrebbero non essere disponibili per l'inclusione nell'initrd.
pt_br: No entanto, não foi discutido o initrd do Guix e sua personalização. É provável que você precise modificar o initrd em uma máquina usando um kernel customizado, já que certos módulos que devem ser compilados podem não estar disponíveis para inclusão no initrd.
sk: Nepozreli sme sa však na initrd a jeho prispôsobenie. Je pravdepodobné, že budete potrebovať prispôsobiť initrd na stroji s vlastným jadrom, keďže niektoré moduly nemusia byť dostupné pre zahrnutie do initrd.

source: Historically, Guix System is centered around an @code{operating-system} structure. This structure contains various fields ranging from the bootloader and kernel declaration to the services to install.
es: Históricamente, el sistema Guix se centra en una estructura @code{operating-system}. Esta estructura contiene varios campos que van desde el gestor de arranque y la declaración del kernel hasta los servicios a instalar.
it: Storicamente, Guix System è incentrato su una struttura @code{operating-system}. Questa struttura contiene vari campi che vanno dal bootloader e dalla dichiarazione del kernel ai servizi da installare.
pt_br: Historicamente, o Sistema Guix é centrado em uma estrutura @code{operating-system}. Esta estrutura contém vários campos que vão desde o gerenciador de boot e a declaração do kernel até os serviços a serem instalados.
sk: Z dejinného pohľadu je systém Guix sústredený okolo štruktúry @code{operating-system}. Táto štruktúra obsahuje rôzne polia počínajúc zadaním zavádzača a jadra až k službám, ktoré sa majú nainštalovať.
