Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: # Attach the new net namespace "guix-test" to the container PID. sudo ip netns attach $ns $pid
es: # Adjunta el nuevo espacio de nombre de red "guix-test" para el PID de contenedor. sudo ip netns attach $ns $pid
it: # Collega il nuovo net namespace "guix-test" al PID del contenitore. sudo ip netns attach $ns $pid
pt_br: # Anexe o novo namespace de rede "guix-test" ao PID do contêiner. sudo ip netns attach $ns $pid
sk: # Pripojiť novú oblasť mien „guix-skuska“ k PID kontajnera. sudo ip netns attach $ns $pid

source: # Create the pair of devices sudo ip link add $host type veth peer name $client
es: # Crea la pareja de dispositivos sudo ip link add $host type veth peer name $client
it: # Crea la coppia di dispositivi sudo ip link add $host type veth peer name $client
pt_br: # Crie o par de dispositivos sudo ip link add $host type veth peer name $client
sk: # Vytvoriť pár zariadení. sudo ip link add $host type veth peer name $client

source: # Move the client device into the container's net namespace sudo ip link set $client netns $ns
es: # Mueve el dispositivo cliente a la red de contenedor del espacio de nombre sudo ip link set $client netns $ns
it: # Sposta il dispositivo client nel namespace di rete del contenitore sudo ip link set $client netns $ns
pt_br: # Mova o dispositivo cliente para o namespace de rede do contêiner sudo ip link set $client netns $ns
sk: # Presunúť klientske zariadenie do oblasti mien kontajnera. sudo ip link set $client netns $ns

source: Then we configure the host side:
es: Entonces configure el lado del hospedaje:
it: Quindi configuriamo il lato host:
pt_br: Em seguida, configuramos o lado do host:
sk: Potom nastavíme hostiteľa:

source: @dots{}and then we configure the client side:
es: @dots{} y entonces configuramos el lado de cliente:
it: @dots{}e poi configuriamo il lato client:
pt_br: @dots{}e então configuramos o lado do cliente:
sk: @dots{}a klienta:

source: At this point the host can reach the container at IP address 10.0.0.2, and the container can reach the host at IP 10.0.0.1. This is all we need to talk to the database server inside the container from the host system on the outside.
es: En este punto el hospedaje puede alcanzar el contenedor en la dirección IP 10.0.0.2, y el contenedor puede alcanzar el hospedador en la IP 10.0.0.1. Esto es todo lo que necesitamos para el servidor de datos base dentro del contenedor desde el sistema hospedaje en la parte externa.
it: A questo punto l'host può raggiungere il contenitore all'indirizzo IP 10.0.0.2, e il contenitore può raggiungere l'host all'IP 10.0.0.1. Questo è tutto ciò di cui abbiamo bisogno per parlare con il server di database all'interno del contenitore dal sistema host all'esterno.
pt_br: Neste ponto, o host pode alcançar o contêiner no endereço IP 10.0.0.2, e o contêiner pode alcançar o host no IP 10.0.0.1. Isso é tudo o que precisamos para falar com o servidor de banco de dados dentro do contêiner do sistema host do lado de fora.
sk: V tomto bode má hostiteľ dosah na klienta cez IP adresu 10.0.0.2 a kontajner má dosah na hostiteľa cez IP 10.0.0.1. To je všetko čo potrebujeme pre spojenie sa s databázovým serverom v kontajneri z vonkajšieho prostredia hostiteľského systému.

source: $ psql -h 10.0.0.2 -U test psql (14.4) Type "help" for help.
es: $ psql -h 10.0.0.2 -U test psql (14.4) Teclee "help" para ayuda
it: $ psql -h 10.0.0.2 -U test psql (14.4) Digita "help" per aiuto.
sk: $ psql -h 10.0.0.2 -U skuska psql (14.4) Type "help" for help.

source: test=> CREATE TABLE hello (who TEXT NOT NULL); CREATE TABLE test=> INSERT INTO hello (who) VALUES ('world'); INSERT 0 1 test=> SELECT * FROM hello; who ------- world (1 row)
it: test=> CREATE TABLE hello (who TEXT NOT NULL); CREATE TABLE test=> INSERT INTO hello (who) VALUES ('world'); INSERT 0 1 test=> SELECT * FROM hello; who ------- world (1 riga)
sk: skuska=> CREATE TABLE ahoj (kto TEXT NOT NULL); CREATE TABLE skuska=> INSERT INTO ahoj (kto) VALUES ('svet'); INSERT 0 1 skuska=> SELECT * FROM ahoj; kto ------- svet (1 row)

source: Now that we're done with this little demonstration let's clean up:
es: Ahora eso está hecho con esta demostración breve::
it: Ora che abbiamo finito con questa piccola dimostrazione, puliamo:
pt_br: Agora que terminamos esta pequena demonstração, vamos limpar:
sk: Keď už sme skončili s týmto krátkym príkladom, trochu upracme:

source: Guix can produce disk images (@pxref{Invoking guix system,,, guix, GNU Guix Reference Manual}) that can be used with virtual machines solutions such as virt-manager, GNOME Boxes or the more bare QEMU, among others.
es: Guix puede producir imágenes de disco (@pxref{Invoking guix system,,, guix, Manual de referencia de GNU Guix}) que pueden ser usadas con soluciones de máquinas virtuales como virt-manager, GNOME Boxes o la más desnuda QEMU, entre otras.
it: Guix può produrre immagini disco (@pxref{Invocare guix system,,, guix.it, Manuale di riferimento di GNU Guix}) che possono essere utilizzate con soluzioni di macchine virtuali come virt-manager, GNOME Boxes o il più semplice QEMU, tra gli altri.
pt_br: O Guix pode produzir imagens de disco (@pxref{Invocando guix system,,, guix.pt_BR, Manual de Referência do GNU Guix}) que podem ser usadas com soluções de máquinas virtuais como virt-manager, GNOME Boxes ou o mais simples QEMU, entre outros.

source: This chapter aims to provide hands-on, practical examples that relates to the usage and configuration of virtual machines on a Guix System.
es: El objetivo de este capítulo es proporcionar ejemplos prácticos relacionados con el uso y la configuración de máquinas virtuales en un sistema Guix.
it: Questo capitolo si propone di fornire esempi pratici e concreti relativi all'utilizzo e alla configurazione di macchine virtuali su un sistema Guix.
pt_br: Este capítulo tem como objetivo fornecer exemplos práticos e práticos relacionados ao uso e à configuração de máquinas virtuais em um sistema Guix.

source: Network bridge interface
es: Interfaz de puente de red
it: Interfaccia bridge di rete
pt_br: Interface de ponte de rede

source: qemu, network bridge
es: qemu, puente de red
it: qemu, bridge di rete
pt_br: qemu, ponte de rede

source: By default, QEMU uses a so-called ``user mode'' host network back-end, which is convenient as it does not require any configuration. Unfortunately, it is also quite limited. In this mode, the guest @abbr{VM, virtual machine} can access the network the same way the host would, but it cannot be reached from the host. Additionally, since the QEMU user networking mode relies on ICMP, ICMP-based networking tools such as @command{ping} do @emph{not} work in this mode. Thus, it is often desirable to configure a network bridge, which enables the guest to fully participate in the network. This is necessary, for example, when the guest is to be used as a server.
it: Per impostazione predefinita, QEMU utilizza un back-end di rete host cosiddetto ``user mode'', che è comodo in quanto non richiede alcuna configurazione. Sfortunatamente, è anche piuttosto limitato. In questa modalità, la @abbr{VM, macchina virtuale} guest può accedere alla rete nello stesso modo in cui lo farebbe l'host, ma non può essere raggiunta dall'host. Inoltre, poiché la modalità di rete utente di QEMU si basa su ICMP, gli strumenti di rete basati su ICMP come @command{ping} @emph{not} funzionano in questa modalità. Pertanto, è spesso desiderabile configurare un bridge di rete, che consente al guest di partecipare pienamente alla rete. Ciò è necessario, ad esempio, quando il guest deve essere utilizzato come server.
pt_br: Por padrão, o QEMU usa um back-end de rede host chamado ``modo usuário'', o que é conveniente, pois não requer nenhuma configuração. Infelizmente, também é bastante limitado. Neste modo, o convidado @abbr{VM, máquina virtual} pode acessar a rede da mesma forma que o host, mas não pode ser alcançado a partir do host. Além disso, como o modo de rede do usuário do QEMU depende do ICMP, ferramentas de rede baseadas em ICMP, como @command{ping}, @emph{não} funcionam neste modo. Portanto, geralmente é desejável configurar uma ponte de rede, que permite que o convidado participe totalmente da rede. Isso é necessário, por exemplo, quando o convidado deve ser usado como um servidor.

source: Creating a network bridge interface
it: Creazione di un'interfaccia bridge di rete
pt_br: Criando uma interface de ponte de rede

source: There are many ways to create a network bridge. The following command shows how to use NetworkManager and its @command{nmcli} command line interface (CLI) tool, which should already be available if your operating system declaration is based on one of the desktop templates:
it: Esistono molti modi per creare un bridge di rete. Il seguente comando mostra come usare NetworkManager e il suo strumento @command{nmcli} da riga di comando (CLI), che dovrebbe essere già disponibile se la dichiarazione del tuo sistema operativo si basa su uno dei modelli desktop:
pt_br: Há muitas maneiras de criar uma ponte de rede. O comando a seguir mostra como usar o NetworkManager e sua ferramenta de interface de linha de comando (CLI) @command{nmcli}, que já deve estar disponível se a declaração do seu sistema operacional for baseada em um dos modelos de desktop:

source: To have this bridge be part of your network, you must associate your network bridge with the Ethernet interface used to connect with the network. Assuming your interface is named @samp{enp2s0}, the following command can be used to do so:
es: Para que este puente forme parte de su red, debe asociar su puente de red con la interfaz Ethernet utilizada para conectarse con la red. Suponiendo que su interfaz se llama @samp{enp2s0}, se puede utilizar el siguiente comando para hacerlo:
it: Per far sì che questo bridge faccia parte della tua rete, devi associare il tuo bridge di rete all'interfaccia Ethernet usata per connetterti alla rete. Supponendo che la tua interfaccia si chiami @samp{enp2s0}, il seguente comando può essere usato per farlo:
pt_br: Para que essa ponte faça parte da sua rede, você deve associar sua ponte de rede à interface Ethernet usada para conectar-se à rede. Supondo que sua interface seja chamada @samp{enp2s0}, o comando a seguir pode ser usado para fazer isso:

source: Important
es: Importante
it: Importante
pt_br: Importante
ru: Важно
sv: Viktigt

source: Only Ethernet interfaces can be added to a bridge. For wireless interfaces, consider the routed network approach detailed in @xref{Routed network for libvirt}.
es: Solamente los interfaces Ethernet pueden ser añadidos a un puente. Para interfaces sin hilo, considere que la apropiación de red de enrrutado en @xref{Red enrutada para libvirt}.
it: Solo le interfacce Ethernet possono essere aggiunte a un bridge. Per le interfacce wireless, considerare l'approccio di rete instradata dettagliato in @xref{Routed network for libvirt}.
pt_br: Somente interfaces Ethernet podem ser adicionadas a uma ponte. Para interfaces sem fio, considere a abordagem de rede roteada detalhada em @xref{Routed network for libvirt}.

source: By default, the network bridge will allow your guests to obtain their IP address via DHCP, if available on your local network. For simplicity, this is what we will use here. To easily find the guests, they can be configured to advertise their host names via mDNS.
es: Por defecto, el puente de red permitirá sus invitados que obtenga su dirección IP por medio de DHCP, si disponible en su red local. Por simplificar, esto es que usaremos aquí. Para encontrar fácilmente el invitado, puede ser configurador para advertir su nombres de hospedajes por medio de mDNS.
it: Per impostazione predefinita, il bridge di rete consentirà ai tuoi ospiti di ottenere il loro indirizzo IP tramite DHCP, se disponibile sulla tua rete locale. Per semplicità, questo è ciò che useremo qui. Per trovare facilmente gli ospiti, possono essere configurati per pubblicizzare i loro nomi host tramite mDNS.
pt_br: Por padrão, a ponte de rede permitirá que seus convidados obtenham seus endereços IP via DHCP, se disponível em sua rede local. Para simplificar, é isso que usaremos aqui. Para encontrar facilmente os convidados, eles podem ser configurados para anunciar seus nomes de host via mDNS.

source: Configuring the QEMU bridge helper script
es: Configura el guion ayudante del puente QEMU
it: Configurazione dello script helper del bridge QEMU
pt_br: Configurando o script auxiliar da ponte QEMU

source: QEMU comes with a helper program to conveniently make use of a network bridge interface as an unprivileged user @pxref{Network options,,, QEMU, QEMU Documentation}. The binary must be made setuid root for proper operation; this can be achieved by adding it to the @code{privileged-programs} field of your (host) @code{operating-system} definition, as shown below:
es: QEMU viene con un programa de ayuda para hacer uso convenientemente de una interfaz de puente de red como un usuario sin privilegios @pxref{Opciones de red,,, QEMU, Documentación QEMU}. El binario se debe hacer root setuid para un funcionamiento correcto; esto se puede lograr mediante la adición a la @code{privileged-programs} campo de su (host) @code{sistema-operativo} definición, como se muestra a continuación:
it: QEMU viene fornito con un programma di aiuto per utilizzare comodamente un'interfaccia bridge di rete come utente non privilegiato @pxref{Network options,,, QEMU, Documentazione QEMU}. Il binario deve essere reso setuid root per il corretto funzionamento; questo può essere ottenuto aggiungendolo al campo @code{privileged-programs} della tua definizione @code{operating-system} (host), come mostrato sotto:
pt_br: O QEMU vem com um programa auxiliar para usar convenientemente uma interface de ponte de rede como um usuário sem privilégios @pxref{Network options,,, QEMU, Documentação do QEMU}. O binário deve ser definido como setuid root para operação adequada; isso pode ser obtido adicionando-o ao campo @code{privileged-programs} da sua definição @code{operating-system} (host), conforme mostrado abaixo:

source: The file @file{/etc/qemu/bridge.conf} must also be made to allow the bridge interface, as the default is to deny all. Add the following to your list of services to do so:
es: El archivo @file{/etc/qemu/bridge.conf} también se debe hacer para permitir la interfaz bridge, ya que el valor predeterminado es denegar todo. Para ello, añada lo siguiente a la lista de servicios:
it: Il file @file{/etc/qemu/bridge.conf} deve anche essere modificato per consentire l'interfaccia del bridge, poiché l'impostazione predefinita è di negare tutto. Aggiungi quanto segue all'elenco dei servizi per farlo:
pt_br: O arquivo @file{/etc/qemu/bridge.conf} também deve ser feito para permitir a interface bridge, já que o padrão é negar tudo. Adicione o seguinte à sua lista de serviços para fazer isso:

source: Invoking QEMU with the right command line options
es: Invocar QEMU con las opciones de línea de comandos adecuadas
it: Avviare QEMU con le opzioni da riga di comando corrette
pt_br: Invocando QEMU com as opções de linha de comando corretas

source: When invoking QEMU, the following options should be provided so that the network bridge is used, after having selected a unique MAC address for the guest.
es: Cuando invoque a QEMU, las siguientes opciones estarían proporcionadas tales que el puente de red es utilizado, tras haber seleccionado una dirección MAC única para el invitado.
it: Quando si invoca QEMU, le seguenti opzioni devono essere fornite in modo che il bridge di rete sia utilizzato, dopo aver selezionato un indirizzo MAC unico per il guest.
pt_br: Ao invocar o QEMU, as seguintes opções devem ser fornecidas para que a ponte de rede seja usada, após selecionar um endereço MAC exclusivo para o convidado.

source: By default, a single MAC address is used for all guests, unless provided. Failing to provide different MAC addresses to each virtual machine making use of the bridge would cause networking issues.
es: Por defecto, se utiliza una única dirección MAC para todos los invitados, a menos que se proporcione. Si no se proporcionan direcciones MAC diferentes a cada máquina virtual que utilice el puente, se producirán problemas de red.
it: Per impostazione predefinita, viene utilizzato un singolo indirizzo MAC per tutti gli ospiti, a meno che non venga fornito. Il mancato fornitura di indirizzi MAC diversi a ciascuna macchina virtuale che utilizza il bridge causerebbe problemi di rete.
pt_br: Por padrão, um único endereço MAC é usado para todos os convidados, a menos que seja fornecido. Deixar de fornecer endereços MAC diferentes para cada máquina virtual que faz uso da ponte causaria problemas de rede.

source: To generate MAC addresses that have the QEMU registered prefix, the following snippet can be employed:
es: Para generar direcciones MAC que tienen el prefijo QEMU registrado, el siguiente fragmento puede ser empleado:
it: Per generare indirizzi MAC che hanno il prefisso registrato da QEMU, può essere utilizzato il seguente frammento:
pt_br: Para gerar endereços MAC que tenham o prefixo registrado QEMU, o seguinte snippet pode ser empregado:

source: Networking issues caused by Docker
es: Asuntos de red causados por Docker
it: Problemi di rete causati da Docker
pt_br: Problemas de rede causados pelo Docker

source: If you use Docker on your machine, you may experience connectivity issues when attempting to use a network bridge, which are caused by Docker also relying on network bridges and configuring its own routing rules. The solution is add the following @code{iptables} snippet to your @code{operating-system} declaration:
es: Si utilizas Docker en su máquina, puede experimentar problemas de conectividad cuando intente utilizar un puente de red, el cual está causado por Docker además de confiar en puentes de red y configuración en sus propias reglas de enrutado. La solución es añadir el siguiente fragmento de @code{iptables} a su declaración de @code{sistema-operativo}:
it: Se usi Docker sulla tua macchina, potresti riscontrare problemi di connettività quando tenti di usare un bridge di rete, causati dal fatto che Docker si basa anche sui bridge di rete e configura le proprie regole di routing. La soluzione è aggiungere il seguente frammento @code{iptables} alla tua dichiarazione @code{operating-system}:
pt_br: Se você usa o Docker na sua máquina, você pode ter problemas de conectividade ao tentar usar uma ponte de rede, que são causados pelo Docker também depender de pontes de rede e configurar suas próprias regras de roteamento. A solução é adicionar o seguinte snippet @code{iptables} à sua declaração @code{operating-system}:

source: Virtual network bridge interface
it: Interfaccia bridge di rete virtuale
pt_br: Interface de ponte de rede virtual

source: networking, virtual bridge
it: networking, bridge virtuale
pt_br: rede, ponte virtual

source: libvirt, virtual network switch
it: libvirt, switch di rete virtuale
pt_br: libvirt, comutador de rede virtual

source: If the machine hosting your virtual machines is connected wirelessly to the network, you won't be able to use a true network bridge as explained in the preceding section (@pxref{Network bridge for QEMU}). In this case, the next best option is to use a @emph{virtual network switch} with static routing and to configure a libvirt-powered virtual machine to use it (via the @command{virt-manager} GUI for example). This is similar to the default mode of operation of QEMU/libvirt, except that instead of using @abbr{NAT, Network Address Translation}, it relies on static routes to join the @abbr{VM, virtual machine} IP address to the @abbr{LAN, local area network}. This provides two-way connectivity to and from the virtual machine, which is needed for exposing services hosted on the virtual machine.
it: Se la macchina che ospita le tue macchine virtuali è collegata in modalità wireless alla rete, non sarai in grado di usare un vero bridge di rete come spiegato nella sezione precedente (@pxref{Network bridge for QEMU}). In questo caso, la prossima migliore opzione è usare uno @emph{switch di rete virtuale} con routing statico e configurare una macchina virtuale basata su libvirt per usarlo (tramite la GUI di @command{virt-manager} per esempio). Questo è simile alla modalità di funzionamento predefinita di QEMU/libvirt, tranne che invece di usare @abbr{NAT, Network Address Translation}, si basa su rotte statiche per unire l'indirizzo IP della @abbr{VM, macchina virtuale} alla @abbr{LAN, rete locale}. Questo fornisce connettività bidirezionale da e verso la macchina virtuale, che è necessaria per esporre i servizi ospitati sulla macchina virtuale.
pt_br: Se a máquina que hospeda suas máquinas virtuais estiver conectada sem fio à rede, você não poderá usar uma ponte de rede verdadeira, conforme explicado na seção anterior (@pxref{Network bridge for QEMU}). Nesse caso, a próxima melhor opção é usar um @emph{comutador virtual} com roteamento estático e configurar uma máquina virtual com libvirt para usá-la (por meio da GUI @command{virt-manager}, por exemplo). Isso é semelhante ao modo de operação padrão do QEMU/libvirt, exceto que, em vez de usar @abbr{NAT, Network Address Translation}, ele depende de rotas estáticas para unir o endereço IP da @abbr{VM, máquina virtual} à @abbr{LAN, rede local}. Isso fornece conectividade bidirecional de e para a máquina virtual, necessária para expor serviços hospedados na máquina virtual.

source: Creating a virtual network switch
it: Creazione di uno switch di rete virtuale
pt_br: Criando um comutador de rede virtual

source: A virtual network switch consists of a virtual network device called a `virtual bridge', DHCP server (dnsmasq) and firewall rules (iptables). See the @url{https://wiki.libvirt.org/VirtualNetworking.html, libvirt Wiki article on Virtual Networking} for more details on the modes of operation, management and implementation of virtual network switches.
it: Uno switch di rete virtuale consiste in un dispositivo di rete virtuale chiamato `bridge virtuale', server DHCP (dnsmasq) e regole firewall (iptables). Vedi l'@url{https://wiki.libvirt.org/VirtualNetworking.html, articolo wiki di libvirt sulle Reti Virtuali} per maggiori dettagli sulle modalità di funzionamento, gestione e implementazione degli switch di rete virtuali.
pt_br: Um comutador de rede virtual consiste em um dispositivo de rede virtual chamado `ponte virtual', servidor DHCP (dnsmasq) e regras de firewall (iptables). Veja o @url{https://wiki.libvirt.org/VirtualNetworking.html, artigo da Wiki do libvirt sobre redes virtuais} para mais detalhes sobre modos de operação, gerenciamento e implementação de comutadores de rede virtual.
