Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The distribution provides core GNU packages such as GNU libc, GCC, and Binutils, as well as many GNU and non-GNU applications. The complete list of available packages can be browsed @url{https://www.gnu.org/software/guix/packages,on-line} or by running @command{guix package} (@pxref{Invoking guix package}):
it: La distribuzione fornisce pacchetti GNU di base come GNU libc, GCC e Binutils, così come molte applicazioni GNU e non-GNU. L'elenco completo dei pacchetti disponibili può essere consultato @url{https://www.gnu.org/software/guix/packages,on-line} o eseguendo @command{guix package} (@pxref{Invoking guix package}):
pt_br: A distribuição fornece pacotes GNU principais, como GNU libc, GCC e Binutils, além de muitos aplicativos GNU e não GNU. A lista completa de pacotes disponíveis pode ser acessada @url{https://www.gnu.org/software/guix/packages,online} ou executando @command{guix package} (@pxref{Invoking guix package}):

source: Our goal is to provide a practical 100% free software distribution of Linux-based and other variants of GNU, with a focus on the promotion and tight integration of GNU components, and an emphasis on programs and tools that help users exert that freedom.
it: Il nostro obiettivo è fornire una distribuzione pratica di software libero al 100% di varianti basate su Linux e altre di GNU, con un focus sulla promozione e l'integrazione stretta dei componenti GNU, e un'enfasi su programmi e strumenti che aiutano gli utenti a esercitare tale libertà.
pt_br: Nosso objetivo é fornecer uma distribuição prática e 100% de software livre, baseada em Linux e outras variantes do GNU, com foco na promoção e forte integração de componentes do GNU e ênfase em programas e ferramentas que ajudam os usuários a exercer essa liberdade.

source: Packages are currently available on the following platforms:
it: I pacchetti sono attualmente disponibili sulle seguenti piattaforme:
pt_br: Os pacotes estão atualmente disponíveis nas seguintes plataformas:

source: Intel/AMD @code{x86_64} architecture, Linux-Libre kernel.
it: Architettura Intel/AMD @code{x86_64}, kernel Linux-Libre.
pt_br: Arquitetura Intel/AMD @code{x86_64}, kernel Linux-Libre.

source: Intel 32-bit architecture (IA32), Linux-Libre kernel.
it: Architettura Intel a 32 bit (IA32), kernel Linux-Libre.
pt_br: Arquitetura Intel de 32 bits (IA32), kernel Linux-Libre.

source: ARMv7-A architecture with hard float, Thumb-2 and NEON, using the EABI hard-float application binary interface (ABI), and Linux-Libre kernel.
it: Architettura ARMv7-A con hard float, Thumb-2 e NEON, usando l'interfaccia binaria applicativa (ABI) EABI hard-float, e kernel Linux-Libre.
pt_br: Arquitetura ARMv7-A com hard float, Thumb-2 e NEON, usando a interface binária de aplicativos EABI hard-float (ABI) e o kernel Linux-Libre.

source: little-endian 64-bit ARMv8-A processors, Linux-Libre kernel.
it: Processori ARMv8-A a 64 bit little-endian, kernel Linux-Libre.
pt_br: Processadores ARMv8-A little-endian de 64 bits, kernel Linux-Libre.

source: @uref{https://hurd.gnu.org, GNU/Hurd} on the Intel 32-bit architecture (IA32).
it: @uref{https://hurd.gnu.org, GNU/Hurd} sull'architettura Intel a 32 bit (IA32).
pt_br: @uref{https://hurd.gnu.org, GNU/Hurd} sobre a arquitetura Intel de 32 bits (IA32).

source: This configuration is experimental and under development. The easiest way for you to give it a try is by setting up an instance of @code{hurd-vm-service-type} on your GNU/Linux machine (@pxref{transparent-emulation-qemu, @code{hurd-vm-service-type}}). @xref{Contributing}, on how to help!
it: Questa configurazione è sperimentale e in fase di sviluppo. Il modo più semplice per provarla è impostare un'istanza di @code{hurd-vm-service-type} sulla tua macchina GNU/Linux (@pxref{transparent-emulation-qemu, @code{hurd-vm-service-type}}). @xref{Contributing}, su come aiutare!
pt_br: Esta configuração é experimental e está em desenvolvimento. A maneira mais fácil de você tentar é configurando uma instância de @code{hurd-vm-service-type} na sua máquina GNU/Linux (@pxref{transparent-emulation-qemu, @code{hurd-vm-service-type}}). @xref{Contributing}, sobre como ajudar!

source: mips64el-linux (unsupported)
it: mips64el-linux (non supportato)
pt_br: mips64el-linux (sem suporte)

source: little-endian 64-bit MIPS processors, specifically the Loongson series, n32 ABI, and Linux-Libre kernel. This configuration is no longer fully supported; in particular, there is no ongoing work to ensure that this architecture still works. Should someone decide they wish to revive this architecture then the code is still available.
it: Processori MIPS a 64 bit little-endian, in particolare la serie Loongson, ABI n32 e kernel Linux-Libre. Questa configurazione non è più completamente supportata; in particolare, non c'è un lavoro in corso per garantire che questa architettura funzioni ancora. Se qualcuno decidesse di voler ripristinare questa architettura, il codice è ancora disponibile.
pt_br: processadores little-endian MIPS de 64 bits, especificamente a série Loongson, n32 ABI e kernel Linux-Libre. Esta configuração não é mais totalmente suportada; em particular, não há trabalho em andamento para garantir que esta arquitetura ainda funcione. Caso alguém decida que deseja reviver esta arquitetura, o código ainda estará disponível.

source: powerpc-linux (unsupported)
it: powerpc-linux (non supportato)
pt_br: powerpc-linux (sem suporte)

source: big-endian 32-bit PowerPC processors, specifically the PowerPC G4 with AltiVec support, and Linux-Libre kernel. This configuration is not fully supported and there is no ongoing work to ensure this architecture works.
it: Processori PowerPC a 32 bit big-endian, in particolare il PowerPC G4 con supporto AltiVec, e kernel Linux-Libre. Questa configurazione non è completamente supportata e non c'è un lavoro in corso per garantire che questa architettura funzioni.
pt_br: processadores PowerPC big-endian de 32 bits, especificamente o PowerPC G4 com suporte AltiVec e kernel Linux-Libre. Esta configuração não é totalmente suportada e não há trabalho em andamento para garantir que esta arquitetura funcione.

source: little-endian 64-bit Power ISA processors, Linux-Libre kernel. This includes POWER9 systems such as the @uref{https://www.fsf.org/news/talos-ii-mainboard-and-talos-ii-lite-mainboard-now-fsf-certified-to-respect-your-freedom, RYF Talos II mainboard}. This platform is available as a "technology preview": although it is supported, substitutes are not yet available from the build farm (@pxref{Substitutes}), and some packages may fail to build (@pxref{Tracking Bugs and Changes}). That said, the Guix community is actively working on improving this support, and now is a great time to try it and get involved!
it: Processori Power ISA a 64 bit little-endian, kernel Linux-Libre. Questo include sistemi POWER9 come la @uref{https://www.fsf.org/news/talos-ii-mainboard-and-talos-ii-lite-mainboard-now-fsf-certified-to-respect-your-freedom, scheda madre RYF Talos II}. Questa piattaforma è disponibile come "anteprima tecnologica": sebbene sia supportata, i sostituti non sono ancora disponibili dalla build farm (@pxref{Substitutes}), e alcuni pacchetti potrebbero non compilare (@pxref{Tracking Bugs and Changes}). Detto questo, la comunità di Guix sta lavorando attivamente per migliorare questo supporto, e ora è un ottimo momento per provarlo e farsi coinvolgere!
pt_br: processadores little-endian 64 bits Power ISA, kernel Linux-Libre. Isso inclui sistemas POWER9 como o @uref{https://www.fsf.org/news/talos-ii-mainboard-and-talos-ii-lite-mainboard-now-fsf-certified-to-respect-your-freedom, placa-mãe RYF Talos II}. Esta plataforma está disponível como uma "prévia de tecnologia": embora seja suportada, substitutos ainda não estão disponíveis na fazenda de construção (@pxref{Substitutes}), e alguns pacotes podem falhar na construção (@pxref{Tracking Bugs and Changes}). Dito isso, a comunidade Guix está trabalhando ativamente para melhorar esse suporte, e agora é um ótimo momento para experimentá-lo e se envolver!

source: little-endian 64-bit RISC-V processors, specifically RV64GC, and Linux-Libre kernel. This platform is available as a "technology preview": although it is supported, substitutes are not yet available from the build farm (@pxref{Substitutes}), and some packages may fail to build (@pxref{Tracking Bugs and Changes}). That said, the Guix community is actively working on improving this support, and now is a great time to try it and get involved!
it: Processori RISC-V a 64 bit little-endian, in particolare RV64GC, e kernel Linux-Libre. Questa piattaforma è disponibile come "anteprima tecnologica": sebbene sia supportata, i sostituti non sono ancora disponibili dalla build farm (@pxref{Substitutes}), e alcuni pacchetti potrebbero non compilare (@pxref{Tracking Bugs and Changes}). Detto questo, la comunità di Guix sta lavorando attivamente per migliorare questo supporto, e ora è un ottimo momento per provarlo e farsi coinvolgere!
pt_br: processadores little-endian RISC-V de 64 bits, especificamente RV64GC, e kernel Linux-Libre. Esta plataforma está disponível como uma "prévia de tecnologia": embora seja suportada, substitutos ainda não estão disponíveis na build farm (@pxref{Substitutes}), e alguns pacotes podem falhar na compilação (@pxref{Tracking Bugs and Changes}). Dito isto, a comunidade Guix está trabalhando ativamente para melhorar este suporte, e agora é um ótimo momento para experimentá-lo e se envolver!

source: With Guix@tie{}System, you @emph{declare} all aspects of the operating system configuration and Guix takes care of instantiating the configuration in a transactional, reproducible, and stateless fashion (@pxref{System Configuration}). Guix System uses the Linux-libre kernel, the Shepherd initialization system (@pxref{Introduction,,, shepherd, The GNU Shepherd Manual}), the well-known GNU utilities and tool chain, as well as the graphical environment or system services of your choice.
it: Con Guix@tie{}System, tu @emph{declare} tutti gli aspetti della configurazione del sistema operativo e Guix si occupa di instanziare la configurazione in modo transazionale, riproducibile e senza stato (@pxref{System Configuration}). Guix System utilizza il kernel Linux-libre, il sistema di inizializzazione Shepherd (@pxref{Introduction,,, shepherd, The GNU Shepherd Manual}), le ben note utilità e catena di compilazione GNU, così come l'ambiente grafico o i servizi di sistema di tua scelta.
pt_br: Com o Guix@tie{}System, você @emph{declara} todos os aspectos da configuração do sistema operacional, e o Guix cuida de instanciar a configuração de maneira transacional, reproduzível e sem estado (@pxref{System Configuration}). O Guix System usa o kernel Linux-libre, o sistema de inicialização Shepherd (@pxref{Introduction ,,, shepherd, The GNU Shepherd Manual}), os conhecidos utilitários do GNU e cadeia de ferramentas, bem como o ambiente gráfico ou os serviços de sistema do sua escolha.

source: For information on porting to other architectures or kernels, @pxref{Porting}.
it: Per informazioni sul porting ad altre architetture o kernel, @pxref{Porting}.
pt_br: Para obter informações sobre como portar para outras arquiteturas ou kernels, @pxref{Porting}.

source: Building this distribution is a cooperative effort, and you are invited to join! @xref{Contributing}, for information about how you can help.
it: La creazione di questa distribuzione è uno sforzo cooperativo, e sei invitato a unirti! @xref{Contributing}, per informazioni su come puoi aiutare.
pt_br: A construção desta distribuição é um esforço cooperativo e você está convidado a participar! @xref{Contributing}, para obter informações sobre como você pode ajudar.

source: installing Guix
it: installare Guix
pt_br: instalando Guix

source: foreign distro
it: distro esterna
pt_br: distro alheia

source: You can install the package management tool Guix on top of an existing GNU/Linux or GNU/Hurd system@footnote{Hurd support is currently limited.}, referred to as a @dfn{foreign distro}. If, instead, you want to install the complete, standalone GNU system distribution, @dfn{Guix@tie{}System}, @pxref{System Installation}. This section is concerned only with the installation of Guix on a foreign distro.
it: Puoi installare lo strumento di gestione dei pacchetti Guix su un sistema GNU/Linux o GNU/Hurd esistente@footnote{Il supporto a Hurd è attualmente limitato.}, chiamato @dfn{distro esterna}. Se, invece, vuoi installare la distribuzione di sistema GNU completa e autonoma, @dfn{Guix@tie{}System}, @pxref{System Installation}. Questa sezione riguarda solo l'installazione di Guix su una distro esterna.
pt_br: Você pode instalar a ferramenta de gerenciamento de pacotes Guix sobre um sistema GNU/Linux ou GNU/Hurd existente@footnote{O suporte ao Hurd é atualmente limitado.}, conhecido como @dfn{distro estrangeiro}. Se, em vez disso, você quiser instalar a distribuição completa e autônoma do sistema GNU, @dfn{Guix@tie{}System}, @pxref{System Installation}. Esta seção se preocupa apenas com a instalação do Guix em uma distro estrangeira.

source: This section only applies to systems without Guix. Following it for existing Guix installations will overwrite important system files.
it: Questa sezione si applica solo ai sistemi senza Guix. Seguirla per installazioni esistenti di Guix sovrascriverà file di sistema importanti.
pt_br: Esta seção se aplica somente a sistemas sem Guix. Segui-la para instalações Guix existentes sobrescreverá arquivos importantes do sistema.

source: directories related to foreign distro
it: directory relative a distro esterna
pt_br: diretórios relacionados à distro alheia

source: When installed on a foreign distro, GNU@tie{}Guix complements the available tools without interference. Its data lives exclusively in two directories, usually @file{/gnu/store} and @file{/var/guix}; other files on your system, such as @file{/etc}, are left untouched.
it: Quando installato su una distro esterna, GNU@tie{}Guix completa gli strumenti disponibili senza interferenze. I suoi dati risiedono esclusivamente in due directory, solitamente @file{/gnu/store} e @file{/var/guix}; altri file sul tuo sistema, come @file{/etc}, non vengono toccati.
pt_br: Quando instalado sobre uma distro alheia. GNU@tie{}Guix complementa as ferramentas disponíveis sem interferência. Seus dados residem exclusivamente em dois diretórios, geralmente @file{/gnu/store} e @file{/var/guix}; outros arquivos no seu sistema, como @file{/etc}, são deixados intactos.

source: Once installed, Guix can be updated by running @command{guix pull} (@pxref{Invoking guix pull}).
it: Una volta installato, Guix può essere aggiornato eseguendo @command{guix pull} (@pxref{Invoking guix pull}).
pt_br: Uma vez instalado, o Guix pode ser atualizado executando @command{guix pull} (@pxref{Invoking guix pull}).

source: installing Guix from binaries
it: installare Guix da binari
pt_br: instalando Guix de binários

source: installer script
it: script di installazione
pt_br: script de instalação

source: Some GNU/Linux distributions, such as Debian, Ubuntu, and openSUSE provide Guix through their own package managers. The version of Guix may be older than @value{VERSION} but you can update it afterwards by running @samp{guix pull}.
it: Alcune distribuzioni GNU/Linux, come Debian, Ubuntu e openSUSE, forniscono Guix tramite i loro gestori di pacchetti. La versione di Guix potrebbe essere più vecchia di @value{VERSION} ma puoi aggiornarla in seguito eseguendo @samp{guix pull}.
pt_br: Algumas distribuições GNU/Linux, como Debian, Ubuntu e openSUSE fornecem Guix por meio de seus próprios gerenciadores de pacotes. A versão do Guix pode ser mais antiga que @value{VERSION}, mas você pode atualizá-la depois executando @samp{guix pull}.

source: We advise system administrators who install Guix, both from the installation script or @i{via} the native package manager of their foreign distribution, to also regularly read and follow security notices, as shown by @command{guix pull}.
it: Consigliamo agli amministratori di sistema che installano Guix, sia dallo script di installazione che @i{via} il gestore di pacchetti nativo della loro distribuzione esterna, di leggere e seguire regolarmente gli avvisi di sicurezza, come mostrato da @command{guix pull}.
pt_br: Aconselhamos os administradores de sistema que instalam o Guix, tanto a partir do script de instalação quanto por meio do gerenciador de pacotes nativo de sua distribuição estrangeira, a também ler e seguir regularmente os avisos de segurança, conforme mostrado pelo @command{guix pull}.

source: For Debian or derivatives such as Ubuntu or Trisquel, call:
it: Per Debian o derivate come Ubuntu o Trisquel, chiama:
pt_br: Para Debian ou derivados como Ubuntu ou Trisquel, chame:

source: Likewise, on openSUSE:
it: Allo stesso modo, su openSUSE:
pt_br: Da mesma forma, no openSUSE:

source: If you are running Parabola, after enabling the pcr (Parabola Community Repo) repository, you can install Guix with:
it: Se stai usando Parabola, dopo aver abilitato il repository pcr (Parabola Community Repo), puoi installare Guix con:
pt_br: Se você estiver executando o Parabola, depois de habilitar o repositório pcr (Parabola Community Repo), você pode instalar o Guix com:

source: The Guix project also provides a shell script, @file{guix-install.sh}, which automates the binary installation process without use of a foreign distro package manager@footnote{@uref{https://guix.gnu.org/guix-install.sh}}. Use of @file{guix-install.sh} requires Bash, GnuPG, GNU@tie{}tar, wget, and Xz.
it: Il progetto Guix fornisce anche uno script di shell, @file{guix-install.sh}, che automatizza il processo di installazione binaria senza l'uso di un gestore di pacchetti di una distro esterna@footnote{@uref{https://guix.gnu.org/guix-install.sh}}. L'uso di @file{guix-install.sh} richiede Bash, GnuPG, GNU@tie{}tar, wget e Xz.
pt_br: O projeto Guix também fornece um script de shell, @file{guix-install.sh}, que automatiza o processo de instalação binária sem o uso de um gerenciador de pacotes de distro estrangeiro@footnote{@uref{https://guix.gnu.org/guix-install.sh}}. O uso de @file{guix-install.sh} requer Bash, GnuPG, GNU@tie{}tar, wget e Xz.

source: Downloading and extracting the binary tarball
it: Scaricare ed estrarre il tarball binario
pt_br: Baixando e extraindo o tarball binário

source: Making the ‘guix’ command available to non-root users
it: Rendere il comando 'guix' disponibile agli utenti non root
pt_br: Disponibilizando o comando ‘guix’ para usuários não root

source: As root, run:
it: Come root, esegui:
pt_br: Como root, execute:

source: The script to install Guix is also packaged in Parabola (in the pcr repository). You can install and run it with:
it: Lo script per installare Guix è anche pacchettizzato in Parabola (nel repository pcr). Puoi installarlo ed eseguirlo con:
pt_br: O script para instalar o Guix também está empacotado no Parabola (no repositório pcr). Você pode instalá-lo e executá-lo com:

source: By default, @file{guix-install.sh} will configure Guix to download pre-built package binaries, called @dfn{substitutes} (@pxref{Substitutes}), from the project's build farms. If you choose not to permit this, Guix will build @emph{everything} from source, making each installation and upgrade very expensive. @xref{On Trusting Binaries} for a discussion of why you may want to build packages from source.
it: Per impostazione predefinita, @file{guix-install.sh} configurerà Guix per scaricare binari di pacchetti precompilati, chiamati @dfn{sostituti} (@pxref{Substitutes}), dalle build farm del progetto. Se scegli di non permetterlo, Guix compilerà @emph{everything} dai sorgenti, rendendo ogni installazione e aggiornamento molto costoso. @xref{On Trusting Binaries} per una discussione sul perché potresti voler compilare i pacchetti dai sorgenti.
pt_br: Por padrão, @file{guix-install.sh} configurará o Guix para baixar binários de pacotes pré-construídos, chamados @dfn{substitutes} (@pxref{Substitutes}), das fazendas de construção do projeto. Se você escolher não permitir isso, o Guix construirá @emph{tudo} a partir da fonte, tornando cada instalação e atualização muito cara. @xref{On Trusting Binaries} para uma discussão sobre por que você pode querer construir pacotes a partir da fonte.

source: substitutes, authorization thereof
it: sostituti, autorizzazione degli stessi
pt_br: substitutos, autenticação dela

source: To use substitutes from @code{@value{SUBSTITUTE-SERVER-1}}, @code{@value{SUBSTITUTE-SERVER-2}} or a mirror, you must authorize them. For example,
it: Per usare i sostituti da @code{@value{SUBSTITUTE-SERVER-1}}, @code{@value{SUBSTITUTE-SERVER-2}} o un mirror, devi autorizzarli. Ad esempio,
pt_br: Para usar substitutos de @code{@value{SUBSTITUTE-SERVER-1}}, @code{@value{SUBSTITUTE-SERVER-2}} ou um espelho, você deve autorizá-los. Por exemplo,

source: When you're done installing Guix, @pxref{Application Setup} for extra configuration you might need, and @ref{Getting Started} for your first steps!
it: Quando hai finito di installare Guix, @pxref{Application Setup} per una configurazione extra di cui potresti aver bisogno, e @ref{Getting Started} per i tuoi primi passi!
pt_br: Quando terminar de instalar o Guix, @pxref{Application Setup} para configurações extras que você pode precisar e @ref{Getting Started} para seus primeiros passos!

source: The binary installation tarball can be (re)produced and verified simply by running the following command in the Guix source tree:
it: Il tarball di installazione binaria può essere (ri)prodotto e verificato semplicemente eseguendo il seguente comando nell'albero dei sorgenti di Guix:
pt_br: O tarball da instalação binária pode ser (re)produzido e verificado simplesmente executando o seguinte comando na árvore de código-fonte do Guix:

source: make guix-binary.@var{system}.tar.xz
pt_br: make guix-binary.@var{sistema}.tar.xz

source: ...@: which, in turn, runs:
it: ... che, a sua volta, esegue:
pt_br: ...@: que, por sua vez, executa:

source: guix pack -s @var{system} --localstatedir \ --profile-name=current-guix guix
pt_br: guix pack -s @var{sistema} --localstatedir \ --profile-name=current-guix guix

source: @xref{Invoking guix pack}, for more info on this handy tool.
it: @xref{Invoking guix pack}, per maggiori informazioni su questo utile strumento.
pt_br: @xref{Invoking guix pack}, para mais informações sobre essa ferramenta útil.

source: Should you eventually want to uninstall Guix, run the same script with the @option{--uninstall} flag:
it: Se alla fine volessi disinstallare Guix, esegui lo stesso script con l'opzione @option{--uninstall}:
pt_br: Caso você queira desinstalar o Guix, execute o mesmo script com o sinalizador @option{--uninstall}:

source: With @option{--uninstall}, the script irreversibly deletes all the Guix files, configuration, and services.
it: Con @option{--uninstall}, lo script elimina irreversibilmente tutti i file, la configurazione e i servizi di Guix.
pt_br: Com @option{--uninstall}, o script exclui irreversivelmente todos os arquivos Guix, configuração e serviços.

source: During installation, the @dfn{build daemon} that must be running to use Guix has already been set up and you can run @command{guix} commands in your terminal program, @pxref{Getting Started}:
it: Durante l'installazione, il @dfn{demone di build} che deve essere in esecuzione per usare Guix è già stato configurato e puoi eseguire i comandi @command{guix} nel tuo programma terminale, @pxref{Getting Started}:
pt_br: Durante a instalação, o @dfn{build daemon} que deve estar em execução para usar o Guix já foi configurado e você pode executar comandos @command{guix} no seu programa de terminal, @pxref{Getting Started}:
