Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: The @command{virsh} command, provided by the @code{libvirt} package, makes it very easy to create a virtual switch. You first need to choose a network subnet for your virtual switch; if your home LAN is in the @samp{192.168.1.0/24} network, you could opt to use e.g.@: @samp{192.168.2.0/24}. Define an XML file, e.g.@: @file{/tmp/virbr0.xml}, containing the following:
it: Il comando @command{virsh}, fornito dal pacchetto @code{libvirt}, rende molto facile creare uno switch virtuale. Per prima cosa devi scegliere una sottorete di rete per il tuo switch virtuale; se la tua LAN domestica è nella rete @samp{192.168.1.0/24}, potresti optare per l'uso ad es.: @samp{192.168.2.0/24}. Definisci un file XML, ad es.: @file{/tmp/virbr0.xml}, contenente quanto segue:
pt_br: O comando @command{virsh}, fornecido pelo pacote @code{libvirt}, torna muito fácil criar um comutador virtual. Primeiro, você precisa escolher uma sub-rede de rede para seu comutador virtual; se sua LAN doméstica estiver na rede @samp{192.168.1.0/24}, você pode optar por usar, por exemplo, @samp{192.168.2.0/24}. Defina um arquivo XML, por exemplo, @file{/tmp/virbr0.xml}, contendo o seguinte:

source: Then create and configure the interface using the @command{virsh} command, as root:
it: Quindi crea e configura l'interfaccia usando il comando @command{virsh}, come root:
pt_br: Em seguida, crie e configure a interface usando o comando @command{virsh}, como root:

source: The @samp{virbr0} interface should now be visible e.g.@: via the @samp{ip address} command. It will be automatically started every time your libvirt virtual machine is started.
it: L'interfaccia @samp{virbr0} dovrebbe ora essere visibile ad es.: tramite il comando @samp{ip address}. Verrà avviata automaticamente ogni volta che la tua macchina virtuale libvirt viene avviata.
pt_br: A interface @samp{virbr0} agora deve estar visível, por exemplo, via o comando @samp{ip address}. Ela será iniciada automaticamente toda vez que sua máquina virtual libvirt for iniciada.

source: Configuring the static routes for your virtual bridge
it: Configurazione delle rotte statiche per il tuo bridge virtuale
pt_br: Configurando as rotas estáticas para sua ponte virtual

source: If you configured your virtual machine to use your newly created @samp{virbr0} virtual bridge interface, it should already receive an IP via DHCP such as @samp{192.168.2.15} and be reachable from the server hosting it, e.g.@: via @samp{ping 192.168.2.15}. There's one last configuration needed so that the VM can reach the external network: adding static routes to the network's router.
it: Se hai configurato la tua macchina virtuale per utilizzare la tua nuova interfaccia bridge virtuale @samp{virbr0}, dovrebbe già ricevere un IP tramite DHCP come @samp{192.168.2.15} ed essere raggiungibile dal server che la ospita, ad es.: tramite @samp{ping 192.168.2.15}. C'è un'ultima configurazione necessaria affinché la VM possa raggiungere la rete esterna: aggiungere rotte statiche al router della rete.
pt_br: Se você configurou sua máquina virtual para usar sua interface de ponte virtual @samp{virbr0} recém-criada, ela já deve receber um IP via DHCP, como @samp{192.168.2.15} e ser acessível a partir do servidor que a hospeda, por exemplo, via @samp{ping 192.168.2.15}. Há uma última configuração necessária para que a VM possa alcançar a rede externa: adicionar rotas estáticas ao roteador da rede.

source: In this example, the LAN network is @samp{192.168.1.0/24} and the router configuration web page may be accessible via e.g.@: the @url{http://192.168.1.1} page. On a router running the @url{https://librecmc.org/, libreCMC} firmware, you would navigate to the @clicksequence{Network @click{} Static Routes} page (@url{https://192.168.1.1/cgi-bin/luci/admin/network/routes}), and you would add a new entry to the @samp{Static IPv4 Routes} with the following information:
it: In questo esempio, la rete LAN è @samp{192.168.1.0/24} e la pagina web di configurazione del router potrebbe essere accessibile ad es.: tramite la pagina @url{http://192.168.1.1}. Su un router che esegue il firmware @url{https://librecmc.org/, libreCMC}, dovresti navigare alla pagina @clicksequence{Rete @click{} Rotte Statiche} (@url{https://192.168.1.1/cgi-bin/luci/admin/network/routes}), e aggiungeresti una nuova voce a @samp{Rotte IPv4 Statiche} con le seguenti informazioni:
pt_br: Neste exemplo, a rede LAN é @samp{192.168.1.0/24} e a página da web de configuração do roteador pode ser acessada por meio de, por exemplo, a página @url{http://192.168.1.1}. Em um roteador executando o firmware @url{https://librecmc.org/, libreCMC}, você navegaria até a página @clicksequence{Network @click{} Static Routes} (@url{https://192.168.1.1/cgi-bin/luci/admin/network/routes}) e adicionaria uma nova entrada em @samp{Static IPv4 Routes} com as seguintes informações:

source: Interface
es: Interfaz
it: Interfaccia
ru: Интерфейс
sv: Gränssnitt

source: Target
es: Destino
it: Destinazione
pt_br: Alvo
ru: Цель
sv: Mål

source: IPv4-Netmask
es: Máscara de red IPv4
it: Maschera di rete IPv4
pt_br: Rede-IPV4
ru: Маска IPv4
sv: IPv4-nätmask

source: IPv4-Gateway
es: Puerta de enlace IPv4
it: Gateway IPv4
pt_br: IPv4-Ponto de entrada
ru: Шлюз IPv4

source: server-ip
it: ip-server
pt_br: servidor-ip

source: Route type
es: Tipo de enrutamiento
it: Tipo di rotta
pt_br: Tipo de rota

source: where @var{server-ip} is the IP address of the machine hosting the VMs, which should be static.
it: dove @var{server-ip} è l'indirizzo IP della macchina che ospita le VM, che dovrebbe essere statico.
pt_br: onde @var{server-ip} é o endereço IP da máquina que hospeda as VMs, que deve ser estático.

source: After saving/applying this new static route, external connectivity should work from within your VM; you can e.g.@: run @samp{ping gnu.org} to verify that it functions correctly.
it: Dopo aver salvato/applicato questa nuova rotta statica, la connettività esterna dovrebbe funzionare all'interno della tua VM; puoi ad es.: eseguire @samp{ping gnu.org} per verificare che funzioni correttamente.
pt_br: Depois de salvar/aplicar essa nova rota estática, a conectividade externa deve funcionar de dentro da sua VM; você pode, por exemplo, executar @samp{ping gnu.org} para verificar se ela funciona corretamente.

source: As mentioned in the preceding section (@pxref{Routed network for libvirt}), libvirt allows virtual networks to be defined via XML files and managed by the @command{virsh} command. The details of the creation and removal of virtual network switches are handled by libvirt, so the user does not have to deal with them.
it: Come menzionato nella sezione precedente (@pxref{Routed network for libvirt}), libvirt permette di definire reti virtuali tramite file XML e di gestirle con il comando @command{virsh}. I dettagli della creazione e rimozione di switch di rete virtuali sono gestiti da libvirt, quindi l'utente non deve occuparsene.
pt_br: Como mencionado na seção anterior (@pxref{Roteamento de rede para libvirt}), libvirt permite que redes virtuais seja definidas usando arquivos XML e gerenciadas pelo comando @command{virsh}. Os detalhes da criação e remoção de comutadores de rede virtual são tratados pelo libvirt, então o usuário não precisa lidar com eles.

source: However, libvirt's handling of virtual network switches can sometimes clash with more complex networking setups. In particular, the iptables rules inserted by libvirt for switches operating in the NAT mode can clash with existing iptables/nftables rules, leading to insecure or broken packet filtering.
it: Tuttavia, la gestione degli switch di rete virtuali da parte di libvirt può a volte entrare in conflitto con configurazioni di rete più complesse. In particolare, le regole iptables inserite da libvirt per gli switch che operano in modalità NAT possono entrare in conflitto con regole iptables/nftables esistenti, portando a un filtraggio dei pacchetti insicuro o interrotto.
pt_br: No entanto, a maneira que libvirt trata comutadores de rede virtuais pode, às vezes, entrar em conflito com configurações de rede mais complexas. Em particular, as regras de iptables inseridas pelo libvirt para comutadores operando no modo NAT podem entrar em conflito com as regras iptables/nftables existentes, levando a uma filtragem de pacotes insegura ou quebrada.

source: In such cases, the only solution is to manually set up a virtual network switch. This section will provide instructions on how to do so using Guix System services.
it: In questi casi, l'unica soluzione è configurare manualmente uno switch di rete virtuale. Questa sezione fornirà istruzioni su come farlo utilizzando i servizi del sistema Guix.
pt_br: Nesses casos, a única solução é configurar manualmente um comutador de rede virtual. Essa seção irá fornecer instruções de como fazer isso usando serviços do Guix System.

source: Creating the virtual network bridge
it: Creazione del bridge di rete virtuale
pt_br: Criando a ponte de rede virtual

source: The @code{static-networking-service-type} can be used to create a virtual network bridge and assign an IP address to it:
it: Il @code{static-networking-service-type} può essere usato per creare un bridge di rete virtuale e assegnargli un indirizzo IP:
pt_br: O @code{static-networking-service-type} pode ser usado para criar uma ponte de rede virtual e atribuir um endereço IP a ela:

source: (service static-networking-service-type (list (static-networking ;; The default provision is 'networking; if you're using any ;; other service with this provision, such as ;; `network-manager-service-type`, then you need to change the ;; default. (provision '(static-networking)) (links (list (network-link (name "virbr0") (type 'bridge) (arguments '())))) (addresses (list (network-address (device "virbr0") (value "192.168.10.1/24")))))))
it: (service static-networking-service-type (list (static-networking ;; La fornitura predefinita è 'networking; se stai usando qualsiasi ;; altro servizio con questa fornitura, come ;; `network-manager-service-type`, allora devi cambiare il ;; predefinito. (provision '(static-networking)) (links (list (network-link (name "virbr0") (type 'bridge) (arguments '())))) (addresses (list (network-address (device "virbr0") (value "192.168.10.1/24")))))))
pt_br: (service static-networking-service-type (list (static-networking ;; O provisionamento padrão é 'networking; se você está usando ;; qualquer outro serviço com esse provisionamento, tal como ;; `network-manager-service-type`, então você precisa mudar o ;; padrão. (provision '(static-networking)) (links (list (network-link (name "virbr0") (type 'bridge) (arguments '())))) (addresses (list (network-address (device "virbr0") (value "192.168.10.1/24")))))))

source: Running dnsmasq for the virtual network bridge
it: Esecuzione di dnsmasq per il bridge di rete virtuale
pt_br: Executando dnsmasq para a ponte de rede virtual

source: The @code{dnsmasq-service-type} can be used to provide DNS and DHCP for guests connected to this virtual network switch:
it: Il @code{dnsmasq-service-type} può essere usato per fornire DNS e DHCP per gli ospiti connessi a questo switch di rete virtuale:
pt_br: O @code{dnsmasq-service-type} pode ser usado para fornecer serviços de DNS e DHCP para convidados conectados a esse comutador de rede virtual:

source: (service dnsmasq-service-type (dnsmasq-configuration ;; You can have multiple instances of `dnsmasq-service-type` as long ;; as each one has a different shepherd-provision. (shepherd-provision '(dnsmasq-virbr0)) (extra-options (list ;; Only bind to the virtual bridge. This ;; avoids conflicts with other running ;; dnsmasq instances. "--except-interface=lo" "--interface=virbr0" "--bind-dynamic" ;; IPv4 addresses to offer to VMs. This ;; should match the chosen subnet. "--dhcp-range=192.168.10.2,192.168.10.254"))))
it: (service dnsmasq-service-type (dnsmasq-configuration ;; Puoi avere più istanze di `dnsmasq-service-type` purché ;; ognuna abbia una diversa shepherd-provision. (shepherd-provision '(dnsmasq-virbr0)) (extra-options (list ;; Bind solo al bridge virtuale. Questo ;; evita conflitti con altre istanze di ;; dnsmasq in esecuzione. "--except-interface=lo" "--interface=virbr0" "--bind-dynamic" ;; Indirizzi IPv4 da offrire alle VM. Questo ;; dovrebbe corrispondere alla sottorete scelta. "--dhcp-range=192.168.10.2,192.168.10.254"))))

source: Configuring NAT for the virtual network switch
it: Configurazione del NAT per lo switch di rete virtuale
pt_br: Configurando NAT para o comutador de rede virtual

source: If you intend to use the virtual network switch in NAT mode, you will need to use nftables (or iptables) rules to set up IP masquerading. The following example shows how to use @code{nftables-service-type} to do this:
it: Se intendi utilizzare lo switch di rete virtuale in modalità NAT, dovrai utilizzare le regole nftables (o iptables) per impostare il masquerading IP. Il seguente esempio mostra come utilizzare @code{nftables-service-type} per farlo:
pt_br: Se você pretende usar o comutador de rede virtual em modo NAT, você precisará usar regras nftables (ou iptables) para configurar mascaramento de IP. O seguinte exemplo mostra como usar @code{nftables-service-type} para fazer isso:

source: chain input @{ type filter hook input priority filter; policy drop; # Add your existing packet filtering rules here... iifname virbr0 udp dport 67 counter accept comment \"allow dhcp on virbr0\" iifname virbr0 meta l4proto @{tcp, udp@} th dport 53 accept \\ comment \"allow dns on virbr0\" @}
it: input catena @{ tipo filtro hook input priorità filtro; policy drop; # Aggiungi qui le tue regole di filtraggio pacchetti esistenti... iifname virbr0 udp dport 67 contatore accetta commento \"consenti DHCP su virbr0\" iifname virbr0 meta l4proto @{tcp, udp@} th dport 53 accetta \\ commento \"consenti DNS su virbr0\" @}
pt_br: chain input @{ type filter hook input priority filter; policy drop; # Adicione suas regras de filtragem de pacotes existente aqui... iifname virbr0 udp dport 67 counter accept comment \"allow dhcp on virbr0\" iifname virbr0 meta l4proto @{tcp, udp@} th dport 53 accept \\ comment \"allow dns on virbr0\" @}

source: chain forward @{ type filter hook forward priority filter; policy drop; # Add your existing forwarding rules here... iifname virbr0 accept comment \"allow outbound traffic from virbr0\" oifname virbr0 ct state @{established, related @} accept \\ comment \"allow established traffic to virbr0\" @}
it: chain forward @{ type filter hook forward priority filter; policy drop; # Aggiungi qui le tue regole di inoltro esistenti... iifname virbr0 accept comment \"consenti il traffico in uscita da virbr0\" oifname virbr0 ct state @{established, related @} accept \\ comment \"consenti il traffico stabilito verso virbr0\" @}
pt_br: chain forward @{ type filter hook forward priority filter; policy drop; # Adicione suas regras de redirecionamento aqui... iifname virbr0 accept comment \"allow outbound traffic from virbr0\" oifname virbr0 ct state @{established, related @} accept \\ comment \"allow established traffic to virbr0\" @}

source: table inet nat @{ chain postrouting @{ type nat hook postrouting priority srcnat; policy accept; # Add your existing nat rules here... iifname virbr0 ip daddr @{ 224.0.0.0/24, 255.255.255.255/32 @} return \\ comment \"don't masquerade to reserved address blocks\" iifname virbr0 oifname != virbr0 masquerade \\ comment \"masquerade all outgoing traffic from VMs\" @} @} "))))
it: table inet nat @{ chain postrouting @{ type nat hook postrouting priority srcnat; policy accept; # Aggiungi qui le tue regole NAT esistenti... iifname virbr0 ip daddr @{ 224.0.0.0/24, 255.255.255.255/32 @} return \\ comment \"non mascherare verso blocchi di indirizzi riservati\" iifname virbr0 oifname != virbr0 masquerade \\ comment \"mascherare tutto il traffico in uscita dalle VM\" @} @} "))))
pt_br: table inet nat @{ chain postrouting @{ type nat hook postrouting priority srcnat; policy accept; # Adicione suas regras de NAT existentes aqui... iifname virbr0 ip daddr @{ 224.0.0.0/24, 255.255.255.255/32 @} return \\ comment \"don't masquerade to reserved address blocks\" iifname virbr0 oifname != virbr0 masquerade \\ comment \"masquerade all outgoing traffic from VMs\" @} @} "))))

source: Ensure that you have IPv4 forwarding enabled (you can use @code{sysctl-service-type} for this).
it: Assicurati di avere l'inoltro IPv4 abilitato (puoi usare @code{sysctl-service-type} per questo).
pt_br: Certifique-se de que o encaminhamento IPv4 esteja habilitado (você pode usar @code{sysctl-service-type} para isso).

source: VM References
es: Referencias de MV
it: Riferimenti VM
pt_br: Referências de MV

source: @uref{https://jamielinux.com/docs/libvirt-networking-handbook/index.html, The (unofficial) libvirt Networking Handbook}@* Note that this resource is rather outdated at the time of writing (as of March 2025, it was last updated in 2015). Nevertheless, the authors of this chapter have found it to be a valuable source of information.
it: @uref{https://jamielinux.com/docs/libvirt-networking-handbook/index.html, The (unofficial) libvirt Networking Handbook}@* Nota che questa risorsa è piuttosto datata al momento della stesura (a marzo 2025, è stata aggiornata l'ultima volta nel 2015). Ciononostante, gli autori di questo capitolo l'hanno trovata una preziosa fonte di informazioni.
pt_br: @uref{https://jamielinux.com/docs/libvirt-networking-handbook/index.html, O Manual de Rede (não oficial) da libvirt}@* Note que este recurso está bastante desatualizado no momento da escrita (em março de 2025, foi atualizado pela última vez em 2015). No entanto, os autores deste capítulo descobriram que ele é uma fonte valiosa de informações.

source: Guix is a functional package manager that offers many features beyond what more traditional package managers can do. To the uninitiated, those features might not have obvious use cases at first. The purpose of this chapter is to demonstrate some advanced package management concepts.
it: Guix è un gestore di pacchetti funzionale che offre molte funzionalità oltre a ciò che i gestori di pacchetti più tradizionali possono fare. Per i non iniziati, queste funzionalità potrebbero non avere casi d'uso ovvi all'inizio. Lo scopo di questo capitolo è dimostrare alcuni concetti avanzati di gestione dei pacchetti.
pt_br: Guix é um gerenciador de pacotes funcional que oferece muitos recursos além do que os gerenciadores de pacotes mais tradicionais podem fazer. Para os não iniciados, esses recursos podem não ter casos de uso óbvios a princípio. O propósito deste capítulo é demonstrar alguns conceitos avançados de gerenciamento de pacotes.
sk: Guix je funkcionálny správca balíkov, ktorý ponúka omnoho viac možností než tradiční správcovia balíkov. Tieto možnosti nemusia mať pre nezasvätených zdanlivé využitie. Účelom tohto oddielu je predstaviť niekoľko pokročilých pojmov správy balíkov.
sv: Guix är en funktionell pakethanterare som erbjuder många fler funktioner än vad traditionella pakethanterare gör. För den oinvigde kan dessa funktioner vid en första anblick tyckas sakna uppenbart användningsområde. Syftet med det här kapitlet är att demonstrera några avancerade pakethanteringsbegrepp.

source: @pxref{Package Management,,, guix, GNU Guix Reference Manual} for a complete reference.
it: @pxref{Gestione dei pacchetti,,, guix,it, Manuale di riferimento GNU Guix} per un riferimento completo.
pt_br: @pxref{Gerenciamento de pacotes,,, guix.pt_BR, Manual de Referência GNU Guix} para uma referência completa.
sk: @pxref{Package Management,,, guix, GNU Guix Reference Manual}.

source: Guix provides a very useful feature that may be quite foreign to newcomers: @dfn{profiles}. They are a way to group package installations together and all users on the same system are free to use as many profiles as they want.
it: Guix fornisce una funzionalità molto utile che potrebbe essere piuttosto estranea ai nuovi arrivati: i @dfn{profiles}. Sono un modo per raggruppare le installazioni di pacchetti e tutti gli utenti sullo stesso sistema sono liberi di usare quanti profili desiderano.
pt_br: Guix fornece um recurso muito útil que pode ser bem estranho para novatos: @dfn{profiles}. Eles são uma maneira de agrupar instalações de pacotes e todos os usuários no mesmo sistema são livres para usar quantos perfis quiserem.
sk: Guix má veľmi užitočnú schopnosť, o ktorej noví používatelia málokedy vedia: @dfn{profily}. Sú spôsobom ako zoskupiť inštalácie balíkov a všetci používatelia rovnakého systému môžu používať toľko rôznych profil, koľko len chcú.

source: Whether you're a developer or not, you may find that multiple profiles bring you great power and flexibility. While they shift the paradigm somewhat compared to @emph{traditional package managers}, they are very convenient to use once you've understood how to set them up.
it: Che tu sia uno sviluppatore o meno, potresti scoprire che più profili ti offrono grande potenza e flessibilità. Sebbene spostino un po' il paradigma rispetto ai @emph{gestori di pacchetti tradizionali}, sono molto comodi da usare una volta che hai capito come configurarli.
pt_br: Seja você um desenvolvedor ou não, você pode descobrir que múltiplos perfis trazem grande poder e flexibilidade. Embora eles mudem um pouco o paradigma em comparação aos @emph{gerenciadores de pacotes tradicionais}, eles são muito convenientes de usar depois que você entende como configurá-los.
sk: Či už ste vývojár alebo nie, profily vám môžu poskytnúť veľa možností. Napriek tomu, že sa od @emph{tradičných správcov balíkov} myšlienkovo líšia, môžu byť veľmi užitočné, keď sa s nimi naučíte pracovať.

source: This section is an opinionated guide on the use of multiple profiles. It predates @command{guix shell} and its fast profile cache (@pxref{Invoking guix shell,,, guix, GNU Guix Reference Manual}).
it: Questa sezione è una guida ragionata sull'uso di più profili. Precede @command{guix shell} e la sua cache veloce dei profili (@pxref{Invocare guix shell,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: Esta seção é um guia opinativo sobre o uso de múltiplos perfis. Ele é anterior ao @command{guix shell} e seu cache de perfil rápido (@pxref{Invocando guix shell,,, guix.pt_BR, Manual de Referência do GNU Guix}).

source: In many cases, you may find that using @command{guix shell} to set up the environment you need, when you need it, is less work that maintaining a dedicated profile. Your call!
it: In molti casi, potresti scoprire che l'utilizzo di @command{guix shell} per configurare l'ambiente di cui hai bisogno, quando ne hai bisogno, richiede meno lavoro rispetto al mantenimento di un profilo dedicato. A te la scelta!
pt_br: Em muitos casos, você pode descobrir que usar @command{guix shell} para configurar o ambiente que você precisa, quando você precisa, dá menos trabalho do que manter um perfil dedicado. Sua escolha!
