Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: [My Bluetooth Speaker]# [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110b-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110c-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110e-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD Paired: yes Pairing successful
it: [My Bluetooth Speaker]# [CHG] Dispositivo AA:BB:CC:A4:AA:CD UUIDs: 0000110b-0000-1000-8000-00xxxxxxxxxx [CHG] Dispositivo AA:BB:CC:A4:AA:CD UUIDs: 0000110c-0000-1000-8000-00xxxxxxxxxx [CHG] Dispositivo AA:BB:CC:A4:AA:CD UUIDs: 0000110e-0000-1000-8000-00xxxxxxxxxx [CHG] Dispositivo AA:BB:CC:A4:AA:CD Accoppiato: sì Accoppiamento riuscito
pt_br: [Meu alto-falante Bluetooth]# [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110b-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110c-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD UUIDs: 0000110e-0000-1000-8000-00xxxxxxxxxx [CHG] Device AA:BB:CC:A4:AA:CD Paired: yes Pairing successful

source: [CHG] Device AA:BB:CC:A4:AA:CD Connected: no
it: [CHG] Dispositivo AA:BB:CC:A4:AA:CD Connesso: no

source: [bluetooth]# [bluetooth]# trust AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Device AA:BB:CC:A4:AA:CD Trusted: yes Changing AA:BB:CC:A4:AA:CD trust succeeded
es: [bluetooth]# [bluetooth]# trust AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Device AA:BB:CC:A4:AA:CD Confiado: sí Cambiando AA:BB:CC:A4:AA:CD confianza lograda
it: [bluetooth]# [bluetooth]# trust AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Dispositivo AA:BB:CC:A4:AA:CD Affidabile: sì Modifica dell'affidabilità di AA:BB:CC:A4:AA:CD riuscita

source: [bluetooth]# [bluetooth]# connect AA:BB:CC:A4:AA:CD Attempting to connect to AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Device AA:BB:CC:A4:AA:CD RSSI: -63 [CHG] Device AA:BB:CC:A4:AA:CD Connected: yes Connection successful
es: [bluetooth]# [bluetooth]# conecta a AA:BB:CC:A4:AA:CD Intentando conectar a AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Dispositivo AA:BB:CC:A4:AA:CD RSSI: -63 [CHG] Dispositivo AA:BB:CC:A4:AA:CD Conectado: sí Conexión lograda
it: [bluetooth]# [bluetooth]# connect AA:BB:CC:A4:AA:CD Tentativo di connessione a AA:BB:CC:A4:AA:CD [bluetooth]# [CHG] Dispositivo AA:BB:CC:A4:AA:CD RSSI: -63 [CHG] Dispositivo AA:BB:CC:A4:AA:CD Connesso: sì Connessione riuscita

source: [My Bluetooth Speaker]# scan off [CHG] Device AA:BB:CC:A4:AA:CD RSSI is nil Discovery stopped [CHG] Controller 00:11:22:33:95:7F Discovering: no
es: [My Bluetooth Speaker]# scan off [CHG] Device AA:BB:CC:A4:AA:CD RSSI is nil Descubrimiento detenido [CHG] Controller 00:11:22:33:95:7F Discovering: no
it: [My Bluetooth Speaker]# scan off [CHG] Dispositivo AA:BB:CC:A4:AA:CD RSSI è nullo Rilevamento interrotto [CHG] Controller 00:11:22:33:95:7F Rilevamento: no

source: Congratulations, you can now automatically connect to your Bluetooth speaker!
es: Enhorabuena, ¡ya puedes conectarte automáticamente a tu altavoz Bluetooth!
it: Congratulazioni, ora puoi connetterti automaticamente al tuo altoparlante Bluetooth!
pt_br: Parabéns, agora você pode se conectar automaticamente ao seu alto-falante Bluetooth!
sk: Blahoželáme, už sa môžete samočinne pripojiť k vášmu Bluetooth reproduktoru!

source: It is now time to configure ALSA to use the @emph{bluealsa} Bluetooth module, so that you can define an ALSA pcm device corresponding to your Bluetooth speaker. For a headless server using @emph{bluealsa} with a fixed Bluetooth device is likely simpler than configuring Pulseaudio and its stream switching behavior. We configure ALSA by crafting a custom @code{alsa-configuration} for the @code{alsa-service-type}. The configuration will declare a @code{pcm} type @code{bluealsa} from the @code{bluealsa} module provided by the @code{bluez-alsa} package, and then define a @code{pcm} device of that type for your Bluetooth speaker.
es: Ahora es el momento de configurar ALSA para utilizar el módulo @emph{bluealsa} Bluetooth, para que puedas definir un dispositivo ALSA pcm correspondiente a tu altavoz Bluetooth. Para un servidor headless usar @emph{bluealsa} con un dispositivo Bluetooth fijo es probablemente más sencillo que configurar Pulseaudio y su comportamiento de conmutación de flujos. Configuramos ALSA creando un @code{alsa-configuration} personalizado para el @code{alsa-service-type}. La configuración declarará un tipo @code{pcm} @code{bluealsa} del módulo @code{bluealsa} proporcionado por el paquete @code{bluez-alsa} y, a continuación, definirá un dispositivo @code{pcm} de ese tipo para el altavoz Bluetooth.
it: Ora è il momento di configurare ALSA per utilizzare il modulo Bluetooth @emph{bluealsa}, in modo da poter definire un dispositivo pcm ALSA corrispondente al tuo altoparlante Bluetooth. Per un server headless che utilizza @emph{bluealsa} con un dispositivo Bluetooth fisso è probabilmente più semplice che configurare Pulseaudio e il suo comportamento di commutazione del flusso. Configureremo ALSA creando una @code{alsa-configuration} personalizzata per il @code{alsa-service-type}. La configurazione dichiarerà un tipo @code{pcm} @code{bluealsa} dal modulo @code{bluealsa} fornito dal pacchetto @code{bluez-alsa}, e quindi definirà un dispositivo @code{pcm} di quel tipo per il tuo altoparlante Bluetooth.
pt_br: Agora é hora de configurar o ALSA para usar o módulo Bluetooth @emph{bluealsa}, para que você possa definir um dispositivo ALSA pcm correspondente ao seu alto-falante Bluetooth. Para um servidor headless, usar @emph{bluealsa} com um dispositivo Bluetooth fixo é provavelmente mais simples do que configurar o Pulseaudio e seu comportamento de troca de fluxo. Configuramos o ALSA criando um @code{alsa-configuration} personalizado para o @code{alsa-service-type}. A configuração declarará um tipo @code{pcm} @code{bluealsa} do módulo @code{bluealsa} fornecido pelo pacote @code{bluez-alsa} e, em seguida, definirá um dispositivo @code{pcm} desse tipo para seu alto-falante Bluetooth.
sk: Teraz je čas nastaviť ALSA na používanie Bluetooth modulu @emph{bluealsa}, aby ste mohli určiť ALSA pcm zariadenie zodpovedajúce vášmu Bluetooth reproduktoru. Pre bezobrazovkový server je použitie @emph{bluealsa} s pevne určeným Bluetooth zariadením pravdepodobne jednoduchšie ako nastavenie Pulseaudia a prepínania tokov. ALSA nastavíme vytvorením vlastného nastavenia @code{alsa-configuration} pre druh @code{alsa-service-type}. Nastavenie zadá @code{bluealsa} @code{pcm} druhu z modulu @code{bluealsa} poskytovaného balíkom @code{bluez-alsa} a potom určí @code{pcm} zariadenie daného druhu pre váš Bluetooth reproduktor.

source: All that is left then is to make MPD send audio data to this ALSA device. We also add a secondary MPD output that makes the currently played audio files available as a stream through a web server on port 8080. When enabled a device on the network could listen to the audio stream by connecting any capable media player to the HTTP server on port 8080, independent of the status of the Bluetooth speaker.
es: Todo lo que queda entonces es hacer que MPD envíe datos de audio a este dispositivo ALSA. También añadimos una salida MPD secundaria que hace que los archivos de audio reproducidos actualmente estén disponibles como un flujo a través de un servidor web en el puerto 8080. Cuando se activa, un dispositivo de la red puede escuchar el flujo de audio conectando cualquier reproductor multimedia al servidor HTTP del puerto 8080, independientemente del estado del altavoz Bluetooth.
it: Tutto ciò che resta da fare è far sì che MPD invii dati audio a questo dispositivo ALSA. Aggiungiamo anche un'uscita MPD secondaria che rende i file audio attualmente riprodotti disponibili come stream tramite un server web sulla porta 8080. Quando abilitato un dispositivo sulla rete potrebbe ascoltare il flusso audio collegando qualsiasi lettore multimediale compatibile al server HTTP sulla porta 8080, indipendentemente dallo stato dell'altoparlante Bluetooth.
pt_br: Tudo o que resta então é fazer o MPD enviar dados de áudio para este dispositivo ALSA. Também adicionamos uma saída MPD secundária que torna os arquivos de áudio atualmente reproduzidos disponíveis como um fluxo por meio de um servidor web na porta 8080. Quando habilitado, um dispositivo na rede pode ouvir o fluxo de áudio conectando qualquer reprodutor de mídia capaz ao servidor HTTP na porta 8080, independentemente do status do alto-falante Bluetooth.
sk: Už zostáva len nastaviť MPD tak, aby odosielal zvukové údaje na toto ALSA zariadenie. Pridáme tiež podvojný MPD výstup, ktorý sprístupní práve prehrávané zvukové súbory ako tok cez webový server na koncovom bode 8080. Ak je zvukový tok dostupný, zariadenia na sieti ho môžu počúvať pripojením ľubovoľného hudobného prehrávača ku koncovému bodu 8080 HTTP servera nezávisle od stavu Bluetooth reproduktora.

source: What follows is the outline of an @code{operating-system} declaration that should accomplish the above-mentioned tasks:
es: Lo que sigue es el esquema de una declaración @code{operating-system} que debería cumplir las tareas mencionadas:
it: Quello che segue è lo schema di una dichiarazione @code{operating-system} che dovrebbe compiere i compiti sopra menzionati:
pt_br: O que se segue é o esboço de uma declaração @code{operating-system} que deve realizar as tarefas mencionadas acima:
sk: Nasleduje náčrt zadania @code{operating-system}, ktoré by malo umožniť vyššie uvedené úlohy:

source: (use-modules (gnu)) (use-service-modules audio dbus sound #;… etc) (use-package-modules audio linux #;… etc) (operating-system ;; … (packages (cons* bluez bluez-alsa %base-packages)) (services ;; … (service mpd-service-type (mpd-configuration (user "your-username") (music-dir "/path/to/your/music") (address "192.168.178.20") (outputs (list (mpd-output (type "alsa") (name "MPD") (extra-options ;; Use the same name as in the ALSA ;; configuration below. '((device . "pcm.btspeaker")))) (mpd-output (type "httpd") (name "streaming") (enabled? #false) (always-on? #true) (tags? #true) (mixer-type 'null) (extra-options '((encoder . "vorbis") (port . "8080") (bind-to-address . "192.168.178.20") (max-clients . "0") ;no limit (quality . "5.0") (format . "44100:16:1")))))))) (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t) (service alsa-service-type (alsa-configuration (pulseaudio? #false) ;we don't need it (extra-options #~(string-append "\ # Declare Bluetooth audio device type \"bluealsa\" from bluealsa module pcm_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_pcm_bluealsa.so") "\" @}
es: (use-modules (gnu)) (use-service-modules audio dbus sound #;… etc) (use-package-modules audio linux #;… etc) (operating-system ;; … (packages (cons* bluez bluez-alsa %base-packages)) (services ;; … (service mpd-service-type (mpd-configuration (user "your-username") (music-dir "/path/to/your/music") (address "192.168.178.20") (outputs (list (mpd-output (type "alsa") (name "MPD") (extra-options ;; Use the same name as in the ALSA ;; configuration below. '((device . "pcm.btspeaker")))) (mpd-output (type "httpd") (name "streaming") (enabled? #false) (always-on? #true) (tags? #true) (mixer-type 'null) (extra-options '((encoder . "vorbis") (port . "8080") (bind-to-address . "192.168.178.20") (max-clients . "0") ;no limit (quality . "5.0") (format . "44100:16:1")))))))) (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t) (service alsa-service-type (alsa-configuration (pulseaudio? #false) ;we don't need it (extra-options #~(string-append "\ # Declara sonido Bluetooth de dispositivo con tipo \"bluealsa\" desde módulo bluealsa pcm_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_pcm_bluealsa.so") "\" @}
it: (use-modules (gnu)) (use-service-modules audio dbus sound #;… etc) (use-package-modules audio linux #;… etc) (operating-system ;; … (packages (cons* bluez bluez-alsa %base-packages)) (services ;; … (service mpd-service-type (mpd-configuration (user "il-tuo-nome-utente") (music-dir "/percorso/alla/tua/musica") (address "192.168.178.20") (outputs (list (mpd-output (type "alsa") (name "MPD") (extra-options ;; Usa lo stesso nome della configurazione ALSA ;; qui sotto. '((device . "pcm.btspeaker")))) (mpd-output (type "httpd") (name "streaming") (enabled? #false) (always-on? #true) (tags? #true) (mixer-type 'null) (extra-options '((encoder . "vorbis") (port . "8080") (bind-to-address . "192.168.178.20") (max-clients . "0") ;nessun limite (quality . "5.0") (format . "44100:16:1")))))))) (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t) (service alsa-service-type (alsa-configuration (pulseaudio? #false) ;non ne abbiamo bisogno (extra-options #~(string-append "\ # Dichiara il tipo di dispositivo audio Bluetooth \"bluealsa\" dal modulo bluealsa pcm_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_pcm_bluealsa.so") "\" @}
pt_br: (use-modules (gnu)) (use-service-modules audio dbus sound #;… etc) (use-package-modules audio linux #;… etc) (operating-system ;; … (packages (cons* bluez bluez-alsa %base-packages)) (services ;; … (service mpd-service-type (mpd-configuration (user "your-username") (music-dir "/path/to/your/music") (address "192.168.178.20") (outputs (list (mpd-output (type "alsa") (name "MPD") (extra-options ;; Use o mesmo nome que no ALSA ;; configuração abaixo. '((device . "pcm.btspeaker")))) (mpd-output (type "httpd") (name "streaming") (enabled? #false) (always-on? #true) (tags? #true) (mixer-type 'null) (extra-options '((encoder . "vorbis") (port . "8080") (bind-to-address . "192.168.178.20") (max-clients . "0") ;no limit (quality . "5.0") (format . "44100:16:1")))))))) (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t) (service alsa-service-type (alsa-configuration (pulseaudio? #false) ;nós não precisamos disso (extra-options #~(string-append "\ # Declarar o tipo de dispositivo de áudio Bluetooth \"bluealsa\" do módulo bluealsa pcm_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_pcm_bluealsa.so") "\" @}
sk: (use-modules (gnu)) (use-service-modules audio dbus sound #;… etc) (use-package-modules audio linux #;… etc) (operating-system ;; … (packages (cons* bluez bluez-alsa %base-packages)) (services ;; … (service mpd-service-type (mpd-configuration (user "vase-pouzivatelske-meno") (music-dir "/cesta/k/vašej/hudbe") (address "192.168.178.20") (outputs (list (mpd-output (type "alsa") (name "MPD") (extra-options ;; Použite rovnaký názov ako ;; v nižšie uvedenom nastavení ALSA. '((device . "pcm.btspeaker")))) (mpd-output (type "httpd") (name "streaming") (enabled? #false) (always-on? #true) (tags? #true) (mixer-type 'null) (extra-options '((encoder . "vorbis") (port . "8080") (bind-to-address . "192.168.178.20") (max-clients . "0") ; bez obmedzení (quality . "5.0") (format . "44100:16:1")))))))) (dbus-service #:services (list bluez-alsa)) (bluetooth-service #:auto-enable? #t) (service alsa-service-type (alsa-configuration (pulseaudio? #false) ; nepotrebujeme ho! (extra-options #~(string-append "\ # Zadáva zvukové Bluetooth zariadenie druhu \"bluealsa\" z modulu bluealsa pcm_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_pcm_bluealsa.so") "\" @}

source: # Declare control device type \"bluealsa\" from the same module ctl_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_ctl_bluealsa.so") "\" @}
es: # Declarar dispositivo de control tipo \"bluealsa\" desde el mismo módulo. ctl_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_ctl_bluealsa.so") "\" @}
it: # Dichiara il tipo di dispositivo di controllo \"bluealsa\" dallo stesso modulo ctl_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_ctl_bluealsa.so") "\" @}
pt_br: # Declarar tipo de dispositivo de controle \"bluealsa\" do mesmo módulo ctl_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_ctl_bluealsa.so") "\" @}
sk: # Zadáva overovacie zariadenie druhu \"bluealsa\" z rovnakého modulu ctl_type.bluealsa @{ lib \"" #$(file-append bluez-alsa "/lib/alsa-lib/libasound_module_ctl_bluealsa.so") "\" @}

source: # Define the actual Bluetooth audio device. pcm.btspeaker @{ type bluealsa device \"AA:BB:CC:A4:AA:CD\" # unique device identifier profile \"a2dp\" @}
es: # Define el dispositivo de audio Bluetooth real. pcm.btspeaker @{ type bluealsa device \"AA:BB:CC:A4:AA:CD\" # unique device identifier profile \"a2dp\" @}
it: # Definisci il dispositivo audio Bluetooth effettivo. pcm.btspeaker @{ type bluealsa device \"AA:BB:CC:A4:AA:CD\" # identificatore unico del dispositivo profile \"a2dp\" @}
pt_br: # Defina o dispositivo de áudio Bluetooth real. pcm.btspeaker @{ type bluealsa device \"AA:BB:CC:A4:AA:CD\" # identificador de dispositivo exclusivo profile \"a2dp\" @}
sk: # Určuje zvukové Bluetooth zariadenie. pcm.btspeaker @{ type bluealsa device \"AA:BB:CC:A4:AA:CD\" # jedinečné označenie zariadenia profile \"a2dp\" @}

source: # Define an associated controller. ctl.btspeaker @{ type bluealsa @} "))))))
es: # Definir un controlador asociado. ctl.btspeaker @{ type bluealsa @} "))))))
it: # Definisci un controller associato. ctl.btspeaker @{ type bluealsa @} "))))))
pt_br: # Defina um controlador associado. ctl.btspeaker @{ type bluealsa @} "))))))
sk: # Určuje súvisiaci overovač. ctl.btspeaker @{ type bluealsa @} "))))))

source: Enjoy the music with the MPD client of your choice or a media player capable of streaming via HTTP!
es: Disfruta de la música con el cliente MPD de tu elección o con un reproductor multimedia capaz de transmitir vía HTTP.
it: Goditi la musica con il client MPD di tua scelta o un lettore multimediale capace di streaming via HTTP!
pt_br: Aproveite a música com o cliente MPD de sua escolha ou um media player capaz de transmitir via HTTP!
sk: Užite si hudbu s MPD klientom podľa vlastného výberu alebo s hudobným prehrávačom schopným prijímať zvukové toky cez HTTP!

source: The kernel Linux provides a number of shared facilities that are available to processes in the system. These facilities include a shared view on the file system, other processes, network devices, user and group identities, and a few others. Since Linux 3.19 a user can choose to @emph{unshare} some of these shared facilities for selected processes, providing them (and their child processes) with a different view on the system.
es: El núcleo Linux proporciona una serie de facilidades compartidas que están disponibles para los procesos del sistema. Estas facilidades incluyen una vista compartida sobre el sistema de archivos, otros procesos, dispositivos de red, identidades de usuario y grupo, y algunas otras. Desde Linux 3.19 un usuario puede elegir @emph{unshare} algunas de estas facilidades compartidas para procesos seleccionados, proporcionándoles a ellos (y a sus procesos hijos) una vista diferente del sistema.
it: Il kernel Linux fornisce una serie di strutture condivise che sono disponibili ai processi nel sistema. Queste strutture includono una vista condivisa sul file system, altri processi, dispositivi di rete, identità di utenti e gruppi, e alcune altre. Dal kernel Linux 3.19 un utente può scegliere di @emph{unshare} alcune di queste strutture condivise per processi selezionati, fornendo loro (e ai loro processi figli) una vista diversa del sistema.
pt_br: O kernel Linux fornece uma série de facilidades compartilhadas que estão disponíveis para processos no sistema. Essas facilidades incluem uma visão compartilhada no sistema de arquivos, outros processos, dispositivos de rede, identidades de usuários e grupos e alguns outros. Desde o Linux 3.19, um usuário pode escolher @emph{unshare} algumas dessas facilidades compartilhadas para processos selecionados, fornecendo a eles (e seus processos filhos) uma visão diferente do sistema.
sk: Linuxové jadro poskytuje určitý počet zdieľaných prostriedkov dostupných pre systémové procesy. Tieto prostriedky zahŕňajú zdieľaný pohľad na systém súborov, ostatné procesy, sieťové zariadenia, používateľov, skupinové totožnosti, a niekoľko ďalších. Počínajúc Linuxom 3.19 sa môže používateľ rozhodnúť prestať zdieľať niektoré z týchto zdieľaných prostriedkov pre vybrané procesy poskytujúc im (a ich podprocesom) odlišný pohľad na systém.

source: A process with an unshared @code{mount} namespace, for example, has its own view on the file system --- it will only be able to see directories that have been explicitly bound in its mount namespace. A process with its own @code{proc} namespace will consider itself to be the only process running on the system, running as PID 1.
es: Un proceso con un espacio de nombres @code{mount} no compartido, por ejemplo, tiene su propia vista sobre el sistema de archivos --- sólo podrá ver los directorios que han sido explícitamente vinculados en su espacio de nombres mount. Un proceso con su propio espacio de nombres @code{proc} se considerará a sí mismo como el único proceso ejecutándose en el sistema, ejecutándose como PID 1.
it: Un processo con un namespace @code{mount} non condiviso, ad esempio, ha la sua propria vista sul file system --- sarà in grado di vedere solo le directory che sono state esplicitamente vincolate nel suo namespace mount. Un processo con il suo proprio namespace @code{proc} si considererà l'unico processo in esecuzione sul sistema, in esecuzione come PID 1.
pt_br: Um processo com um namespace @code{mount} não compartilhado, por exemplo, tem sua própria visão no sistema de arquivos --- ele só poderá ver diretórios que foram explicitamente vinculados em seu namespace mount. Um processo com seu próprio namespace @code{proc} se considerará o único processo em execução no sistema, executando como PID 1.
sk: Napríklad, proces s nezdieľanou oblasťou mien pripojení (@code{mount}) má oddelený pohľad na súborový systém --- môže vidieť len priečinky, ktoré boli výslovne pripojené k jeho oblasti mien pripojení. Proces so svojou vlastnou oblasťou mien procesov (@code{proc}) vidí seba samého ako jediný proces v systéme, bežiaci pod PID 1.
