Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Indeed, you must now tell your shell where @command{emacs} and other programs installed with Guix are to be found. Pasting the two lines above will do just that: it will add @code{$HOME/.guix-profile/bin}---which is where the installed package is---to the @code{PATH} environment variable. You can paste these two lines in your shell so they take effect right away, but more importantly you should add them to @file{~/.bash_profile} (or equivalent file if you do not use Bash) so that environment variables are set next time you spawn a shell. You only need to do this once and other search paths environment variables will be taken care of similarly---e.g., if you eventually install @code{python} and Python libraries, @env{GUIX_PYTHONPATH} will be defined.
pt_br: De fato, agora você deve informar ao seu shell onde @command{emacs} e outros programas instalados com Guix podem ser encontrados. Colar as duas linhas acima fará exatamente isso: adicionará @code{$HOME/.guix-profile/bin}---que é onde o pacote instalado está---à variável de ambiente @code{PATH}. Você pode colar essas duas linhas no seu shell para que elas entrem em vigor imediatamente, mas o mais importante é adicioná-las a @file{~/.bash_profile} (ou arquivo equivalente se você não usar Bash) para que as variáveis de ambiente sejam definidas na próxima vez que você gerar um shell. Você só precisa fazer isso uma vez e outras variáveis de ambiente de caminhos de busca serão cuidadas de forma semelhante---por exemplo, se você eventualmente instalar @code{python} e bibliotecas Python, @env{GUIX_PYTHONPATH} será definido.

source: You can go on installing packages at your will. To list installed packages, run:
pt_br: Você pode continuar instalando pacotes à vontade. Para listar os pacotes instalados, execute:

source: To remove a package, you would unsurprisingly run @command{guix remove}. A distinguishing feature is the ability to @dfn{roll back} any operation you made---installation, removal, upgrade---by simply typing:
pt_br: Para remover um pacote, você executaria, sem surpresa, @command{guix remove}. Um recurso diferenciador é a capacidade de @dfn{reverter} qualquer operação que você fez---instalação, remoção, atualização---simplesmente digitando:

source: This is because each operation is in fact a @dfn{transaction} that creates a new @dfn{generation}. These generations and the difference between them can be displayed by running:
pt_br: Isso ocorre porque cada operação é, na verdade, uma @dfn{transação} que cria uma nova @dfn{geração}. Essas gerações e a diferença entre elas podem ser exibidas executando:

source: Now you know the basics of package management!
pt_br: Agora você conhece os conceitos básicos de gerenciamento de pacotes!

source: Going further
it: Andare oltre
pt_br: Indo além

source: @xref{Package Management}, for more about package management. You may like @dfn{declarative} package management with @command{guix package --manifest}, managing separate @dfn{profiles} with @option{--profile}, deleting old generations, collecting garbage, and other nifty features that will come in handy as you become more familiar with Guix. If you are a developer, @pxref{Development} for additional tools. And if you're curious, @pxref{Features}, to peek under the hood.
pt_br: @xref{Package Management}, para mais informações sobre gerenciamento de pacotes. Você pode gostar do gerenciamento de pacotes @dfn{declarativo} com @command{guix package --manifest}, gerenciar @dfn{perfis} separados com @option{--profile}, excluir gerações antigas, coletar lixo e outros recursos interessantes que serão úteis à medida que você se familiarizar com o Guix. Se você for um desenvolvedor, @pxref{Development} para ferramentas adicionais. E se estiver curioso, @pxref{Features}, para dar uma olhada nos bastidores.

source: You can also manage the configuration of your entire @dfn{home environment}---your user ``dot files'', services, and packages---using Guix Home. @xref{Home Configuration}, to learn more about it!
pt_br: Você também pode gerenciar a configuração de todo o seu ambiente @dfn{pessoal} --- seus "arquivos dot'' de usuário, serviços e pacotes --- usando o Guix Home. @xref{Home Configuration}, para saber mais sobre isso!

source: Once you've installed a set of packages, you will want to periodically @emph{upgrade} them to the latest and greatest version. To do that, you will first pull the latest revision of Guix and its package collection:
pt_br: Depois de instalar um conjunto de pacotes, você vai querer @emph{atualizá-los} periodicamente para a versão mais recente e melhor. Para fazer isso, você primeiro vai puxar a revisão mais recente do Guix e sua coleção de pacotes:

source: The end result is a new @command{guix} command, under @file{~/.config/guix/current/bin}. Unless you're on Guix System, the first time you run @command{guix pull}, be sure to follow the hint that the command prints and, similar to what we saw above, paste these two lines in your terminal and @file{.bash_profile}:
pt_br: O resultado final é um novo comando @command{guix}, em @file{~/.config/guix/current/bin}. A menos que você esteja no Guix System, na primeira vez que você executar @command{guix pull}, certifique-se de seguir a dica que o comando imprime e, similar ao que vimos acima, cole estas duas linhas no seu terminal e @file{.bash_profile}:

source: You must also instruct your shell to point to this new @command{guix}:
pt_br: Você também deve instruir seu shell a apontar para este novo @command{guix}:

source: At this point, you're running a brand new Guix. You can thus go ahead and actually upgrade all the packages you previously installed:
pt_br: Neste ponto, você está executando um Guix novinho em folha. Você pode então prosseguir e realmente atualizar todos os pacotes que você instalou anteriormente:

source: As you run this command, you will see that binaries are downloaded (or perhaps some packages are built), and eventually you end up with the upgraded packages. Should one of these upgraded packages not be to your liking, remember you can always roll back!
pt_br: Ao executar este comando, você verá que os binários são baixados (ou talvez alguns pacotes são construídos) e, eventualmente, você acaba com os pacotes atualizados. Se um desses pacotes atualizados não for do seu agrado, lembre-se de que você sempre pode reverter!

source: You can display the exact revision of Guix you're currently using by running:
pt_br: Você pode exibir a revisão exata do Guix que está usando atualmente executando:

source: The information it displays is @emph{all it takes to reproduce the exact same Guix}, be it at a different point in time or on a different machine.
pt_br: As informações exibidas são @emph{tudo o que é necessário para reproduzir exatamente o mesmo Guix}, seja em um momento diferente ou em uma máquina diferente.

source: @xref{Invoking guix pull}, for more information. @xref{Channels}, on how to specify additional @dfn{channels} to pull packages from, how to replicate Guix, and more. You may also find @command{time-machine} handy (@pxref{Invoking guix time-machine}).
pt_br: @xref{Invoking guix pull}, para mais informações. @xref{Channels}, sobre como especificar @dfn{canais} adicionais para extrair pacotes, como replicar Guix e muito mais. Você também pode achar @command{time-machine} útil (@pxref{Invoking guix time-machine}).

source: If you installed Guix System, one of the first things you'll want to do is to upgrade your system. Once you've run @command{guix pull} to get the latest Guix, you can upgrade the system like this:
pt_br: Se você instalou o Guix System, uma das primeiras coisas que você vai querer fazer é atualizar seu sistema. Depois de executar @command{guix pull} para obter o Guix mais recente, você pode atualizar o sistema assim:

source: Upon completion, the system runs the latest versions of its software packages. Just like for packages, you can always @emph{roll back} to a previous generation @emph{of the whole system}. @xref{Getting Started with the System}, to learn how to manage your system.
pt_br: Após a conclusão, o sistema executa as versões mais recentes de seus pacotes de software. Assim como para pacotes, você sempre pode @emph{reverter} para uma geração anterior @emph{de todo o sistema}. @xref{Getting Started with the System}, para aprender como gerenciar seu sistema.

source: Now you know enough to get started!
pt_br: Agora você sabe o suficiente para começar!

source: Resources
pt_br: Recursos

source: The rest of this manual provides a reference for all things Guix. Here are some additional resources you may find useful:
pt_br: O restante deste manual fornece uma referência para todas as coisas do Guix. Aqui estão alguns recursos adicionais que você pode achar úteis:

source: @xref{Top,,, guix-cookbook, The GNU Guix Cookbook}, for a list of ``how-to'' style of recipes for a variety of applications.
pt_br: @xref{Top,,, guix-cookbook.pt_BR, O Livro de Receitas do GNU Guix}, para uma lista de receitas no estilo "como fazer" para uma variedade de aplicações.

source: The @uref{https://guix.gnu.org/guix-refcard.pdf, GNU Guix Reference Card} lists in two pages most of the commands and options you'll ever need.
pt_br: O @uref{https://guix.gnu.org/guix-refcard.pdf, GNU Guix Reference Card} lista em duas páginas a maioria dos comandos e opções que você precisará.

source: The web site contains @uref{https://guix.gnu.org/en/videos/, instructional videos} covering topics such as everyday use of Guix, how to get help, and how to become a contributor.
pt_br: O site contém @uref{https://guix.gnu.org/en/videos/, vídeos instrucionais} que abordam tópicos como o uso diário do Guix, como obter ajuda e como se tornar um colaborador.

source: @xref{Documentation}, to learn how to access documentation on your computer.
pt_br: @xref{Documentation}, para aprender como acessar a documentação no seu computador.

source: We hope you will enjoy Guix as much as the community enjoys building it!
pt_br: Esperamos que você goste do Guix tanto quanto a comunidade gosta de criá-lo!

source: The purpose of GNU Guix is to allow users to easily install, upgrade, and remove software packages, without having to know about their build procedures or dependencies. Guix also goes beyond this obvious set of features.
pt_br: O propósito do GNU Guix é permitir que os usuários instalem, atualizem e removam facilmente pacotes de software, sem precisar saber sobre seus procedimentos de construção ou dependências. O Guix também vai além desse conjunto óbvio de recursos.

source: This chapter describes the main features of Guix, as well as the package management tools it provides. Along with the command-line interface described below (@pxref{Invoking guix package, @code{guix package}}), you may also use the Emacs-Guix interface (@pxref{Top,,, emacs-guix, The Emacs-Guix Reference Manual}), after installing @code{emacs-guix} package (run @kbd{M-x guix-help} command to start with it):
pt_br: Este capítulo descreve os principais recursos do Guix, bem como as ferramentas de gerenciamento de pacotes que ele fornece. Junto com a interface de linha de comando descrita abaixo (@pxref{Invoking guix package, @code{guix package}}), você também pode usar a interface Emacs-Guix (@pxref{Top,,, emacs-guix, The Emacs-Guix Reference Manual}), após instalar o pacote @code{emacs-guix} (execute o comando @kbd{M-x guix-help} para começar com ele):

source: Here we assume you've already made your first steps with Guix (@pxref{Getting Started}) and would like to get an overview about what's going on under the hood.
pt_br: Aqui presumimos que você já deu os primeiros passos com o Guix (@pxref{Getting Started}) e gostaria de ter uma visão geral do que está acontecendo nos bastidores.

source: When using Guix, each package ends up in the @dfn{package store}, in its own directory---something that resembles @file{/gnu/store/xxx-package-1.2}, where @code{xxx} is a base32 string.
pt_br: Ao usar o Guix, cada pacote acaba no @dfn{armazém de pacotes}, em seu próprio diretório — algo que lembra @file{/gnu/store/xxx-package-1.2}, onde @code{xxx} é uma string base32.

source: Instead of referring to these directories, users have their own @dfn{profile}, which points to the packages that they actually want to use. These profiles are stored within each user's home directory, at @code{$HOME/.guix-profile}.
pt_br: Em vez de se referir a esses diretórios, os usuários têm seu próprio @dfn{perfil}, que aponta para os pacotes que eles realmente querem usar. Esses perfis são armazenados dentro do diretório pessoal de cada usuário, em @code{$HOME/.guix-profile}.

source: For example, @code{alice} installs GCC 4.7.2. As a result, @file{/home/alice/.guix-profile/bin/gcc} points to @file{/gnu/store/@dots{}-gcc-4.7.2/bin/gcc}. Now, on the same machine, @code{bob} had already installed GCC 4.8.0. The profile of @code{bob} simply continues to point to @file{/gnu/store/@dots{}-gcc-4.8.0/bin/gcc}---i.e., both versions of GCC coexist on the same system without any interference.
pt_br: Por exemplo, @code{alice} instala o GCC 4.7.2. Como resultado, @file{/home/alice/.guix-profile/bin/gcc} aponta para @file{/gnu/store/@dots{}-gcc-4.7.2/bin/gcc}. Agora, na mesma máquina, @code{bob} já tinha instalado o GCC 4.8.0. O perfil de @code{bob} simplesmente continua a apontar para @file{/gnu/store/@dots{}-gcc-4.8.0/bin/gcc}---ou seja, ambas as versões do GCC coexistem no mesmo sistema sem nenhuma interferência.

source: The @command{guix package} command is the central tool to manage packages (@pxref{Invoking guix package}). It operates on the per-user profiles, and can be used @emph{with normal user privileges}.
pt_br: O comando @command{guix package} é a ferramenta central para gerenciar pacotes (@pxref{Invoking guix package}). Ele opera nos perfis por usuário e pode ser usado @emph{com privilégios normais de usuário}.

source: transactions
pt_br: transações

source: The command provides the obvious install, remove, and upgrade operations. Each invocation is actually a @emph{transaction}: either the specified operation succeeds, or nothing happens. Thus, if the @command{guix package} process is terminated during the transaction, or if a power outage occurs during the transaction, then the user's profile remains in its previous state, and remains usable.
pt_br: O comando fornece as operações óbvias de instalação, remoção e atualização. Cada invocação é, na verdade, uma @emph{transação}: ou a operação especificada é bem-sucedida ou nada acontece. Portanto, se o processo @command{guix package} for encerrado durante a transação, ou se ocorrer uma queda de energia durante a transação, o perfil do usuário permanecerá em seu estado anterior e continuará utilizável.

source: In addition, any package transaction may be @emph{rolled back}. So, if, for example, an upgrade installs a new version of a package that turns out to have a serious bug, users may roll back to the previous instance of their profile, which was known to work well. Similarly, the global system configuration on Guix is subject to transactional upgrades and roll-back (@pxref{Getting Started with the System}).
pt_br: Além disso, qualquer transação de pacote pode ser @emph{revertida}. Então, se, por exemplo, uma atualização instalar uma nova versão de um pacote que acabe tendo um bug sério, os usuários podem reverter para a instância anterior de seu perfil, que era conhecida por funcionar bem. Da mesma forma, a configuração global do sistema no Guix está sujeita a atualizações transacionais e roll-back (@pxref{Getting Started with the System}).

source: All packages in the package store may be @emph{garbage-collected}. Guix can determine which packages are still referenced by user profiles, and remove those that are provably no longer referenced (@pxref{Invoking guix gc}). Users may also explicitly remove old generations of their profile so that the packages they refer to can be collected.
pt_br: Todos os pacotes no repositório de pacotes podem ser @emph{garbage-collected}. O Guix pode determinar quais pacotes ainda são referenciados por perfis de usuário e remover aqueles que comprovadamente não são mais referenciados (@pxref{Invoking guix gc}). Os usuários também podem remover explicitamente gerações antigas de seus perfis para que os pacotes aos quais eles se referem possam ser coletados.

source: Guix takes a @dfn{purely functional} approach to package management, as described in the introduction (@pxref{Introduction}). Each @file{/gnu/store} package directory name contains a hash of all the inputs that were used to build that package---compiler, libraries, build scripts, etc. This direct correspondence allows users to make sure a given package installation matches the current state of their distribution. It also helps maximize @dfn{build reproducibility}: thanks to the isolated build environments that are used, a given build is likely to yield bit-identical files when performed on different machines (@pxref{Invoking guix-daemon, container}).
pt_br: Guix adota uma abordagem @dfn{puramente funcional} para gerenciamento de pacotes, conforme descrito na introdução (@pxref{Introduction}). Cada nome de diretório de pacote @file{/gnu/store} contém um hash de todas as entradas que foram usadas para construir aquele pacote---compilador, bibliotecas, scripts de construção, etc. Essa correspondência direta permite que os usuários tenham certeza de que uma determinada instalação de pacote corresponde ao estado atual de sua distribuição. Também ajuda a maximizar a @dfn{reprodutibilidade da construção}: graças aos ambientes de construção isolados que são usados, uma determinada construção provavelmente produzirá arquivos de bits idênticos quando executada em máquinas diferentes (@pxref{Invoking guix-daemon, container}).

source: This foundation allows Guix to support @dfn{transparent binary/source deployment}. When a pre-built binary for a @file{/gnu/store} item is available from an external source---a @dfn{substitute}, Guix just downloads it and unpacks it; otherwise, it builds the package from source, locally (@pxref{Substitutes}). Because build results are usually bit-for-bit reproducible, users do not have to trust servers that provide substitutes: they can force a local build and @emph{challenge} providers (@pxref{Invoking guix challenge}).
pt_br: Essa base permite que o Guix suporte @dfn{transparent binary/source deployment}. Quando um binário pré-construído para um item @file{/gnu/store} está disponível em uma fonte externa---um @dfn{substituto}, o Guix apenas o baixa e descompacta; caso contrário, ele constrói o pacote a partir da fonte, localmente (@pxref{Substitutes}). Como os resultados da construção são geralmente reproduzíveis bit a bit, os usuários não precisam confiar em servidores que fornecem substitutos: eles podem forçar uma construção local e @emph{desafiar} os provedores (@pxref{Invoking guix challenge}).

source: Control over the build environment is a feature that is also useful for developers. The @command{guix shell} command allows developers of a package to quickly set up the right development environment for their package, without having to manually install the dependencies of the package into their profile (@pxref{Invoking guix shell}).
pt_br: O controle sobre o ambiente de construção é um recurso que também é útil para desenvolvedores. O comando @command{guix shell} permite que os desenvolvedores de um pacote configurem rapidamente o ambiente de desenvolvimento correto para seu pacote, sem ter que instalar manualmente as dependências do pacote em seu perfil (@pxref{Invoking guix shell}).

source: replication, of software environments
pt_br: replicação, de ambientes de software

source: provenance tracking, of software artifacts
pt_br: rastreamento de proveniência, de artefatos de software

source: All of Guix and its package definitions is version-controlled, and @command{guix pull} allows you to ``travel in time'' on the history of Guix itself (@pxref{Invoking guix pull}). This makes it possible to replicate a Guix instance on a different machine or at a later point in time, which in turn allows you to @emph{replicate complete software environments}, while retaining precise @dfn{provenance tracking} of the software.
pt_br: Todo o Guix e suas definições de pacote são controlados por versão, e @command{guix pull} permite que você "viaje no tempo'' no histórico do próprio Guix (@pxref{Invoking guix pull}). Isso torna possível replicar uma instância do Guix em uma máquina diferente ou em um ponto posterior no tempo, o que por sua vez permite que você @emph{replique ambientes de software completos}, enquanto retém o @dfn{rastreamento de procedência} preciso do software.

source: Invoking @command{guix package}
pt_br: Invocando @command{guix package}

source: installing packages
pt_br: instalando pacotes

source: removing packages
pt_br: removendo pacotes

source: package installation
pt_br: instalação de pacote

source: package removal
pt_br: remoção de pacote

source: The @command{guix package} command is the tool that allows users to install, upgrade, and remove packages, as well as rolling back to previous configurations. These operations work on a user @dfn{profile}---a directory of installed packages. Each user has a default profile in @file{$HOME/.guix-profile}. The command operates only on the user's own profile, and works with normal user privileges (@pxref{Features}). Its syntax is:
pt_br: O comando @command{guix package} é a ferramenta que permite aos usuários instalar, atualizar e remover pacotes, bem como reverter para configurações anteriores. Essas operações funcionam no @dfn{perfil} de um usuário---um diretório de pacotes instalados. Cada usuário tem um perfil padrão em @file{$HOME/.guix-profile}. O comando opera apenas no próprio perfil do usuário e funciona com privilégios de usuário normais (@pxref{Features}). Sua sintaxe é:

source: guix package @var{options}
pt_br: guix package @var{opções}

source: Primarily, @var{options} specifies the operations to be performed during the transaction. Upon completion, a new profile is created, but previous @dfn{generations} of the profile remain available, should the user want to roll back.
pt_br: Principalmente, @var{opções} especifica as operações a serem executadas durante a transação. Após a conclusão, um novo perfil é criado, mas as @dfn{gerações} anteriores do perfil permanecem disponíveis, caso o usuário queira reverter.

source: For example, to remove @code{lua} and install @code{guile} and @code{guile-cairo} in a single transaction:
pt_br: Por exemplo, para remover @code{lua} e instalar @code{guile} e @code{guile-cairo} em uma única transação:

source: aliases, for @command{guix package}
pt_br: aliases, para @command{guix package}

source: For your convenience, we also provide the following aliases:
pt_br: Para sua conveniência, também fornecemos os seguintes aliases:

source: @command{guix search} is an alias for @command{guix package -s},
pt_br: @command{guix search} é um alias para @command{guix package -s},

source: @command{guix install} is an alias for @command{guix package -i},
pt_br: @command{guix install} é um alias para @command{guix package -i},

source: @command{guix remove} is an alias for @command{guix package -r},
pt_br: @command{guix remove} é um alias para @command{guix package -r},

source: @command{guix upgrade} is an alias for @command{guix package -u},
pt_br: @command{guix upgrade} é um alias para @command{guix package -u},

source: and @command{guix show} is an alias for @command{guix package --show=}.
pt_br: e @command{guix show} é um alias para @command{guix package --show=}.
