Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: If this runs through without error, feel free to skip this section. You should continue with the following section, @ref{Application Setup}.
it: Se questo viene eseguito senza errori, sentiti libero di saltare questa sezione. Dovresti continuare con la sezione successiva, @ref{Application Setup}.
pt_br: Se isso ocorrer sem erros, sinta-se à vontade para pular esta seção. Você deve continuar com a seção seguinte, @ref{Application Setup}.

source: However, now would be a good time to replace outdated daemon versions, tweak it, perform builds on other machines (@pxref{Daemon Offload Setup}), or start it manually in special environments like ``chroots'' (@pxref{Chrooting into an existing system}) or WSL (not needed for WSL images created with Guix, @pxref{System Images, @code{wsl2-image-type}}). If you want to know more or optimize your system, this section is worth reading.
it: Tuttavia, ora sarebbe un buon momento per sostituire versioni obsolete del demone, modificarlo, eseguire build su altre macchine (@pxref{Daemon Offload Setup}), o avviarlo manualmente in ambienti speciali come i ``chroot'' (@pxref{Chrooting into an existing system}) o WSL (non necessario per le immagini WSL create con Guix, @pxref{System Images, @code{wsl2-image-type}}). Se vuoi saperne di più o ottimizzare il tuo sistema, questa sezione merita di essere letta.
pt_br: No entanto, agora seria um bom momento para substituir versões desatualizadas do daemon, ajustá-lo, executar compilações em outras máquinas (@pxref{Daemon Offload Setup}) ou iniciá-lo manualmente em ambientes especiais como ``chroots'' (@pxref{Chrooting into an existing system}) ou WSL (não necessário para imagens WSL criadas com Guix, @pxref{System Images, @code{wsl2-image-type}}). Se você quiser saber mais ou otimizar seu sistema, vale a pena ler esta seção.

source: Operations such as building a package or running the garbage collector are all performed by a specialized process, the build daemon, on behalf of clients. Only the daemon may access the store and its associated database. Thus, any operation that manipulates the store goes through the daemon. For instance, command-line tools such as @command{guix package} and @command{guix build} communicate with the daemon (@i{via} remote procedure calls) to instruct it what to do.
it: Operazioni come la compilazione di un pacchetto o l'esecuzione del garbage collector sono tutte eseguite da un processo specializzato, il demone di build, per conto dei client. Solo il demone può accedere allo store e al suo database associato. Quindi, qualsiasi operazione che manipola lo store passa attraverso il demone. Per esempio, strumenti da riga di comando come @command{guix package} e @command{guix build} comunicano con il demone (@i{via} chiamate di procedura remota) per istruirlo su cosa fare.
pt_br: Operações como compilar um pacote ou executar o coletor de lixo são todas executadas por um processo especializado, o build daemon, em nome dos clientes. Apenas o daemon pode acessar o armazém e seu banco de dados associado. Assim, qualquer operação que manipule o armazém passa pelo daemon. Por exemplo, ferramentas de linha de comando como @command{guix package} e @command{guix build} se comunicam com o daemon (@i{via} chamadas de procedimento remoto) para instruir o que fazer.

source: The following sections explain how to prepare the build daemon's environment. @xref{Substitutes} for how to allow the daemon to download pre-built binaries.
it: Le sezioni seguenti spiegano come preparare l'ambiente del demone di build. @xref{Substitutes} per come consentire al demone di scaricare binari precompilati.
pt_br: As seções a seguir explicam como preparar o ambiente do daemon de compilação. @xref{Substitutes} para informações sobre como permitir que o daemon baixe binários pré-compilados.

source: build environment
it: ambiente di build
pt_br: ambiente de compilação

source: In a standard multi-user setup, Guix and its daemon---the @command{guix-daemon} program---are installed by the system administrator. Unprivileged users may use Guix tools to build packages or otherwise access the store, and the daemon will do it on their behalf, ensuring that the store is kept in a consistent state, and allowing built packages to be shared among users.
it: In una configurazione multi-utente standard, Guix e il suo demone - il programma @command{guix-daemon} - sono installati dall'amministratore di sistema. Gli utenti non privilegiati possono usare gli strumenti di Guix per compilare pacchetti o accedere allo store in altro modo, e il demone lo farà per loro conto, assicurando che lo store sia mantenuto in uno stato consistente e permettendo che i pacchetti compilati siano condivisi tra gli utenti.
pt_br: Em uma configuração multiusuário padrão, o Guix e seu daemon – o programa @command{guix-daemon} – são instalados pelo administrador do sistema. Usuários desprivilegiados podem usar ferramentas Guix para criar pacotes ou acessar o armazém, e o daemon fará isso em seu nome, garantindo que o armazém seja mantido em um estado consistente e permitindo que pacotes construídos sejam compartilhados entre os usuários.

source: build users
it: utenti di build
pt_br: usuários de compilação

source: When @command{guix-daemon} runs as @code{root}, you may not want package build processes themselves to run as @code{root} too, for obvious security reasons. To avoid that, a special pool of @dfn{build users} should be created for use by build processes started by the daemon. Having several such users allows the daemon to launch distinct build processes under separate UIDs, which guarantees that they do not interfere with each other---an essential feature since builds are regarded as pure functions (@pxref{Introduction}).
it: Quando @command{guix-daemon} viene eseguito come @code{root}, potresti non volere che anche i processi di build dei pacchetti vengano eseguiti come @code{root}, per ovvie ragioni di sicurezza. Per evitarlo, dovrebbe essere creato un pool speciale di @dfn{utenti di build} da utilizzare per i processi di build avviati dal demone. Avere diversi utenti di questo tipo permette al demone di avviare processi di build distinti con UID separati, il che garantisce che non interferiscano tra loro - una caratteristica essenziale poiché le build sono considerate funzioni pure (@pxref{Introduction}).
pt_br: Quando @command{guix-daemon} é executado como @code{root}, você pode não querer que os próprios processos de compilação de pacotes também sejam executados como @code{root}, por razões óbvias de segurança. Para evitar isso, um conjunto especial de @dfn{usuários de compilação} deve ser criado para uso pelos processos de construção iniciados pelo daemon. Ter vários desses usuários permite que o daemon ative processos de compilação distintos sob UIDs separados, o que garante que eles não interfiram uns com os outros - um recurso essencial, pois as compilações são consideradas funções puras (@pxref{Introduction}).

source: On a GNU/Linux system, a build user pool may be created like this (using Bash syntax and the @code{shadow} commands):
it: Su un sistema GNU/Linux, un pool di utenti di build può essere creato in questo modo (usando la sintassi Bash e i comandi @code{shadow}):
pt_br: Em um sistema GNU/Linux, um conjunto de usuários de construção pode ser criado assim (usando a sintaxe Bash e os comandos @code{shadow}):

source: The number of build users determines how many build jobs may run in parallel, as specified by the @option{--max-jobs} option (@pxref{Invoking guix-daemon, @option{--max-jobs}}). To use @command{guix system vm} and related commands, you may need to add the build users to the @code{kvm} group so they can access @file{/dev/kvm}, using @code{-G guixbuild,kvm} instead of @code{-G guixbuild} (@pxref{Invoking guix system}).
it: Il numero di utenti di build determina quanti lavori di build possono essere eseguiti in parallelo, come specificato dall'opzione @option{--max-jobs} (@pxref{Invoking guix-daemon, @option{--max-jobs}}). Per usare @command{guix system vm} e comandi correlati, potrebbe essere necessario aggiungere gli utenti di build al gruppo @code{kvm} in modo che possano accedere a @file{/dev/kvm}, usando @code{-G guixbuild,kvm} invece di @code{-G guixbuild} (@pxref{Invoking guix system}).
pt_br: O número de usuários de compilação determina quantos trabalhos de compilação podem ser executados em paralelo, conforme especificado pela opção @option{--max-jobs} (@pxref{Invoking guix-daemon, @option{--max-jobs}}). Para usar @command{guix system vm} e comandos relacionados, você pode precisar adicionar os usuários de compilação ao grupo @code{kvm} para que eles possam acessar @file{/dev/kvm}, usando @code{-G guixbuild,kvm} em vez de @code{-G guixbuild} (@pxref{Invoking guix system}).

source: a minimal @code{/dev} directory, created mostly independently from the host @code{/dev}@footnote{``Mostly'', because while the set of files that appear in the chroot's @code{/dev} is fixed, most of these files can only be created if the host has them.};
it: una directory @code{/dev} minimale, creata per lo più indipendentemente dalla @code{/dev} dell'host@footnote{``Per lo più'', perché mentre l'insieme di file che appaiono nella @code{/dev} del chroot è fisso, la maggior parte di questi file può essere creata solo se l'host li ha.};
pt_br: um diretório @code{/dev} mínimo, criado principalmente independentemente do @code{/dev} do hospedeiro@footnote{``Principalmente'' porque enquanto o conjunto de arquivos que aparece no @code{/dev} do chroot é corrigido, a maioria desses arquivos só pode ser criada se o hospedeiro os possuir.};

source: the @code{/proc} directory; it only shows the processes of the container since a separate PID name space is used;
it: la directory @code{/proc}; mostra solo i processi del container poiché viene usato un namespace PID separato;
pt_br: o diretório @code{/proc}; mostra apenas os processos do contêiner desde que um espaço de nome PID separado é usado;

source: @file{/etc/passwd} with an entry for the current user and an entry for user @file{nobody};
it: @file{/etc/passwd} con una voce per l'utente corrente e una voce per l'utente @file{nobody};
pt_br: @file{/etc/passwd} com uma entrada para o usuário atual e uma entrada para o usuário @file{nobody};

source: @file{/etc/group} with an entry for the user's group;
it: @file{/etc/group} con una voce per il gruppo dell'utente;
pt_br: @file{/etc/group} com uma entrada para o grupo de usuários;

source: @file{/etc/hosts} with an entry that maps @code{localhost} to @code{127.0.0.1};
it: @file{/etc/hosts} con una voce che mappa @code{localhost} a @code{127.0.0.1};
pt_br: @file{/etc/hosts} com uma entrada que mapeia @code{localhost} para @code{127.0.0.1};

source: a writable @file{/tmp} directory.
it: una directory @file{/tmp} scrivibile.
pt_br: um diretório @file{/tmp} com permissão de escrita.

source: The chroot does not contain a @file{/home} directory, and the @env{HOME} environment variable is set to the non-existent @file{/homeless-shelter}. This helps to highlight inappropriate uses of @env{HOME} in the build scripts of packages.
it: Il chroot non contiene una directory @file{/home}, e la variabile d'ambiente @env{HOME} è impostata sulla directory inesistente @file{/homeless-shelter}. Questo aiuta a evidenziare usi inappropriati di @env{HOME} negli script di build dei pacchetti.
pt_br: O chroot não contém um diretório @file{/home}, e a variável de ambiente @env{HOME} é definida como o inexistente @file{/homeless-shelter}. Isso ajuda a destacar usos inapropriados de @env{HOME} nos scripts de construção de pacotes.

source: All this is usually enough to ensure details of the environment do not influence build processes. In some exceptional cases where more control is needed---typically over the date, kernel, or CPU---you can resort to a virtual build machine (@pxref{build-vm, virtual build machines}).
it: Tutto questo è solitamente sufficiente per garantire che i dettagli dell'ambiente non influenzino i processi di build. In alcuni casi eccezionali in cui è necessario un maggiore controllo - tipicamente sulla data, il kernel o la CPU - si può ricorrere a una macchina virtuale di build (@pxref{build-vm, virtual build machines}).
pt_br: Tudo isso geralmente é suficiente para garantir que os detalhes do ambiente não influenciem os processos de construção. Em alguns casos excepcionais em que mais controle é necessário --- normalmente sobre a data, kernel ou CPU --- você pode recorrer a uma máquina de construção virtual (@pxref{build-vm, máquinas de construção virtual}).

source: You can influence the directory where the daemon stores build trees @i{via} the @env{TMPDIR} environment variable. However, the build tree within the chroot is always called @file{/tmp/guix-build-@var{name}.drv-0}, where @var{name} is the derivation name---e.g., @code{coreutils-8.24}. This way, the value of @env{TMPDIR} does not leak inside build environments, which avoids discrepancies in cases where build processes capture the name of their build tree.
it: Puoi influenzare la directory in cui il demone memorizza gli alberi di build @i{via} la variabile d'ambiente @env{TMPDIR}. Tuttavia, l'albero di build all'interno del chroot è sempre chiamato @file{/tmp/guix-build-@var{name}.drv-0}, dove @var{name} è il nome della derivazione - ad esempio, @code{coreutils-8.24}. In questo modo, il valore di @env{TMPDIR} non trapela negli ambienti di build, il che evita discrepanze nei casi in cui i processi di build catturano il nome del loro albero di build.
pt_br: Você pode influenciar o diretório onde o daemon armazena árvores de build @i{via} a variável de ambiente @env{TMPDIR}. No entanto, a árvore de build dentro do chroot é sempre chamada @file{/tmp/guix-build-@var{name}.drv-0}, onde @var{name} é o nome da derivação---por exemplo, @code{coreutils-8.24}. Dessa forma, o valor de @env{TMPDIR} não vaza dentro de ambientes de build, o que evita discrepâncias em casos em que os processos de build capturam o nome de sua árvore de build.

source: The daemon also honors the @env{http_proxy} and @env{https_proxy} environment variables for HTTP and HTTPS downloads it performs, be it for fixed-output derivations (@pxref{Derivations}) or for substitutes (@pxref{Substitutes}).
it: Il demone onora anche le variabili d'ambiente @env{http_proxy} e @env{https_proxy} per i download HTTP e HTTPS che esegue, sia per le derivazioni a output fisso (@pxref{Derivations}) che per i sostituti (@pxref{Substitutes}).
pt_br: O daemon também respeita as variáveis de ambiente @env{http_proxy} e @env{https_proxy} para downloads HTTP e HTTPS que ele realiza, seja para derivações de saída fixa (@pxref{Derivations}) ou para substitutos (@pxref{Substitutes}).

source: Using the Offload Facility
it: Uso della funzione di offload
pt_br: Usando o recurso de descarregamento

source: offloading
pt_br: descarregamento

source: build hook
it: hook di build
pt_br: hook de compilação

source: When desired, the build daemon can @dfn{offload} derivation builds to other machines running Guix, using the @code{offload} @dfn{build hook}@footnote{This feature is available only when @uref{https://github.com/artyom-poptsov/guile-ssh, Guile-SSH} is present.}. When that feature is enabled, a list of user-specified build machines is read from @file{/etc/guix/machines.scm}; every time a build is requested, for instance via @code{guix build}, the daemon attempts to offload it to one of the machines that satisfy the constraints of the derivation, in particular its system types---e.g., @code{x86_64-linux}. A single machine can have multiple system types, either because its architecture natively supports it, via emulation (@pxref{transparent-emulation-qemu, Transparent Emulation with QEMU}), or both. Missing prerequisites for the build are copied over SSH to the target machine, which then proceeds with the build; upon success the output(s) of the build are copied back to the initial machine. The offload facility comes with a basic scheduler that attempts to select the best machine. The best machine is chosen among the available machines based on criteria such as:
it: Se lo si desidera, il demone di build può fare l'@dfn{offload} delle build di derivazione su altre macchine che eseguono Guix, utilizzando l'@dfn{hook di build} @code{offload}@footnote{Questa funzione è disponibile solo quando @uref{https://github.com/artyom-poptsov/guile-ssh, Guile-SSH} è presente.}. Quando questa funzione è abilitata, un elenco di macchine di build specificate dall'utente viene letto da @file{/etc/guix/machines.scm}; ogni volta che viene richiesta una build, ad esempio tramite @code{guix build}, il demone tenta di scaricarla su una delle macchine che soddisfano i vincoli della derivazione, in particolare i suoi tipi di sistema, ad esempio @code{x86_64-linux}. Una singola macchina può avere più tipi di sistema, sia perché la sua architettura lo supporta nativamente, sia tramite emulazione (@pxref{transparent-emulation-qemu, Transparent Emulation with QEMU}), o entrambi. I prerequisiti mancanti per la build vengono copiati tramite SSH sulla macchina di destinazione, che procede quindi con la build; in caso di successo, l'output (o gli output) della build viene copiato nuovamente sulla macchina iniziale. La funzione di offload è dotata di uno scheduler di base che tenta di selezionare la macchina migliore. La macchina migliore viene scelta tra le macchine disponibili in base a criteri quali:
pt_br: Quando desejado, o daemon de compilação pode @dfn{offload} compilações de derivação para outras máquinas executando Guix, usando o @code{offload} @dfn{build hook}@footnote{Este recurso está disponível somente quando @uref{https://github.com/artyom-poptsov/guile-ssh, Guile-SSH} está presente.}. Quando esse recurso é habilitado, uma lista de máquinas de compilação especificadas pelo usuário é lida de @file{/etc/guix/machines.scm}; toda vez que uma compilação é solicitada, por exemplo via @code{guix build}, o daemon tenta descarregá-la para uma das máquinas que satisfazem as restrições da derivação, em particular seus tipos de sistema --- por exemplo, @code{x86_64-linux}. Uma única máquina pode ter vários tipos de sistema, seja porque sua arquitetura o suporta nativamente, via emulação (@pxref{transparent-emulation-qemu, Transparent Emulation with QEMU}), ou ambos. Os pré-requisitos ausentes para a compilação são copiados por SSH para a máquina de destino, que então prossegue com a compilação; em caso de sucesso, a(s) saída(s) da compilação são copiadas de volta para a máquina inicial. O recurso de offload vem com um agendador básico que tenta selecionar a melhor máquina. A melhor máquina é escolhida entre as máquinas disponíveis com base em critérios como:

source: The availability of a build slot. A build machine can have as many build slots (connections) as the value of the @code{parallel-builds} field of its @code{build-machine} object.
it: La disponibilità di uno slot di build. Una macchina di build può avere tanti slot di build (connessioni) quanti il valore del campo @code{parallel-builds} del suo oggetto @code{build-machine}.
pt_br: A disponibilidade de um slot de build. Uma máquina de build pode ter tantos slots de build (conexões) quanto o valor do campo @code{parallel-builds} do seu objeto @code{build-machine}.

source: Its relative speed, as defined via the @code{speed} field of its @code{build-machine} object.
it: La sua velocità relativa, come definita tramite il campo @code{speed} del suo oggetto @code{build-machine}.
pt_br: Sua velocidade relativa, conforme definida pelo campo @code{speed} do seu objeto @code{build-machine}.

source: Its load. The normalized machine load must be lower than a threshold value, configurable via the @code{overload-threshold} field of its @code{build-machine} object.
it: Il suo carico. Il carico normalizzato della macchina deve essere inferiore a un valore soglia, configurabile tramite il campo @code{overload-threshold} del suo oggetto @code{build-machine}.
pt_br: Sua carga. A carga normalizada da máquina deve ser menor que um valor limite, configurável por meio do campo @code{overload-threshold} de seu objeto @code{build-machine}.

source: Disk space availability. More than 100 MiB must be available.
it: Disponibilità di spazio su disco. Devono essere disponibili più di 100 MiB.
pt_br: Disponibilidade de espaço em disco. Mais de 100 MiB devem estar disponíveis.

source: The @file{/etc/guix/machines.scm} file typically looks like this:
it: Il file @file{/etc/guix/machines.scm} si presenta tipicamente così:
pt_br: O arquivo @file{/etc/guix/machines.scm} geralmente se parece com isso:

source: ;; Remember 'guix offload' is spawned by ;; 'guix-daemon' as root. (private-key "/root/.ssh/identity-for-guix")))
it: ;; Ricorda che 'guix offload' viene generato da ;; 'guix-daemon' come root. (private-key "/root/.ssh/identity-for-guix")))
pt_br: ;; Lembre-se de que 'guix offload' é gerado por ;; 'guix-daemon' como root. (private-key "/root/.ssh/identity-for-guix")))

source: In the example above we specify a list of two build machines, one for the @code{x86_64} and @code{i686} architectures and one for the @code{aarch64} architecture.
it: Nell'esempio sopra specifichiamo un elenco di due macchine di build, una per le architetture @code{x86_64} e @code{i686} e una per l'architettura @code{aarch64}.
pt_br: No exemplo acima, especificamos uma lista de duas máquinas de compilação, uma para as arquiteturas @code{x86_64} e @code{i686} e uma para a arquitetura @code{aarch64}.

source: In fact, this file is---not surprisingly!---a Scheme file that is evaluated when the @code{offload} hook is started. Its return value must be a list of @code{build-machine} objects. While this example shows a fixed list of build machines, one could imagine, say, using DNS-SD to return a list of potential build machines discovered in the local network (@pxref{Introduction, Guile-Avahi,, guile-avahi, Using Avahi in Guile Scheme Programs}). The @code{build-machine} data type is detailed below.
it: Infatti, questo file è - non sorprendentemente! - un file Scheme che viene valutato quando l'hook @code{offload} viene avviato. Il suo valore di ritorno deve essere un elenco di oggetti @code{build-machine}. Sebbene questo esempio mostri un elenco fisso di macchine di build, si potrebbe immaginare, ad esempio, di usare DNS-SD per restituire un elenco di potenziali macchine di build scoperte nella rete locale (@pxref{Introduction, Guile-Avahi,, guile-avahi, Using Avahi in Guile Scheme Programs}). Il tipo di dato @code{build-machine} è dettagliato di seguito.
pt_br: De fato, esse arquivo é -- não surpreendentemente! -- um arquivo de Scheme que é avaliado quando o hook @code{offload} é iniciado. Seu valor de retorno deve ser uma lista de objetos de @code{build-machine}. Embora este exemplo mostre uma lista fixa de máquinas de compilação, pode-se imaginar, digamos, usando DNS-SD para retornar uma lista de possíveis máquinas de compilação descobertas na rede local (@pxref{Introduction, Guile-Avahi ,, guile-avahi, Using Avahi in Guile Scheme Programs}). O tipo de dados de @code{build-machine} está detalhado abaixo.

source: {Data Type} build-machine
it: {Tipo di dato} build-machine
pt_br: {Tipo de dados} build-machine

source: This data type represents build machines to which the daemon may offload builds. The important fields are:
it: Questo tipo di dato rappresenta le macchine di build su cui il demone può scaricare le build. I campi importanti sono:
pt_br: Esse tipo de dados representa máquinas de compilação nas quais o daemon pode descarregar compilações. Os campos importantes são:

source: The host name of the remote machine.
it: Il nome host della macchina remota.
pt_br: O nome de host da máquina remota.
