Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: The Guix System provides a wide array of interconnected system services that are configured declaratively to form a dependable stateless GNU System foundation for whatever tasks you throw at it. Even when using Guix on a foreign distribution you can benefit from the design of Guix System by running a system instance as a container. Using the same kernel features of unshared namespaces mentioned in the previous section, the resulting Guix System instance is isolated from the host system and only shares file system locations that you explicitly declare.
it: Il sistema Guix fornisce una vasta gamma di servizi di sistema interconnessi che sono configurati in modo dichiarativo per formare una fondazione affidabile e senza stato per il sistema GNU per qualsiasi attività tu gli assegni. Anche quando usi Guix su una distribuzione esterna, puoi beneficiare del design del sistema Guix eseguendo un'istanza di sistema come container. Usando le stesse funzionalità del kernel di namespace non condivisi menzionati nella sezione precedente, l'istanza Guix System risultante è isolata dal sistema host e condivide solo le posizioni del file system che dichiari esplicitamente.
pt_br: O Guix System fornece uma ampla gama de serviços de sistema interconectados que são configurados declarativamente para formar uma fundação GNU System sem estado confiável para quaisquer tarefas que você jogue nele. Mesmo ao usar o Guix em uma distribuição estrangeira, você pode se beneficiar do design do Guix System executando uma instância do sistema como um contêiner. Usando os mesmos recursos do kernel de namespaces não compartilhados mencionados na seção anterior, a instância do Guix System resultante é isolada do sistema host e compartilha apenas os locais do sistema de arquivos que você declara explicitamente.
sk: Systém Guix poskytuje široké pole systémových služieb s deklaratívnym nastavením vzájomne prepojených tak, aby vytvárali spoľahlivý a bezstavový základ GNU systému pre akékoľvek úlohy. Aj pri použití Guixu na cudzej distribúcií môžete využiť výhody systému Guix spustením systémovej inštancie v podobe kontajnera. Vďaka vlastnostiam nezdieľaných oblastí mien spomínaných v predošlom oddieli je výsledná inštancia systému Guix oddelená od hostiteľského systému a zdieľa s ním len tie umiestnenia súborového systému, ktoré ste si výslovne zvolili.

source: A Guix System container differs from the shell process created by @command{guix shell --container} in a number of important ways. While in a container shell the containerized process is a Bash shell process, a Guix System container runs the Shepherd as PID 1. In a system container all system services (@pxref{Services,,, guix, GNU Guix Reference Manual}) are set up just as they would be on a Guix System in a virtual machine or on bare metal---this includes daemons managed by the GNU@tie{}Shepherd (@pxref{Shepherd Services,,, guix, GNU Guix Reference Manual}) as well as other kinds of extensions to the operating system (@pxref{Service Composition,,, guix, GNU Guix Reference Manual}).
es: Un contenedor del Sistema Guix difiere del proceso shell creado por @command{guix shell --container} en varios aspectos importantes. Mientras que en un shell contenedor el proceso de contenedor es un proceso shell Bash, un contenedor Guix System ejecuta el Shepherd como PID 1. En un contenedor de sistema todos los servicios del sistema (@pxref{Servicios,,, guix.es, Manual de referencia de GNU Guix}) están configurados tal y como lo estarían en un Sistema Guix en una máquina virtual o en una máquina de metal desnudo - esto incluye daemons gestionados por GNU@tie{}Shepherd (@pxref{Servicios de Shepherd,,,guix.es, Manual de referencia de GNU Guix}) así como otros tipos de extensiones del sistema operativo (@pxref{Composición de servicios,,, guix.es, Manual de referencia de GNU Guix}).
it: Un contenitore del sistema Guix differisce dal processo di shell creato da @command{guix shell --container} in una serie di modi importanti. Mentre in una shell contenitore il processo containerizzato è un processo shell Bash, un contenitore del sistema Guix esegue Shepherd come PID 1. In un contenitore di sistema tutti i servizi di sistema (@pxref{Services,,, guix, GNU Guix Reference Manual}) sono configurati esattamente come lo sarebbero su un sistema Guix in una macchina virtuale o su hardware bare metal --- questo include i demoni gestiti da GNU@tie{}Shepherd (@pxref{Servizi Shepherd,,, guix.it, Manuale di riferimento di GNU Guix}) così come altri tipi di estensioni al sistema operativo (@pxref{Composizione dei servizi,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: Um contêiner do Sistema Guix difere do processo shell criado por @command{guix shell --container} em várias maneiras importantes. Enquanto em um shell de contêiner o processo containerizado é um processo de shell Bash, um contêiner do Sistema Guix executa o Shepherd como PID 1. Em um contêiner do sistema, todos os serviços do sistema (@pxref{Serviços,,, guix.pt_BR, Manual de Referência do GNU Guix}) são configurados exatamente como seriam em um Sistema Guix em uma máquina virtual ou em bare metal --- isso inclui daemons gerenciados pelo GNU@tie{}Shepherd (@pxref{Serviços do Shepherd,,, guix.pt_BR, Manual de Referência do GNU Guix}), bem como outros tipos de extensões para o sistema operacional (@pxref{Composição de serviço,,, guix.pt_BR, Manual de Referência do GNU Guix}).
sk: Kontajner systému Guix sa od procesu shell vytvoreného pomocou @command{guix shell --container} v mnohých ohľadoch líši. Zatiaľčo v kontajnerovom shelle je hlavným oddeleným procesom Bash, v kontajneri so systémom Guix beží pod PID 1 Shepherd. V tomto prípade sú tiež všetky systémové služby (@pxref{Services,,, guix, GNU Guix Reference Manual}) nastavené tak, ako by boli v systéme Guix vrámci virtuálneho stroja alebo na skutočnom vybavení. To zahŕňa démonov spravovaných GNU@tie{}Shepherdom (@pxref{Shepherd Services,,, guix, GNU Guix Reference Manual}) ako aj ďalšie druhy rozšírení operačného systému (@pxref{Service Composition,,, guix, GNU Guix Reference Manual}).

source: The perceived increase in complexity of running a Guix System container is easily justified when dealing with more complex applications that have higher or just more rigid requirements on their execution contexts---configuration files, dedicated user accounts, directories for caches or log files, etc. In Guix System the demands of this kind of software are satisfied through the deployment of system services.
es: El aumento percibido en la complejidad de ejecutar un contenedor de Sistema Guix se justifica fácilmente cuando se trata de aplicaciones más complejas que tienen requisitos más altos o simplemente más rígidos en sus contextos de ejecución---archivos de configuración, cuentas de usuario dedicadas, directorios para cachés o archivos de registro, etc. En Sistema Guix las demandas de este tipo de software se satisfacen mediante el despliegue de servicios de sistema.
it: Il percepito aumento di complessità nell'esecuzione di un contenitore del sistema Guix è facilmente giustificato quando si ha a che fare con applicazioni più complesse che hanno requisiti più elevati o semplicemente più rigidi sui loro contesti di esecuzione --- file di configurazione, account utente dedicati, directory per cache o file di log, ecc. Nel sistema Guix le esigenze di questo tipo di software sono soddisfatte attraverso l'implementazione di servizi di sistema.
pt_br: O aumento percebido na complexidade da execução de um contêiner do Guix System é facilmente justificado ao lidar com aplicativos mais complexos que têm requisitos mais altos ou mais rígidos em seus contextos de execução: arquivos de configuração, contas de usuários dedicadas, diretórios para caches ou arquivos de log, etc. No Guix System, as demandas desse tipo de software são satisfeitas por meio da implantação de serviços do sistema.
sk: Pozorovanú zvýšenú zložitosť v používaní kontajnerov so systémom Guix možno jednoducho zdôvodniť keď sa musíte vysporiadať so zložitými aplikáciami, ktoré majú vyššie či len prísnejšie požiadavky na prostredie, v ktorom sú spúšťané, napr. súbory nastavení, vyhradené používateľské účty, priečinky vyrovnávacej pamäte, súbory záznamov a pod. Systém Guix tento druh požiadaviek spĺňa nasadením systémových služieb.

source: A good example might be a PostgreSQL database server. Much of the complexity of setting up such a database server is encapsulated in this deceptively short service declaration:
es: Un buen ejemplo podría ser un servidor de bases de datos PostgreSQL. Gran parte de la complejidad de configurar un servidor de bases de datos de este tipo se encapsula en esta declaración de servicio engañosamente corta:
it: Un buon esempio potrebbe essere un server di database PostgreSQL. Gran parte della complessità della configurazione di un tale server di database è incapsulata in questa ingannevolmente breve dichiarazione di servizio:
pt_br: Um bom exemplo pode ser um servidor de banco de dados PostgreSQL. Grande parte da complexidade de configurar tal servidor de banco de dados está encapsulada nesta declaração de serviço enganosamente curta:
sk: Dobrým príkladom by mohol byť databázový server PostgreSQL. Väčšina zložitosti nastavenia takéhoto databázového servera je zhrnutá do nezvyčajne krátkeho zadania príslušnej služby:

source: A complete operating system declaration for use with a Guix System container would look something like this:
es: Una declaración de sistema operativo completa para su uso con un contenedor Guix System tendría este aspecto:
it: Una dichiarazione completa del sistema operativo da utilizzare con un contenitore del sistema Guix sarebbe simile a questa:
pt_br: Uma declaração completa do sistema operacional para uso com um contêiner do sistema Guix seria algo como isto:
sk: Úplné zadanie operačného systému pre použitie s kontajnerom systému Guix by vyzeralo asi takto:

source: (operating-system (host-name "container") (timezone "Europe/Berlin") (file-systems (cons (file-system (device (file-system-label "does-not-matter")) (mount-point "/") (type "ext4")) %base-file-systems)) (bootloader (bootloader-configuration (bootloader grub-bootloader) (targets '("/dev/sdX")))) (services (cons* (service postgresql-service-type (postgresql-configuration (postgresql postgresql-14) (config-file (postgresql-config-file (log-destination "stderr") (hba-file (plain-file "pg_hba.conf" "\ local all all trust host all all 10.0.0.1/32 trust")) (extra-config '(("listen_addresses" "*") ("log_directory" "/var/log/postgresql"))))))) (service postgresql-role-service-type (postgresql-role-configuration (roles (list (postgresql-role (name "test") (create-database? #t)))))) %base-services)))
it: (operating-system (host-name "container") (timezone "Europe/Berlin") (file-systems (cons (file-system (device (file-system-label "non-importa")) (mount-point "/") (type "ext4")) %base-file-systems)) (bootloader (bootloader-configuration (bootloader grub-bootloader) (targets '("/dev/sdX")))) (services (cons* (service postgresql-service-type (postgresql-configuration (postgresql postgresql-14) (config-file (postgresql-config-file (log-destination "stderr") (hba-file (plain-file "pg_hba.conf" "\ local all all trust host all all 10.0.0.1/32 trust")) (extra-config '(("listen_addresses" "*") ("log_directory" "/var/log/postgresql"))))))) (service postgresql-role-service-type (postgresql-role-configuration (roles (list (postgresql-role (name "test") (create-database? #t)))))) %base-services)))
sk: (operating-system (host-name "container") (timezone "Europe/Bratislava") (file-systems (cons (file-system (device (file-system-label "co-ma-po-tom")) (mount-point "/") (type "ext4")) %base-file-systems)) (bootloader (bootloader-configuration (bootloader grub-bootloader) (targets '("/dev/sdX")))) (services (cons* (service postgresql-service-type (postgresql-configuration (postgresql postgresql-14) (config-file (postgresql-config-file (log-destination "stderr") (hba-file (plain-file "pg_hba.conf" "\ local all all trust host all all 10.0.0.1/32 trust")) (extra-config '(("listen_addresses" "*") ("log_directory" "/var/log/postgresql"))))))) (service postgresql-role-service-type (postgresql-role-configuration (roles (list (postgresql-role (name "skuska") (create-database? #t)))))) %base-services)))

source: With @code{postgresql-role-service-type} we define a role ``test'' and create a matching database, so that we can test right away without any further manual setup. The @code{postgresql-config-file} settings allow a client from IP address 10.0.0.1 to connect without requiring authentication---a bad idea in production systems, but convenient for this example.
es: Con @code{postgresql-role-service-type} definimos un rol ``prueba'' y creamos una base de datos coincidente, para que podamos probar de inmediato sin ninguna configuración manual adicional. La configuración de @code{postgresql-config-file} permite que un cliente de la dirección IP 10.0.0.1 se conecte sin requerir autenticación--una mala idea en sistemas de producción, pero conveniente para este ejemplo.
it: Con @code{postgresql-role-service-type} definiamo un ruolo ``test'' e creiamo un database corrispondente, in modo da poter testare subito senza alcuna ulteriore configurazione manuale. Le impostazioni di @code{postgresql-config-file} permettono a un client dall'indirizzo IP 10.0.0.1 di connettersi senza richiedere autenticazione---una cattiva idea nei sistemi di produzione, ma comoda per questo esempio.
pt_br: Com @code{postgresql-role-service-type} definimos uma função ``test'' e criamos um banco de dados correspondente, para que possamos testar imediatamente sem nenhuma configuração manual adicional. As configurações do @code{postgresql-config-file} permitem que um cliente do endereço IP 10.0.0.1 se conecte sem exigir autenticação --- uma má ideia em sistemas de produção, mas conveniente para este exemplo.
sk: Pomocou @code{postgresql-role-service-type} zadáme úlohu „skuska“ a vytvoríme príslušnú databázu tak, aby sme všetko mohli priamo vyskúšať bez ďalšieho ručného zasahovania. Nastavenia v @code{postgresql-config-file} umožňujú klientom pripájať sa z IP adresy 10.0.0.1 bez overenia --- zlý nápad pre systémy vo výrobnom nasadení ale vhodný pre tento príklad.

source: Let's build a script that will launch an instance of this Guix System as a container. Write the @code{operating-system} declaration above to a file @file{os.scm} and then use @command{guix system container} to build the launcher. (@pxref{Invoking guix system,,, guix, GNU Guix Reference Manual}).
es: Vamos a construir un script que lanzará una instancia de este Sistema Guix como contenedor. Escribe la declaración @code{operating-system} de arriba en un archivo @file{os.scm} y luego usa @command{guix system container} para construir el lanzador. (@pxref{Invocar sistema guix,,, guix, Manual de Referencia de GNU Guix}).
it: Costruiamo uno script che avvierà un'istanza di questo sistema Guix come contenitore. Scrivi la dichiarazione @code{operating-system} sopra in un file @file{os.scm} e poi usa @command{guix system container} per costruire il launcher. (@pxref{Invocare guix system,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: Vamos construir um script que irá iniciar uma instância deste Guix System como um contêiner. Escreva a declaração @code{operating-system} acima em um arquivo @file{os.scm} e então use @command{guix system container} para construir o inicializador. (@pxref{Invocando guix system,,, guix.pt_BR, Manual de Referência do GNU Guix}).
sk: Zostavme skript, ktorý spustí inštanciu systému Guix v podobe kontajnera. Uložte horeuvedené zadanie pre @code{operating-system} do súboru @file{os.scm} a potom použite @command{guix system container} pre zostavenie spúšťača. (@pxref{Invoking guix system,,, guix, GNU Guix Reference Manual}).

source: $ guix system container os.scm The following derivations will be built: /gnu/store/@dots{}-run-container.drv @dots{} building /gnu/store/@dots{}-run-container.drv... /gnu/store/@dots{}-run-container
es: $ guix system container os.scm Se construirán las siguientes derivaciones: /gnu/store/@dots{}-run-container.drv @dots{} compilando /gnu/store/@dots{}-run-container.drv... /gnu/store/@dots{}-run-container
it: $ guix system container os.scm Verranno costruite le seguenti derivazioni: /gnu/store/@dots{}-run-container.drv @dots{} costruzione di /gnu/store/@dots{}-run-container.drv... /gnu/store/@dots{}-run-container
pt_br: $ guix system container os.scm As seguintes derivações serão compiladas:: /gnu/store/@dots{}-run-container.drv @dots{} compilando /gnu/store/@dots{}-run-container.drv... /gnu/store/@dots{}-run-container
sk: $ guix system container os.scm Zostavia sa nasledovné odvodeniny: /gnu/store/@dots{}-run-container.drv @dots{} building /gnu/store/@dots{}-run-container.drv... /gnu/store/@dots{}-run-container

source: Now that we have a launcher script we can run it to spawn the new system with a running PostgreSQL service. Note that due to some as yet unresolved limitations we need to run the launcher as the root user, for example with @command{sudo}.
es: Ahora que tenemos un script lanzador podemos ejecutarlo para generar el nuevo sistema con un servicio PostgreSQL en ejecución. Tenga en cuenta que debido a algunas limitaciones aún no resueltas tenemos que ejecutar el lanzador como usuario root, por ejemplo con @command{sudo}.
it: Ora che abbiamo uno script di avvio, possiamo eseguirlo per avviare il nuovo sistema con un servizio PostgreSQL in esecuzione. Si noti che a causa di alcune limitazioni non ancora risolte, dobbiamo eseguire il launcher come utente root, ad esempio con @command{sudo}.
pt_br: Agora que temos um script de launcher, podemos executá-lo para gerar o novo sistema com um serviço PostgreSQL em execução. Observe que, devido a algumas limitações ainda não resolvidas, precisamos executar o launcher como usuário root, por exemplo, com @command{sudo}.
sk: Teraz, keď už máme skript spúšťača, môžeme ho použiť pre spustenie nového systému s bežiacou PostgreSQL službou. Vedzte, že kvôli doposiaľ neodstráneným obmedzeniam, musíme spúšťač spustiť ako root, napr. pomocou @command{sudo}.

source: $ sudo /gnu/store/@dots{}-run-container system container is running as PID 5983 @dots{}
es: $ sudo /gnu/store/@dots{}-run-container se ejecuta como PID 5983 @dots{}
it: $ sudo /gnu/store/@dots{}-run-container il contenitore di sistema è in esecuzione come PID 5983 @dots{}
pt_br: $ sudo /gnu/store/@dots{}-run-container O contêiner de sistema está rodando como PID 5983 @dots{}
sk: $ sudo /gnu/store/@dots{}-run-container systémový kontajner beží pod PID 5983 @dots{}

source: Background the process with @key{Ctrl-z} followed by @command{bg}. Note the process ID in the output; we will need it to connect to the container later. You know what? Let's try attaching to the container right now. We will use @command{nsenter}, a tool provided by the @code{util-linux} package:
es: Ponga el proceso en segundo plano con @key{Ctrl-z} seguido de @command{bg}. Observa el ID del proceso en la salida; lo necesitaremos para conectarnos al contenedor más tarde. ¿Sabes qué? Vamos a intentar conectarnos al contenedor ahora mismo. Utilizaremos @command{nsenter}, una herramienta proporcionada por el paquete @code{util-linux}:
it: Metti in background il processo con @key{Ctrl-z} seguito da @command{bg}. Nota il ID del processo nell'output; ci servirà per connetterci al contenitore più tardi. Sai cosa? Proviamo a connetterci al contenitore subito. Useremo @command{nsenter}, uno strumento fornito dal pacchetto @code{util-linux}:
pt_br: Coloque o processo em segundo plano com @key{Ctrl-z} seguido por @command{bg}. Observe o ID do processo na saída; precisaremos dele para conectar ao contêiner mais tarde. Quer saber? Vamos tentar anexar ao contêiner agora mesmo. Usaremos @command{nsenter}, uma ferramenta fornecida pelo pacote @code{util-linux}:
sk: Presuňte proces do pozadia pomocou @key{Ctrl-z} nasledovaným @command{bg}. Zaznamenajte si označenie procesu na výstupe; neskôr ho budeme potrebovať pre pripojenie ku kontajneru. Viete čo? Skúsme sa pripojiť ku kontajneru už teraz. Použijeme @command{nsenter}, nástroj poskytovaný balíkom @code{util-linux}:

source: The PostgreSQL service is running in the container!
es: El servicio PostgreSQL se está ejecutando en el contenedor.
it: Il servizio PostgreSQL è in esecuzione nel contenitore!
pt_br: O serviço PostgreSQL está sendo executado no contêiner!
sk: Služba PostgreSQL beží v kontajneri!

source: container networking
es: red de contenedor
it: networking del contenitore
pt_br: rede do contêiner
sk: nastavenie siete v kontajneri

source: What good is a Guix System running a PostgreSQL database service as a container when we can only talk to it with processes originating in the container? It would be much better if we could talk to the database over the network.
es: ¿De qué sirve un Sistema Guix ejecutando un servicio de base de datos PostgreSQL como contenedor cuando sólo podemos hablar con él con procesos originados en el contenedor? Sería mucho mejor si pudiéramos hablar con la base de datos a través de la red.
it: A che serve un sistema Guix che esegue un servizio di database PostgreSQL come contenitore quando possiamo comunicare con esso solo con processi originari del contenitore? Sarebbe molto meglio se potessimo comunicare con il database tramite la rete.
pt_br: De que adianta um Sistema Guix rodando um serviço de banco de dados PostgreSQL como um contêiner quando só podemos falar com ele com processos originados no contêiner? Seria muito melhor se pudéssemos falar com o banco de dados pela rede.
sk: Na čo nám je systém Guix, na ktorom v kontajneri beží databázová služba PostgreSQL, ku ktorej môžeme pristupovať len prostredníctvom procesov spustených v kontajneri? Bolo by oveľa lepšie, keby sme k databáze mohli pristupovať cez sieť.

source: The easiest way to do this is to create a pair of connected virtual Ethernet devices (known as @code{veth}). We move one of the devices (@code{ceth-test}) into the @code{net} namespace of the container and leave the other end (@code{veth-test}) of the connection on the host system.
es: La forma más sencilla de hacerlo es crear un par de dispositivos Ethernet virtuales conectados (conocidos como @code{veth}). Movemos uno de los dispositivos (@code{ceth-test}) al espacio de nombres @code{net} del contenedor y dejamos el otro extremo (@code{veth-test}) de la conexión en el sistema anfitrión.
it: Il modo più semplice per farlo è creare una coppia di dispositivi Ethernet virtuali connessi (noti come @code{veth}). Spostiamo uno dei dispositivi (@code{ceth-test}) nel namespace @code{net} del contenitore e lasciamo l'altra estremità (@code{veth-test}) della connessione sul sistema host.
pt_br: A maneira mais fácil de fazer isso é criar um par de dispositivos Ethernet virtuais conectados (conhecidos como @code{veth}). Movemos um dos dispositivos (@code{ceth-test}) para o namespace @code{net} do contêiner e deixamos a outra extremidade (@code{veth-test}) da conexão no sistema host.
sk: Najjednoduchším spôsobom ako to dosiahnuť, je vytvoriť pár spojených virtuálnych Ethernet zariadení (známych ako @code{veth}). Jedno zo zariadení (@code{ceth-skuska}) presunieme do oblasti názvov @code{net} nášho kontajnera a to druhý koniec (@code{veth-skuska}) pripojenia ponecháme na hostiteľskom systéme.
