Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: If you're a committer and you want to add a usertag, just start using it with the @code{guix} user. If the usertag proves useful to you, consider updating this section of the manual so that others will know what your usertag means.
it: Se sei un committer e vuoi aggiungere un usertag, inizia semplicemente a usarlo con l'utente @code{guix}. Se l'usertag si rivela utile, considera di aggiornare questa sezione del manuale in modo che altri sappiano cosa significa il tuo usertag.
pt_br: Se você for um committer e quiser adicionar uma usertag, basta começar a usá-la com o usuário @code{guix}. Se a usertag for útil para você, considere atualizar esta seção do manual para que outros saibam o que sua usertag significa.

source: build event notifications, RSS feed
it: notifiche di eventi di build, feed RSS
pt_br: criar notificações de eventos, feed RSS

source: notifications, build events
it: notifiche, eventi di build
pt_br: notificações, eventos de compilação

source: Cuirass includes @acronym{RSS, Really Simple Syndication} feeds as one of its features (@pxref{Notifications,,,cuirass}). Since @url{https://ci.guix.gnu.org/, Berlin} runs an instance of Cuirass, this feature can be used to keep track of recently broken or fixed packages caused by changes pushed to the Guix git repository. Any RSS client can be used. A good one, included with Emacs, is @xref{Gnus,,,gnus}. To register the feed, copy its URL, then from the main Gnus buffer, @samp{*Group*}, do the following:
it: Cuirass include feed @acronym{RSS, Really Simple Syndication} come una delle sue funzionalità (@pxref{Notifications,,,cuirass}). Poiché @url{https://ci.guix.gnu.org/, Berlin} esegue un'istanza di Cuirass, questa funzionalità può essere usata per tenere traccia dei pacchetti recentemente rotti o riparati causati da modifiche inviate al repository git di Guix. Qualsiasi client RSS può essere usato. Uno buono, incluso in Emacs, è @xref{Gnus,,,gnus}. Per registrare il feed, copia il suo URL, quindi dal buffer principale di Gnus, @samp{*Group*}, fai quanto segue:
pt_br: O Cuirass inclui feeds @acronym{RSS, Really Simple Syndication} como um de seus recursos (@pxref{Notifications,,,cuirass}). Como @url{https://ci.guix.gnu.org/, Berlin} executa uma instância do Cuirass, esse recurso pode ser usado para manter o controle de pacotes recentemente quebrados ou corrigidos causados por alterações enviadas ao repositório git do Guix. Qualquer cliente RSS pode ser usado. Um bom, incluído no Emacs, é @xref{Gnus,,,gnus}. Para registrar o feed, copie sua URL e, a partir do buffer principal do Gnus, @samp{*Group*}, faça o seguinte:

source: Gnus, configuration to read CI RSS feeds
it: Gnus, configurazione per leggere i feed RSS CI
pt_br: Gnus, configuração para ler feeds RSS do CI

source: RSS feeds, Gnus configuration
pt_br: feed RSS, configuração do Gnus

source: Then, back at the @samp{*Group*} buffer, press @kbd{s} to save the newly added RSS group. As for any other Gnus group, you can update its content by pressing the @kbd{g} key. You should now receive notifications that read like:
it: Quindi, tornando al buffer @samp{*Group*}, premi @kbd{s} per salvare il gruppo RSS appena aggiunto. Come per qualsiasi altro gruppo Gnus, puoi aggiornare il suo contenuto premendo il tasto @kbd{g}. Dovresti ora ricevere notifiche che recitano così:
pt_br: Então, de volta ao buffer @samp{*Group*}, pressione @kbd{s} para salvar o grupo RSS recém-adicionado. Assim como para qualquer outro grupo Gnus, você pode atualizar seu conteúdo pressionando a tecla @kbd{g}. Agora você deve receber notificações que dizem algo como:

source: where each RSS entry contains a link to the Cuirass build details page of the associated build.
it: dove ogni voce RSS contiene un collegamento alla pagina dei dettagli della build di Cuirass per la build associata.
pt_br: onde cada entrada RSS contém um link para a página de detalhes da compilação do Cuirass associada.

source: To organize work on Guix, including but not just development efforts, the project has a set of @dfn{teams}. Each team has its own focus and interests and is the primary contact point for questions and contributions in those areas. A team's primary mission is to coordinate and review the work of individuals in its scope (@pxref{Reviewing the Work of Others}); it can make decisions within its scope, in agreement with other teams whenever there is overlap or a close connection, and in accordance with other project rules such as seeking consensus (@pxref{Making Decisions}).
it: Per organizzare il lavoro su Guix, inclusi ma non solo gli sforzi di sviluppo, il progetto ha un insieme di @dfn{team}. Ogni team ha il proprio focus e interessi ed è il punto di contatto principale per domande e contributi in quelle aree. La missione principale di un team è coordinare e revisionare il lavoro degli individui nel suo ambito (@pxref{Reviewing the Work of Others}); può prendere decisioni nel suo ambito, in accordo con altri team ogni volta che c'è sovrapposizione o una stretta connessione, e in conformità con altre regole del progetto come la ricerca del consenso (@pxref{Making Decisions}).
pt_br: Para organizar o trabalho no Guix, incluindo, mas não apenas, os esforços de desenvolvimento, o projeto tem um conjunto de @dfn{equipes}. Cada equipe tem seu próprio foco e interesses e é o principal ponto de contato para perguntas e contribuições nessas áreas. A principal missão de uma equipe é coordenar e revisar o trabalho de indivíduos em seu escopo (@pxref{Reviewing the Work of Others}); ela pode tomar decisões dentro de seu escopo, em acordo com outras equipes sempre que houver sobreposição ou uma conexão próxima, e de acordo com outras regras do projeto, como buscar consenso (@pxref{Making Decisions}).

source: As an example, the Python team is responsible for core Python packaging matters; it can decide to upgrade core Python packages in a dedicated @code{python-team} branch, in collaboration with any team whose scope is directly dependent on Python---e.g., the Science team---and following branching rules (@pxref{Managing Patches and Branches}). The Documentation team helps review changes to the documentation and can initiate overarching documentation changes. The Translations team organizes translation of Guix and its manual and coordinates efforts in that area. The Core team is responsible for the development of core functionality and interfaces of Guix; because of its central nature, some of its work may require soliciting input from the community at large and seeking consensus before enacting decisions that would affect the entire community.
it: Ad esempio, il team Python è responsabile delle questioni fondamentali di packaging Python; può decidere di aggiornare i pacchetti Python di base in un ramo dedicato @code{python-team}, in collaborazione con qualsiasi team il cui ambito dipende direttamente da Python---ad esempio, il team Scientifico---e seguendo le regole di branching (@pxref{Managing Patches and Branches}). Il team Documentazione aiuta a revisionare le modifiche alla documentazione e può avviare modifiche documentali generali. Il team Traduzioni organizza la traduzione di Guix e del suo manuale e coordina gli sforzi in quell'area. Il team Core è responsabile dello sviluppo delle funzionalità fondamentali e delle interfacce di Guix; a causa della sua natura centrale, parte del suo lavoro potrebbe richiedere la richiesta di input dalla comunità in generale e la ricerca del consenso prima di emanare decisioni che influenzerebbero l'intera comunità.
pt_br: Como exemplo, a equipe Python é responsável por questões de empacotamento do núcleo Python; ela pode decidir atualizar os pacotes principais do Python em uma ramificação dedicada @code{python-team}, em colaboração com qualquer equipe cujo escopo seja diretamente dependente do Python --- por exemplo, a equipe Science --- e seguindo regras de ramificação (@pxref{Managing Patches and Branches}). A equipe Documentation ajuda a revisar as alterações na documentação e pode iniciar alterações abrangentes na documentação. A equipe Translations organiza a tradução do Guix e seu manual e coordena os esforços nessa área. A equipe Core é responsável pelo desenvolvimento da funcionalidade principal e das interfaces do Guix; devido à sua natureza central, parte de seu trabalho pode exigir a solicitação de contribuições da comunidade em geral e a busca de consenso antes de promulgar decisões que afetariam toda a comunidade.

source: Teams are defined in the @file{etc/teams.scm} file in the Guix repository. The scope of each team is defined, when applicable, as a set of files or as a regular expression matching file names.
it: I team sono definiti nel file @file{etc/teams.scm} nel repository di Guix. L'ambito di ogni team è definito, quando applicabile, come un insieme di file o come un'espressione regolare che corrisponde ai nomi dei file.
pt_br: As equipes são definidas no arquivo @file{etc/teams.scm} no repositório Guix. O escopo de cada equipe é definido, quando aplicável, como um conjunto de arquivos ou como uma expressão regular que corresponde a nomes de arquivos.

source: team membership
it: appartenenza al team
pt_br: membros da equipe

source: Anyone with interest in a team's domain and willing to contribute to its work can apply to become a member by contacting current members by email; commit access is not a precondition. Membership is formalized by adding the person's name and email address to @file{etc/teams.scm}. Members who have not been participating in the team's work for one year or more may be removed; they are free to reapply for membership later.
it: Chiunque sia interessato al dominio di un team e disposto a contribuire al suo lavoro può candidarsi per diventare membro contattando i membri attuali via email; l'accesso in commit non è un prerequisito. L'appartenenza è formalizzata aggiungendo il nome e l'indirizzo email della persona a @file{etc/teams.scm}. I membri che non hanno partecipato al lavoro del team per un anno o più possono essere rimossi; sono liberi di ricandidarsi per l'appartenenza in seguito.
pt_br: Qualquer pessoa interessada no domínio de uma equipe e disposta a contribuir com seu trabalho pode se candidatar para se tornar um membro entrando em contato com os membros atuais por e-mail; acesso de commit não é uma pré-condição. A filiação é formalizada adicionando o nome e endereço de e-mail da pessoa em @file{etc/teams.scm}. Membros que não participam do trabalho da equipe por um ano ou mais podem ser removidos; eles são livres para se candidatar novamente para filiação mais tarde.

source: team creation
pt_br: criação de equipes

source: One or more people may propose the creation of a new team by reaching out to the community by email at @email{guix-devel@@gnu.org}, clarifying the intended scope and purpose. When consensus is reached on the creation of this team, someone with commit access formalizes its creation by adding it and its initial members to @file{etc/teams.scm}.
it: Una o più persone possono proporre la creazione di un nuovo team contattando la comunità via email a @email{guix-devel@@gnu.org}, chiarendo l'ambito e lo scopo previsti. Quando si raggiunge il consenso sulla creazione di questo team, qualcuno con accesso in commit formalizza la sua creazione aggiungendo esso e i suoi membri iniziali a @file{etc/teams.scm}.
pt_br: Uma ou mais pessoas podem propor a criação de uma nova equipe entrando em contato com a comunidade por e-mail em @email{guix-devel@@gnu.org}, esclarecendo o escopo e o propósito pretendidos. Quando o consenso é alcançado sobre a criação desta equipe, alguém com acesso de commit formaliza sua criação adicionando-a e seus membros iniciais a @file{etc/teams.scm}.

source: To list existing teams, run the following command from a Guix checkout:
it: Per elencare i team esistenti, esegui il seguente comando da un checkout di Guix:
pt_br: Para listar as equipes existentes, execute o seguinte comando em um checkout do Guix:

source: mentoring
pt_br: mentoria

source: You can run the following command to have the Mentors team put in CC of a patch series:
it: Puoi eseguire il seguente comando per includere il team Mentori in CC di una serie di patch:
pt_br: Você pode executar o seguinte comando para que a equipe Mentors coloque em CC uma série de patches:

source: $ git send-email --to=@var{ISSUE_NUMBER}@@debbugs.gnu.org \ --header-cmd='etc/teams.scm cc-mentors-header-cmd' *.patch
pt_br: $ git send-email --to=@var{NÚMERO_DE_ISSÃO}@@debbugs.gnu.org \ --header-cmd='etc/teams.scm cc-mentors-header-cmd' *.patch

source: The appropriate team or teams can also be inferred from the modified files. For instance, if you want to send the two latest commits of the current Git repository to review, you can run:
it: Il team o i team appropriati possono anche essere dedotti dai file modificati. Ad esempio, se vuoi inviare gli ultimi due commit del repository Git corrente per la revisione, puoi eseguire:
pt_br: A equipe ou equipes apropriadas também podem ser inferidas a partir dos arquivos modificados. Por exemplo, se você quiser enviar os dois últimos commits do repositório Git atual para revisão, você pode executar:

source: $ guix shell -D guix [env]$ git send-email --to=@var{ISSUE_NUMBER}@@debbugs.gnu.org -2
pt_br: $ guix shell -D guix [env]$ git send-email --to=@var{NÚMERO_DE_ISSÃO}@@debbugs.gnu.org -2

source: teams, on Codeberg
it: team, su Codeberg
pt_br: equipes, no Codeberg

source: To generate a @file{CODEOWNERS} file, which Forgejo---the software behind Codeberg---uses to determine which team or person should review changes to a given set of files, run:
it: Per generare un file @file{CODEOWNERS}, che Forgejo - il software dietro Codeberg - utilizza per determinare quale team o persona dovrebbe revisionare le modifiche a un determinato insieme di file, esegui:
pt_br: Para gerar o arquivo @file{CODEOWNERS}, que o Forgejo---o software por trás do Codeberg---usa para determinar qual time ou pessoa deve revisar mudanças feitas a um dado conjunto de arquivos, rode:

source: decision making
it: presa di decisioni
pt_br: tomando uma decisão

source: consensus seeking
it: ricerca del consenso
pt_br: busca de consenso

source: It is expected from all contributors, and even more so from committers, to help build consensus and make decisions based on consensus. By using consensus, we are committed to finding solutions that everyone can live with. It implies that no decision is made against significant concerns and these concerns are actively resolved with proposals that work for everyone.
it: È previsto da tutti i contributori, e ancor più dai committer, aiutare a costruire il consenso e prendere decisioni basate sul consenso. Usando il consenso, ci impegniamo a trovare soluzioni con cui tutti possano convivere. Ciò implica che nessuna decisione è presa contro preoccupazioni significative e queste preoccupazioni sono attivamente risolte con proposte che funzionano per tutti.
pt_br: Espera-se de todos os contribuidores, e ainda mais dos committers, que ajudem a construir consenso e tomar decisões com base no consenso. Ao usar o consenso, estamos comprometidos em encontrar soluções com as quais todos possam conviver. Isso implica que nenhuma decisão é tomada contra preocupações significativas e essas preocupações são ativamente resolvidas com propostas que funcionam para todos.

source: A contributor (who may or may not have commit access) wishing to block a proposal bears a special responsibility for finding alternatives, proposing ideas/code or explain the rationale for the status quo to resolve the deadlock. To learn what consensus decision making means and understand its finer details, you are encouraged to read @url{https://www.seedsforchange.org.uk/consensus}.
it: Un contributore (che potrebbe o meno avere accesso in commit) che desidera bloccare una proposta ha una responsabilità speciale nel trovare alternative, proporre idee/codice o spiegare la logica dello status quo per risolvere l'impasse. Per imparare cosa significa la presa di decisioni per consenso e capirne i dettagli più fini, ti incoraggiamo a leggere @url{https://www.seedsforchange.org.uk/consensus}.
pt_br: Um colaborador (que pode ou não ter acesso de commit) que deseja bloquear uma proposta tem uma responsabilidade especial de encontrar alternativas, propor ideias/código ou explicar a lógica do status quo para resolver o impasse. Para aprender o que significa tomada de decisão por consenso e entender seus detalhes mais sutis, você é encorajado a ler @url{https://www.seedsforchange.org.uk/consensus}.

source: commit access, for developers
it: accesso in commit, per sviluppatori
pt_br: acesso de confirmação, para desenvolvedores

source: Everyone can contribute to Guix without having commit access (@pxref{Submitting Patches}). However, for frequent contributors, having write access to the repository can be convenient. As a rule of thumb, a contributor should have accumulated fifty (50) reviewed commits to be considered as a committer and have sustained their activity in the project for at least 6 months. This ensures enough interactions with the contributor, which is essential for mentoring and assessing whether they are ready to become a committer. Commit access should not be thought of as a ``badge of honor'' but rather as a responsibility a contributor is willing to take to help the project.
it: Chiunque può contribuire a Guix senza avere accesso in commit (@pxref{Submitting Patches}). Tuttavia, per i contributori frequenti, avere accesso in scrittura al repository può essere conveniente. Come regola generale, un contributore dovrebbe aver accumulato cinquanta (50) commit revisionati per essere considerato un committer e aver mantenuto la sua attività nel progetto per almeno 6 mesi. Ciò garantisce abbastanza interazioni con il contributore, che è essenziale per il mentoring e la valutazione se è pronto a diventare un committer. L'accesso in commit non dovrebbe essere pensato come un ``distintivo d'onore'' ma piuttosto come una responsabilità che un contributore è disposto ad assumersi per aiutare il progetto.
pt_br: Todos podem contribuir para o Guix sem ter acesso de commit (@pxref{Submitting Patches}). No entanto, para contribuidores frequentes, ter acesso de gravação ao repositório pode ser conveniente. Como regra geral, um contribuidor deve ter acumulado cinquenta (50) commits revisados para ser considerado um committer e ter mantido sua atividade no projeto por pelo menos 6 meses. Isso garante interações suficientes com o contribuidor, o que é essencial para a orientação e avaliação se ele está pronto para se tornar um committer. O acesso de commit não deve ser pensado como um ``emblema de honra'', mas sim como uma responsabilidade que um contribuidor está disposto a assumir para ajudar o projeto.

source: Committers are in a position where they enact technical decisions. Such decisions must be made by @emph{actively building consensus} among interested parties and stakeholders. @xref{Making Decisions}, for more on that.
it: I committer sono in una posizione in cui emanano decisioni tecniche. Tali decisioni devono essere prese @emph{costruendo attivamente il consenso} tra le parti interessate e gli stakeholder. @xref{Making Decisions}, per maggiori informazioni su questo.
pt_br: Os committers estão em uma posição onde eles promulgam decisões técnicas. Tais decisões devem ser tomadas por @emph{construindo ativamente o consenso} entre as partes interessadas e stakeholders. @xref{Making Decisions}, para mais sobre isso.

source: The following sections explain how to get commit access, how to be ready to push commits, and the policies and community expectations for commits pushed upstream.
it: Le sezioni seguenti spiegano come ottenere l'accesso in commit, come essere pronti a inviare commit e le politiche e le aspettative della comunità per i commit inviati upstream.
pt_br: As seções a seguir explicam como obter acesso de commit, como estar pronto para enviar commits e as políticas e expectativas da comunidade para commits enviados upstream.

source: Applying for Commit Access
it: Richiesta di Accesso in Commit
pt_br: Solicitando acesso de confirmação

source: When you deem it necessary, consider applying for commit access by following these steps:
it: Quando lo ritieni necessario, considera di richiedere l'accesso in commit seguendo questi passaggi:
pt_br: Quando você julgar necessário, considere solicitar acesso de confirmação seguindo estas etapas:

source: Find three committers who would vouch for you. Each of them should email a statement to @email{guix-maintainers@@gnu.org} (a private alias for the collective of maintainers), signed with their OpenPGP key.
it: Trova tre committer che possano garantire per te. Ciascuno di loro dovrebbe inviare una dichiarazione a @email{guix-maintainers@@gnu.org} (un alias privato per il collettivo dei maintainer), firmata con la loro chiave OpenPGP.
pt_br: Encontre três committers que atestariam por você. Cada um deles deve enviar uma declaração por e-mail para @email{guix-maintainers@@gnu.org} (um alias privado para o coletivo de mantenedores), assinado com sua chave OpenPGP.

source: Committers are expected to have had some interactions with you as a contributor and to be able to judge whether you are sufficiently familiar with the project's practices. It is @emph{not} a judgment on the value of your work, so a refusal should rather be interpreted as ``let's try again later''.
it: Si prevede che i committer abbiano avuto alcune interazioni con te come contributore e siano in grado di giudicare se sei sufficientemente familiare con le pratiche del progetto. Non è un giudizio sul valore del tuo lavoro, quindi un rifiuto dovrebbe piuttosto essere interpretato come ``riproviamo più tardi''.
pt_br: Espera-se que os committers tenham tido algumas interações com você como colaborador e sejam capazes de julgar se você está suficientemente familiarizado com as práticas do projeto. Não é um julgamento sobre o valor do seu trabalho, então uma recusa deve ser interpretada como "vamos tentar novamente mais tarde''.

source: Send @email{guix-maintainers@@gnu.org} a message stating your intent, listing the three committers who support your application, signed with the OpenPGP key you will use to sign commits, and giving its fingerprint (see below). See @uref{https://emailselfdefense.fsf.org/en/}, for an introduction to public-key cryptography with GnuPG.
it: Invia a @email{guix-maintainers@@gnu.org} un messaggio che dichiara la tua intenzione, elencando i tre committer che supportano la tua candidatura, firmato con la chiave OpenPGP che userai per firmare i commit e fornendo la sua impronta digitale (vedi sotto). Vedi @uref{https://emailselfdefense.fsf.org/en/}, per un'introduzione alla crittografia a chiave pubblica con GnuPG.
pt_br: Envie para @email{guix-maintainers@@gnu.org} uma mensagem informando sua intenção, listando os três committers que dão suporte ao seu aplicativo, assinados com a chave OpenPGP que você usará para assinar commits e fornecendo sua impressão digital (veja abaixo). Veja @uref{https://emailselfdefense.fsf.org/en/}, para uma introdução à criptografia de chave pública com GnuPG.
