Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: These bootstrap binaries are ``taken for granted'', though we can also re-create them if needed (@pxref{Preparing to Use the Bootstrap Binaries}).
pt_br: Esses binários bootstrap são ``considerados garantidos'', embora também possamos recriá-los se necessário (@pxref{Preparing to Use the Bootstrap Binaries}).

source: The Full-Source Bootstrap
pt_br: O Bootstrap de código fonte completo

source: Guix---like other GNU/Linux distributions---is traditionally bootstrapped from a set of bootstrap binaries: Bourne shell, command-line tools provided by GNU Coreutils, Awk, Findutils, `sed', and `grep' and Guile, GCC, Binutils, and the GNU C Library (@pxref{Bootstrapping}). Usually, these bootstrap binaries are ``taken for granted.''
pt_br: Guix---como outras distribuições GNU/Linux---é tradicionalmente bootstrapado a partir de um conjunto de binários bootstrap: Bourne shell, ferramentas de linha de comando fornecidas pelo GNU Coreutils, Awk, Findutils, ``sed' e `grep' e Guile, GCC, Binutils e a GNU C Library (@pxref{Bootstrapping}). Normalmente, esses binários bootstrap são ``considerados garantidos.''

source: Taking the bootstrap binaries for granted means that we consider them to be a correct and trustworthy ``seed'' for building the complete system. Therein lies a problem: the combined size of these bootstrap binaries is about 250MB (@pxref{Bootstrappable Builds,,, mes, GNU Mes}). Auditing or even inspecting these is next to impossible.
pt_br: Tomar os binários bootstrap como garantidos significa que os consideramos uma ``semente'' correta e confiável para construir o sistema completo. Aí está um problema: o tamanho combinado desses binários bootstrap é de cerca de 250 MB (@pxref{Bootstrappable Builds,,, mes, GNU Mes}). Auditar ou mesmo inspecionar isso é quase impossível.

source: For @code{i686-linux} and @code{x86_64-linux}, Guix now features a @dfn{full-source bootstrap}. This bootstrap is rooted in @file{hex0-seed} from the @url{https://savannah.gnu.org/projects/stage0, Stage0} package. The hex0 program is minimalist assembler: it reads space-separated hexadecimal digits (nibbles) from a file, possibly including comments, and emits on standard output the bytes corresponding to those hexadecimal numbers. The source code of this initial hex0 program is a file called @url{https://github.com/oriansj/bootstrap-seeds/blob/master/POSIX/x86/hex0_x86.hex0,@file{hex0_x86.hex0}} and is written in the @code{hex0} language.
pt_br: Para @code{i686-linux} e @code{x86_64-linux}, o Guix agora apresenta um @dfn{full-source bootstrap}. Este bootstrap está enraizado em @file{hex0-seed} do pacote @url{https://savannah.gnu.org/projects/stage0, Stage0}. O programa hex0 é um assembler minimalista: ele lê dígitos hexadecimais separados por espaços (nibbles) de um arquivo, possivelmente incluindo comentários, e emite na saída padrão os bytes correspondentes a esses números hexadecimais. O código-fonte deste programa hex0 inicial é um arquivo chamado @url{https://github.com/oriansj/bootstrap-seeds/blob/master/POSIX/x86/hex0_x86.hex0,@file{hex0_x86.hex0}} e é escrito na linguagem @code{hex0}.

source: Hex0 is self-hosting, which means that it can build itself:
pt_br: O Hex0 é auto-hospedado, o que significa que ele pode se construir:

source: Hex0 it is the ASCII-equivalent of the binary program and can be produced by doing something much like:
pt_br: Hex0 é o equivalente ASCII do programa binário e pode ser produzido fazendo algo muito parecido com:

source: It is because of this ASCII-binary equivalence that we can bless this initial 357-byte binary as source, and hence `full-source bootstrap''.
pt_br: É por causa dessa equivalência ASCII-binário que podemos abençoar esse binário inicial de 357 bytes como fonte e, portanto, `bootstrap de fonte completa''.

source: The bootstrap then continues: @code{hex0} builds @code{hex1} and then on to @code{M0}, @code{hex2}, @code{M1}, @code{mescc-tools} and finally @code{M2-Planet}. Then, using @code{mescc-tools}, @code{M2-Planet} we build Mes (@pxref{Top, GNU Mes Reference Manual,, mes, GNU Mes}, a Scheme interpreter and C compiler in Scheme). From here on starts the more traditional @code{C}-based bootstrap of the GNU System.
pt_br: O bootstrap então continua: @code{hex0} constrói @code{hex1} e então para @code{M0}, @code{hex2}, @code{M1}, @code{mescc-tools} e finalmente @code{M2-Planet}. Então, usando @code{mescc-tools}, @code{M2-Planet} nós construímos Mes (@pxref{Top, GNU Mes Reference Manual,, mes, GNU Mes}, um interpretador Scheme e compilador C em Scheme). A partir daqui começa o bootstrap mais tradicional baseado em @code{C} do Sistema GNU.

source: Another step that Guix has taken is to replace the shell and all its utilities with implementations in Guile Scheme, the @emph{Scheme-only bootstrap}. Gash (@pxref{Gash,,, gash, The Gash manual}) is a POSIX-compatible shell that replaces Bash, and it comes with Gash Utils which has minimalist replacements for Awk, the GNU Core Utilities, Grep, Gzip, Sed, and Tar.
pt_br: Outro passo que o Guix tomou foi substituir o shell e todos os seus utilitários por implementações no Guile Scheme, o @emph{Scheme-only bootstrap}. O Gash (@pxref{Gash,,, gash, The Gash manual}) é um shell compatível com POSIX que substitui o Bash, e vem com o Gash Utils, que tem substituições minimalistas para o Awk, o GNU Core Utilities, Grep, Gzip, Sed e Tar.

source: Building the GNU System from source is currently only possible by adding some historical GNU packages as intermediate steps@footnote{Packages such as @code{gcc-2.95.3}, @code{binutils-2.14}, @code{glibc-2.2.5}, @code{gzip-1.2.4}, @code{tar-1.22}, and some others. For details, see @file{gnu/packages/commencement.scm}.}. As Gash and Gash Utils mature, and GNU packages become more bootstrappable again (e.g., new releases of GNU Sed will also ship as gzipped tarballs again, as alternative to the hard to bootstrap @code{xz}-compression), this set of added packages can hopefully be reduced again.
pt_br: Atualmente, construir o Sistema GNU a partir do código-fonte só é possível adicionando alguns pacotes históricos do GNU como etapas intermediárias@footnote{Pacotes como @code{gcc-2.95.3}, @code{binutils-2.14}, @code{glibc-2.2.5}, @code{gzip-1.2.4}, @code{tar-1.22} e alguns outros. Para detalhes, veja @file{gnu/packages/commencement.scm}.}. Conforme o Gash e o Gash Utils amadurecem, e os pacotes GNU se tornam mais inicializáveis novamente (por exemplo, novos lançamentos do GNU Sed também serão enviados como tarballs compactados novamente, como alternativa à compressão @code{xz} difícil de inicializar), esse conjunto de pacotes adicionados pode ser reduzido novamente.

source: The graph below shows the resulting dependency graph for @code{gcc-core-mesboot0}, the bootstrap compiler used for the traditional bootstrap of the rest of the Guix System.
pt_br: O grafo abaixo mostra o grafo de dependência resultante para @code{gcc-core-mesboot0}, o compilador bootstrap usado para o bootstrap tradicional do restante do Sistema Guix.

source: Work is ongoing to bring these bootstraps to the @code{arm-linux} and @code{aarch64-linux} architectures and to the Hurd.
pt_br: O trabalho está em andamento para levar esses bootstraps às arquiteturas @code{arm-linux} e @code{aarch64-linux} e ao Hurd.

source: If you are interested, join us on @samp{#bootstrappable} on the Libera.Chat IRC network or discuss on @email{bug-mes@@gnu.org} or @email{gash-devel@@nongnu.org}.
pt_br: Se você estiver interessado, junte-se a nós em @samp{#bootstrappable} na rede IRC Libera.Chat ou discuta em @email{bug-mes@@gnu.org} ou @email{gash-devel@@nongnu.org}.

source: @image{images/bootstrap-graph,6in,,Dependency graph of the early bootstrap derivations}
pt_br: @image{images/bootstrap-graph,6in,,Grafo de dependência das primeiras derivações do bootstrap}

source: The figure above shows the very beginning of the dependency graph of the distribution, corresponding to the package definitions of the @code{(gnu packages bootstrap)} module. A similar figure can be generated with @command{guix graph} (@pxref{Invoking guix graph}), along the lines of:
pt_br: A figura acima mostra o início do grafo de dependência da distribuição, correspondendo às definições de pacote do módulo @code{(gnu packages bootstrap)}. Uma figura similar pode ser gerada com @command{guix graph} (@pxref{Invoking guix graph}), ao longo das linhas de:

source: or, for the further Reduced Binary Seed bootstrap
pt_br: ou, para o bootstrap de semente binária reduzida

source: guix graph -t derivation \ -e '(@@@@ (gnu packages bootstrap) %bootstrap-mes)' \ | dot -Tps > mes.ps
pt_br: guix graph -t derivation \ -e '(@@@@ (pacotes gnu bootstrap) %bootstrap-mes)' \ | ponto -Tps > mes.ps

source: At this level of detail, things are slightly complex. First, Guile itself consists of an ELF executable, along with many source and compiled Scheme files that are dynamically loaded when it runs. This gets stored in the @file{guile-2.0.7.tar.xz} tarball shown in this graph. This tarball is part of Guix's ``source'' distribution, and gets inserted into the store with @code{add-to-store} (@pxref{The Store}).
pt_br: Neste nível de detalhe, as coisas são um pouco complexas. Primeiro, o próprio Guile consiste em um executável ELF, junto com muitas fontes e arquivos de Scheme compilados que são carregados dinamicamente quando ele é executado. Isso é armazenado no tarball @file{guile-2.0.7.tar.xz} mostrado neste grafo. Este tarball é parte da distribuição de ``fontes'' do Guix e é inserido no armazém com @code{add-to-store} (@pxref{The Store}).

source: But how do we write a derivation that unpacks this tarball and adds it to the store? To solve this problem, the @code{guile-bootstrap-2.0.drv} derivation---the first one that gets built---uses @code{bash} as its builder, which runs @code{build-bootstrap-guile.sh}, which in turn calls @code{tar} to unpack the tarball. Thus, @file{bash}, @file{tar}, @file{xz}, and @file{mkdir} are statically-linked binaries, also part of the Guix source distribution, whose sole purpose is to allow the Guile tarball to be unpacked.
pt_br: Mas como escrevemos uma derivação que descompacta esse tarball e o adiciona ao armazém? Para resolver esse problema, a derivação @code{guile-bootstrap-2.0.drv} --- a primeira que é construída --- usa @code{bash} como seu construtor, que executa @code{build-bootstrap-guile.sh}, que por sua vez chama @code{tar} para descompactar o tarball. Assim, @file{bash}, @file{tar}, @file{xz} e @file{mkdir} são binários estaticamente vinculados, também parte da distribuição de fontes do Guix, cujo único propósito é permitir que o tarball do Guile seja descompactado.

source: Once @code{guile-bootstrap-2.0.drv} is built, we have a functioning Guile that can be used to run subsequent build programs. Its first task is to download tarballs containing the other pre-built binaries---this is what the @file{.tar.xz.drv} derivations do. Guix modules such as @code{ftp-client.scm} are used for this purpose. The @code{module-import.drv} derivations import those modules in a directory in the store, using the original layout. The @code{module-import-compiled.drv} derivations compile those modules, and write them in an output directory with the right layout. This corresponds to the @code{#:modules} argument of @code{build-expression->derivation} (@pxref{Derivations}).
pt_br: Uma vez que @code{guile-bootstrap-2.0.drv} é construído, temos um Guile funcional que pode ser usado para executar programas de construção subsequentes. Sua primeira tarefa é baixar tarballs contendo os outros binários pré-construídos --- é isso que as derivações @file{.tar.xz.drv} fazem. Módulos Guix como @code{ftp-client.scm} são usados para esse propósito. As derivações @code{module-import.drv} importam esses módulos em um diretório no armazém, usando o layout original. As derivações @code{module-import-compiled.drv} compilam esses módulos e os escrevem em um diretório de saída com o layout correto. Isso corresponde ao argumento @code{#:modules} de @code{build-expression->derivation} (@pxref{Derivations}).

source: Finally, the various tarballs are unpacked by the derivations @code{gcc-bootstrap-0.drv}, @code{glibc-bootstrap-0.drv}, or @code{bootstrap-mes-0.drv} and @code{bootstrap-mescc-tools-0.drv}, at which point we have a working C tool chain.
pt_br: Por fim, os vários tarballs são descompactados pelas derivações @code{gcc-bootstrap-0.drv}, @code{glibc-bootstrap-0.drv} ou @code{bootstrap-mes-0.drv} e @code{bootstrap-mescc-tools-0.drv}, ponto em que temos uma cadeia de ferramentas C funcional.

source: Building the Build Tools
pt_br: Construindo as ferramentas de construção

source: Bootstrapping is complete when we have a full tool chain that does not depend on the pre-built bootstrap tools discussed above. This no-dependency requirement is verified by checking whether the files of the final tool chain contain references to the @file{/gnu/store} directories of the bootstrap inputs. The process that leads to this ``final'' tool chain is described by the package definitions found in the @code{(gnu packages commencement)} module.
pt_br: O bootstrapping está completo quando temos uma cadeia de ferramentas completa que não depende das ferramentas bootstrap pré-construídas discutidas acima. Esse requisito de não dependência é verificado verificando se os arquivos da cadeia de ferramentas final contêm referências aos diretórios @file{/gnu/store} das entradas bootstrap. O processo que leva a essa cadeia de ferramentas ``final'' é descrito pelas definições de pacote encontradas no módulo @code{(gnu packages commencement)}.

source: The @command{guix graph} command allows us to ``zoom out'' compared to the graph above, by looking at the level of package objects instead of individual derivations---remember that a package may translate to several derivations, typically one derivation to download its source, one to build the Guile modules it needs, and one to actually build the package from source. The command:
pt_br: O comando @command{guix graph} nos permite ``diminuir o zoom'' em comparação ao grafo acima, observando o nível de objetos do pacote em vez de derivações individuais --- lembre-se de que um pacote pode ser traduzido para várias derivações, normalmente uma derivação para baixar sua fonte, uma para construir os módulos Guile de que ele precisa e uma para realmente construir o pacote a partir da fonte. O comando:

source: displays the dependency graph leading to the ``final'' C library@footnote{You may notice the @code{glibc-intermediate} label, suggesting that it is not @emph{quite} final, but as a good approximation, we will consider it final.}, depicted below.
pt_br: exibe o grafo de dependência que leva à biblioteca C ``final''@footnote{Você pode notar o rótulo @code{glibc-intermediate}, sugerindo que ela não é @emph{completamente} final, mas como uma boa aproximação, a consideraremos final.}, descrita abaixo.

source: @image{images/bootstrap-packages,6in,,Dependency graph of the early packages}
pt_br: @image{images/bootstrap-packages,6in,,Grafo de dependência dos primeiros pacotes}

source: The first tool that gets built with the bootstrap binaries is GNU@tie{}Make---noted @code{make-boot0} above---which is a prerequisite for all the following packages. From there Findutils and Diffutils get built.
pt_br: A primeira ferramenta que é construída com os binários bootstrap é o GNU@tie{}Make---observado @code{make-boot0} acima---que é um pré-requisito para todos os pacotes seguintes. A partir daí, Findutils e Diffutils são construídos.

source: Then come the first-stage Binutils and GCC, built as pseudo cross tools---i.e., with @option{--target} equal to @option{--host}. They are used to build libc. Thanks to this cross-build trick, this libc is guaranteed not to hold any reference to the initial tool chain.
pt_br: Então vêm os Binutils e GCC de primeiro estágio, construídos como pseudo cross tools---i.e., com @option{--target} igual a @option{--host}. Eles são usados para construir a libc. Graças a esse truque de cross-build, essa libc tem a garantia de não manter nenhuma referência à cadeia de ferramentas inicial.

source: From there the final Binutils and GCC (not shown above) are built. GCC uses @command{ld} from the final Binutils, and links programs against the just-built libc. This tool chain is used to build the other packages used by Guix and by the GNU Build System: Guile, Bash, Coreutils, etc.
pt_br: A partir daí, os Binutils finais e o GCC (não mostrados acima) são construídos. O GCC usa @command{ld} dos Binutils finais e vincula programas à libc recém-construída. Essa cadeia de ferramentas é usada para construir os outros pacotes usados pelo Guix e pelo GNU Build System: Guile, Bash, Coreutils, etc.

source: And voilà! At this point we have the complete set of build tools that the GNU Build System expects. These are in the @code{%final-inputs} variable of the @code{(gnu packages commencement)} module, and are implicitly used by any package that uses @code{gnu-build-system} (@pxref{Build Systems, @code{gnu-build-system}}).
pt_br: E voilà! Neste ponto, temos o conjunto completo de ferramentas de construção que o GNU Build System espera. Elas estão na variável @code{%final-inputs} do módulo @code{(gnu packages commencement)} e são implicitamente usadas por qualquer pacote que use @code{gnu-build-system} (@pxref{Build Systems, @code{gnu-build-system}}).

source: Building the Bootstrap Binaries
pt_br: Construindo os binários Bootstrap

source: Porting to a New Platform
pt_br: Portando para uma nova plataforma

source: contributing.texi
it: contributing.it.texi
pt_br: contributing.pt_BR.texi

source: Guix is based on the @uref{https://nixos.org/nix/, Nix package manager}, which was designed and implemented by Eelco Dolstra, with contributions from other people (see the @file{nix/AUTHORS} file in Guix). Nix pioneered functional package management, and promoted unprecedented features, such as transactional package upgrades and rollbacks, per-user profiles, and referentially transparent build processes. Without this work, Guix would not exist.
pt_br: Guix é baseado no @uref{https://nixos.org/nix/, gerenciador de pacotes Nix}, que foi projetado e implementado por Eelco Dolstra, com contribuições de outras pessoas (veja o arquivo @file{nix/AUTHORS} no Guix.) O Nix foi pioneiro no gerenciamento funcional de pacotes e promoveu recursos sem precedentes, como atualizações e reversões de pacotes transacionais, perfis por usuário e processos de construção referencialmente transparentes. Sem esse trabalho, o Guix não existiria.

source: The Nix-based software distributions, Nixpkgs and NixOS, have also been an inspiration for Guix.
it: Le distribuzioni software basate su Nix, Nixpkgs e NixOS, sono state anche un'ispirazione per Guix.
pt_br: As distribuições de software baseadas em Nix, Nixpkgs e NixOS, também foram uma inspiração para o Guix.

source: GNU@tie{}Guix itself is a collective work with contributions from a number of people. See the @file{AUTHORS} file in Guix for more information on these fine people. The @file{THANKS} file lists people who have helped by reporting bugs, taking care of the infrastructure, providing artwork and themes, making suggestions, and more---thank you!
it: GNU@tie{}Guix stesso è un lavoro collettivo con contributi di diverse persone. Consulta il file @file{AUTHORS} in Guix per maggiori informazioni su queste persone. Il file @file{THANKS} elenca le persone che hanno contribuito segnalando bug, curando l'infrastruttura, fornendo grafica e temi, dando suggerimenti e altro ancora --- grazie!
pt_br: O GNU@tie{}Guix em si é um trabalho coletivo com contribuições de várias pessoas. Veja o arquivo @file{AUTHORS} no Guix para obter mais informações sobre essas pessoas legais. O arquivo @file{THANKS} lista as pessoas que ajudaram a relatar erros, cuidar da infraestrutura, fornecer ilustrações e temas, fazer sugestões e muito mais -- obrigado!

source: license, GNU Free Documentation License
it: licenza, GNU Free Documentation License
pt_br: licença, Licença de Documentação Livre GNU

source: ;;; Bug references. (require 'bug-reference) (add-hook 'prog-mode-hook #'bug-reference-prog-mode) (add-hook 'gnus-mode-hook #'bug-reference-mode) (add-hook 'erc-mode-hook #'bug-reference-mode) (add-hook 'gnus-summary-mode-hook #'bug-reference-mode) (add-hook 'gnus-article-mode-hook #'bug-reference-mode)
it: ;;; Riferimenti ai bug. (require 'bug-reference) (add-hook 'prog-mode-hook #'bug-reference-prog-mode) (add-hook 'gnus-mode-hook #'bug-reference-mode) (add-hook 'erc-mode-hook #'bug-reference-mode) (add-hook 'gnus-summary-mode-hook #'bug-reference-mode) (add-hook 'gnus-article-mode-hook #'bug-reference-mode)

source: Snippets versus Phases
it: Snippet contro fasi

source: Rust Crates
it: Crate Rust

source: ;; TRANSLATORS: "X11 resize-and-rotate" should not be translated. (description "ARandR is designed to provide a simple visual front end for the X11 resize-and-rotate (RandR) extension. @dots{}")
it: ;; TRANSLATORS: "X11 resize-and-rotate" non deve essere tradotto. (description "ARandR è progettato per fornire un semplice front-end visivo per l'estensione X11 resize-and-rotate (RandR). @dots{}")

source: work-in-progress branches, wip
it: rami work-in-progress, wip

source: wip branches
it: rami wip

source: Sometimes, a branch may be a work in progress, for example for larger efforts such as updating the GNOME desktop. In these cases, the branch name should reflect this by having the @samp{wip-} prefix. The QA infrastructure will avoid building work-in-progress branches, so that the available resources can be better focused on building the branches that are ready to be merged. When the branch is no longer a work in progress, it should be renamed, with the @samp{wip-} prefix removed, and only then should the merge requests be created, as documented earlier.
it: A volte, un ramo potrebbe essere un lavoro in corso, ad esempio per sforzi maggiori come l'aggiornamento del desktop GNOME. In questi casi, il nome del ramo dovrebbe rifletterlo con il prefisso @samp{wip-}. L'infrastruttura QA eviterà di costruire rami work-in-progress, in modo che le risorse disponibili possano essere meglio concentrate sulla costruzione dei rami pronti per essere uniti. Quando il ramo non è più un lavoro in corso, dovrebbe essere rinominato, rimuovendo il prefisso @samp{wip-}, e solo allora dovrebbero essere create le richieste di merge, come documentato in precedenza.

source: This section is about bug reports and patches sent by email to @uref{https://issues.guix.gnu.org, Debbugs}. This option is supported until December 31st, 2025, after which @uref{https://codeberg.org/guix/guix, Codeberg} will be the only interface for submitting bug reports and changes. @xref{Submitting Patches}, for more info.
it: Questa sezione riguarda le segnalazioni di bug e le patch inviate via email a @uref{https://issues.guix.gnu.org, Debbugs}. Questa opzione è supportata fino al 31 dicembre 2025, dopodiché @uref{https://codeberg.org/guix/guix, Codeberg} diventerà l'unica interfaccia per inviare segnalazioni di bug e modifiche. @xref{Submitting Patches}, per maggiori informazioni.

source: @kbd{G R} https://ci.guix.gnu.org/events/rss/?specification=master RET Guix CI - master RET Build events for specification master. RET
it: @kbd{G R} https://ci.guix.gnu.org/events/rss/?specification=master INVIO Guix CI - master INVIO Build events for specification master. INVIO
