Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Publishing a signed channel requires discipline: any mistake, such as an unsigned commit or a commit signed by an unauthorized key, will prevent users from pulling from your channel---well, that's the whole point of authentication! Pay attention to merges in particular: merge commits are considered authentic if and only if they are signed by a key present in the @file{.guix-authorizations} file of @emph{both} branches.
pt_br: Publicar um canal assinado requer disciplina: qualquer erro, como um commit não assinado ou um commit assinado por uma chave não autorizada, impedirá que usuários puxem do seu canal --- bem, esse é o ponto principal da autenticação! Preste atenção às mesclagens em particular: commits de mesclagem são considerados autênticos se e somente se forem assinados por uma chave presente no arquivo @file{.guix-authorizations} de @emph{ambos} os ramos.

source: primary URL, channels
pt_br: URL principal, canais

source: Channel authors can indicate the primary URL of their channel's Git repository in the @file{.guix-channel} file, like so:
pt_br: Os autores do canal podem indicar a URL principal do repositório Git do canal no arquivo @file{.guix-channel}, assim:

source: This allows @command{guix pull} to determine whether it is pulling code from a mirror of the channel; when that is the case, it warns the user that the mirror might be stale and displays the primary URL@. That way, users cannot be tricked into fetching code from a stale mirror that does not receive security updates.
pt_br: Isso permite que @command{guix pull} determine se está puxando código de um espelho do canal; quando esse for o caso, ele avisa o usuário que o espelho pode estar obsoleto e exibe a URL primária. Dessa forma, os usuários não podem ser enganados para buscar código de um espelho obsoleto que não recebe atualizações de segurança.

source: This feature only makes sense for authenticated repositories, such as the official @code{guix} channel, for which @command{guix pull} ensures the code it fetches is authentic.
pt_br: Esse recurso só faz sentido para repositórios autenticados, como o canal oficial @code{guix}, para o qual @command{guix pull} garante que o código que ele recupera é autêntico.

source: news, for channels
pt_br: notícias, para canais

source: Channel authors may occasionally want to communicate to their users information about important changes in the channel. You'd send them all an email, but that's not convenient.
pt_br: Os autores do canal podem ocasionalmente querer comunicar aos seus usuários informações sobre mudanças importantes no canal. Você enviaria um e-mail para todos eles, mas isso não é conveniente.

source: Instead, channels can provide a @dfn{news file}; when the channel users run @command{guix pull}, that news file is automatically read and @command{guix pull --news} can display the announcements that correspond to the new commits that have been pulled, if any.
pt_br: Em vez disso, os canais podem fornecer um @dfn{arquivo de notícias}; quando os usuários do canal executam @command{guix pull}, esse arquivo de notícias é lido automaticamente e @command{guix pull --news} pode exibir os anúncios que correspondem aos novos commits que foram extraídos, se houver.

source: To do that, channel authors must first declare the name of the news file in their @file{.guix-channel} file:
pt_br: Para fazer isso, os autores do canal devem primeiro declarar o nome do arquivo de notícias em seu arquivo @file{.guix-channel}:

source: The news file itself, @file{etc/news.txt} in this example, must look something like this:
pt_br: O arquivo de notícias em si, @file{etc/news.txt} neste exemplo, deve ser parecido com isto:

source: While the news file is using the Scheme syntax, avoid naming it with a @file{.scm} extension or else it will get picked up when building the channel and yield an error since it is not a valid module. Alternatively, you can move the channel module to a subdirectory and store the news file in another directory.
pt_br: Enquanto o arquivo de notícias estiver usando a sintaxe Scheme, evite nomeá-lo com uma extensão @file{.scm} ou então ele será pego ao construir o canal e gerará um erro, pois não é um módulo válido. Como alternativa, você pode mover o módulo do canal para um subdiretório e armazenar o arquivo de notícias em outro diretório.

source: The file consists of a list of @dfn{news entries}. Each entry is associated with a commit or tag: it describes changes made in this commit, possibly in preceding commits as well. Users see entries only the first time they obtain the commit the entry refers to.
pt_br: O arquivo consiste em uma lista de @dfn{entradas de notícias}. Cada entrada é associada a um commit ou tag: ela descreve as alterações feitas neste commit, possivelmente em commits anteriores também. Os usuários veem as entradas somente na primeira vez que obtêm o commit ao qual a entrada se refere.

source: The @code{title} field should be a one-line summary while @code{body} can be arbitrarily long, and both can contain Texinfo markup (@pxref{Overview,,, texinfo, GNU Texinfo}). Both the title and body are a list of language tag/message tuples, which allows @command{guix pull} to display news in the language that corresponds to the user's locale.
pt_br: O campo @code{title} deve ser um resumo de uma linha, enquanto @code{body} pode ser arbitrariamente longo, e ambos podem conter marcação Texinfo (@pxref{Overview,,, texinfo, GNU Texinfo}). Tanto o título quanto o corpo são uma lista de tuplas de tag/mensagem de idioma, o que permite que @command{guix pull} exiba notícias no idioma que corresponde à localidade do usuário.

source: If you want to translate news using a gettext-based workflow, you can extract translatable strings with @command{xgettext} (@pxref{xgettext Invocation,,, gettext, GNU Gettext Utilities}). For example, assuming you write news entries in English first, the command below creates a PO file containing the strings to translate:
pt_br: Se você quiser traduzir notícias usando um fluxo de trabalho baseado em gettext, você pode extrair strings traduzíveis com @command{xgettext} (@pxref{xgettext Invocation,,, gettext, GNU Gettext Utilities}). Por exemplo, supondo que você escreva entradas de notícias em inglês primeiro, o comando abaixo cria um arquivo PO contendo as strings a serem traduzidas:

source: To sum up, yes, you could use your channel as a blog. But beware, this is @emph{not quite} what your users might expect.
pt_br: Para resumir, sim, você pode usar seu canal como um blog. Mas cuidado, isso é @emph{não é bem} o que seus usuários podem esperar.

source: software development
pt_br: desenvolvimento de software

source: If you are a software developer, Guix provides tools that you should find helpful---independently of the language you're developing in. This is what this chapter is about.
pt_br: Se você é um desenvolvedor de software, o Guix fornece ferramentas que você achará úteis, independentemente da linguagem em que estiver desenvolvendo. É sobre isso que este capítulo trata.

source: The @command{guix shell} command provides a convenient way to set up one-off software environments, be it for development purposes or to run a command without installing it in your profile. The @command{guix pack} command allows you to create @dfn{application bundles} that can be easily distributed to users who do not run Guix.
pt_br: O comando @command{guix shell} fornece uma maneira conveniente de configurar ambientes de software únicos, seja para fins de desenvolvimento ou para executar um comando sem instalá-lo em seu perfil. O comando @command{guix pack} permite que você crie @dfn{embalagens de aplicativos} que podem ser facilmente distribuídas para usuários que não executam o Guix.

source: Invoking @command{guix shell}
pt_br: Invocando @command{guix shell}

source: reproducible build environments
pt_br: ambientes de construção reproduzíveis

source: development environments
pt_br: ambientes de desenvolvimento

source: environment, package build environment
pt_br: ambiente, ambiente de construção de pacotes

source: The purpose of @command{guix shell} is to make it easy to create one-off software environments, without changing one's profile. It is typically used to create development environments; it is also a convenient way to run applications without ``polluting'' your profile.
pt_br: O propósito do @command{guix shell} é facilitar a criação de ambientes de software únicos, sem alterar o perfil. Ele é normalmente usado para criar ambientes de desenvolvimento; também é uma maneira conveniente de executar aplicativos sem ``poluir'' seu perfil.

source: The @command{guix shell} command was recently introduced to supersede @command{guix environment} (@pxref{Invoking guix environment}). If you are familiar with @command{guix environment}, you will notice that it is similar but also---we hope!---more convenient.
pt_br: O comando @command{guix shell} foi introduzido recentemente para substituir @command{guix environment} (@pxref{Invoking guix environment}). Se você estiver familiarizado com @command{guix environment}, notará que ele é semelhante, mas também---esperamos!---mais conveniente.

source: guix shell [@var{options}] [@var{package}@dots{}]
pt_br: guix shell [@var{opções}] [@var{pacote}@dots{}]

source: Sometimes an interactive shell session is not desired. An arbitrary command may be invoked by placing the @code{--} token to separate the command from the rest of the arguments.
pt_br: Às vezes, uma sessão de shell interativa não é desejada. Um comando arbitrário pode ser invocado colocando o token @code{--} para separar o comando do resto dos argumentos.

source: The following example creates an environment containing Python and NumPy, building or downloading any missing package, and runs the @command{python3} command in that environment:
pt_br: O exemplo a seguir cria um ambiente contendo Python e NumPy, compilando ou baixando qualquer pacote ausente e executa o comando @command{python3} nesse ambiente:

source: Note that it is necessary to include the main @code{python} package in this command even if it is already installed into your environment. This is so that the shell environment knows to set @env{PYTHONPATH} and other related variables. The shell environment cannot check the previously installed environment, because then it would be non-deterministic. This is true for most libraries: their corresponding language package should be included in the shell invocation.
pt_br: Note que é necessário incluir o pacote principal @code{python} neste comando, mesmo que ele já esteja instalado em seu ambiente. Isso é para que o ambiente shell saiba definir @env{PYTHONPATH} e outras variáveis relacionadas. O ambiente shell não pode verificar o ambiente instalado anteriormente, porque então seria não determinístico. Isso é verdade para a maioria das bibliotecas: seu pacote de linguagem correspondente deve ser incluído na invocação do shell.

source: shebang, for @command{guix shell}
pt_br: shebang, para @command{guix shell}

source: @command{guix shell} can be also be used as a script interpreter, also known as @dfn{shebang}. Here is an example self-contained Python script making use of this feature:
pt_br: @command{guix shell} também pode ser usado como um interpretador de script, também conhecido como @dfn{shebang}. Aqui está um exemplo de script Python autocontido fazendo uso desse recurso:

source: You may pass any @command{guix shell} option, but there's one caveat: the Linux kernel has a limit of 127 bytes on shebang length.
pt_br: Você pode passar qualquer opção @command{guix shell}, mas há uma ressalva: o kernel Linux tem um limite de 127 bytes no comprimento do shebang.

source: Development environments can be created as in the example below, which spawns an interactive shell containing all the dependencies and environment variables needed to work on Inkscape:
pt_br: Ambientes de desenvolvimento podem ser criados como no exemplo abaixo, que gera um shell interativo contendo todas as dependências e variáveis de ambiente necessárias para trabalhar no Inkscape:

source: Exiting the shell places the user back in the original environment before @command{guix shell} was invoked. The next garbage collection (@pxref{Invoking guix gc}) may clean up packages that were installed in the environment and that are no longer used outside of it.
pt_br: Sair do shell coloca o usuário de volta no ambiente original antes de @command{guix shell} ser invocado. A próxima coleta de lixo (@pxref{Invoking guix gc}) pode limpar pacotes que foram instalados no ambiente e que não são mais usados fora dele.

source: As an added convenience, @command{guix shell} will try to do what you mean when it is invoked interactively without any other arguments as in:
pt_br: Como uma conveniência adicional, @command{guix shell} tentará fazer o que você quer dizer quando for invocado interativamente sem nenhum outro argumento, como em:

source: If it finds a @file{manifest.scm} in the current working directory or any of its parents, it uses this manifest as though it was given via @code{--manifest}. Likewise, if it finds a @file{guix.scm} in the same directories, it uses it to build a development profile as though both @code{--development} and @code{--file} were present. In either case, the file will only be loaded if the directory it resides in is listed in @file{~/.config/guix/shell-authorized-directories}. This provides an easy way to define, share, and enter development environments.
pt_br: Se encontrar um @file{manifest.scm} no diretório de trabalho atual ou em qualquer um dos seus pais, ele usa esse manifesto como se tivesse sido fornecido via @code{--manifest}. Da mesma forma, se encontrar um @file{guix.scm} nos mesmos diretórios, ele o usa para construir um perfil de desenvolvimento como se @code{--development} e @code{--file} estivessem presentes. Em ambos os casos, o arquivo só será carregado se o diretório em que ele reside estiver listado em @file{~/.config/guix/shell-authorized-directories}. Isso fornece uma maneira fácil de definir, compartilhar e entrar em ambientes de desenvolvimento.

source: By default, the shell session or command runs in an @emph{augmented} environment, where the new packages are added to search path environment variables such as @code{PATH}. You can, instead, choose to create an @emph{isolated} environment containing nothing but the packages you asked for. Passing the @option{--pure} option clears environment variable definitions found in the parent environment@footnote{Be sure to use the @option{--check} option the first time you use @command{guix shell} interactively to make sure the shell does not undo the effect of @option{--pure}.}; passing @option{--container} goes one step further by spawning a @dfn{container} isolated from the rest of the system:
pt_br: Por padrão, a sessão ou comando do shell é executado em um ambiente @emph{aumentado}, onde os novos pacotes são adicionados às variáveis de ambiente do caminho de pesquisa, como @code{PATH}. Em vez disso, você pode escolher criar um ambiente @emph{isolado} contendo apenas os pacotes solicitados. Passar a opção @option{--pure} limpa as definições de variáveis de ambiente encontradas no ambiente pai@footnote{Certifique-se de usar a opção @option{--check} na primeira vez que usar @command{guix shell} interativamente para garantir que o shell não desfaça o efeito de @option{--pure}.}; passar @option{--container} vai um passo além ao gerar um @dfn{contêiner} isolado do resto do sistema:

source: The command above spawns an interactive shell in a container where nothing but @code{emacs}, @code{gcc-toolchain}, and their dependencies is available. The container lacks network access and shares no files other than the current working directory with the surrounding environment. This is useful to prevent access to system-wide resources such as @file{/usr/bin} on foreign distros.
pt_br: O comando acima gera um shell interativo em um contêiner onde nada além de @code{emacs}, @code{gcc-toolchain} e suas dependências estão disponíveis. O contêiner não tem acesso à rede e não compartilha nenhum arquivo além do diretório de trabalho atual com o ambiente ao redor. Isso é útil para evitar acesso a recursos de todo o sistema, como @file{/usr/bin} em distros estrangeiras.

source: This @option{--container} option can also prove useful if you wish to run a security-sensitive application, such as a web browser, in an isolated environment. For example, the command below launches Ungoogled-Chromium in an isolated environment, which:
pt_br: Esta opção @option{--container} também pode ser útil se você deseja executar um aplicativo sensível à segurança, como um navegador da web, em um ambiente isolado. Por exemplo, o comando abaixo inicia o Ungoogled-Chromium em um ambiente isolado, que:

source: shares network access with the host
pt_br: compartilha o acesso à rede com o host

source: inherits host's environment variables @code{DISPLAY} and @code{XAUTHORITY}
pt_br: herda as variáveis de ambiente do host @code{DISPLAY} e @code{XAUTHORITY}

source: has access to host's authentication records from the @code{XAUTHORITY}
pt_br: tem acesso aos registros de autenticação do host do @code{XAUTHORITY}

source: has no information about host's current directory
pt_br: não tem informações sobre o diretório atual do host

source: @command{guix shell} defines the @env{GUIX_ENVIRONMENT} variable in the shell it spawns; its value is the file name of the profile of this environment. This allows users to, say, define a specific prompt for development environments in their @file{.bashrc} (@pxref{Bash Startup Files,,, bash, The GNU Bash Reference Manual}):
pt_br: @command{guix shell} define a variável @env{GUIX_ENVIRONMENT} no shell que ele gera; seu valor é o nome do arquivo do perfil deste ambiente. Isso permite que os usuários, digamos, definam um prompt específico para ambientes de desenvolvimento em seu @file{.bashrc} (@pxref{Bash Startup Files,,, bash, Manual de referência do GNU Bash}):

source: ...@: or to browse the profile:
pt_br: ...@: ou para navegar pelo perfil:

source: The available options are summarized below.
pt_br: As opções disponíveis estão resumidas abaixo.

source: Set up the environment and check whether the shell would clobber environment variables. It's a good idea to use this option the first time you run @command{guix shell} for an interactive session to make sure your setup is correct.
pt_br: Configure o ambiente e verifique se o shell sobrecarregaria as variáveis de ambiente. É uma boa ideia usar esta opção na primeira vez que você executar @command{guix shell} para uma sessão interativa para garantir que sua configuração esteja correta.

source: For example, if the shell modifies the @env{PATH} environment variable, report it since you would get a different environment than what you asked for.
pt_br: Por exemplo, se o shell modificar a variável de ambiente @env{PATH}, informe isso, pois você obterá um ambiente diferente do que solicitou.

source: Such problems usually indicate that the shell startup files are unexpectedly modifying those environment variables. For example, if you are using Bash, make sure that environment variables are set or modified in @file{~/.bash_profile} and @emph{not} in @file{~/.bashrc}---the former is sourced only by log-in shells. @xref{Bash Startup Files,,, bash, The GNU Bash Reference Manual}, for details on Bash start-up files.
pt_br: Tais problemas geralmente indicam que os arquivos de inicialização do shell estão modificando inesperadamente essas variáveis de ambiente. Por exemplo, se você estiver usando Bash, certifique-se de que as variáveis de ambiente estejam definidas ou modificadas em @file{~/.bash_profile} e @emph{não} em @file{~/.bashrc}---o primeiro é originado apenas por shells de login. @xref{Bash Startup Files,,, bash, Manual de referência do GNU Bash}, para detalhes sobre os arquivos de inicialização do Bash.

source: Cause @command{guix shell} to include in the environment the dependencies of the following package rather than the package itself. This can be combined with other packages. For instance, the command below starts an interactive shell containing the build-time dependencies of GNU@tie{}Guile, plus Autoconf, Automake, and Libtool:
pt_br: Faça com que @command{guix shell} inclua no ambiente as dependências do pacote a seguir em vez do pacote em si. Isso pode ser combinado com outros pacotes. Por exemplo, o comando abaixo inicia um shell interativo contendo as dependências de tempo de compilação do GNU@tie{}Guile, além do Autoconf, Automake e Libtool:

source: Create an environment for the package or list of packages that @var{expr} evaluates to.
pt_br: Crie um ambiente para o pacote ou lista de pacotes que @var{expr} avalia.

source: For example, running:
pt_br: Por exemplo, executando:

source: starts a shell with the environment for this specific variant of the PETSc package.
pt_br: inicia um shell com o ambiente para esta variante específica do pacote PETSc.

source: Running:
pt_br: Rodando:

source: starts a shell with all the base system packages available.
pt_br: inicia um shell com todos os pacotes do sistema base disponíveis.

source: The above commands only use the default output of the given packages. To select other outputs, two element tuples can be specified:
pt_br: Os comandos acima usam apenas a saída padrão dos pacotes fornecidos. Para selecionar outras saídas, duas tuplas de elementos podem ser especificadas:

source: @xref{package-development-manifest, @code{package->development-manifest}}, for information on how to write a manifest for the development environment of a package.
pt_br: @xref{package-development-manifest, @code{package->development-manifest}}, para obter informações sobre como escrever um manifesto para o ambiente de desenvolvimento de um pacote.

source: --file=@var{file}
pt_br: --file=@var{arquivo}

source: Create an environment containing the package or list of packages that the code within @var{file} evaluates to.
pt_br: Crie um ambiente contendo o pacote ou lista de pacotes que o código dentro de @var{arquivo} avalia.

source: With the file above, you can enter a development environment for GDB by running:
pt_br: Com o arquivo acima, você pode entrar em um ambiente de desenvolvimento para o GDB executando:

source: Create an environment for the packages contained in the manifest object returned by the Scheme code in @var{file}. This option can be repeated several times, in which case the manifests are concatenated.
pt_br: Crie um ambiente para os pacotes contidos no objeto manifest retornado pelo código Scheme em @var{arquivo}. Esta opção pode ser repetida várias vezes, nesse caso os manifestos são concatenados.

source: This is similar to the same-named option in @command{guix package} (@pxref{profile-manifest, @option{--manifest}}) and uses the same manifest files.
pt_br: Isso é semelhante à opção de mesmo nome em @command{guix package} (@pxref{profile-manifest, @option{--manifest}}) e usa os mesmos arquivos de manifesto.

source: @xref{Writing Manifests}, for information on how to write a manifest. See @option{--export-manifest} below on how to obtain a first manifest.
pt_br: @xref{Writing Manifests}, para informações sobre como escrever um manifesto. Veja @option{--export-manifest} abaixo sobre como obter um primeiro manifesto.

source: Write to standard output a manifest suitable for @option{--manifest} corresponding to given command-line options.
pt_br: Grave na saída padrão um manifesto adequado para @option{--manifest} correspondente às opções de linha de comando fornecidas.
