Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: You may not be able to run the above commands at this point. If you have issues remotely logging into your linode box via SSH, then you may still need to set your root and user password initially by clicking on the ``Launch Console'' option in your linode. Choose the ``Glish'' instead of ``Weblish''. Now you should be able to ssh into the machine.
es: Es posible que no pueda ejecutar los comandos anteriores en este punto. Si tiene problemas para iniciar sesión de forma remota en su caja linode a través de SSH, entonces es posible que aún tenga que establecer su contraseña de root y de usuario inicialmente haciendo clic en la opción ``Lanzar Consola'' en su linode. Elija ``Glish'' en lugar de ``Weblish''. Ahora usted debe ser capaz de ssh en la máquina.
it: Potresti non essere in grado di eseguire i comandi sopra a questo punto. Se hai problemi ad accedere in remoto alla tua macchina Linode via SSH, potresti ancora dover impostare inizialmente la password di root e dell'utente cliccando sull'opzione ``Launch Console'' nel tuo Linode. Scegli ``Glish'' invece di ``Weblish''. Ora dovresti essere in grado di accedere alla macchina tramite ssh.
pt_br: Talvez você não consiga executar os comandos acima neste momento. Se você tiver problemas para fazer login remotamente em sua caixa linode via SSH, então você ainda pode precisar definir sua senha root e de usuário inicialmente clicando na opção ``Launch Console'' em seu linode. Escolha ``Glish'' em vez de ``Weblish''. Agora você deve conseguir fazer o ssh na máquina.
sk: V tomto bode možno nebudete môcť vyššie uvedené príkazy vykonať. Ak máte ťažkosti so vzdialeným prihlásením cez SSH, tak možno budete musieť používateľské heslá nastaviť kliknutím na možnosť „Launch Console“ (spustiť príkazový riadok) vo vašom Linode. Vyberte „Glish“ namiesto „Weblish“. Teraz by ste už mali byť schopní prihlásiť sa do stroja.

source: Hooray! At this point you can shut down the server, delete the Debian disk, and resize the Guix to the rest of the size. Congratulations!
es: ¡Hurra! En este punto puede apagar el servidor, borrar el disco Debian y redimensionar el Guix al resto del tamaño. ¡Enhorabuena!
it: Evviva! A questo punto puoi spegnere il server, eliminare il disco Debian, e ridimensionare il Guix al resto della dimensione. Congratulazioni!
pt_br: Viva! Neste ponto você pode desligar o servidor, excluir o disco Debian e redimensionar o Guix para o restante do tamanho. Parabéns!
sk: Sláva! Teraz môžete server vypnúť, odstrániť disk s Debianom a rozšíriť disk Guixom. Blahoželáme!

source: By the way, if you save it as a disk image right at this point, you'll have an easy time spinning up new Guix images! You may need to down-size the Guix image to 6144MB, to save it as an image. Then you can resize it again to the max size.
es: Por cierto, si la guardas como imagen de disco en este momento, ¡te resultará muy fácil crear nuevas imágenes Guix! Puede que necesites reducir el tamaño de la imagen Guix a 6144MB, para guardarla como imagen. A continuación, puede cambiar el tamaño de nuevo al tamaño máximo.
it: A proposito, se lo salvi come immagine disco proprio a questo punto, avrai facilità a creare nuove immagini Guix! Potrebbe essere necessario ridurre la dimensione dell'immagine Guix a 6144MB, per salvarla come immagine. Quindi puoi ridimensionarla di nuovo a la dimensione massima.
pt_br: A propósito, se você salvá-lo como uma imagem de disco neste momento, será fácil criar novas imagens Guix! Pode ser necessário reduzir o tamanho da imagem Guix para 6144 MB para salvá-la como uma imagem. Então você pode redimensioná-lo novamente para o tamanho máximo.
sk: Inak, ak teraz výsledok uložíte ako obraz disku, uľahčíte si tým spúšťanie nových obrazov s Guixom! Pre uloženie ako obraz disku možno budete musieť disk s Guixom zmenšiť na 6144 MB, ale potom ho môžete znovu rozšíriť na pôvodnú veľkosť.

source: To run Guix on a server hosted by @uref{https://www.kimsufi.com/, Kimsufi}, click on the netboot tab then select rescue64-pro and restart.
es: Para ejecutar Guix en un servidor alojado en @uref{https://www.kimsufi.com/, Kimsufi}, haz clic en la pestaña netboot, selecciona rescue64-pro y reinicia.
it: Per eseguire Guix su un server ospitato da @uref{https://www.kimsufi.com/, Kimsufi}, clicca sulla scheda netboot, quindi seleziona rescue64-pro e riavvia.
pt_br: Para executar o Guix em um servidor hospedado por @uref{https://www.kimsufi.com/, Kimsufi}, clique na guia netboot, selecione Rescue64-pro e reinicie.

source: OVH will email you the credentials required to ssh into a Debian system.
es: OVH le enviará por correo electrónico las credenciales necesarias para entrar por ssh en un sistema Debian.
it: OVH ti invierà via email le credenziali necessarie per accedere via ssh a un sistema Debian.
pt_br: A OVH enviar-lhe-á por e-mail as credenciais necessárias para efetuar o ssh num sistema Debian.

source: Now you can run the "install guix from @pxref{Binary Installation,,, guix, GNU Guix}" steps:
es: Ahora puede ejecutar los pasos "instalar guix desde @pxref{Instalación binaria,,, guix, GNU Guix}":
it: Ora puoi eseguire i passaggi per "installare Guix da @pxref{Installazione binaria,,, guix.it, GNU Guix}":
pt_br: Agora você pode executar as etapas "instalar guix de @pxref{Instalação de binários,,, guix.pt_BR, GNU Guix}":

source: Partition the drives and format them, first stop the raid array:
es: Particionar los discos y formatearlos, primero parar el raid array:
it: Partiziona i dischi e formattali, prima ferma l'array raid:
pt_br: Particione as unidades e formate-as, primeiro interrompa a matriz raid:

source: Then wipe the disks and set up the partitions, we will create a RAID 1 array.
es: A continuación, limpie los discos y configurar las particiones, vamos a crear una matriz RAID 1.
it: Quindi azzera i dischi e configura le partizioni, creeremo un array RAID 1.
pt_br: Em seguida, limpe os discos e configure as partições, criaremos uma matriz RAID 1.

source: Create the array:
es: Crea el array:
it: Crea l'array:
pt_br: Crie a matriz:

source: Now create file systems on the relevant partitions, first the boot partitions:
es: Ahora cree sistemas de archivos en las particiones relevantes, primero las particiones de arranque:
it: Ora crea i file system sulle partizioni pertinenti, prima le partizioni di avvio:
pt_br: Agora crie sistemas de arquivos nas partições relevantes, primeiro as partições de inicialização:

source: Then the root partition:
es: A continuación, la partición raíz:
it: Quindi la partizione root:
pt_br: Então a partição raiz:

source: Initialize the swap partitions:
es: Inicializar las particiones swap:
it: Inizializza le partizioni di swap:
pt_br: Inicialize as partições swap:

source: Mount the guix drive:
es: Monte la unidad guix:
it: Monta l'unità guix:
pt_br: Monte a unidade guix:

source: Now is time to write an operating system declaration @file{os.scm} file; here is a sample:
es: Ahora es el momento de escribir una declaración del sistema operativo del archivo @file{os.scm}; aquí tiene una muestra:
it: Ora è il momento di scrivere un file di dichiarazione del sistema operativo @file{os.scm}; ecco un esempio:
pt_br: Agora é hora de escrever um arquivo @file{os.scm} de declaração do sistema operacional; aqui está uma amostra:

source: ;; Add a kernel module for RAID-1 (aka. "mirror"). (initrd-modules (cons* "raid1" %base-initrd-modules))
es: ;; Añadir un módulo de kernel para RAID-1 (aka. "mirror"). (initrd-modules (cons* "raid1" %base-initrd-modules))
it: ;; Aggiungi un modulo del kernel per RAID-1 (alias "mirror"). (initrd-modules (cons* "raid1" %base-initrd-modules))
pt_br: ;; Adicionar um módulo de kernel para RAID-1 (conhecido como. "espelho"). (initrd-modules (cons* "raid1" %base-initrd-modules))

source: (issue ;; Default contents for /etc/issue. "\ This is the GNU system at Kimsufi. Welcome.\n")
es: (issue ;; Default contents for /etc/issue. "\ Este es el sistema GNU en Kimsufi. Bienvenido.\n")
it: (issue ;; Contenuti predefiniti per /etc/issue. "\ Questo è il sistema GNU su Kimsufi. Benvenuto.\n")
pt_br: (issue ;;Conteúdo padrão para /etc/issue. "\ Este é o sistema GNU em Kimsufi. Bem-vindo.\n")

source: ;; Globally-installed packages. (packages (cons* tmux gnutls wireguard-tools %base-packages)) (services (cons* (service static-networking-service-type (list (static-networking (addresses (list (network-address (device "enp3s0") (value "@var{server-ip-address}/24")))) (routes (list (network-route (destination "default") (gateway "@var{server-gateway}")))) (name-servers '("213.186.33.99")))))
es: ;; Paquetes instalados globalmente. (packages (cons* tmux gnutls wireguard-tools %base-packages)) (services (cons* (service static-networking-service-type (list (static-networking (addresses (list (network-address (device "enp3s0") (value "@var{server-ip-address}/24")))) (routes (list (network-route (destination "default") (gateway "@var{server-gateway}")))) (name-servers '("213.186.33.99")))))
it: ;; Pacchetti installati globalmente. (packages (cons* tmux gnutls wireguard-tools %base-packages)) (services (cons* (service static-networking-service-type (list (static-networking (addresses (list (network-address (device "enp3s0") (value "@var{indirizzo-ip-server}/24")))) (routes (list (network-route (destination "default") (gateway "@var{server-gateway}")))) (name-servers '("213.186.33.99")))))
pt_br: ;; Pacotes instalados globalmente. (packages (cons* tmux nss-certs gnutls wireguard-tools %base-packages)) (services (cons* (service static-networking-service-type (list (static-networking (addresses (list (network-address (device "enp3s0") (value "@var{server-ip-address}/24")))) (routes (list (network-route (destination "default") (gateway "@var{server-gateway}")))) (name-servers '("213.186.33.99")))))

source: (service openssh-service-type (openssh-configuration (openssh openssh-sans-x) (permit-root-login #f) (authorized-keys `(("guix" ,(plain-file "@var{ssh-key-name.pub}" "@var{ssh-public-key-content}")))))) (modify-services %base-services (sysctl-service-type config => (sysctl-configuration (settings (append '(("net.ipv6.conf.all.autoconf" . "0") ("net.ipv6.conf.all.accept_ra" . "0")) %default-sysctl-settings))))))))
it: (service openssh-service-type (openssh-configuration (openssh openssh-sans-x) (permit-root-login #f) (authorized-keys `(("guix" ,(plain-file "@var{ssh-key-name.pub}" "@var{contenuto-chiave-pubblica-ssh}")))))) (modify-services %base-services (sysctl-service-type config => (sysctl-configuration (settings (append '(("net.ipv6.conf.all.autoconf" . "0") ("net.ipv6.conf.all.accept_ra" . "0")) %default-sysctl-settings))))))))

source: Don't forget to substitute the @var{server-ip-address}, @var{server-gateway}, @var{ssh-key-name} and @var{ssh-public-key-content} variables with your own values.
es: No olvide sustituir el @var{server-ip-address}, @var{server-gateway}, @var{ssh-key-name} y @var{ssh-public-key-content} con sus propios valores.
it: Non dimenticare di sostituire le variabili @var{indirizzo-ip-server}, @var{server-gateway}, @var{nome-chiave-ssh} e @var{contenuto-chiave-pubblica-ssh} con i tuoi valori.
pt_br: Não se esqueça de substituir as variáveis @var{server-ip-address}, @var{server-gateway}, @var{ssh-key-name} e @var{ssh-public-key-content} pelos seus próprias valores.
sv: Kom ihåg att ersätta variablerna @var{server-ip-address}, @var{server-gateway}, @var{ssh-key-name} och @var{ssh-public-key-content} med dina egna värden.

source: The gateway is the last usable IP in your block so if you have a server with an IP of @samp{37.187.79.10} then its gateway will be @samp{37.187.79.254}.
es: La puerta de enlace es la última IP utilizable de su bloque, por lo que si tiene un servidor con una IP de @samp{37.187.79.10} entonces su puerta de enlace será @samp{37.187.79.254}.
it: Il gateway è l'ultimo IP utilizzabile nel tuo blocco, quindi se hai un server con un IP di @samp{37.187.79.10} allora il suo gateway sarà @samp{37.187.79.254}.
pt_br: O gateway é o último IP utilizável em seu bloco, portanto, se você tiver um servidor com IP @samp{37.187.79.10}, seu gateway será @samp{37.187.79.254}.

source: Transfer your operating system declaration @file{os.scm} file on the server via the @command{scp} or @command{sftp} commands.
es: Transfiera su declaración de sistema operativo @file{os.scm} en el servidor a través de @command{scp} o comandos @command{sftp}.
it: Trasferisci il file di dichiarazione del tuo sistema operativo @file{os.scm} sul server tramite i comandi @command{scp} o @command{sftp}.
pt_br: Transfira o arquivo de declaração do sistema operacional @file{os.scm} para o servidor por meio dos comandos @command{scp} ou @command{sftp}.

source: Now all that is left is to install Guix with a @code{guix system init} and restart.
es: Ahora sólo queda instalar Guix con un @code{guix system init} y reinicia.
it: Ora non resta che installare Guix con un @code{guix system init} e riavviare.
pt_br: Agora só falta instalar o Guix com @code{guix system init} e reiniciar.

source: However we first need to set up a chroot, because the root partition of the rescue system is mounted on an aufs partition and if you try to install Guix it will fail at the GRUB install step complaining about the canonical path of "aufs".
es: Sin embargo, primero necesitamos configurar un chroot, porque la partición raíz del sistema de rescate está montada en una partición aufs y si intentas instalar Guix fallará en el paso de instalación de GRUB quejándose de la ruta canónica de "aufs".
it: Tuttavia, dobbiamo prima configurare un chroot, perché la partizione root del sistema di recupero è montata su una partizione aufs e se provi a installare Guix fallirà al passaggio di installazione di GRUB lamentandosi del percorso canonico di "aufs".
pt_br: No entanto, primeiro precisamos configurar um chroot, porque a partição raiz do sistema de recuperação é montada em uma partição aufs e se você tentar instalar o Guix ele falhará na etapa de instalação do GRUB reclamando do caminho canônico de "aufs".

source: Install packages that will be used in the chroot:
es: Instala los paquetes que se utilizarán en el chroot:
it: Installa i pacchetti che verranno usati nel chroot:
pt_br: Instale os pacotes que serão usados no chroot:

source: Then run the following to create directories needed for the chroot:
es: A continuación, ejecute lo siguiente para crear los directorios necesarios para el chroot:
it: Quindi esegui quanto segue per creare le directory necessarie per il chroot:
pt_br: Em seguida, execute o seguinte para criar os diretórios necessários para o chroot:

source: Copy the host resolv.conf in the chroot:
es: Copie el host resolv.conf en el chroot:
it: Copia il resolv.conf dell'host nel chroot:
pt_br: Copie o host resolv.conf no chroot:

source: Mount block devices, the store and its database and the current guix config:
es: Montar dispositivos de bloque, el almacén y su base de datos y la configuración guix actual:
it: Monta i dispositivi a blocchi, lo store e il suo database e la configurazione attuale di guix:
pt_br: Monte os dispositivos de bloco, o armazém e seu banco de dados e a configuração atual do guix:

source: Chroot in /mnt and install the system:
es: Chroot en /mnt e instalar el sistema:
it: Chroot in /mnt e installa il sistema:
pt_br: Faça chroot em /mnt e instale o sistema:

source: Finally, from the web user interface (UI), change @samp{netboot} to @samp{boot to disk} and restart (also from the web UI).
es: Por último, desde la interfaz de usuario web (UI), cambia @samp{netboot} por @samp{boot to disk} y reinicia (también desde la UI web).
it: Infine, dall'interfaccia utente web (UI), cambia @samp{netboot} in @samp{avvio da disco} e riavvia (anche dall'interfaccia utente web).
pt_br: Por fim, na interface do usuário (IU) da web, altere @samp{netboot} para @samp{boot to disk} e reinicie (também na IU da web).

source: Wait a few minutes and try to ssh with @code{ssh guix@@@var{server-ip-address>} -i @var{path-to-your-ssh-key}}
es: Espera unos minutos e intenta hacer ssh con @code{ssh guix@@@var{dirección-ip-del-servidor>} -i @var{path-to-your-ssh-key}}.
it: Aspetta qualche minuto e prova a connetterti via ssh con @code{ssh guix@@@var{indirizzo-ip-server>} -i @var{path-to-your-ssh-key}}
pt_br: Aguarde alguns minutos e tente fazer ssh com @code{ssh guix@@@var{endereço IP do servidor>} -i @var{caminho para sua chave ssh}}

source: You should have a Guix system up and running on Kimsufi; congratulations!
es: Deberías tener un sistema Guix funcionando en Kimsufi; ¡enhorabuena!
it: Dovresti avere un sistema Guix attivo e funzionante su Kimsufi; congratulazioni!
pt_br: Você deve ter um sistema Guix instalado e funcionando no Kimsufi; Parabéns!

source: To bind mount a file system, one must first set up some definitions before the @code{operating-system} section of the system definition. In this example we will bind mount a folder from a spinning disk drive to @file{/tmp}, to save wear and tear on the primary SSD, without dedicating an entire partition to be mounted as @file{/tmp}.
es: Para enlazar el montaje de un sistema de archivos, primero hay que establecer algunas definiciones antes de la sección @code{operating-system} de la definición del sistema. En este ejemplo vamos a bind mount una carpeta de una unidad de disco giratorio a @file{/tmp}, para ahorrar desgaste en el SSD primario, sin dedicar una partición entera a ser montada como @file{/tmp}.
it: Per montare con bind un file system, è necessario prima impostare alcune definizioni prima della sezione @code{operating-system} della definizione del sistema. In questo esempio monteremo con bind una cartella da un disco rotante su @file{/tmp}, per risparmiare usura sul SSD primario, senza dedicare un'intera partizione da montare come @file{/tmp}.
pt_br: Para vincular a montagem de um sistema de arquivos, é necessário primeiro configurar algumas definições antes da seção @code{operating-system} da definição do sistema. Neste exemplo, vincularemos a montagem de uma pasta de uma unidade de disco rígido a @file{/tmp}, para evitar desgaste no SSD primário, sem dedicar uma partição inteira para ser montada como @file{/tmp}.
sk: Pre vytvorenie podvojného pripojenia systému súborov je najskôr nutné pridať niekoľko zadaní do oddielu @code{operating-system} v zadaní systému. Aby sme nevyčerpávali hlavný SSD disk, v tomto príklade vytvoríme podvojné pripojenie pre priečinok z pevného disku k @file{/tmp} bez nutnosti vyhradenia celého jedného oddielu pre @file{/tmp}.

source: First, the source drive that hosts the folder we wish to bind mount should be defined, so that the bind mount can depend on it.
es: En primer lugar, debe definirse la unidad de origen que aloja la carpeta que deseamos montar de forma enlazada, para que el montaje enlazado pueda depender de ella.
it: Innanzitutto, l'unità sorgente che ospita la cartella che desideriamo montare con bind dovrebbe essere definita, in modo che il mount bind possa dipendere da essa.
pt_br: Primeiro, a unidade de origem que hospeda a pasta que desejamos vincular a montagem deve ser definida, para que a montagem de ligação possa depender dela.
sk: Po prvé, zdrojové zariadenie s priečinkom, pre ktorý chceme vytvoriť podvojné pripojenie, musí byť dané, aby na ňom mohlo podvojné pripojenie závisieť.

source: (define source-drive ;; "source-drive" can be named anything you want. (file-system (device (uuid "UUID goes here")) (mount-point "/path-to-spinning-disk-goes-here") (type "ext4"))) ;Make sure to set this to the appropriate type for your drive.
es: (define source-drive ;; "source-drive" puede llamarse como quieras. (file-system (device (uuid "UUID goes here")) (mount-point "/path-to-spinning-disk-goes-here") (type "ext4"))) ;Asegúrese de establecer el tipo adecuado para su unidad..
it: (define source-drive ;; "source-drive" può essere chiamato come vuoi. (file-system (device (uuid "UUID va qui")) (mount-point "/percorso-al-disco-rotante-va-qui") (type "ext4"))) ;Assicurati di impostarlo al tipo appropriato per la tua unità.
pt_br: (define source-drive ;; "source-drive" pode ser nomeado como você quiser. (file-system (device (uuid "UUID vai aqui")) (mount-point "/path-to-spinning-disk-goes-here") (type "ext4"))) ;; Certifique-se de definir isso para o tipo apropriado para sua unidade.
sk: (define zdrojove-zariadenie ;; „zdrojove-zariadenie“ môžete ľubovoľne nahradiť (file-system (device (uuid "sem príde UUID")) (mount-point "/sem-príde-cesta-k-pevnému-disku") (type "ext4"))) ;Uistite sa, že druh systému súborov zodpovedá tomu, čo je na disku.

source: The source folder must also be defined, so that guix will know it's not a regular block device, but a folder.
es: También debe definirse la carpeta de origen, para que guix sepa que no se trata de un dispositivo de bloque normal, sino de una carpeta.
it: La cartella sorgente deve essere definita anche, in modo che guix sappia che non è un dispositivo a blocchi regolare, ma una cartella.
pt_br: A pasta de origem também deve ser definida, para que o guix saiba que não é um dispositivo de bloco normal, mas uma pasta.
sk: Zdrojový priečinok musí byť taktiež určený, aby Guix vedel, že sa jedná o priečinok, a nie o diskovú jednotku.

source: ;; "source-directory" can be named any valid variable name. (define (%source-directory) "/path-to-spinning-disk-goes-here/tmp")
es: ;; "source-directory" puede denominarse con cualquier nombre de variable válido. (define (%source-directory) "/path-to-spinning-disk-goes-here/tmp")
it: ;; "source-directory" può essere qualsiasi nome di variabile valido. (define (%source-directory) "/percorso-al-disco-rotante-va-qui/tmp")
pt_br: ;; "%source-directory" pode receber qualquer nome de variável válido. (define (%source-directory) "/caminho_para_ o_disco_vai_aqui/tmp")
sk: ;; „zdrojovy-priecinok“ môžete nahradiť ľubovoľným platným názvom premennej. (define (%zdrojovy-priecinok) "/sem-príde-cesta-k-pevnému-disku/tmp")

source: Finally, inside the @code{file-systems} definition, we must add the mount itself.
es: Por último, dentro del @code{file-systems} definición, debemos añadir el propio montaje.
it: Infine, all'interno della definizione @code{file-systems}, dobbiamo aggiungere il mount stesso.
pt_br: Finalmente, dentro da definição @code{file-systems}, devemos adicionar a própria montagem.
sk: Nakoniec musíme samotné pripojenie pridať do zadania @code{file-systems}.

source: ...<other drives omitted for clarity>...
es: ...<otras unidades omitidas para mayor claridad>...
it: ...<altre unità omesse per chiarezza>...
sk: ...<ostatné pripojenia sme vynechali>...

source: ;; Must match the name you gave the source drive in the earlier definition. source-drive
es: ;; Debe coincidir con el nombre que le diste a la unidad de origen en la definición anterior. source-drive
it: ;; Deve corrispondere al nome che hai dato all'unità sorgente nella definizione precedente. source-drive
pt_br: ;; Deve corresponder ao nome que você deu à unidade ;; de origem na definição anterior. source-drive
sk: ;; Musí sa zhodovať s názvom, ktorý ste pridelili zdrojovému ;; zariadeniu vyššie. zdrojove-zariadenie
