Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The @code{(gnu packages package-management)} module exports the @code{guix-for-channels} procedure, described below.
pt_br: O módulo @code{(gnu packages package-management)} exporta o procedimento @code{guix-for-channels}, descrito abaixo.

source: {Procedure} guix-for-channels @var{channels}
pt_br: {Procedimento} guix-for-channels @var{canais}

source: Return a package corresponding to @var{channels}.
pt_br: Retorna um pacote correspondente a @var{canais}.

source: The result is a ``regular'' package, which can be used in @code{guix-configuration} as shown above or in any other place that expects a package.
pt_br: O resultado é um pacote ``regular'', que pode ser usado em @code{guix-configuration} como mostrado acima ou em qualquer outro lugar que espere um pacote.

source: The @command{guix pull} and @command{guix time-machine} commands @dfn{authenticate} the code retrieved from channels: they make sure each commit that is fetched is signed by an authorized developer. The goal is to protect from unauthorized modifications to the channel that would lead users to run malicious code.
pt_br: Os comandos @command{guix pull} e @command{guix time-machine} @dfn{autenticam} o código recuperado dos canais: eles garantem que cada commit que é buscado seja assinado por um desenvolvedor autorizado. O objetivo é proteger contra modificações não autorizadas no canal que levariam os usuários a executar código malicioso.

source: As a user, you must provide a @dfn{channel introduction} in your channels file so that Guix knows how to authenticate its first commit. A channel specification, including its introduction, looks something along these lines:
pt_br: Como usuário, você deve fornecer uma @dfn{introdução de canal} no seu arquivo de canais para que o Guix saiba como autenticar seu primeiro commit. Uma especificação de canal, incluindo sua introdução, parece algo como estas linhas:

source: (channel (name 'some-channel) (url "https://example.org/some-channel.git") (introduction (make-channel-introduction "6f0d8cc0d88abb59c324b2990bfee2876016bb86" (openpgp-fingerprint "CABB A931 C0FF EEC6 900D 0CFB 090B 1199 3D9A EBB5"))))
pt_br: (channel (name 'algum-canal) (url "https://example.org/algum-canal.git") (introduction (make-channel-introduction "6f0d8cc0d88abb59c324b2990bfee2876016bb86" (openpgp-fingerprint "CABB A931 C0FF EEC6 900D 0CFB 090B 1199 3D9A EBB5"))))

source: The specification above shows the name and URL of the channel. The call to @code{make-channel-introduction} above specifies that authentication of this channel starts at commit @code{6f0d8cc@dots{}}, which is signed by the OpenPGP key with fingerprint @code{CABB A931@dots{}}.
pt_br: A especificação acima mostra o nome e a URL do canal. A chamada para @code{make-channel-introduction} acima especifica que a autenticação deste canal começa no commit @code{6f0d8cc@dots{}}, que é assinado pela chave OpenPGP com impressão digital @code{CABB A931@dots{}}.

source: For the main channel, called @code{guix}, you automatically get that information from your Guix installation. For other channels, include the channel introduction provided by the channel authors in your @file{channels.scm} file. Make sure you retrieve the channel introduction from a trusted source since that is the root of your trust.
pt_br: Para o canal principal, chamado @code{guix}, você obtém automaticamente essas informações da sua instalação Guix. Para outros canais, inclua a introdução do canal fornecida pelos autores do canal no seu arquivo @file{channels.scm}. Certifique-se de recuperar a introdução do canal de uma fonte confiável, pois essa é a raiz da sua confiança.

source: If you're curious about the authentication mechanics, read on!
pt_br: Se você está curioso sobre a mecânica de autenticação, continue lendo!

source: When running @command{guix pull}, Guix will first compile the definitions of every available package. This is an expensive operation for which substitutes (@pxref{Substitutes}) may be available. The following snippet in @file{channels.scm} will ensure that @command{guix pull} uses the latest commit with available substitutes for the package definitions: this is done by querying the continuous integration server at @url{https://ci.guix.gnu.org}.
pt_br: Ao executar @command{guix pull}, o Guix primeiro compilará as definições de cada pacote disponível. Esta é uma operação cara para a qual substitutos (@pxref{Substitutes}) podem estar disponíveis. O seguinte snippet em @file{channels.scm} garantirá que o @command{guix pull} use o commit mais recente com substitutos disponíveis para as definições de pacote: isso é feito consultando o servidor de integração contínua em @url{https://ci.guix.gnu.org}.

source: Note that this does not mean that all the packages that you will install after running @command{guix pull} will have available substitutes. It only ensures that @command{guix pull} will not try to compile package definitions. This is particularly useful when using machines with limited resources.
pt_br: Note que isso não significa que todos os pacotes que você instalará após executar @command{guix pull} terão substitutos disponíveis. Isso apenas garante que @command{guix pull} não tentará compilar definições de pacotes. Isso é particularmente útil ao usar máquinas com recursos limitados.

source: personal packages (channels)
pt_br: pacotes pessoais (canais)

source: channels, for personal packages
pt_br: canais, para pacotes pessoais

source: Let's say you have a bunch of custom package variants or personal packages that you think would make little sense to contribute to the Guix project, but would like to have these packages transparently available to you at the command line. By creating a @dfn{channel}, you can use and publish such a package collection. This involves the following steps:
pt_br: Digamos que você tenha um monte de variantes de pacotes personalizados ou pacotes pessoais que você acha que faria pouco sentido contribuir para o projeto Guix, mas gostaria de ter esses pacotes disponíveis de forma transparente para você na linha de comando. Ao criar um @dfn{canal}, você pode usar e publicar tal coleção de pacotes. Isso envolve as seguintes etapas:

source: A channel lives in a Git repository so the first step, when creating a channel, is to create its repository:
pt_br: Um canal fica em um repositório Git, então o primeiro passo, ao criar um canal, é criar seu repositório:

source: mkdir my-channel cd my-channel git init
pt_br: mkdir meu-canal cd meu-canal git init

source: The next step is to create files containing package modules (@pxref{Package Modules}), each of which will contain one or more package definitions (@pxref{Defining Packages}). A channel can provide things other than packages, such as build systems or services; we're using packages as it's the most common use case.
pt_br: O próximo passo é criar arquivos contendo módulos de pacote (@pxref{Package Modules}), cada um dos quais conterá uma ou mais definições de pacote (@pxref{Defining Packages}). Um canal pode fornecer coisas além de pacotes, como sistemas de compilação ou serviços; estamos usando pacotes, pois é o caso de uso mais comum.

source: For example, Alice might want to provide a module called @code{(alice packages greetings)} that will provide her favorite ``hello world'' implementations. To do that Alice will create a directory corresponding to that module name.
pt_br: Por exemplo, Alice pode querer fornecer um módulo chamado @code{(alice packages greetings)} que fornecerá suas implementações favoritas de ``hello world''. Para fazer isso, Alice criará um diretório correspondente ao nome desse módulo.

source: You can name your package modules however you like; the main constraint to keep in mind is to avoid name clashes with other package collections, which is why our hypothetical Alice wisely chose the @code{(alice packages @dots{})} name space.
pt_br: Você pode nomear seus módulos de pacote como quiser; a principal restrição a ter em mente é evitar conflitos de nomes com outras coleções de pacotes, e é por isso que nossa hipotética Alice sabiamente escolheu o namespace @code{(alice packages @dots{})}.

source: Note that you can also place modules in a sub-directory of the repository; @pxref{Package Modules in a Sub-directory}, for more info on that.
pt_br: Observe que você também pode colocar módulos em um subdiretório do repositório; @pxref{Package Modules in a Sub-directory}, para mais informações sobre isso.

source: With this first module in place, the next step is to test the packages it provides. This can be done with @command{guix build}, which needs to be told to look for modules in the Git checkout. For example, assuming @code{(alice packages greetings)} provides a package called @code{hi-from-alice}, Alice will run this command from the Git checkout:
pt_br: Com este primeiro módulo em funcionamento, o próximo passo é testar os pacotes que ele fornece. Isso pode ser feito com @command{guix build}, que precisa ser informado para procurar módulos no checkout do Git. Por exemplo, supondo que @code{(alice packages greetings)} forneça um pacote chamado @code{hi-from-alice}, Alice executará este comando do checkout do Git:

source: ... where @code{-L.} adds the current directory to Guile's load path (@pxref{Load Paths,,, guile, GNU Guile Reference Manual}).
pt_br: ... onde @code{-L.} adiciona o diretório atual ao caminho de carregamento do Guile (@pxref{Load Paths,,, guile, Manual de referência do GNU Guile}).

source: It might take Alice a few iterations to obtain satisfying package definitions. Eventually Alice will commit this file:
pt_br: Pode levar algumas iterações para Alice obter definições de pacote satisfatórias. Eventualmente, Alice fará commit deste arquivo:

source: As a channel author, consider bundling authentication material with your channel so that users can authenticate it. @xref{Channel Authentication}, and @ref{Specifying Channel Authorizations}, for info on how to do it.
pt_br: Como autor de um canal, considere agrupar material de autenticação com seu canal para que os usuários possam autenticá-lo. @xref{Channel Authentication} e @ref{Specifying Channel Authorizations} para obter informações sobre como fazer isso.

source: To use Alice's channel, anyone can now add it to their channel file (@pxref{Specifying Additional Channels}) and run @command{guix pull} (@pxref{Invoking guix pull}):
pt_br: Para usar o canal de Alice, qualquer pessoa pode adicioná-lo ao seu arquivo de canal (@pxref{Specifying Additional Channels}) e executar @command{guix pull} (@pxref{Invoking guix pull}):

source: Guix will now behave as if the root directory of that channel's Git repository had been permanently added to the Guile load path. In this example, @code{(alice packages greetings)} will automatically be found by the @command{guix} command.
pt_br: Guix agora se comportará como se o diretório raiz do repositório Git daquele canal tivesse sido adicionado permanentemente ao caminho de carregamento do Guile. Neste exemplo, @code{(alice packages greetings)} será encontrado automaticamente pelo comando @command{guix}.

source: Before you publish your channel, we would like to share a few words of caution:
pt_br: Antes de publicar seu canal, gostaríamos de compartilhar algumas palavras de cautela:

source: Before publishing a channel, please consider contributing your package definitions to Guix proper (@pxref{Contributing}). Guix as a project is open to free software of all sorts, and packages in Guix proper are readily available to all Guix users and benefit from the project's quality assurance process.
pt_br: Antes de publicar um canal, considere contribuir com suas definições de pacote para o Guix propriamente dito (@pxref{Contributing}). O Guix como um projeto é aberto a software livre de todos os tipos, e os pacotes no Guix propriamente dito estão prontamente disponíveis para todos os usuários do Guix e se beneficiam do processo de garantia de qualidade do projeto.

source: Corollary: if you're using an external channel and that channel breaks, please @emph{report the issue to the channel authors}, not to the Guix project.
pt_br: Corolário: se você estiver usando um canal externo e esse canal quebrar, @emph{reporte o problema aos autores do canal}, não ao projeto Guix.

source: You've been warned! Having said this, we believe external channels are a practical way to exert your freedom to augment Guix' package collection and to share your improvements, which are basic tenets of @uref{https://www.gnu.org/philosophy/free-sw.html, free software}. Please email us at @email{guix-devel@@gnu.org} if you'd like to discuss this.
pt_br: Você foi avisado! Dito isso, acreditamos que canais externos são uma maneira prática de exercer sua liberdade para aumentar a coleção de pacotes do Guix e compartilhar suas melhorias, que são princípios básicos do @uref{https://www.gnu.org/philosophy/free-sw.html, software livre}. Por favor, envie um e-mail para @email{guix-devel@@gnu.org} se você quiser discutir isso.

source: subdirectory, channels
pt_br: subdiretório, canais

source: As a channel author, you may want to keep your channel modules in a sub-directory. If your modules are in the sub-directory @file{guix}, you must add a meta-data file @file{.guix-channel} that contains:
pt_br: Como autor de canal, você pode querer manter seus módulos de canal em um subdiretório. Se seus módulos estiverem no subdiretório @file{guix}, você deve adicionar um arquivo de metadados @file{.guix-channel} que contenha:

source: The modules must be @b{underneath} the specified directory, as the @code{directory} changes Guile's @code{load-path}. For example, if @file{.guix-channel} has @code{(directory "base")}, then a module defined as @code{(define-module (gnu packages fun))} must be located at @code{base/gnu/packages/fun.scm}.
pt_br: Os módulos devem estar @b{abaixo} do diretório especificado, pois o diretório @code{directory} altera o @code{load-path} do Guile. Por exemplo, se @file{.guix-channel} tiver @code{(directory "base")}, então um módulo definido como @code{(define-module (gnu packages fun))} deve estar localizado em @code{base/gnu/packages/fun.scm}.

source: Doing this allows for only parts of a repository to be used as a channel, as Guix expects valid Guile modules when pulling. For instance, @command{guix deploy} machine configuration files are not valid Guile modules, and treating them as such would make @command{guix pull} fail.
pt_br: Fazer isso permite que apenas partes de um repositório sejam usadas como um canal, pois o Guix espera módulos Guile válidos ao puxar. Por exemplo, os arquivos de configuração de máquina @command{guix deploy} não são módulos Guile válidos, e tratá-los como tal faria com que @command{guix pull} falhasse.

source: dependencies, channels
pt_br: dependências, canais

source: meta-data, channels
pt_br: metadados, canais

source: Channel authors may decide to augment a package collection provided by other channels. They can declare their channel to be dependent on other channels in a meta-data file @file{.guix-channel}, which is to be placed in the root of the channel repository.
pt_br: Os autores de canais podem decidir aumentar uma coleção de pacotes fornecida por outros canais. Eles podem declarar que seu canal é dependente de outros canais em um arquivo de metadados @file{.guix-channel}, que deve ser colocado na raiz do repositório do canal.

source: The meta-data file should contain a simple S-expression like this:
pt_br: O arquivo de metadados deve conter uma expressão S simples como esta:

source: (channel (version 0) (dependencies (channel (name some-collection) (url "https://example.org/first-collection.git")
pt_br: (channel (version 0) (dependencies (channel (name algum-coleção) (url "https://example.org/first-collection.git")

source: In the above example this channel is declared to depend on two other channels, which will both be fetched automatically. The modules provided by the channel will be compiled in an environment where the modules of all these declared channels are available.
pt_br: No exemplo acima, este canal é declarado para depender de dois outros canais, que serão buscados automaticamente. Os módulos fornecidos pelo canal serão compilados em um ambiente onde os módulos de todos esses canais declarados estão disponíveis.

source: For the sake of reliability and maintainability, you should avoid dependencies on channels that you don't control, and you should aim to keep the number of dependencies to a minimum.
pt_br: Por uma questão de confiabilidade e manutenibilidade, você deve evitar dependências em canais que você não controla e deve tentar manter o número de dependências no mínimo.

source: channel authorizations
pt_br: autorizações de canal

source: As we saw above, Guix ensures the source code it pulls from channels comes from authorized developers. As a channel author, you need to specify the list of authorized developers in the @file{.guix-authorizations} file in the channel's Git repository. The authentication rule is simple: each commit must be signed by a key listed in the @file{.guix-authorizations} file of its parent commit(s)@footnote{Git commits form a @dfn{directed acyclic graph} (DAG). Each commit can have zero or more parents; ``regular'' commits have one parent and merge commits have two parent commits. Read @uref{https://eagain.net/articles/git-for-computer-scientists/, @i{Git for Computer Scientists}} for a great overview.} The @file{.guix-authorizations} file looks like this:
pt_br: Como vimos acima, o Guix garante que o código-fonte que ele extrai dos canais vem de desenvolvedores autorizados. Como autor de um canal, você precisa especificar a lista de desenvolvedores autorizados no arquivo @file{.guix-authorizations} no repositório Git do canal. A regra de autenticação é simples: cada commit deve ser assinado por uma chave listada no arquivo @file{.guix-authorizations} de seu(s) commit(s) pai(s)@footnote{Os commits do Git formam um @dfn{gráfico acíclico direcionado} (DAG). Cada commit pode ter zero ou mais pais; os commits ``regulares'' têm um pai e os commits de mesclagem têm dois commits pais. Leia @uref{https://eagain.net/articles/git-for-computer-scientists/, @i{Git para cientistas da computação}} para uma ótima visão geral.} O arquivo @file{.guix-authorizations} se parece com isso:

source: ;; Example '.guix-authorizations' file.
pt_br: ;; Exemplo de arquivo '.guix-authorizations'.

source: Each fingerprint is followed by optional key/value pairs, as in the example above. Currently these key/value pairs are ignored.
pt_br: Cada impressão digital é seguida por pares chave/valor opcionais, como no exemplo acima. Atualmente, esses pares chave/valor são ignorados.

source: This authentication rule creates a chicken-and-egg issue: how do we authenticate the first commit? Related to that: how do we deal with channels whose repository history contains unsigned commits and lack @file{.guix-authorizations}? And how do we fork existing channels?
pt_br: Esta regra de autenticação cria um problema do tipo "ovo e galinha": como autenticamos o primeiro commit? Relacionado a isso: como lidamos com canais cujo histórico de repositório contém commits não assinados e não tem @file{.guix-authorizations}? E como bifurcamos canais existentes?

source: channel introduction
pt_br: introdução do canal

source: Channel introductions answer these questions by describing the first commit of a channel that should be authenticated. The first time a channel is fetched with @command{guix pull} or @command{guix time-machine}, the command looks up the introductory commit and verifies that it is signed by the specified OpenPGP key. From then on, it authenticates commits according to the rule above. Authentication fails if the target commit is neither a descendant nor an ancestor of the introductory commit.
pt_br: As introduções de canal respondem a essas perguntas descrevendo o primeiro commit de um canal que deve ser autenticado. Na primeira vez que um canal é buscado com @command{guix pull} ou @command{guix time-machine}, o comando procura o commit introdutório e verifica se ele está assinado pela chave OpenPGP especificada. A partir daí, ele autentica os commits de acordo com a regra acima. A autenticação falha se o commit de destino não for descendente nem ancestral do commit introdutório.

source: Additionally, your channel must provide all the OpenPGP keys that were ever mentioned in @file{.guix-authorizations}, stored as @file{.key} files, which can be either binary or ``ASCII-armored''. By default, those @file{.key} files are searched for in the branch named @code{keyring} but you can specify a different branch name in @code{.guix-channel} like so:
pt_br: Além disso, seu canal deve fornecer todas as chaves OpenPGP que já foram mencionadas em @file{.guix-authorizations}, armazenadas como arquivos @file{.key}, que podem ser binários ou ``ASCII-armored''. Por padrão, esses arquivos @file{.key} são pesquisados no branch chamado @code{keyring}, mas você pode especificar um nome de branch diferente em @code{.guix-channel} assim:

source: To summarize, as the author of a channel, there are three things you have to do to allow users to authenticate your code:
pt_br: Para resumir, como autor de um canal, há três coisas que você precisa fazer para permitir que os usuários autentiquem seu código:

source: Export the OpenPGP keys of past and present committers with @command{gpg --export} and store them in @file{.key} files, by default in a branch named @code{keyring} (we recommend making it an @dfn{orphan branch}).
pt_br: Exporte as chaves OpenPGP de contribuidores anteriores e atuais com @command{gpg --export} e armazene-as em arquivos @file{.key}, por padrão em uma ramificação chamada @code{keyring} (recomendamos torná-la uma @dfn{ramificação órfã}).

source: Introduce an initial @file{.guix-authorizations} in the channel's repository. Do that in a signed commit (@pxref{Commit Access}, for information on how to sign Git commits).
pt_br: Introduza um @file{.guix-authorizations} inicial no repositório do canal. Faça isso em um commit assinado (@pxref{Commit Access}, para obter informações sobre como assinar commits do Git).

source: Advertise the channel introduction, for instance on your channel's web page. The channel introduction, as we saw above, is the commit/key pair---i.e., the commit that introduced @file{.guix-authorizations}, and the fingerprint of the OpenPGP used to sign it.
pt_br: Anuncie a introdução do canal, por exemplo, na página web do seu canal. A introdução do canal, como vimos acima, é o par commit/chave---i.e., o commit que introduziu @file{.guix-authorizations}, e a impressão digital do OpenPGP usada para assiná-lo.

source: Before pushing to your public Git repository, you can run @command{guix git authenticate} to verify that you did sign all the commits you are about to push with an authorized key:
pt_br: Antes de enviar para seu repositório Git público, você pode executar @command{guix git authenticate} para verificar se você assinou todos os commits que está prestes a enviar com uma chave autorizada:

source: where @var{commit} and @var{signer} are your channel introduction. @xref{Invoking guix git authenticate}, for details.
pt_br: onde @var{commit} e @var{signer} são a introdução do seu canal. @xref{Invoking guix git authenticate}, para detalhes.
