Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: If you are familiar with Python's @samp{virtualenv}, you can think of a profile as a kind of universal @samp{virtualenv} that can hold any kind of software whatsoever, not just Python software. Furthermore, profiles are self-sufficient: they capture all the runtime dependencies which guarantees that all programs within a profile will always work at any point in time.
it: Se hai familiarità con @samp{virtualenv} di Python, puoi pensare a un profilo come a una sorta di @samp{virtualenv} universale che può contenere qualsiasi tipo di software, non solo software Python. Inoltre, i profili sono autosufficienti: catturano tutte le dipendenze di runtime, il che garantisce che tutti i programmi all'interno di un profilo funzioneranno sempre in qualsiasi momento.
pt_br: Se você estiver familiarizado com o @samp{virtualenv} do Python, você pode pensar em um perfil como um tipo de @samp{virtualenv} universal que pode conter qualquer tipo de software, não apenas software Python. Além disso, os perfis são autossuficientes: eles capturam todas as dependências de tempo de execução, o que garante que todos os programas dentro de um perfil sempre funcionarão em qualquer ponto do tempo.
sk: Ak ste oboznámení s @samp{virtualenv} v Pythone, môžete si profily predstaviť ako všeobecné @samp{virtualenv}, ktoré môžu obsahovať ľubovoľné programové vybavenie, a nie len to založené na Pythone. Okrem toho, profily sú sebestačné: zachytávajú všetky závislosti potrebné pre beh programov, čo zaručuje, že všetky programy v profile budú fungovať vždy a v každom čase.

source: Multiple profiles have many benefits:
it: Più profili offrono molti vantaggi:
pt_br: Perfis múltiplos têm muitos benefícios:
sk: Viacero profilov má mnoho výhod:

source: Clean semantic separation of the various packages a user needs for different contexts.
it: Pulita separazione semantica dei vari pacchetti di cui un utente ha bisogno per diversi contesti.
pt_br: Separação semântica limpa dos vários pacotes que um usuário precisa para diferentes contextos.
sk: Jasné významové oddelenie rozličných balíkov, ktoré využívate v rôznych súvislostiach.

source: Multiple profiles can be made available into the environment either on login or within a dedicated shell.
it: È possibile rendere disponibili più profili nell'ambiente sia all'accesso che all'interno di una shell dedicata.
pt_br: Vários perfis podem ser disponibilizados no ambiente no login ou em um shell dedicado.
sk: Viacero profilov možno v prostredí sprístupniť buď pri prihlásení, alebo vrámci vyhradeného shellu.

source: Profiles can be loaded on demand. For instance, the user can use multiple shells, each of them running different profiles.
it: I profili possono essere caricati su richiesta. Ad esempio, l'utente può usare più shell, ognuna delle quali esegue profili diversi.
pt_br: Os perfis podem ser carregados sob demanda. Por exemplo, o usuário pode usar vários shells, cada um deles executando perfis diferentes.
sk: Profily možno načítať na požiadanie. Napríklad, môžete používať viacero shellov a v každom z nich môže bežať iný profil.

source: Isolation: Programs from one profile will not use programs from the other, and the user can even install different versions of the same programs to the two profiles without conflict.
it: Isolamento: i programmi di un profilo non utilizzeranno i programmi dell'altro, e l'utente può persino installare diverse versioni degli stessi programmi nei due profili senza conflitto.
pt_br: Isolamento: programas de um perfil não usarão programas do outro, e o usuário pode até instalar versões diferentes dos mesmos programas nos dois perfis sem conflito.
sk: Oddelenie: Programy z jedného profilu nebudú používať programy z druhého. Môžete tiež nainštalovať rôzne vydania rovnakých programov do dvoch rôznych profilov bez vzájomných rozporov.

source: Deduplication: Profiles share dependencies that happens to be the exact same. This makes multiple profiles storage-efficient.
it: Deduplicazione: i profili condividono dipendenze che risultano essere esattamente le stesse. Questo rende più profili efficienti in termini di archiviazione.
pt_br: Deduplicação: Perfis compartilham dependências que são exatamente as mesmas. Isso torna o armazenamento de múltiplos perfis eficiente.
sk: Znásobenie: Profily môžu zdieľať rovnaké závislosti, čo umožňuje ušetriť úložné miesto.

source: Reproducible: when used with declarative manifests, a profile can be fully specified by the Guix commit that was active when it was set up. This means that the exact same profile can be @uref{https://guix.gnu.org/blog/2018/multi-dimensional-transactions-and-rollbacks-oh-my/, set up anywhere and anytime}, with just the commit information. See the section on @ref{Reproducible profiles}.
it: Riproducibile: se utilizzato con manifest dichiarativi, un profilo può essere completamente specificato dal commit Guix attivo al momento della sua configurazione. Ciò significa che lo stesso identico profilo può essere @uref{https://guix.gnu.org/blog/2018/multi-dimensional-transactions-and-rollbacks-oh-my/, configurato ovunque e in qualsiasi momento}, con le sole informazioni di commit. Consulta la sezione sui @ref{Reproducible profiles}.
pt_br: Reproduzível: quando usado com manifestos declarativos, um perfil pode ser totalmente especificado pelo commit do Guix que estava ativo quando foi configurado. Isso significa que o mesmo perfil exato pode ser @uref{https://guix.gnu.org/blog/2018/multi-dimensional-transactions-and-rollbacks-oh-my/, configurado em qualquer lugar e a qualquer hora}, com apenas as informações de commit. Veja a seção sobre @ref{Reproducible profiles}.
sk: Opakovateľné: pri použití so zadaným balíkospisom môže byť profil jasne určený úpravou Guixu, ktorá bola použitá pri jeho spustení. To znamená, že ten istý profil možno @uref{https://guix.gnu.org/blog/2018/multi-dimensional-transactions-and-rollbacks-oh-my/, napodobniť kdekoľvek a kedykoľvek} iba na základe údaju o použitej úprave. Viď oddiel @ref{Reproducible profiles}.

source: Easier upgrades and maintenance: Multiple profiles make it easy to keep package listings at hand and make upgrades completely frictionless.
it: Aggiornamenti e manutenzione più semplici: più profili rendono facile avere a portata di mano gli elenchi dei pacchetti e rendono gli aggiornamenti completamente senza attriti.
pt_br: Atualizações e manutenção mais fáceis: vários perfis facilitam a manutenção de listas de pacotes em mãos e tornam as atualizações completamente sem atrito.
sk: Jednoduchšie aktualizácie a spravovanie: Pri viacerých profiloch je jednoduché udržiavať zoznamy balíkov poruke a zaistiť ich bezstarostné aktualizovanie.

source: Concretely, here follows some typical profiles:
it: Concretamente, ecco alcuni profili tipici:
pt_br: Concretamente, seguem alguns perfis típicos:
sk: Niekoľko príznačných a často používaných profilov:

source: The dependencies of a project you are working on.
it: Le dipendenze di un progetto su cui stai lavorando.
pt_br: As dependências de um projeto no qual você está funcionando.
sk: Závislosti projektu, na ktorom pracujete.

source: Your favourite programming language libraries.
it: Le tue librerie di linguaggio di programmazione preferite.
pt_br: Suas bibliotecas de linguagens de programação favoritas.
sk: Knižnice vášho obľúbeného programovacieho jazyka.

source: Laptop-specific programs (like @samp{powertop}) that you don't need on a desktop.
it: Programmi specifici per laptop (come @samp{powertop}) di cui non hai bisogno su un desktop.
pt_br: Programas específicos para laptop (como @samp{powertop}) que você não precisa em um desktop.
sk: Programy príznačné pre prenosný počítač (ako @samp{powertop}), ktoré nepotrebujete na stolnom počítači.

source: @TeX{}live (this one can be really useful when you need to install just one package for this one document you've just received over email).
it: @TeX{}live (questo può essere davvero utile quando hai bisogno di installare un solo pacchetto per un documento che hai appena ricevuto via email).
pt_br: @TeX{}live (este pode ser muito útil quando você precisa instalar apenas um pacote para este documento que acabou de receber por e-mail).
sk: @TeX{}live (tento sa môže zvlášť hodiť, keď potrebujete nainštalovať len jeden balík pre dokument, ktorý vám práve prišiel elektronickou poštou).

source: Games.
it: Giochi.
pt_br: Jogos.
ru: Игры.
sk: Hry.
sv: Spel.

source: Let's dive in the set up!
it: Immergiamoci nella configurazione!
pt_br: Vamos mergulhar na configuração!
sk: Ponorme sa do toho!

source: A Guix profile can be set up @i{via} a @dfn{manifest}. A manifest is a snippet of Scheme code that specifies the set of packages you want to have in your profile; it looks like this:
it: Un profilo Guix può essere configurato @i{via} un @dfn{manifest}. Un manifest è uno snippet di codice Scheme che specifica l'insieme di pacchetti che desideri avere nel tuo profilo; assomiglia a questo:
pt_br: Um perfil Guix pode ser configurado @i{via} um @dfn{manifest}. Um manifesto é um trecho de código Scheme que especifica o conjunto de pacotes que você quer ter em seu perfil; parece com isso:
sk: Guixovský profil možno nastaviť pomocou @dfn{balíkospisu}. Balíkospis je kúsok kódu určujúci množinu balíkov, ktorú chcete zahrnúť do vášho profilu; vyzerá takto:

source: (specifications->manifest '("package-1" ;; Version 1.3 of package-2. "package-2@@1.3" ;; The "lib" output of package-3. "package-3:lib" ; ... "package-N"))
it: (specifications->manifest '("pacchetto-1" ;; Versione 1.3 del pacchetto-2. "pacchetto-2@@1.3" ;; L'output "lib" del pacchetto-3. "pacchetto-3:lib" ; ... "pacchetto-N"))
pt_br: (specifications->manifest '("pacote-1" ;; Versão 1.3 do pacote-2. "pacote-2@@1.3" ;; A saída "lib" do pacote-3. "pacote-3:lib" ; ... "pacote-N"))
sk: (specifications->manifest '("balik-1" ;; Vydanie 1.3 balíka balik-2. "balik-2@@1.3" ;; Výstup „lib“ balíka balik-3. "balik-3:lib" ; ... "balik-N"))

source: @xref{Writing Manifests,,, guix, GNU Guix Reference Manual}, for more information about the syntax.
it: @xref{Scrivere manifesti,,, guix.it, Manuale di riferimento GNU Guix}, per maggiori informazioni sulla sintassi.
pt_br: @xref{Escrevendo manifestos,,, guix.pt_BR, Manual de referência do GNU Guix}, para mais informações sobre a sintaxe.
sk: @xref{Writing Manifests,,, guix, GNU Guix Reference Manual} pre viac podrobností o skladbe.

source: We can create a manifest specification per profile and install them this way:
it: Possiamo creare una specifica di manifest per ogni profilo e installarli in questo modo:
pt_br: Podemos criar uma especificação de manifesto por perfil e instalá-los desta maneira:
sk: Môžeme si vytvoriť balíkospis pre každý profil a nainštalovať ich nasledovne:

source: GUIX_EXTRA_PROFILES=$HOME/.guix-extra-profiles mkdir -p "$GUIX_EXTRA_PROFILES"/my-project # if it does not exist yet guix package --manifest=/path/to/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project
it: GUIX_EXTRA_PROFILES=$HOME/.guix-extra-profiles mkdir -p "$GUIX_EXTRA_PROFILES"/my-project # se non esiste ancora guix package --manifest=/percorso/a/guix-my-project-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/my-project/my-project
pt_br: GUIX_EXTRA_PROFILES=$HOME/.guix-extra-profiles mkdir -p "$GUIX_EXTRA_PROFILES"/meu-projeto # se ainda não existir guix package --manifest=/caminho/para/guix-meu-projeto-manifest.scm \ --profile="$GUIX_EXTRA_PROFILES"/meu-projeto/meu-projeto
sk: GUIX_DOPLNKOVE_PROFILY=$HOME/.guix-extra-profiles mkdir -p "$GUIX_DOPLNKOVE_PROFILY"/moj-projekt # ak ešte nejestvuje guix package --manifest=/cesta/ku/guix-balikospis-mojho-projektu.scm \ --profile="$GUIX_DOPLNKOVE_PROFILY"/moj-projekt/moj-projekt

source: Here we set an arbitrary variable @samp{GUIX_EXTRA_PROFILES} to point to the directory where we will store our profiles in the rest of this article.
it: Qui impostiamo una variabile arbitraria @samp{GUIX_EXTRA_PROFILES} per indicare la directory dove memorizzeremo i nostri profili nel resto di questo articolo.
pt_br: Aqui definimos uma variável arbitrária @samp{GUIX_EXTRA_PROFILES} para apontar para o diretório onde armazenaremos nossos perfis no restante deste artigo.
sk: Tu sme si nastavili premennú s ľubovoľne zvoleným názvom @samp{GUIX_DOPLNKOVE_PROFILY} odkazujúcu na priečinok, do ktorého si uložíme naše profily vrámci tohto článku.

source: Placing all your profiles in a single directory, with each profile getting its own sub-directory, is somewhat cleaner. This way, each sub-directory will contain all the symlinks for precisely one profile. Besides, ``looping over profiles'' becomes obvious from any programming language (e.g.@: a shell script) by simply looping over the sub-directories of @samp{$GUIX_EXTRA_PROFILES}.
it: Posizionare tutti i tuoi profili in una singola directory, con ogni profilo che ottiene la propria sottodirectory, è un po' più pulito. In questo modo, ogni sottodirectory conterrà tutti i symlink per un solo profilo. Inoltre, ``iterare sui profili'' diventa ovvio da qualsiasi linguaggio di programmazione (ad esempio: uno script di shell) semplicemente iterando sulle sottodirectory di @samp{$GUIX_EXTRA_PROFILES}.
pt_br: Colocar todos os seus perfis em um único diretório, com cada perfil recebendo seu próprio subdiretório, é um pouco mais limpo. Dessa forma, cada subdiretório conterá todos os links simbólicos para precisamente um perfil. Além disso, ``fazer loop sobre perfis'' se torna óbvio em qualquer linguagem de programação (por exemplo, um script de shell) simplesmente fazendo loop sobre os subdiretórios de @samp{$GUIX_EXTRA_PROFILES}.
sk: Dáva zmysel uložiť si všetky svoje profily do jedného priečinka, v ktorom má každý z nich pridelený osobitný podpriečinok. Takto bude každý podpriečinok obsahovať symbolické odkazy presne jedného profilu. Okrem toho, bude ľahké získať zoznam profilov v hociktorom programovacom jazyku (napr.@: skript shellu) pomocou jednoduchej slučky prechádzajúcej podpriečinkami v @samp{GUIX_DOPLNKOVE_PROFILY}.

source: Note that it's also possible to loop over the output of
it: Nota che è anche possibile scorrere l'output di
pt_br: Observe que também é possível fazer um loop na saída de
sk: Všimnite si, že slučkou tiež možno prechádzať výstup

source: although you'll probably have to filter out @file{~/.config/guix/current}.
it: anche se probabilmente dovrai filtrare @file{~/.config/guix/current}.
pt_br: embora você provavelmente tenha que filtrar @file{~/.config/guix/current}.
sk: aj keď budete pravdepodobne musieť vynechať @file{~/.config/guix/current}.

source: To enable all profiles on login, add this to your @file{~/.bash_profile} (or similar):
it: Per abilitare tutti i profili all'accesso, aggiungi questo al tuo @file{~/.bash_profile} (o simile):
pt_br: Para habilitar todos os perfis no login, adicione isto ao seu @file{~/.bash_profile} (ou similar):
sk: Pre nastavenie všetkých profilov po prihlásení, pridajte toto do vášho @file{~/.bash_profile} (alebo podobného súboru):

source: Note to Guix System users: the above reflects how your default profile @file{~/.guix-profile} is activated from @file{/etc/profile}, that latter being loaded by @file{~/.bashrc} by default.
it: Nota per gli utenti di Guix System: quanto sopra riflette come il tuo profilo predefinito @file{~/.guix-profile} viene attivato da @file{/etc/profile}, quest'ultimo caricato da @file{~/.bashrc} per impostazione predefinita.
pt_br: Nota para usuários do sistema Guix: o acima reflete como seu perfil padrão @file{~/.guix-profile} é ativado a partir de @file{/etc/profile}, sendo este último carregado por @file{~/.bashrc} por padrão.
sk: Poznámka pre používateľov systému Guix: horeuvedené odráža to, ako sa váš predvolený profil @file{~/.guix-profile} nastavuje z @file{/etc/profile}, ktorý je predvolene načítaný vrámci @file{~/.bashrc}.

source: You can obviously choose to only enable a subset of them:
it: Puoi ovviamente scegliere di abilitarne solo un sottoinsieme:
pt_br: Obviamente, você pode escolher habilitar apenas um subconjunto deles:
sk: Môžete sa samozrejme rozhodnúť, že z nich načítate len niektoré:

source: When a profile is off, it's straightforward to enable it for an individual shell without "polluting" the rest of the user session:
it: Quando un profilo è disabilitato, è semplice abilitarlo per una singola shell senza "inquinare" il resto della sessione utente:
pt_br: Quando um perfil está desativado, é fácil habilitá-lo para um shell individual sem "poluir" o restante da sessão do usuário:
sk: Keď je profil vypnutý, je jednoduché ho zapnúť vo vyhradenom shelle bez „znečistenia“ zvyšku sedenia:

source: GUIX_PROFILE="path/to/my-project" ; . "$GUIX_PROFILE"/etc/profile
it: GUIX_PROFILE="percorso/al/mio-progetto" ; . "$GUIX_PROFILE"/etc/profile
sk: GUIX_PROFILE="cesta/k/moj-projekt" ; . "$GUIX_PROFILE"/etc/profile

source: The key to enabling a profile is to @emph{source} its @samp{etc/profile} file. This file contains shell code that exports the right environment variables necessary to activate the software contained in the profile. It is built automatically by Guix and meant to be sourced. It contains the same variables you would get if you ran:
it: La chiave per abilitare un profilo è @emph{source} il suo file @samp{etc/profile}. Questo file contiene codice shell che esporta le variabili d'ambiente corrette necessarie per attivare il software contenuto nel profilo. È costruito automaticamente da Guix e destinato all'esecuzione. Contiene le stesse variabili che otterresti eseguendo:
pt_br: A chave para habilitar um perfil é @emph{source} seu arquivo @samp{etc/profile}. Este arquivo contém código shell que exporta as variáveis de ambiente corretas necessárias para ativar o software contido no perfil. Ele é construído automaticamente pelo Guix e deve ser sourced. Ele contém as mesmas variáveis que você obteria se executasse:
sk: Kľúčovým krok pri zapnutí profilu je @emph{načítanie} jeho súboru @samp{etc/profile}. Tento súbor obsahuje kód shellu, ktorý nastaví tie správne premenné prostredia potrebné pre spojazdnenie programov v profile. Je vytvoreným samotným Guixom a určený na načítanie pomocou príkazu @code{source}. Obsahuje rovnaké premenné ako tie, ktoré by ste získali vykonaním:

source: Once again, see @ref{Invoking guix package,,, guix, GNU Guix Reference Manual} for the command line options.
it: Ancora una volta, vedi @ref{Invocare guix package,,, guix.it, Manuale di riferimento di GNU Guix} per le opzioni della riga di comando.
pt_br: Mais uma vez, veja @ref{Invocando guix package,,, guix.pt_BR, Manual de Referência do GNU Guix} para as opções de linha de comando.
sk: Viď voľby príkazu v @ref{Invoking guix package,,, guix, GNU Guix Reference Manual}.

source: To upgrade a profile, simply install the manifest again:
it: Per aggiornare un profilo, è sufficiente installare di nuovo il manifest:
pt_br: Para atualizar um perfil, basta instalar o manifesto novamente:
sk: Profil môžete aktualizovať opätovnou inštaláciou balíkospisu:

source: guix package -m /path/to/guix-my-project-manifest.scm \ -p "$GUIX_EXTRA_PROFILES"/my-project/my-project
it: guix package -m /percorso/a/guix-my-project-manifest.scm \ -p "$GUIX_EXTRA_PROFILES"/my-project/my-project
pt_br: guix package -m /caminho/para/guix-meu-projeto-manifest.scm \ -p "$GUIX_EXTRA_PROFILES"/meu-projeto/meu-projeto
sk: guix package -m /cesta/ku/guix-balikospis-mojho-projektu.scm \ -p "$GUIX_DOPLNKOVE_PROFILY"/moj-projekt/moj-projekt

source: To upgrade all profiles, it's easy enough to loop over them. For instance, assuming your manifest specifications are stored in @file{~/.guix-manifests/guix-$profile-manifest.scm}, with @samp{$profile} being the name of the profile (e.g.@: "project1"), you could do the following in Bourne shell:
it: Per aggiornare tutti i profili, è abbastanza facile scorrerli. Ad esempio, supponendo che le specifiche del tuo manifest siano archiviate in @file{~/.guix-manifests/guix-$profile-manifest.scm}, con @samp{$profile} che è il nome del profilo (es.: "project1"), potresti fare quanto segue in una shell Bourne:
pt_br: Para atualizar todos os perfis, é fácil fazer um loop sobre eles. Por exemplo, supondo que suas especificações de manifesto estejam armazenadas em @file{~/.guix-manifests/guix-$profile-manifest.scm}, com @samp{$profile} sendo o nome do perfil (por exemplo, "project1"), você pode fazer o seguinte no Bourne shell:
sk: Ak chcete aktualizovať všetky profily, môžete ich jednoducho prechádzať slučkou. Napríklad, predpokladajúc, že váš balíkospis je uložený v @file{~/.guix-manifests/guix-$profil-balikospis.scm}, kde @samp{$profil} je názov profilu (napr.@: „projekt1“), pomocou shellu môžete vykonať nasledovné:

source: Each profile has its own generations:
it: Ogni profilo ha le sue generazioni:
pt_br: Cada perfil tem suas próprias gerações:
sk: Každý profil má svoje vlastné pokolenia:

source: You can roll-back to any generation of a given profile:
it: Puoi tornare indietro a qualsiasi generazione di un dato profilo:
pt_br: Você pode reverter para qualquer geração de um determinado perfil:
sk: Môžete sa vrátiť ku ktorémukoľvek pokoleniu daného profilu:

source: Finally, if you want to switch to a profile without inheriting from the current environment, you can activate it from an empty shell:
it: Infine, se vuoi passare a un profilo senza ereditare dall'ambiente corrente, puoi attivarlo da una shell vuota:
pt_br: Por fim, se você quiser alternar para um perfil sem herdar do ambiente atual, poderá ativá-lo a partir de um shell vazio:
sk: Konečne, ak chcete prepnúť na iný profil bez zdedenia súčasné prostredia, môžete ho zapnúť v prázdnom shelle:

source: Activating a profile essentially boils down to exporting a bunch of environmental variables. This is the role of the @samp{etc/profile} within the profile.
it: L'attivazione di un profilo si riduce essenzialmente all'esportazione di una serie di variabili d'ambiente. Questo è il ruolo del file @samp{etc/profile} all'interno del profilo.
pt_br: Ativar um perfil basicamente se resume a exportar um monte de variáveis ambientais. Essa é a função do @samp{etc/profile} dentro do perfil.
sk: Zapnutie profilu znamená hlavne nastavenie množstva premenných prostredia. Toto je úloha pre @samp{etc/profile} vrámci profilu.

source: Note: Only the environmental variables of the packages that consume them will be set.
it: Nota: verranno impostate solo le variabili d'ambiente dei pacchetti che le consumano.
pt_br: Nota: Somente as variáveis de ambiente dos pacotes que os consomem serão definidas.
sk: Poznámka: Nastavujú sa len premenné prostredia balíkov, ktoré ich používajú.

source: For instance, @samp{MANPATH} won't be set if there is no consumer application for man pages within the profile. So if you need to transparently access man pages once the profile is loaded, you've got two options:
it: Ad esempio, @samp{MANPATH} non verrà impostato se non esiste un'applicazione che consuma le pagine man all'interno del profilo. Quindi, se hai bisogno di accedere in modo trasparente alle pagine man una volta caricato il profilo, hai due opzioni:
pt_br: Por exemplo, @samp{MANPATH} não será definido se não houver um aplicativo de consumidor para páginas de manual dentro do perfil. Então, se você precisar acessar páginas de manual de forma transparente depois que o perfil for carregado, você tem duas opções:
sk: Napríklad, @samp{MANPATH} nebude nastavená ak profil neobsahuje aplikáciu, ktorá túto premennú priamo využíva. Takže, ak chcete po zapnutí profilu jednoducho pristupovať k stránkam pomocníka, máte dve možnosti:

source: Either export the variable manually, e.g.
it: Esporta la variabile manualmente, ad esempio
pt_br: Exporte a variável manualmente, por exemplo
sk: Buď nastavíte túto premennú prostredia ručne, napr.
