Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: This might be helpful to build programs that (usually wrongfully) depend on the kernel version number.
pt_br: Isso pode ser útil para criar programas que (geralmente de forma errada) dependem do número da versão do kernel.

source: Do not keep build logs. By default they are kept under @file{@var{localstatedir}/guix/log}.
pt_br: Não mantenha logs de build. Por padrão, eles são mantidos em @file{@var{localstatedir}/guix/log}.

source: --system=@var{system}
pt_br: --system=@var{sistema}

source: Assume @var{system} as the current system type. By default it is the architecture/kernel pair found at configure time, such as @code{x86_64-linux}.
pt_br: Assuma @var{sistema} como o tipo de sistema atual. Por padrão, é o par arquitetura/kernel encontrado no momento da configuração, como @code{x86_64-linux}.

source: Listen for connections on @var{endpoint}. @var{endpoint} is interpreted as the file name of a Unix-domain socket if it starts with @code{/} (slash sign). Otherwise, @var{endpoint} is interpreted as a host name or host name and port to listen to. Here are a few examples:
pt_br: Ouça conexões em @var{endpoint}. @var{endpoint} é interpretado como o nome do arquivo de um soquete de domínio Unix se ele começar com @code{/} (sinal de barra). Caso contrário, @var{endpoint} é interpretado como um nome de host ou nome de host e porta para ouvir. Aqui estão alguns exemplos:

source: Listen for connections on the @file{/gnu/var/daemon} Unix-domain socket, creating it if needed.
pt_br: Ouça conexões no soquete de domínio Unix @file{/gnu/var/daemon}, criando-o se necessário.

source: daemon, remote access
pt_br: daemon, acesso remoto

source: remote access to the daemon
pt_br: acesso remoto ao daemon

source: daemon, cluster setup
pt_br: daemon, configuração de cluster

source: clusters, daemon setup
pt_br: clusters, configuração do daemon

source: Listen for TCP connections on the network interface corresponding to @code{localhost}, on port 44146.
pt_br: Ouça as conexões TCP na interface de rede correspondente a @code{localhost}, na porta 44146.

source: Listen for TCP connections on the network interface corresponding to @code{128.0.0.42}, on port 1234.
pt_br: Ouça as conexões TCP na interface de rede correspondente ao @code{128.0.0.42}, na porta 1234.

source: This option can be repeated multiple times, in which case @command{guix-daemon} accepts connections on all the specified endpoints. Users can tell client commands what endpoint to connect to by setting the @env{GUIX_DAEMON_SOCKET} environment variable (@pxref{The Store, @env{GUIX_DAEMON_SOCKET}}).
pt_br: Esta opção pode ser repetida várias vezes, nesse caso @command{guix-daemon} aceita conexões em todos os endpoints especificados. Os usuários podem informar aos comandos do cliente a qual endpoint se conectar definindo a variável de ambiente @env{GUIX_DAEMON_SOCKET} (@pxref{The Store, @env{GUIX_DAEMON_SOCKET}}).

source: The daemon protocol is @emph{unauthenticated and unencrypted}. Using @option{--listen=@var{host}} is suitable on local networks, such as clusters, where only trusted nodes may connect to the build daemon. In other cases where remote access to the daemon is needed, we recommend using Unix-domain sockets along with SSH.
pt_br: O protocolo daemon é @emph{unauthenticated and unencrypted}. Usar @option{--listen=@var{host}} é adequado em redes locais, como clusters, onde apenas nós confiáveis podem se conectar ao daemon de compilação. Em outros casos em que o acesso remoto ao daemon é necessário, recomendamos usar soquetes de domínio Unix junto com SSH.

source: When @option{--listen} is omitted, @command{guix-daemon} listens for connections on the Unix-domain socket located at @file{@var{localstatedir}/guix/daemon-socket/socket}.
pt_br: Quando @option{--listen} é omitido, @command{guix-daemon} escuta conexões no soquete de domínio Unix localizado em @file{@var{localstatedir}/guix/daemon-socket/socket}.

source: When using Guix on top of GNU/Linux distribution other than Guix System---a so-called @dfn{foreign distro}---a few additional steps are needed to get everything in place. Here are some of them.
pt_br: Ao usar Guix sobre uma distribuição GNU/Linux que não seja um Guix System --- uma chamada @dfn{distro alheia} --- algumas etapas adicionais são necessárias para colocar tudo no seu lugar. Aqui estão algumas delas.

source: locales, when not on Guix System
pt_br: locales, quando não está no Guix System

source: Packages installed @i{via} Guix will not use the locale data of the host system. Instead, you must first install one of the locale packages available with Guix and then define the @env{GUIX_LOCPATH} environment variable:
pt_br: Pacotes instalados @i{via} Guix não usarão os dados de localidade do sistema host. Em vez disso, você deve primeiro instalar um dos pacotes de localidade disponíveis com Guix e então definir a variável de ambiente @env{GUIX_LOCPATH}:

source: Note that the @code{glibc-locales} package contains data for all the locales supported by the GNU@tie{}libc and weighs in at around 930@tie{}MiB@footnote{The size of the @code{glibc-locales} package is reduced down to about 213@tie{}MiB with store deduplication and further down to about 67@tie{}MiB when using a zstd-compressed Btrfs file system.}. If you only need a few locales, you can define your custom locales package via the @code{make-glibc-utf8-locales} procedure from the @code{(gnu packages base)} module. The following example defines a package containing the various Canadian UTF-8 locales known to the GNU@tie{}libc, that weighs around 14@tie{}MiB:
pt_br: Observe que o pacote @code{glibc-locales} contém dados para todos os locais suportados pela GNU@tie{}libc e pesa cerca de 930@tie{}MiB@footnote{O tamanho do pacote @code{glibc-locales} é reduzido para cerca de 213@tie{}MiB com desduplicação de armazém e ainda mais para cerca de 67@tie{}MiB ao usar um sistema de arquivos Btrfs compactado em zstd.}. Se você precisar apenas de alguns locais, poderá definir seu pacote de locais personalizados por meio do procedimento @code{make-glibc-utf8-locales} do módulo @code{(gnu packages base)}. O exemplo a seguir define um pacote contendo os vários locais UTF-8 canadenses conhecidos pela GNU@tie{}libc, que pesa cerca de 14@tie{}MiB:

source: The @env{GUIX_LOCPATH} variable plays a role similar to @env{LOCPATH} (@pxref{Locale Names, @env{LOCPATH},, libc, The GNU C Library Reference Manual}). There are two important differences though:
pt_br: A variável @env{GUIX_LOCPATH} desempenha um papel similar a @env{LOCPATH} (@pxref{Locale Names, @env{LOCPATH},, libc, The GNU C Library Reference Manual}). Há duas diferenças importantes, no entanto:

source: @env{GUIX_LOCPATH} is honored only by the libc in Guix, and not by the libc provided by foreign distros. Thus, using @env{GUIX_LOCPATH} allows you to make sure the programs of the foreign distro will not end up loading incompatible locale data.
pt_br: @env{GUIX_LOCPATH} é honrado apenas pela libc no Guix, e não pela libc fornecida por distros estrangeiras. Assim, usar @env{GUIX_LOCPATH} permite que você tenha certeza de que os programas da distro estrangeira não acabarão carregando dados de localidade incompatíveis.

source: libc suffixes each entry of @env{GUIX_LOCPATH} with @code{/X.Y}, where @code{X.Y} is the libc version---e.g., @code{2.22}. This means that, should your Guix profile contain a mixture of programs linked against different libc version, each libc version will only try to load locale data in the right format.
pt_br: libc sufixa cada entrada de @env{GUIX_LOCPATH} com @code{/X.Y}, onde @code{X.Y} é a versão libc---por exemplo, @code{2.22}. Isso significa que, caso seu perfil Guix contenha uma mistura de programas vinculados a diferentes versões libc, cada versão libc tentará carregar apenas dados de localidade no formato correto.

source: This is important because the locale data format used by different libc versions may be incompatible.
pt_br: Isso é importante porque o formato de dados de localidade usado por diferentes versões da libc pode ser incompatível.

source: name service switch, glibc
pt_br: troca de serviço de nome, glibc

source: NSS (name service switch), glibc
pt_br: NSS (troca de serviço de nomes), glibc

source: When using Guix on a foreign distro, we @emph{strongly recommend} that the system run the GNU C library's @dfn{name service cache daemon}, @command{nscd}, which should be listening on the @file{/var/run/nscd/socket} socket. Failing to do that, applications installed with Guix may fail to look up host names or user accounts, or may even crash. The next paragraphs explain why.
pt_br: Ao usar o Guix em uma distro alheia, nós @emph{recomendamos fortemente} que o sistema use o @dfn{daemon de cache de serviço de nomes} da biblioteca C do GNU, @command{nscd}, que deve ouvir no soquete @file{/var/run/nscd/socket}. Caso não faça isso, os aplicativos instalados com Guix podem falhar em procurar nomes de máquina e contas de usuário, ou até mesmo travar. Os próximos parágrafos explicam o porquê.

source: The GNU C library implements a @dfn{name service switch} (NSS), which is an extensible mechanism for ``name lookups'' in general: host name resolution, user accounts, and more (@pxref{Name Service Switch,,, libc, The GNU C Library Reference Manual}).
pt_br: A biblioteca GNU C implementa um @dfn{name service switch} (NSS), que é um mecanismo extensível para ``pesquisas de nomes'' em geral: resolução de nomes de host, contas de usuários e muito mais (@pxref{Name Service Switch,,, libc, The GNU C Library Reference Manual}).

source: Network information service (NIS)
pt_br: Serviço de informação de rede (NIS)

source: NIS (Network information service)
pt_br: NIS (Serviço de informação de rede)

source: Being extensible, the NSS supports @dfn{plugins}, which provide new name lookup implementations: for example, the @code{nss-mdns} plugin allow resolution of @code{.local} host names, the @code{nis} plugin allows user account lookup using the Network information service (NIS), and so on. These extra ``lookup services'' are configured system-wide in @file{/etc/nsswitch.conf}, and all the programs running on the system honor those settings (@pxref{NSS Configuration File,,, libc, The GNU C Reference Manual}).
pt_br: Sendo extensível, o NSS suporta @dfn{plugins}, que fornecem novas implementações de pesquisa de nomes: por exemplo, o plugin @code{nss-mdns} permite a resolução de nomes de host @code{.local}, o plugin @code{nis} permite a pesquisa de contas de usuários usando o Network information service (NIS), e assim por diante. Esses "serviços de pesquisa'' extras são configurados em todo o sistema em @file{/etc/nsswitch.conf}, e todos os programas em execução no sistema honram essas configurações (@pxref{NSS Configuration File,,, libc, The GNU C Reference Manual}).

source: When they perform a name lookup---for instance by calling the @code{getaddrinfo} function in C---applications first try to connect to the nscd; on success, nscd performs name lookups on their behalf. If the nscd is not running, then they perform the name lookup by themselves, by loading the name lookup services into their own address space and running it. These name lookup services---the @file{libnss_*.so} files---are @code{dlopen}'d, but they may come from the host system's C library, rather than from the C library the application is linked against (the C library coming from Guix).
pt_br: Quando eles realizam uma pesquisa de nome --- por exemplo chamando a função @code{getaddrinfo} em C --- os aplicativos primeiro tentam se conectar ao nscd; em caso de sucesso, o nscd realiza pesquisas de nome em seu nome. Se o nscd não estiver em execução, eles realizam a pesquisa de nome sozinhos, carregando os serviços de pesquisa de nome em seu próprio espaço de endereço e executando-o. Esses serviços de pesquisa de nome --- os arquivos @file{libnss_*.so} --- são @code{dlopen}'d, mas podem vir da biblioteca C do sistema host, em vez da biblioteca C à qual o aplicativo está vinculado (a biblioteca C vem do Guix).

source: And this is where the problem is: if your application is linked against Guix's C library (say, glibc 2.24) and tries to load NSS plugins from another C library (say, @code{libnss_mdns.so} for glibc 2.22), it will likely crash or have its name lookups fail unexpectedly.
pt_br: E é aqui que está o problema: se seu aplicativo estiver vinculado à biblioteca C do Guix (por exemplo, glibc 2.24) e tentar carregar plugins NSS de outra biblioteca C (por exemplo, @code{libnss_mdns.so} para glibc 2.22), ele provavelmente travará ou terá suas pesquisas de nome falhando inesperadamente.

source: Running @command{nscd} on the system, among other advantages, eliminates this binary incompatibility problem because those @code{libnss_*.so} files are loaded in the @command{nscd} process, not in applications themselves.
pt_br: Executar @command{nscd} no sistema, entre outras vantagens, elimina esse problema de incompatibilidade binária porque esses arquivos @code{libnss_*.so} são carregados no processo @command{nscd}, não nos próprios aplicativos.

source: X11 Fonts
pt_br: Fontes X11

source: The majority of graphical applications use Fontconfig to locate and load fonts and perform X11-client-side rendering. The @code{fontconfig} package in Guix looks for fonts in @file{$HOME/.guix-profile} by default. Thus, to allow graphical applications installed with Guix to display fonts, you have to install fonts with Guix as well. Essential font packages include @code{font-ghostscript}, @code{font-dejavu}, and @code{font-gnu-freefont}.
pt_br: A maioria dos aplicativos gráficos usa o Fontconfig para localizar e carregar fontes e executar renderização do lado do cliente X11. O pacote @code{fontconfig} no Guix procura fontes em @file{$HOME/.guix-profile} por padrão. Assim, para permitir que aplicativos gráficos instalados com o Guix exibam fontes, você precisa instalar fontes com o Guix também. Pacotes de fontes essenciais incluem @code{font-ghostscript}, @code{font-dejavu} e @code{font-gnu-freefont}.

source: font cache
pt_br: cache de font

source: Once you have installed or removed fonts, or when you notice an application that does not find fonts, you may need to install Fontconfig and to force an update of its font cache by running:
pt_br: Depois de instalar ou remover fontes, ou quando notar que um aplicativo não encontra fontes, talvez seja necessário instalar o Fontconfig e forçar uma atualização do cache de fontes executando:

source: To display text written in Chinese languages, Japanese, or Korean in graphical applications, consider installing @code{font-adobe-source-han-sans} or @code{font-wqy-zenhei}. The former has multiple outputs, one per language family (@pxref{Packages with Multiple Outputs}). For instance, the following command installs fonts for Chinese languages:
pt_br: Para exibir texto escrito em chinês, japonês ou coreano em aplicativos gráficos, considere instalar @code{font-adobe-source-han-sans} ou @code{font-wqy-zenhei}. O primeiro tem várias saídas, uma por família de idiomas (@pxref{Packages with Multiple Outputs}). Por exemplo, o comando a seguir instala fontes para idiomas chineses:

source: Older programs such as @command{xterm} do not use Fontconfig and instead rely on server-side font rendering. Such programs require to specify a full name of a font using XLFD (X Logical Font Description), like this:
pt_br: Programas mais antigos como @command{xterm} não usam Fontconfig e, em vez disso, dependem da renderização de fontes do lado do servidor. Tais programas exigem a especificação de um nome completo de uma fonte usando XLFD (X Logical Font Description), como este:

source: To be able to use such full names for the TrueType fonts installed in your Guix profile, you need to extend the font path of the X server:
pt_br: Para poder usar esses nomes completos para as fontes TrueType instaladas no seu perfil Guix, você precisa estender o caminho da fonte do servidor X:

source: After that, you can run @code{xlsfonts} (from @code{xlsfonts} package) to make sure your TrueType fonts are listed there.
pt_br: Depois disso, você pode executar @code{xlsfonts} (do pacote @code{xlsfonts}) para garantir que suas fontes TrueType estejam listadas lá.

source: The @code{nss-certs} package provides X.509 certificates, which allow programs to authenticate Web servers accessed over HTTPS.
pt_br: O pacote @code{nss-certs} fornece certificados X.509, que permitem que programas autentiquem servidores Web acessados por HTTPS.

source: When using Guix on a foreign distro, you can install this package and define the relevant environment variables so that packages know where to look for certificates. @xref{X.509 Certificates}, for detailed information.
pt_br: Ao usar uma Guix em uma distro alheia, você pode instalar esse pacote e definir as variáveis de ambiente relevantes de forma que os pacotes saibam onde procurar por certificados. @xref{X.509 Certificates}, para informações detalhadas.

source: When you install Emacs packages with Guix, the Elisp files are placed under the @file{share/emacs/site-lisp/} directory of the profile in which they are installed. The Elisp libraries are made available to Emacs through the @env{EMACSLOADPATH} environment variable, which is set when installing Emacs itself.
pt_br: Quando você instala pacotes do Emacs com o Guix, os arquivos Elisp são colocados no diretório @file{share/emacs/site-lisp/} do perfil no qual eles são instalados. As bibliotecas Elisp são disponibilizadas para o Emacs por meio da variável de ambiente @env{EMACSLOADPATH}, que é definida ao instalar o próprio Emacs.

source: guix-emacs-autoload-packages, refreshing Emacs packages
pt_br: guix-emacs-autoload-packages, atualizando pacotes Emacs

source: Additionally, autoload definitions are automatically evaluated at the initialization of Emacs, by the Guix-specific @code{guix-emacs-autoload-packages} procedure. This procedure can be interactively invoked to have newly installed Emacs packages discovered, without having to restart Emacs. If, for some reason, you want to avoid auto-loading the Emacs packages installed with Guix, you can do so by running Emacs with the @option{--no-site-file} option (@pxref{Init File,,, emacs, The GNU Emacs Manual}).
pt_br: Além disso, as definições de autoload são avaliadas automaticamente na inicialização do Emacs, pelo procedimento específico do Guix @code{guix-emacs-autoload-packages}. Este procedimento pode ser invocado interativamente para que pacotes Emacs recém-instalados sejam descobertos, sem precisar reiniciar o Emacs. Se, por algum motivo, você quiser evitar o carregamento automático dos pacotes Emacs instalados com o Guix, você pode fazer isso executando o Emacs com a opção @option{--no-site-file} (@pxref{Init File,,, emacs, The GNU Emacs Manual}).

source: Most Emacs variants are now capable of doing native compilation. The approach taken by Guix Emacs however differs greatly from the approach taken upstream.
pt_br: A maioria das variantes do Emacs agora são capazes de fazer compilação nativa. A abordagem adotada pelo Guix Emacs, no entanto, difere muito da abordagem adotada pelo upstream.

source: Upstream Emacs compiles packages just-in-time and typically places shared object files in a special folder within your @code{user-emacs-directory}. These shared objects within said folder are organized in a flat hierarchy, and their file names contain two hashes to verify the original file name and contents of the source code.
pt_br: O Upstream Emacs compila pacotes just-in-time e normalmente coloca arquivos de objetos compartilhados em uma pasta especial dentro do seu @code{user-emacs-directory}. Esses objetos compartilhados dentro da referida pasta são organizados em uma hierarquia plana, e seus nomes de arquivo contêm dois hashes para verificar o nome do arquivo original e o conteúdo do código-fonte.

source: Guix Emacs on the other hand prefers to compile packages ahead-of-time. Shared objects retain much of the original file name and no hashes are added to verify the original file name or the contents of the file. Crucially, this allows Guix Emacs and packages built against it to be grafted (@pxref{Security Updates, grafts}), but at the same time, Guix Emacs lacks the hash-based verification of source code baked into upstream Emacs. As this naming schema is trivial to exploit, we disable just-in-time compilation.
pt_br: O Guix Emacs, por outro lado, prefere compilar pacotes antes do tempo. Objetos compartilhados retêm muito do nome do arquivo original e nenhum hashe é adicionado para verificar o nome do arquivo original ou o conteúdo do arquivo. Crucialmente, isso permite que o Guix Emacs e os pacotes construídos contra ele sejam enxertados (@pxref{Security Updates, enxertos}), mas, ao mesmo tempo, o Guix Emacs não tem a verificação baseada em hash do código-fonte embutido no Emacs upstream. Como esse esquema de nomenclatura é trivial de explorar, desabilitamos a compilação just-in-time.

source: Further note, that @code{emacs-minimal}---the default Emacs for building packages---has been configured without native compilation. To natively compile your emacs packages ahead of time, use a transformation like @option{--with-input=emacs-minimal=emacs}.
pt_br: Observe ainda que @code{emacs-minimal}---o Emacs padrão para construir pacotes---foi configurado sem compilação nativa. Para compilar nativamente seus pacotes emacs antes do tempo, use uma transformação como @option{--with-input=emacs-minimal=emacs}.

source: Upgrading Guix, on a foreign distro
pt_br: Atualizando o Guix, em uma distribuição estrangeira

source: To upgrade Guix, run:
pt_br: Para atualizar o Guix, execute:

source: @xref{Invoking guix pull}, for more information.
pt_br: @xref{Invoking guix pull}, para maiores informações.

source: upgrading Guix for the root user, on a foreign distro
pt_br: atualizando Guix para o usuário root, em uma distribuição estrangeira

source: upgrading the Guix daemon, on a foreign distro
pt_br: atualizando o daemon Guix, em uma distribuição estrangeira

source: @command{guix pull} for the root user, on a foreign distro
pt_br: @command{guix pull} para o usuário root, em uma distribuição estrangeira

source: followed by (assuming your distro uses the systemd service management tool):
pt_br: seguido por (supondo que sua distribuição use a ferramenta de gerenciamento de serviço systemd):

source: On Guix System, upgrading the daemon is achieved by reconfiguring the system (@pxref{Invoking guix system, @code{guix system reconfigure}}).
pt_br: No sistema Guix, a atualização do daemon é obtida reconfigurando o sistema (@pxref{Invoking guix system, @code{guix system reconfigure}}).

source: installing Guix System
pt_br: instalando o Guix System

source: Guix System, installation
pt_br: Guix System, instalação

source: This section explains how to install Guix System on a machine. Guix, as a package manager, can also be installed on top of a running GNU/Linux system, @pxref{Installation}.
pt_br: Esta seção explica como instalar o Guix System em uma máquina. Guix, como gerenciador de pacotes, também pode ser instalado sobre um sistema GNU/Linux em execução, @pxref{Installation}.

source: You are reading this documentation with an Info reader. For details on how to use it, hit the @key{RET} key (``return'' or ``enter'') on the link that follows: @pxref{Top, Info reader,, info-stnd, Stand-alone GNU Info}. Hit @kbd{l} afterwards to come back here.
pt_br: Você está lendo esta documentação com um leitor de informações. Para obter detalhes sobre como usá-lo, pressione a tecla @key{RET} ("return'' ou "enter'') no link a seguir: @pxref{Top, Info reader,, info-stnd, Stand-alone GNU Info}. Clique em @kbd{l} depois para voltar aqui.
