Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: @emph{Remain focused: do not change the scope of the work being reviewed.} For example, if the contribution touches code that follows a pattern deemed unwieldy, it would be unfair to ask the submitter to fix all occurrences of that pattern in the code; to put it simply, if a problem unrelated to the patch at hand was already there, do not ask the submitter to fix it.
it: @emph{Rimani concentrato: non cambiare l'ambito del lavoro in revisione.} Ad esempio, se il contributo tocca codice che segue uno schema ritenuto ingombrante, sarebbe ingiusto chiedere al mittente di correggere tutte le occorrenze di quello schema nel codice; per dirla semplicemente, se un problema non correlato alla patch in questione era già presente, non chiedere al mittente di risolverlo.
pt_br: @emph{Mantenha o foco: não altere o escopo do trabalho que está sendo revisado.} Por exemplo, se a contribuição aborda um código que segue um padrão considerado difícil de manejar, seria injusto pedir ao remetente para corrigir todas as ocorrências desse padrão no código; para simplificar, se um problema não relacionado ao patch em questão já estava lá, não peça ao remetente para corrigi-lo.

source: @emph{Ensure progress.} As they respond to review, submitters may submit new revisions of their changes; avoid requesting changes that you did not request in the previous round of comments. Overall, the submitter should get a clear sense of progress; the number of items open for discussion should clearly decrease over time.
it: @emph{Assicura il progresso.} Mentre rispondono alla revisione, i mittenti potrebbero inviare nuove revisioni delle loro modifiche; evita di richiedere modifiche che non hai richiesto nel round precedente di commenti. In generale, il mittente dovrebbe avere una chiara sensazione di progresso; il numero di elementi aperti per la discussione dovrebbe chiaramente diminuire nel tempo.
pt_br: @emph{Garantir o progresso.} Conforme respondem à revisão, os remetentes podem enviar novas revisões de suas alterações; evite solicitar alterações que você não solicitou na rodada anterior de comentários. No geral, o remetente deve ter uma noção clara do progresso; o número de itens abertos para discussão deve diminuir claramente ao longo do tempo.

source: @emph{Aim for finalization.} Reviewing code is time-consuming. Your goal as a reviewer is to put the process on a clear path towards integration, possibly with agreed-upon changes, or rejection, with a clear and mutually-understood reasoning. Avoid leaving the review process in a lingering state with no clear way out.
it: @emph{Mira alla finalizzazione.} Revisionare il codice richiede tempo. Il tuo obiettivo come revisore è mettere il processo su un percorso chiaro verso l'integrazione, possibilmente con modifiche concordate, o il rifiuto, con una motivazione chiara e compresa reciprocamente. Evita di lasciare il processo di revisione in uno stato prolungato senza una via d'uscita chiara.
pt_br: @emph{Aim for finalization.} Revisar código consome tempo. Seu objetivo como revisor é colocar o processo em um caminho claro em direção à integração, possivelmente com mudanças acordadas, ou rejeição, com um raciocínio claro e mutuamente compreendido. Evite deixar o processo de revisão em um estado persistente sem uma saída clara.

source: LGTM, Looks Good To Me
pt_br: LGTM, parece bom para mim

source: review tags
it: tag di revisione
pt_br: tags de revisão

source: Reviewed-by, git trailer
it: Reviewed-by, trailer git
pt_br: Revisado por, git trailer

source: If the @emph{whole} series (containing multiple commits) looks good to you, reply with @samp{Reviewed-by:@tie{}Your@tie{}Name@tie{}<your-email@@example.com>} to the cover page if it has one, or to the last patch of the series otherwise, adding another @samp{(for the whole series)} comment on the line below to explicit this fact.
it: Se l'@emph{intera} serie (contenente più commit) ti sembra buona, rispondi con @samp{Reviewed-by:@tie{}Tuo@tie{}Nome@tie{}<tua-email@@example.com>} alla pagina di copertina se ce n'è una, o all'ultima patch della serie altrimenti, aggiungendo un altro commento @samp{(for the whole series)} sulla riga sotto per esplicitare questo fatto.
pt_br: Se a série @emph{toda} (contendo vários commits) parecer boa para você, responda com @samp{Reviewed-by:@tie{}Your@tie{}Name@tie{}<your-email@@example.com>} para a página de capa, se houver uma, ou para o último patch da série, caso contrário, adicionando outro comentário @samp{(para toda a série)} na linha abaixo para explicitar esse fato.

source: If you instead want to mark a @emph{single commit} as reviewed (but not the whole series), simply reply with @samp{Reviewed-by:@tie{}Your@tie{}Name@tie{}<your-email@@example.com>} to that commit message.
it: Se invece vuoi contrassegnare un @emph{single commit} come revisionato (ma non l'intera serie), rispondi semplicemente con @samp{Reviewed-by:@tie{}Tuo@tie{}Nome@tie{}<tua-email@@example.com>} a quel messaggio di commit.
pt_br: Se você quiser marcar um @emph{único commit} como revisado (mas não a série inteira), basta responder com @samp{Reviewed-by:@tie{}Your@tie{}Name@tie{}<your-email@@example.com>} para essa mensagem de commit.

source: If you are not a committer, you can help others find a @emph{series} you have reviewed more easily by adding a @code{reviewed-looks-good} usertag for the @code{guix} user (@pxref{Debbugs Usertags}).
it: Se non sei un committer, puoi aiutare altri a trovare una @emph{serie} che hai revisionato più facilmente aggiungendo un usertag @code{reviewed-looks-good} per l'utente @code{guix} (@pxref{Debbugs Usertags}).
pt_br: Se você não for um colaborador, pode ajudar outras pessoas a encontrar uma @emph{série} que você revisou mais facilmente adicionando uma usertag @code{reviewed-looks-good} para o usuário @code{guix} (@pxref{Debbugs Usertags}).

source: update-guix-package, updating the guix package
it: update-guix-package, aggiornamento del pacchetto guix
pt_br: update-guix-package, atualizando o pacote guix

source: It is sometimes desirable to update the @code{guix} package itself (the package defined in @code{(gnu packages package-management)}), for example to make new daemon features available for use by the @code{guix-service-type} service type. In order to simplify this task, the following command can be used:
it: A volte è desiderabile aggiornare il pacchetto @code{guix} stesso (il pacchetto definito in @code{(gnu packages package-management)}), ad esempio per rendere disponibili nuove funzionalità del demone per l'uso da parte del tipo di servizio @code{guix-service-type}. Per semplificare questo compito, può essere usato il seguente comando:
pt_br: Às vezes, é desejável atualizar o pacote @code{guix} em si (o pacote definido em @code{(gnu packages package-management)}), por exemplo, para tornar novos recursos de daemon disponíveis para uso pelo tipo de serviço @code{guix-service-type}. Para simplificar essa tarefa, o seguinte comando pode ser usado:

source: The @code{update-guix-package} make target will use the last known @emph{commit} corresponding to @code{HEAD} in your Guix checkout, compute the hash of the Guix sources corresponding to that commit and update the @code{commit}, @code{revision} and hash of the @code{guix} package definition.
it: L'obiettivo make @code{update-guix-package} userà l'ultimo @emph{commit} noto corrispondente a @code{HEAD} nel tuo checkout di Guix, calcolerà l'hash delle sorgenti di Guix corrispondenti a quel commit e aggiornerà il @code{commit}, @code{revision} e l'hash della definizione del pacchetto @code{guix}.
pt_br: O destino de criação do @code{update-guix-package} usará o último @emph{commit} conhecido correspondente ao @code{HEAD} no seu checkout do Guix, calculará o hash das fontes do Guix correspondentes a esse commit e atualizará o @code{commit}, @code{revision} e o hash da definição do pacote @code{guix}.

source: To validate that the updated @code{guix} package hashes are correct and that it can be built successfully, the following command can be run from the directory of your Guix checkout:
it: Per convalidare che gli hash aggiornati del pacchetto @code{guix} siano corretti e che possa essere costruito con successo, il seguente comando può essere eseguito dalla directory del tuo checkout di Guix:
pt_br: Para validar se os hashes do pacote @code{guix} atualizados estão corretos e se ele pode ser construído com sucesso, o seguinte comando pode ser executado no diretório do seu checkout Guix:

source: To guard against accidentally updating the @code{guix} package to a commit that others can't refer to, a check is made that the commit used has already been pushed to the Codeberg-hosted Guix Git repository.
it: Per evitare di aggiornare accidentalmente il pacchetto @code{guix} a un commit a cui altri non possono fare riferimento, viene effettuato un controllo che il commit utilizzato sia già stato inviato al repository Git di Guix ospitato su Codeberg.
pt_br: Para evitar a atualização acidental do pacote @code{guix} para um commit ao qual outros não podem se referir, é feita uma verificação de que o commit usado já foi enviado para o repositório Git de Guix hospedado em Codeberg.

source: This check can be disabled, @emph{at your own peril}, by setting the @code{GUIX_ALLOW_ME_TO_USE_PRIVATE_COMMIT} environment variable. When this variable is set, the updated package source is also added to the store. This is used as part of the release process of Guix.
it: Questo controllo può essere disabilitato, @emph{a tuo rischio e pericolo}, impostando la variabile d'ambiente @code{GUIX_ALLOW_ME_TO_USE_PRIVATE_COMMIT}. Quando questa variabile è impostata, la sorgente del pacchetto aggiornato viene anche aggiunta allo store. Questo è usato come parte del processo di rilascio di Guix.
pt_br: Esta verificação pode ser desabilitada, @emph{por sua conta e risco}, definindo a variável de ambiente @code{GUIX_ALLOW_ME_TO_USE_PRIVATE_COMMIT}. Quando esta variável é definida, a fonte do pacote atualizado também é adicionada ao armazém. Isto é usado como parte do processo de lançamento do Guix.

source: deprecation policy
it: politica di deprecazione
pt_br: política de depreciação

source: As any lively project with a broad scope, Guix changes all the time and at all levels. Because it's user-extensible and programmable, incompatible changes can directly impact users and make their life harder. It is thus important to reduce user-visible incompatible changes to a minimum and, when such changes are deemed necessary, to clearly communicate them through a @dfn{deprecation period} so everyone can adapt with minimum hassle. This section defines the project's commitments for smooth deprecation and describes procedures and mechanisms to honor them.
it: Come qualsiasi progetto vivace con un ampio ambito, Guix cambia continuamente e a tutti i livelli. Poiché è estendibile dall'utente e programmabile, cambiamenti incompatibili possono influenzare direttamente gli utenti e rendere loro la vita più difficile. È quindi importante ridurre al minimo i cambiamenti incompatibili visibili all'utente e, quando tali cambiamenti sono ritenuti necessari, comunicarli chiaramente attraverso un @dfn{periodo di deprecazione} in modo che tutti possano adattarsi con il minimo disagio. Questa sezione definisce gli impegni del progetto per una deprecazione fluida e descrive procedure e meccanismi per rispettarli.
pt_br: Como qualquer projeto animado com um escopo amplo, o Guix muda o tempo todo e em todos os níveis. Como é extensível e programável pelo usuário, mudanças incompatíveis podem impactar diretamente os usuários e dificultar suas vidas. Portanto, é importante reduzir as mudanças incompatíveis visíveis ao usuário ao mínimo e, quando tais mudanças forem consideradas necessárias, comunicá-las claramente por meio de um @dfn{período de depreciação} para que todos possam se adaptar com o mínimo de problemas. Esta seção define os compromissos do projeto para uma depreciação suave e descreve procedimentos e mecanismos para honrá-los.

source: There are several ways to use Guix; how to handle deprecation will depend on each use case. Those can be roughly categorized like this:
it: Ci sono diversi modi per usare Guix; come gestire la deprecazione dipenderà:
pt_br: Há várias maneiras de usar Guix; como lidar com a descontinuação dependerá de cada caso de uso. Elas podem ser categorizadas aproximadamente assim:

source: package management exclusively through the command line;
it: gestione dei pacchetti esclusivamente tramite riga di comando;
pt_br: gerenciamento de pacotes exclusivamente através da linha de comando;

source: advanced package management using the manifest and package interfaces;
it: gestione avanzata dei pacchetti utilizzando le interfacce manifest e pacchetto;
pt_br: gerenciamento avançado de pacotes usando as interfaces de manifesto e pacote;

source: Home and System management, using the @code{operating-system} and/or @code{home-environment} interfaces together with the service interfaces;
it: gestione di Home e System, utilizzando le interfacce @code{operating-system} e/o @code{home-environment} insieme alle interfacce dei servizi;
pt_br: Gerenciamento de sistema e home, usando as interfaces @code{operating-system} e/ou @code{home-environment} juntamente com as interfaces de serviço;

source: development or use of external tools that use programming interfaces such as the @code{(guix ...)} modules.
it: sviluppo o utilizzo di strumenti esterni che utilizzano interfacce di programmazione come i moduli @code{(guix ...)}.
pt_br: desenvolvimento ou utilização de ferramentas externas que utilizam interfaces de programação como os módulos @code{(guix ...)}.

source: These use cases form a spectrum with varying degrees of coupling---from ``distant'' to tightly coupled. Based on this insight, we define the following @dfn{deprecation policies} that we consider suitable for each of these levels.
it: Questi casi d'uso formano uno spettro con vari gradi di accoppiamento—da ``distante'' a strettamente accoppiato. Basandoci su questa osservazione, definiamo le seguenti @dfn{politiche di deprecazione} che riteniamo adatte per ciascuno di questi livelli.
pt_br: Esses casos de uso formam um espectro com vários graus de acoplamento --- de ``distante'' a fortemente acoplado. Com base nesse insight, definimos as seguintes @dfn{políticas de depreciação} que consideramos adequadas para cada um desses níveis.

source: Guix sub-commands should be thought of as remaining available ``forever''. Once a Guix sub-command is to be removed, it should be deprecated first, and then remain available for @b{at least one year} after the first release that deprecated it.
it: I sottocomandi di Guix dovrebbero essere considerati disponibili ``per sempre''. Una volta che un sottocomando di Guix deve essere rimosso, dovrebbe prima essere deprecato, quindi rimanere disponibile per @b{almeno un anno} dopo la prima versione che lo ha deprecato.
pt_br: Os subcomandos Guix devem ser pensados como permanecendo disponíveis ``para sempre''. Uma vez que um subcomando Guix deve ser removido, ele deve ser descontinuado primeiro, e então permanecer disponível por @b{pelo menos um ano} após o primeiro lançamento que o descontinuou.

source: Deprecation should first be announced in the manual and as an entry in @file{etc/news.scm}; additional communication such as a blog post explaining the rationale is welcome. Months before the scheduled removal date, the command should print a warning explaining how to migrate. An example of this is the replacement of @command{guix environment} by @command{guix shell}, started in October 2021@footnote{For more details on the @command{guix shell} transition, see @uref{https://guix.gnu.org/en/blog/2021/from-guix-environment-to-guix-shell/}.}.
it: La deprecazione dovrebbe essere prima annunciata nel manuale e come voce in @file{etc/news.scm}; sono benvenute comunicazioni aggiuntive come un post su blog che spieghi la motivazione. Mesi prima della data di rimozione pianificata, il comando dovrebbe stampare un avviso che spiega come migrare. Un esempio di ciò è la sostituzione di @command{guix environment} con @command{guix shell}, iniziata nell'ottobre 2021@footnote{Per maggiori dettagli sulla transizione di @command{guix shell}, vedere @uref{https://guix.gnu.org/en/blog/2021/from-guix-environment-to-guix-shell/}.}.
pt_br: A descontinuação deve ser anunciada primeiro no manual e como uma entrada em @file{etc/news.scm}; comunicações adicionais, como uma postagem de blog explicando a justificativa, são bem-vindas. Meses antes da data de remoção programada, o comando deve imprimir um aviso explicando como migrar. Um exemplo disso é a substituição de @command{guix environment} por @command{guix shell}, iniciada em outubro de 2021@footnote{Para mais detalhes sobre a transição do @command{guix shell}, consulte @uref{https://guix.gnu.org/en/blog/2021/from-guix-environment-to-guix-shell/}.}.

source: Because of the broad impact of such a change, we recommend conducting a user survey before enacting a plan.
it: A causa del vasto impatto di tale cambiamento, raccomandiamo di condurre un sondaggio utente prima di attuare un piano.
pt_br: Devido ao amplo impacto de tal mudança, recomendamos realizar uma pesquisa com usuários antes de implementar um plano.

source: package deprecation
it: deprecazione dei pacchetti
pt_br: depreciação de pacotes

source: Package name changes
it: Cambiamenti di nome dei pacchetti
pt_br: Mudança de nome de pacotes

source: When a package name changes, it must remain available under its old name for @b{at least one year}. For example, @code{go-ipfs} was renamed to @code{kubo} following a decision made upstream; to communicate the name change to users, the package module provided this definition:
it: Quando il nome di un pacchetto cambia, deve rimanere disponibile con il suo vecchio nome per @b{almeno un anno}. Ad esempio, @code{go-ipfs} è stato rinominato in @code{kubo} a seguito di una decisione upstream; per comunicare il cambio di nome agli utenti, il modulo del pacchetto ha fornito questa definizione:
pt_br: Quando um nome de pacote muda, ele deve permanecer disponível sob seu nome antigo por @b{pelo menos um ano}. Por exemplo, @code{go-ipfs} foi renomeado para @code{kubo} após uma decisão tomada upstream; para comunicar a mudança de nome aos usuários, o módulo do pacote forneceu esta definição:

source: package removal policy
it: politica di rimozione dei pacchetti
pt_br: pacotes, politica de remoção

source: Package removal
pt_br: Remoção de pacote

source: Packages whose upstream developers have declared as having reached ``end of life'' or being unmaintained may be removed; likewise, packages that have been @b{failing to build for two months or more} may be removed.
it: I pacchetti i cui sviluppatori upstream hanno dichiarato di aver raggiunto ``fine vita'' o non essere più mantenuti possono essere rimossi; allo stesso modo, i pacchetti che @b{non sono stati compilati con successo per due mesi o più} possono essere rimossi.
pt_br: Pacotes cujos desenvolvedores originais declararam que atingiram o ``fim da vida útil'' ou não são mantidos podem ser removidos; da mesma forma, pacotes que estão @b{falhando na compilação por dois meses ou mais} podem ser removidos.

source: If the package being removed is a ``leaf'' (no other packages depend on it), it may be removed after a @b{one-month review period} of the patch removing it (this applies even when the removal has additional motivations such as security problems affecting the package).
it: Se il pacchetto da rimuovere è una ``foglia'' (nessun altro pacchetto dipende da esso), può essere rimosso dopo un @b{periodo di revisione di un mese} della patch che lo rimuove (questo si applica anche quando la rimozione ha motivazioni aggiuntive come problemi di sicurezza che interessano il pacchetto).
pt_br: Se o pacote que está sendo removido for um ``leaf'' (nenhum outro pacote depende dele), ele poderá ser removido após um @b{período de revisão de um mês} do patch que o removeu (isso se aplica mesmo quando a remoção tem motivações adicionais, como problemas de segurança que afetam o pacote).

source: When the package being removed is considered popular, whether or not it is a leaf, its deprecation must be announced as an entry in @code{etc/news.scm}.
it: Quando il pacchetto da rimuovere è considerato popolare, che sia o meno una foglia, la sua deprecazione deve essere annunciata come voce in @code{etc/news.scm}.
pt_br: Quando o pacote que está sendo removido é considerado popular, seja ou não uma folha, sua descontinuação deve ser anunciada como uma entrada em @code{etc/news.scm}.

source: Package upgrade
pt_br: Atualização de pacote

source: In the case of packages with many dependents and/or many users, an upgrade may be treated like the @emph{removal} of the previous version.
it: Nel caso di pacchetti con molti dipendenti e/o molti utenti, un aggiornamento può essere trattato come la @emph{removal} della versione precedente.
pt_br: No caso de pacotes com muitos dependentes e/ou muitos usuários, uma atualização pode ser tratada como a @emph{remoção} da versão anterior.

source: Examples include major version upgrades of programming language implementations, as we've seen above with Python, and major upgrades of ``big'' libraries such as Qt or GTK.
it: Esempi includono aggiornamenti di versione maggiore delle implementazioni di linguaggi di programmazione, come abbiamo visto sopra con Python, e aggiornamenti maggiori di librerie ``grandi'' come Qt o GTK.
pt_br: Exemplos incluem grandes atualizações de versões de implementações de linguagens de programação, como vimos acima com Python, e grandes atualizações de bibliotecas ``grandes'' como Qt ou GTK.

source: service deprecation
it: deprecazione dei servizi
pt_br: depreciação de serviço

source: Services
it: Servizi
pt_br: Serviços

source: Changes to services for Guix Home and Guix System have a direct impact on user configuration. For a user, adjusting to interface changes is rarely rewarding, which is why any such change must be clearly communicated in advance through deprecation warnings and documentation.
it: Le modifiche ai servizi per Guix Home e Guix System hanno un impatto diretto sulla configurazione dell'utente. Per un utente, adattarsi ai cambiamenti dell'interfaccia è raramente gratificante, motivo per cui ogni modifica del genere deve essere chiaramente comunicata in anticipo tramite avvisi di deprecazione e documentazione.
pt_br: Mudanças nos serviços para Guix Home e Guix System têm um impacto direto na configuração do usuário. Para um usuário, ajustar-se a mudanças de interface raramente é recompensador, e é por isso que qualquer mudança desse tipo deve ser claramente comunicada com antecedência por meio de avisos de descontinuação e documentação.
