Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: We usually package only the latest version of a given free software project. But sometimes, for instance for incompatible library versions, two (or more) versions of the same package are needed. These require different Scheme variable names. We use the name as defined in @ref{Package Naming} for the most recent version; previous versions use the same name, suffixed by @code{-} and the smallest prefix of the version number that may distinguish the two versions.
it: Di solito pacchettizziamo solo l'ultima versione di un dato progetto di software libero. Ma a volte, ad esempio per versioni di librerie incompatibili, sono necessarie due (o più) versioni dello stesso pacchetto. Queste richiedono nomi di variabili Scheme diversi. Usiamo il nome come definito in @ref{Package Naming} per la versione più recente; le versioni precedenti usano lo stesso nome, con suffisso @code{-} e il più piccolo prefisso del numero di versione che può distinguere le due versioni.
pt_br: Geralmente, empacotamos apenas a versão mais recente de um determinado projeto de software livre. Mas, às vezes, por exemplo, para versões incompatíveis de bibliotecas, são necessárias duas (ou mais) versões do mesmo pacote. Isso requer nomes de variáveis Scheme diferentes. Usamos o nome como definido em @ref{Package Naming} para a versão mais recente; as versões anteriores usam o mesmo nome, com o sufixo @code{-} e o menor prefixo do número da versão que pode distinguir as duas versões.

source: The name inside the package definition is the same for all versions of a package and does not contain any version number.
it: Il nome all'interno della definizione del pacchetto è lo stesso per tutte le versioni di un pacchetto e non contiene alcun numero di versione.
pt_br: O nome dentro da definição do pacote é o mesmo para todas as versões de um pacote e não contém nenhum número de versão.

source: For instance, the versions 2.24.20 and 3.9.12 of GTK+ may be packaged as follows:
it: Ad esempio, le versioni 2.24.20 e 3.9.12 di GTK+ possono essere pacchettizzate come segue:
pt_br: Por exemplo, as versões 2.24.20 e 3.9.12 do GTK podem ser empacotados da seguinte forma:

source: If we also wanted GTK+ 3.8.2, this would be packaged as
it: Se volessimo anche GTK+ 3.8.2, sarebbe pacchettizzato come
pt_br: Se também quiséssemos GTK 3.8.2, este seria empacotado como

source: version number, for VCS snapshots
it: numero di versione, per le istantanee VCS
pt_br: número de versão, para snapshots de VCS

source: Occasionally, we package snapshots of upstream's version control system (VCS) instead of formal releases. This should remain exceptional, because it is up to upstream developers to clarify what the stable release is. Yet, it is sometimes necessary. So, what should we put in the @code{version} field?
it: Occasionalmente, pacchettizziamo istantanee del sistema di controllo di versione (VCS) di upstream invece di rilasci formali. Questo dovrebbe rimanere un'eccezione, perché spetta agli sviluppatori upstream chiarire qual è la versione stabile. Tuttavia, a volte è necessario. Quindi, cosa dovremmo mettere nel campo @code{version}?
pt_br: Ocasionalmente, empacotamos snapshots do sistema de controle de versão (VCS) do upstream em vez de lançamentos formais. Isso deve permanecer excepcional, porque cabe aos desenvolvedores upstream esclarecer qual é a versão estável. No entanto, às vezes é necessário. Então, o que devemos colocar no campo @code{version}?

source: Clearly, we need to make the commit identifier of the VCS snapshot visible in the version string, but we also need to make sure that the version string is monotonically increasing so that @command{guix package --upgrade} can determine which version is newer. Since commit identifiers, notably with Git, are not monotonically increasing, we add a revision number that we increase each time we upgrade to a newer snapshot. The resulting version string looks like this:
it: Chiaramente, dobbiamo rendere visibile l'identificatore del commit della istantanea VCS nella stringa di versione, ma dobbiamo anche assicurarci che la stringa di versione sia monotonicamente crescente in modo che @command{guix package --upgrade} possa determinare quale versione è più recente. Poiché gli identificatori di commit, in particolare con Git, non sono monotonicamente crescenti, aggiungiamo un numero di revisione che incrementiamo ogni volta che aggiorniamo a una nuova istantanea. La stringa di versione risultante assomiglia a questa:
pt_br: Claramente, precisamos tornar o identificador de commit do snapshot VCS visível na string de versão, mas também precisamos garantir que a string de versão esteja aumentando monotonicamente para que o @command{guix package --upgrade} possa determinar qual versão é mais recente. Como os identificadores de commit, principalmente com o Git, não estão aumentando monotonicamente, adicionamos um número de revisão que aumentamos cada vez que atualizamos para um snapshot mais recente. A sequência da versão resultante é assim:

source: 2.0.11-3.cabba9e ^ ^ ^ | | `-- upstream commit ID | | | `--- Guix package revision | latest upstream version
it: 2.0.11-3.cabba9e ^ ^ ^ | | `-- ID commit upstream | | | `--- Revisione pacchetto Guix | ultima versione upstream
pt_br: 2.0.11-3.cabba9e ^ ^ ^ | | `-- ID do commit do upstream | | | `--- revisão do pacote do Guix | versão mais recente do upstream

source: It is a good idea to strip commit identifiers in the @code{version} field to, say, 7 digits. It avoids an aesthetic annoyance (assuming aesthetics have a role to play here) as well as problems related to OS limits such as the maximum shebang length (127 bytes for the Linux kernel). There are helper functions for doing this for packages using @code{git-fetch} or @code{hg-fetch} (see below). It is best to use the full commit identifiers in @code{origin}s, though, to avoid ambiguities. A typical package definition may look like this:
it: È una buona idea troncare gli identificatori di commit nel campo @code{version} a, diciamo, 7 cifre. Questo evita un fastidio estetico (supponendo che l'estetica abbia un ruolo qui) così come problemi legati ai limiti del SO come la lunghezza massima dello shebang (127 byte per il kernel Linux). Ci sono funzioni di aiuto per fare questo per i pacchetti che usano @code{git-fetch} o @code{hg-fetch} (vedi sotto). È meglio usare gli identificatori di commit completi negli @code{origin}, però, per evitare ambiguità. Una definizione di pacchetto tipica potrebbe assomigliare a questa:
pt_br: É uma boa ideia reduzir os identificadores de commit no campo @code{version} para, digamos, 7 dígitos. Isso evita um incômodo estético (assumindo que a estética tenha um papel a desempenhar aqui), bem como problemas relacionados aos limites do sistema operacional, como o comprimento máximo do shebang (127 bytes para o kernel Linux). Existem funções auxiliares para fazer isso para pacotes usando @code{git-fetch} ou @code{hg-fetch} (veja abaixo). Porém, é melhor usar os identificadores de commit completos em @code{origin}s para evitar ambiguidades. Uma definição típica de pacote pode ser assim:

source: (define my-package (let ((commit "c3f29bc928d5900971f65965feaae59e1272a3f7") (revision "1")) ;Guix package revision (package (version (git-version "0.9" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "git://example.org/my-package.git") (commit commit))) (sha256 (base32 "1mbikn@dots{}")) (file-name (git-file-name name version)))) ;; @dots{} )))
it: (define my-package (let ((commit "c3f29bc928d5900971f65965feaae59e1272a3f7") (revision "1")) ;Revisione pacchetto Guix (package (version (git-version "0.9" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "git://example.org/my-package.git") (commit commit))) (sha256 (base32 "1mbikn@dots{}")) (file-name (git-file-name name version)))) ;; @dots{} )))
pt_br: (define meu-pacote (let ((commit "c3f29bc928d5900971f65965feaae59e1272a3f7") (revision "1")) ;revisão do pacote do Guix (package (version (git-version "0.9" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "git://example.org/meu-pacote.git") (commit commit))) (sha256 (base32 "1mbikn@dots{}")) (file-name (git-file-name name version)))) ;; @dots{} )))

source: {Procedure} git-version @var{VERSION} @var{REVISION} @var{COMMIT}
pt_br: {Procedimento} git-version @var{VERSION} @var{REVISION} @var{COMMIT}

source: Return the version string for packages using @code{git-fetch}.
it: Restituisce la stringa di versione per i pacchetti che usano @code{git-fetch}.
pt_br: Retorne a string de versão para pacotes usando @code{git-fetch}.

source: {Procedure} hg-version @var{VERSION} @var{REVISION} @var{CHANGESET}
pt_br: {Procedimento} hg-version @var{VERSION} @var{REVISION} @var{CHANGESET}

source: Return the version string for packages using @code{hg-fetch}. It works in the same way as @code{git-version}.
it: Restituisce la stringa di versione per i pacchetti che usano @code{hg-fetch}. Funziona allo stesso modo di @code{git-version}.
pt_br: Retorne a string de versão para pacotes usando @code{hg-fetch}. Funciona da mesma forma que @code{git-version}.

source: package description
it: descrizione del pacchetto
pt_br: descrição do pacote

source: package synopsis
it: sinossi del pacchetto
pt_br: sinopse do pacote

source: As we have seen before, each package in GNU@tie{}Guix includes a synopsis and a description (@pxref{Defining Packages}). Synopses and descriptions are important: They are what @command{guix package --search} searches, and a crucial piece of information to help users determine whether a given package suits their needs. Consequently, packagers should pay attention to what goes into them.
it: Come abbiamo visto prima, ogni pacchetto in GNU@tie{}Guix include una sinossi e una descrizione (@pxref{Defining Packages}). Sinossi e descrizioni sono importanti: sono ciò che @command{guix package --search} cerca, e un pezzo di informazione cruciale per aiutare gli utenti a determinare se un dato pacchetto soddisfa le loro esigenze. Di conseguenza, i pacchettizzatori dovrebbero prestare attenzione a ciò che vi inseriscono.
pt_br: Como vimos anteriormente, cada pacote no GNU@tie{}Guix inclui uma sinopse e uma descrição (@pxref{Defining Packages}). Sinopses e descrições são importantes: são o que o @command{guix package --search} pesquisa e uma informação crucial para ajudar os usuários a determinar se um determinado pacote atende às suas necessidades. Consequentemente, os empacotadores devem prestar atenção ao que entra neles.

source: Synopses must start with a capital letter and must not end with a period. They must not start with ``a'' or ``the'', which usually does not bring anything; for instance, prefer ``File-frobbing tool'' over ``A tool that frobs files''. The synopsis should say what the package is---e.g., ``Core GNU utilities (file, text, shell)''---or what it is used for---e.g., the synopsis for GNU@tie{}grep is ``Print lines matching a pattern''.
it: Le sinossi devono iniziare con una lettera maiuscola e non devono terminare con un punto. Non devono iniziare con articoli, che di solito non aggiungono nulla; ad esempio, preferire ``Strumento per manipolare file'' a ``Uno strumento che manipola file''. La sinossi dovrebbe dire cosa è il pacchetto --- ad esempio, ``Utilità GNU di base (file, testo, shell)'' --- o a cosa serve --- ad esempio, la sinossi per GNU@tie{}grep è ``Stampa le righe che corrispondono a un modello''.
pt_br: As sinopses devem começar com uma letra maiúscula e não devem terminar com um ponto. Elas não devem começar com ``a'' ou ``the'', que geralmente não traz nada; por exemplo, prefira ``Tool-frobbing tool'' em vez de ``A tool that frobs files''. A sinopse deve dizer o que é o pacote -- por exemplo, ``Core GNU utilities (file, text, shell)'' -- ou para que é usado -- por exemplo, a sinopse do GNU@tie{}grep é ``Print lines matching a pattern''.

source: Keep in mind that the synopsis must be meaningful for a very wide audience. For example, ``Manipulate alignments in the SAM format'' might make sense for a seasoned bioinformatics researcher, but might be fairly unhelpful or even misleading to a non-specialized audience. It is a good idea to come up with a synopsis that gives an idea of the application domain of the package. In this example, this might give something like ``Manipulate nucleotide sequence alignments'', which hopefully gives the user a better idea of whether this is what they are looking for.
it: Tieni presente che la sinossi deve essere significativa per un pubblico molto ampio. Ad esempio, ``Manipola allineamenti in formato SAM'' potrebbe avere senso per un ricercatore esperto di bioinformatica, ma potrebbe essere poco utile o addirittura fuorviante per un pubblico non specializzato. È una buona idea creare una sinossi che dia un'idea del dominio di applicazione del pacchetto. In questo esempio, si potrebbe ottenere qualcosa come ``Manipola allineamenti di sequenze nucleotidiche'', che si spera dia all'utente un'idea migliore se è quello che sta cercando.
pt_br: Lembre-se de que a sinopse deve ser significativa para um público muito amplo. Por exemplo, ``Manipulate alignments in the SAM format'' pode fazer sentido para um pesquisador experiente em bioinformática, mas pode ser bastante inútil ou até enganoso para um público não especializado. É uma boa ideia apresentar uma sinopse que dê uma ideia do domínio do aplicativo do pacote. Neste exemplo, isso pode fornecer algo como ``Manipulate nucleotide sequence alignments'', o que, esperançosamente, dá ao usuário uma melhor ideia de se é isso que eles estão procurando.

source: Descriptions should take between five and ten lines. Use full sentences, and avoid using acronyms without first introducing them. Please avoid marketing phrases such as ``world-leading'', ``industrial-strength'', and ``next-generation'', and avoid superlatives like ``the most advanced''---they are not helpful to users looking for a package and may even sound suspicious. Instead, try to be factual, mentioning use cases and features.
it: Le descrizioni dovrebbero essere lunghe tra le cinque e le dieci righe. Usa frasi complete ed evita di usare acronimi senza averli prima introdotti. Evita frasi di marketing come ``leader mondiale'', ``di forza industriale'' e ``di nuova generazione'', ed evita superlativi come ``il più avanzato'' --- non sono utili agli utenti che cercano un pacchetto e possono persino suonare sospetti. Invece, cerca di essere fattuale, menzionando casi d'uso e funzionalità.
pt_br: Descrições devem levar entre cinco e dez linhas. Use sentenças completas e evite usar acrônimos sem primeiro apresentá-los. Por favor, evite frases de marketing como ``inovação mundial'', ``força industrial'' e ``próxima geração'', e evite superlativos como ``a mais avançada'' -- eles não ajudam o usuário procurando por um pacote e podem atém parece suspeito. Em vez idsso, tente se ater aos fatos, mencionando casos de uso e recursos.

source: Texinfo markup, in package descriptions
it: Markup Texinfo, nelle descrizioni dei pacchetti
pt_br: Marcação Texinfo, em descrições de pacote

source: Descriptions can include Texinfo markup, which is useful to introduce ornaments such as @code{@@code} or @code{@@dfn}, bullet lists, or hyperlinks (@pxref{Overview,,, texinfo, GNU Texinfo}). However you should be careful when using some characters for example @samp{@@} and curly braces which are the basic special characters in Texinfo (@pxref{Special Characters,,, texinfo, GNU Texinfo}). User interfaces such as @command{guix show} take care of rendering it appropriately.
it: Le descrizioni possono includere il markup Texinfo, che è utile per introdurre ornamenti come @code{@@code} o @code{@@dfn}, elenchi puntati o collegamenti ipertestuali (@pxref{Overview,,, texinfo, GNU Texinfo}). Tuttavia, dovresti fare attenzione quando usi alcuni caratteri, ad esempio @samp{@@} e le parentesi graffe, che sono i caratteri speciali di base in Texinfo (@pxref{Special Characters,,, texinfo, GNU Texinfo}). Le interfacce utente come @command{guix show} si occupano di renderlo in modo appropriato.
pt_br: As descrições podem incluir marcação Texinfo, que é útil para introduzir ornamentos como @code{@@code} ou @code{@@dfn}, listas de marcadores ou hiperlinks (@pxref{Overview,,, texinfo, GNU Texinfo}). No entanto, você deve ter cuidado ao usar alguns caracteres, por exemplo @samp{@@} e chaves, que são os caracteres especiais básicos em Texinfo (@pxref{Special Characters,,, texinfo, GNU Texinfo}). Interfaces de usuário como @command{guix show} cuidam de renderizá-lo apropriadamente.

source: Synopses and descriptions are translated by volunteers @uref{https://translate.codeberg.org/projects/guix/packages, at Weblate} so that as many users as possible can read them in their native language. User interfaces search them and display them in the language specified by the current locale.
it: Sinossi e descrizioni sono tradotte da volontari su @uref{https://translate.codeberg.org/projects/guix/packages, Weblate} in modo che il maggior numero possibile di utenti possa leggerle nella propria lingua madre. Le interfacce utente le cercano e le visualizzano nella lingua specificata dalla localizzazione corrente.
pt_br: Sinopses e descrições são traduzidas por voluntários @uref{https://translate.codeberg.org/projects/guix/packages, no Weblate} para que o maior número possível de usuários possam lê-las em seu idioma nativo. As interfaces de usuário os pesquisam e os exibem no idioma especificado pelo código do idioma atual.

source: To allow @command{xgettext} to extract them as translatable strings, synopses and descriptions @emph{must be literal strings}. This means that you cannot use @code{string-append} or @code{format} to construct these strings:
it: Per permettere a @command{xgettext} di estrarle come stringhe traducibili, le sinossi e le descrizioni @emph{devono essere stringhe letterali}. Questo significa che non puoi usare @code{string-append} o @code{format} per costruire queste stringhe:
pt_br: Para permitir que @command{xgettext} extrai-as com strings traduzíveis, as sinopses e descrições @emph{devem ser strings literais}. Isso significa que você não pode usar @code{string-append} ou @code{format} para construir essas strings:

source: (package ;; @dots{} (synopsis "This is translatable") (description (string-append "This is " "*not*" " translatable.")))
it: (package ;; @dots{} (synopsis "Questo è traducibile") (description (string-append "Questo " "*non*" " è traducibile.")))
pt_br: (package ;; @dots{} (synopsis "Isso é traduzível") (description (string-append "Isso " "*não*" " é traduzível.")))

source: Translation is a lot of work so, as a packager, please pay even more attention to your synopses and descriptions as every change may entail additional work for translators. In order to help them, it is possible to make recommendations or instructions visible to them by inserting special comments like this (@pxref{xgettext Invocation,,, gettext, GNU Gettext}):
it: La traduzione è un lavoro impegnativo, quindi, come pacchettizzatore, ti preghiamo di prestare ancora più attenzione alle tue sinossi e descrizioni, poiché ogni modifica può comportare un lavoro aggiuntivo per i traduttori. Per aiutarli, è possibile rendere visibili raccomandazioni o istruzioni inserendo commenti speciali come questo (@pxref{xgettext Invocation,,, gettext, GNU Gettext}):
pt_br: Tradução é muito trabalhoso, então, como empacotador, por favor, tenha ainda mais atenção às suas sinopses e descrições, pois cada alteração pode implicar em trabalho adicional para tradutores. Para ajudá-loas, é possível tornar recomendações ou instruções visíveis inserindo comentários especiais como esse (@pxref{xgettext Invocation,,, gettext, GNU Gettext}):

source: snippets, when to use
it: snippet, quando usarli
pt_br: snippets, quando usar

source: The boundary between using an origin snippet versus a build phase to modify the sources of a package can be elusive. Origin snippets are typically used to remove unwanted files such as bundled libraries, nonfree sources, or to apply simple substitutions. The source derived from an origin should produce a source that can be used to build the package on any system that the upstream package supports (i.e., act as the corresponding source). In particular, origin snippets must not embed store items in the sources; such patching should rather be done using build phases. Refer to the @code{origin} record documentation for more information (@pxref{origin Reference}).
it: Il confine tra l'uso di uno snippet di origine e una fase di compilazione per modificare i sorgenti di un pacchetto può essere sfuggente. Gli snippet di origine sono tipicamente usati per rimuovere file indesiderati come librerie incluse, sorgenti non liberi o per applicare semplici sostituzioni. Il sorgente derivato da un'origine dovrebbe produrre un sorgente che può essere usato per costruire il pacchetto su qualsiasi sistema supportato dal pacchetto upstream (cioè, agire come sorgente corrispondente). In particolare, gli snippet di origine non devono incorporare elementi dello store nei sorgenti; tale patching dovrebbe essere fatto usando le fasi di compilazione. Fai riferimento alla documentazione del record @code{origin} per maggiori informazioni (@pxref{origin Reference}).
pt_br: A fronteira entre usar um snippet de origem e uma fase de construção para modificar as fontes de um pacote pode ser ilusória. Os snippets de origem são normalmente usados para remover arquivos indesejados, como bibliotecas agrupadas, fontes não livres ou para aplicar substituições simples. A fonte derivada de uma origem deve produzir uma fonte que possa ser usada para construir o pacote em qualquer sistema que o pacote suporte (ou seja, atuar como a fonte correspondente). Em particular, os snippets de origem não devem incorporar itens do armazém nas fontes; tal correção deve ser feita usando fases de construção. Consulte a documentação do registro @code{origin} para obter mais informações (@pxref{origin Reference}).

source: While there cannot be circular dependencies between packages, Guile's lax module loading mechanism allows circular dependencies between Guile modules, which doesn't cause problems as long as the following conditions are followed for two modules part of a dependency cycle:
it: Sebbene non possano esserci dipendenze circolari tra i pacchetti, il meccanismo di caricamento dei moduli di Guile, meno rigido, permette dipendenze circolari tra i moduli Guile, il che non causa problemi finché le seguenti condizioni sono rispettate per due moduli che fanno parte di un ciclo di dipendenze:
pt_br: Embora não possa haver dependências circulares entre pacotes, o mecanismo frouxo de carregamento de módulos do Guile permite dependências circulares entre módulos do Guile, o que não causa problemas, desde que as seguintes condições sejam seguidas para dois módulos que fazem parte de um ciclo de dependência:

source: rules to cope with circular module dependencies
it: regole per gestire le dipendenze circolari tra moduli
pt_br: regras para lidar com dependências de módulos circulares

source: Macros are not shared between the co-dependent modules
it: Le macro non sono condivise tra i moduli co-dipendenti
pt_br: As macros não devem ser compartilhadas entre os módulos co-dependentes
