Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: (define-public my-libgit2 (let ((commit "e98d0a37c93574d2c6107bf7f31140b548c6a7bf") (revision "1")) (package (name "my-libgit2") (version (git-version "0.26.6" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/libgit2/libgit2/") (commit commit))) (file-name (git-file-name name version)) (sha256 (base32 "17pjvprmdrx4h6bb1hhc98w9qi6ki7yl57f090n9kbhswxqfs7s3")) (patches (search-patches "libgit2-mtime-0.patch")) (modules '((guix build utils))) ;; Remove bundled software. (snippet '(delete-file-recursively "deps")))) (build-system cmake-build-system) (outputs '("out" "debug")) (arguments `(#:tests? #true ; Run the test suite (this is the default) #:configure-flags '("-DUSE_SHA1DC=ON") ; SHA-1 collision detection #:phases (modify-phases %standard-phases (add-after 'unpack 'fix-hardcoded-paths (lambda _ (substitute* "tests/repo/init.c" (("#!/bin/sh") (string-append "#!" (which "sh")))) (substitute* "tests/clar/fs.h" (("/bin/cp") (which "cp")) (("/bin/rm") (which "rm"))))) ;; Run checks more verbosely. (replace 'check (lambda* (#:key tests? #:allow-other-keys) (when tests? (invoke "./libgit2_clar" "-v" "-Q")))) (add-after 'unpack 'make-files-writable-for-tests (lambda _ (for-each make-file-writable (find-files "."))))))) (inputs (list libssh2 http-parser python-wrapper)) (native-inputs (list pkg-config)) (propagated-inputs ;; These two libraries are in 'Requires.private' in libgit2.pc. (list openssl zlib)) (home-page "https://libgit2.github.com/") (synopsis "Library providing Git core methods") (description "Libgit2 is a portable, pure C implementation of the Git core methods provided as a re-entrant linkable library with a solid API, allowing you to write native speed custom Git applications in any language with bindings.") ;; GPLv2 with linking exception (license license:gpl2))))
es: (define-public my-libgit2 (let ((commit "e98d0a37c93574d2c6107bf7f31140b548c6a7bf") (revision "1")) (package (name "my-libgit2") (version (git-version "0.26.6" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/libgit2/libgit2/") (commit commit))) (file-name (git-file-name name version)) (sha256 (base32 "17pjvprmdrx4h6bb1hhc98w9qi6ki7yl57f090n9kbhswxqfs7s3")) (patches (search-patches "libgit2-mtime-0.patch")) (modules '((guix build utils))) ;; Remove bundled software. (snippet '(delete-file-recursively "deps")))) (build-system cmake-build-system) (outputs '("out" "debug")) (arguments `(#:tests? #true ; Ejecutar el conjunto de pruebas (por defecto) #:configure-flags '("-DUSE_SHA1DC=ON") ; SHA-1 detección de colisiones #:phases (modify-phases %standard-phases (add-after 'unpack 'fix-hardcoded-paths (lambda _ (substitute* "tests/repo/init.c" (("#!/bin/sh") (string-append "#!" (which "sh")))) (substitute* "tests/clar/fs.h" (("/bin/cp") (which "cp")) (("/bin/rm") (which "rm"))))) ;; Realiza comprobaciones más verbosas. (replace 'check (lambda* (#:key tests? #:allow-other-keys) (when tests? (invoke "./libgit2_clar" "-v" "-Q")))) (add-after 'unpack 'make-files-writable-for-tests (lambda _ (for-each make-file-writable (find-files "."))))))) (inputs (list libssh2 http-parser python-wrapper)) (native-inputs (list pkg-config)) (propagated-inputs ;; Estas dos bibliotecas se encuentran en 'Requires.private' en libgit2.pc. (list openssl zlib)) (home-page "https://libgit2.github.com/") (synopsis "Biblioteca que proporciona los métodos básicos de Git") (description "Libgit2 es una implementación portable en C puro de los métodos centrales de Git, proporcionada como una biblioteca enlazable reentrante con una API sólida, que permite escribir aplicaciones Git personalizadas a velocidad nativa en cualquier lenguaje con bindings.") ;; GPLv2 with linking exception (license license:gpl2))))
it: (define-public my-libgit2 (let ((commit "e98d0a37c93574d2c6107bf7f31140b548c6a7bf") (revision "1")) (package (name "my-libgit2") (version (git-version "0.26.6" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/libgit2/libgit2/") (commit commit))) (file-name (git-file-name name version)) (sha256 (base32 "17pjvprmdrx4h6bb1hhc98w9qi6ki7yl57f090n9kbhswxqfs7s3")) (patches (search-patches "libgit2-mtime-0.patch")) (modules '((guix build utils))) ;; Rimuovi software in bundle. (snippet '(delete-file-recursively "deps")))) (build-system cmake-build-system) (outputs '("out" "debug")) (arguments `(#:tests? #true ; Esegui la suite di test (questo è il valore predefinito) #:configure-flags '("-DUSE_SHA1DC=ON") ; Rilevamento collisioni SHA-1 #:phases (modify-phases %standard-phases (add-after 'unpack 'fix-hardcoded-paths (lambda _ (substitute* "tests/repo/init.c" (("#!/bin/sh") (string-append "#!" (which "sh")))) (substitute* "tests/clar/fs.h" (("/bin/cp") (which "cp")) (("/bin/rm") (which "rm"))))) ;; Esegui i controlli in modo più verboso. (replace 'check (lambda* (#:key tests? #:allow-other-keys) (when tests? (invoke "./libgit2_clar" "-v" "-Q")))) (add-after 'unpack 'make-files-writable-for-tests (lambda _ (for-each make-file-writable (find-files "."))))))) (inputs (list libssh2 http-parser python-wrapper)) (native-inputs (list pkg-config)) (propagated-inputs ;; Queste due librerie sono in 'Requires.private' in libgit2.pc. (list openssl zlib)) (home-page "https://libgit2.github.com/") (synopsis "Libreria che fornisce i metodi core di Git") (description "Libgit2 è un'implementazione portatile e pura in C dei metodi core di Git fornita come libreria rientrante collegabile con una solida API, che consente di scrivere applicazioni Git personalizzate a velocità nativa in qualsiasi linguaggio con binding.") ;; GPLv2 con eccezione di linking (license license:gpl2))))
pt_br: (define-public my-libgit2 (let ((commit "e98d0a37c93574d2c6107bf7f31140b548c6a7bf") (revision "1")) (package (name "my-libgit2") (version (git-version "0.26.6" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/libgit2/libgit2/") (commit commit))) (file-name (git-file-name name version)) (sha256 (base32 "17pjvprmdrx4h6bb1hhc98w9qi6ki7yl57f090n9kbhswxqfs7s3")) (patches (search-patches "libgit2-mtime-0.patch")) (modules '((guix build utils))) ;; Remover software empacotado. (snippet '(delete-file-recursively "deps")))) (build-system cmake-build-system) (outputs '("out" "debug")) (arguments `(#:tests? #true ; Execute o conjunto de testes (este é o padrão) #:configure-flags '("-DUSE_SHA1DC=ON") ; Detecção de colisão SHA-1 #:phases (modify-phases %standard-phases (add-after 'unpack 'fix-hardcoded-paths (lambda _ (substitute* "tests/repo/init.c" (("#!/bin/sh") (string-append "#!" (which "sh")))) (substitute* "tests/clar/fs.h" (("/bin/cp") (which "cp")) (("/bin/rm") (which "rm"))))) ;; Execute verificações de forma mais detalhada. (replace 'check (lambda* (#:key tests? #:allow-other-keys) (when tests? (invoke "./libgit2_clar" "-v" "-Q")))) (add-after 'unpack 'make-files-writable-for-tests (lambda _ (for-each make-file-writable (find-files "."))))))) (inputs (list libssh2 http-parser python-wrapper)) (native-inputs (list pkg-config)) (propagated-inputs ;; Essas duas bibliotecas estão em 'Requires.private' em libgit2.pc. (list openssl zlib)) (home-page "https://libgit2.github.com/") (synopsis "Biblioteca que fornece métodos básicos do Git") (description "Libgit2 é uma implementação C pura e portátil dos métodos principais do Git fornecida como uma biblioteca vinculável reentrante com uma API sólida, permitindo que você escreva aplicativos Git personalizados de velocidade nativa em qualquer linguagem com vinculações.") ;; GPLv2 com exceção de vinculação (license license:gpl2))))
sk: (define-public my-libgit2 (let ((commit "e98d0a37c93574d2c6107bf7f31140b548c6a7bf") (revision "1")) (package (name "my-libgit2") (version (git-version "0.26.6" revision commit)) (source (origin (method git-fetch) (uri (git-reference (url "https://github.com/libgit2/libgit2/") (commit commit))) (file-name (git-file-name name version)) (sha256 (base32 "17pjvprmdrx4h6bb1hhc98w9qi6ki7yl57f090n9kbhswxqfs7s3")) (patches (search-patches "libgit2-mtime-0.patch")) (modules '((guix build utils))) ;; Odstrániť pribalený softvér. (snippet '(delete-file-recursively "deps")))) (build-system cmake-build-system) (outputs '("out" "debug")) (arguments `(#:tests? #true ; Preveriť výsledok zostavenia (predvolené). #:configure-flags '("-DUSE_SHA1DC=ON") ; Zisťovanie rozporov v odtlačkoch SHA-1 #:phases (modify-phases %standard-phases (add-after 'unpack 'fix-hardcoded-paths (lambda _ (substitute* "tests/repo/init.c" (("#!/bin/sh") (string-append "#!" (which "sh")))) (substitute* "tests/clar/fs.h" (("/bin/cp") (which "cp")) (("/bin/rm") (which "rm"))))) ;; Bohatší výstup pri preverovaní zostavenia (replace 'check\n" (lambda* (#:key tests? #:allow-other-keys)\n" (when tests?\n" (invoke \"./libgit2_clar\" \"-v\" \"-Q\"))))\n" (add-after 'unpack 'make-files-writable-for-tests (lambda _ (for-each make-file-writable (find-files "." ".*"))))))) (inputs (list libssh2 http-parser python-wrapper)) (native-inputs (list pkg-config)) (propagated-inputs ;; Tieto dve knižnice sa nachádzajú v „Requires.private“ v libgit2.pc. (list openssl zlib)) (home-page "https://libgit2.github.com/") (synopsis "Library providing Git core methods") (description "Libgit2 is a portable, pure C implementation of the Git core methods provided as a re-entrant linkable library with a solid API, allowing you to write native speed custom Git applications in any language with bindings.") ;; GPLv2 s odkazovou výnimkou (license license:gpl2))))

source: (In those cases were you only want to tweak a few fields from a package definition, you should rely on inheritance instead of copy-pasting everything. See below.)
es: (En aquellos casos eran solo querían configurar unos pocos campos desde una definición de pquete, relativamente en herencia en vez de todo copia-pega. Consulte a continuación.)
it: (Nei casi in cui si desidera solo modificare alcuni campi da una definizione di pacchetto, si dovrebbe fare affidamento sull'ereditarietà invece di copiare e incollare tutto. Vedi sotto.)
pt_br: (Nos casos em que você deseja ajustar apenas alguns campos de uma definição de pacote, você deve confiar na herança em vez de copiar e colar tudo. Veja abaixo.)
sk: (V prípade, že chcete zmeniť len pár polí v pôvodnom zadaní balíka by ste sa mali spoľahnúť na dedičnosť namiesto skopírovania celého zadania. Viď nižšie.)

source: Let's discuss those fields in depth.
es: Discutimos esos campos en profundidad.
it: Discutiamo questi campi in dettaglio.
pt_br: Vamos discutir esses campos em profundidade.
sk: Pozrime sa teraz na tieto polia zblízka.

source: @code{git-fetch} method
es: El método @code{git-fetch}
it: Metodo @code{git-fetch}
pt_br: Método @code{git-fetch}
sk: spôsob @code{git-fetch}

source: Unlike the @code{url-fetch} method, @code{git-fetch} expects a @code{git-reference} which takes a Git repository and a commit. The commit can be any Git reference such as tags, so if the @code{version} is tagged, then it can be used directly. Sometimes the tag is prefixed with a @code{v}, in which case you'd use @code{(commit (string-append "v" version))}.
es: A diferencia del método @code{url-fetch}, @code{git-fetch} espera un @code{git-reference} que toma un repositorio Git y un commit. El commit puede ser cualquier referencia Git como etiquetas, por lo que si el @code{version} está etiquetado, entonces puede usarse directamente. A veces la etiqueta va precedida de @code{v}, en cuyo caso se usaría @code{(commit (string-append "v" version))}.
it: A differenza del metodo @code{url-fetch}, @code{git-fetch} si aspetta un @code{git-reference} che accetta un repository Git e un commit. Il commit può essere qualsiasi riferimento Git come i tag, quindi se la @code{version} è taggata, allora può essere usata direttamente. A volte il tag è preceduto da una @code{v}, nel qual caso si userebbe @code{(commit (string-append "v" version))}.
pt_br: Ao contrário do método @code{url-fetch}, @code{git-fetch} espera um @code{git-reference} que usa um repositório Git e um commit. O commit pode ser qualquer referência do Git, como tags, portanto, se @code{version} estiver marcado, ele poderá ser usado diretamente. Às vezes, a tag é prefixada com @code{v}; nesse caso, você usaria @code{(commit (string-append "v" version))}.
sk: Narozdiel od funkcie @code{url-fetch}, @code{git-fetch} vyžaduje @code{git-reference}, ktorú určuje Git repozitár a príslušná úprava. Úpravou sa rozumie akýkoľvek odkaz Git ako napríklad značka. Teda, ak je @code{version} označená, tak je možné použiť priamo číslo verzie. Niekedy majú značky verzií perdponu @code{v}. V tomto prípade môžete použiť @code{(commit (string-append "v" version))}.

source: To ensure that the source code from the Git repository is stored in a directory with a descriptive name, we use @code{(file-name (git-file-name name version))}.
es: Para garantizar que el código fuente del repositorio Git se almacena en un directorio con un nombre descriptivo, utilizamos @code{(file-name (git-file-name name version))}.
it: Per assicurarsi che il codice sorgente dal repository Git sia memorizzato in una directory con un nome descrittivo, usiamo @code{(file-name (git-file-name name version))}.
pt_br: Para garantir que o código-fonte do repositório Git seja armazenado em um diretório com um nome descritivo, usamos @code{(nome‐do- arquivo (nome-do-arquivo-git versão))}.
sk: Aby sme sa uistili, že sa zdrojový kód z Git repozitára uloží do priečinka s výstižným názvom, použijeme @code{(file-name (git-file-name name version))}.

source: The @code{git-version} procedure can be used to derive the version when packaging programs for a specific commit, following the Guix contributor guidelines (@pxref{Version Numbers,,, guix, GNU Guix Reference Manual}).
es: El procedimiento @code{git-version} puede usarse para derivar la versión cuando se empaquetan programas para una confirmación específica, siguiendo las directrices de los contribuidores de Guix (@pxref{Versiones numéricas,,, guix.es, Manual de referencia de GNU Guix}).
it: La procedura @code{git-version} può essere usata per derivare la versione quando si impacchettano programmi per un commit specifico, seguendo le linee guida per i contributori di Guix (@pxref{Numeri di versione,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: O procedimento @code{git-version} pode ser usado para derivar a versão ao empacotar programas para um commit específico, seguindo as diretrizes do contribuidor Guix (@pxref{Números de versão,,, guix.pt_BR, Manual de Referência do GNU Guix}).
sk: Keď zadávate balík pre program s určitým číslom úpravy, môžete pre odvodenie správneho označenia verzie použiť funkciu @code{git-version} podľa pokynov v príručke prispievateľa do Guixu (@pxref{Version Numbers,,, guix, GNU Guix Reference Manual}).

source: How does one obtain the @code{sha256} hash that's in there, you ask? By invoking @command{guix hash} on a checkout of the desired commit, along these lines:
es: ¿Cómo se obtiene el hash @code{sha256} que está ahí, te preguntarás? Invocando @command{guix hash} en una revisión de la confirmación deseada, de la siguiente manera:
it: Come si ottiene l'hash @code{sha256} che si trova lì, chiedi? Invocando @command{guix hash} su un checkout del commit desiderato, in questo modo:
pt_br: Como obter o hash @code{sha256} que está aí, você pergunta? Invocando @command{guix hash} em um checkout do commit desejado, da seguinte forma:
sk: Pýtate sa ako získať správny odtlačok @code{sha256}? Vyvolaním @command{guix hash} na miestnej kópii repozitára v požadovanej úprave, asi takto:

source: @command{guix hash -rx} computes a SHA256 hash over the whole directory, excluding the @file{.git} sub-directory (@pxref{Invoking guix hash,,, guix, GNU Guix Reference Manual}).
es: @command{guix hash -rx} calcula un hash SHA256 sobre el directorio completo, excluyendo el sub-directorio @file{.git} (@pxref{Invocación de guix hash,,, guix.es, Manual referencial de GNU Guix}).
it: @command{guix hash -rx} calcola un hash SHA256 sull'intera directory, escludendo la sottodirectory @file{.git} (@pxref{Invocare guix hash,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: @command{guix hash -rx} calcula um hash SHA256 em todo o diretório, excluindo o subdiretório @file{.git} (@pxref{Invocando guix hash,,, guix.pt_BR, Manual de Referência do GNU Guix}).
sk: @command{guix hash -rx} vypočíta odtlačok SHA256 celého priečinka nezahŕňajúc pod-priečinok @file{.git} (@pxref{Invoking guix hash,,, guix, GNU Guix Reference Manual}).

source: In the future, @command{guix download} will hopefully be able to do these steps for you, just like it does for regular downloads.
es: En el futuro, @command{guix download} ojalá sea capaz de hacer estos pasos por usted, tan solo lo hace para descargas usuales.
it: In futuro, @command{guix download} sarà, si spera, in grado di eseguire questi passaggi per te, proprio come fa per i download normali.
pt_br: No futuro, @command{guix download} será capaz de executar essas etapas para você, assim como faz para downloads regulares.
sk: Do budúcna bude snáď @command{guix download} schopný vykonávať tieto kroky za vás, tak ako je tomu pri bežných sťahovaniach súborov.

source: Snippets
es: Fragmentos
it: Frammenti
pt_br: Trechos
sk: Kusy kódu

source: Snippets are quoted (i.e. non-evaluated) Scheme code that are a means of patching the source. They are a Guix-y alternative to the traditional @file{.patch} files. Because of the quote, the code in only evaluated when passed to the Guix daemon for building. There can be as many snippets as needed.
es: Los fragmentos de código Scheme están entrecomillados (es decir, no evaluado) que tienen un sentido de parcheo de la fuente. Son una alternativa de Guix-y para los archvios tradicionales de tipo parche (@file{.patch}). Debido a la comilla, el código solamente es evaluado cuando pase al daemon Guix para construcción. Allí puede tener tangos fragmentos como se necesiten.
it: Gli snippet sono codice Scheme quotato (cioè non valutato) che è un mezzo per applicare patch al sorgente. Sono un'alternativa in stile Guix ai tradizionali file @file{.patch}. A causa della quotatura, il codice viene valutato solo quando passato al demone Guix per la costruzione. Possono esserci quanti snippet sono necessari.
pt_br: Os trechos ("Snippets" ) são códigos de Scheme marcado como literal (ou seja, não avaliados) que são um meio de corrigir a fonte. Eles são uma alternativa Guix-y aos arquivos @file{.patch} tradicionais. Por causa da marcação, o código só é avaliado quando passado para o daemon Guix para construção. Pode haver quantos trechos forem necessários.
sk: Kusy kódu predstavujú malé časti Scheme kódu v úvodzovkách, t.j. bežne nevykonávané, ktoré sa používajú na plátanie zdrojových súborov. Je to taká Guixová náhrada za dobre známe @file{.patch} súbory. Vďaka úvodzovkám sa daný kód vykoná len vtedy, keď sa odošle démonovi Guixu na zostavenie. V praxi môžeme použiť toľko kusov kódu, koľko potrebujeme.

source: Snippets might need additional Guile modules which can be imported from the @code{modules} field.
es: Los fragmentos quizá necesiten módulos Guile adicionales los cuales pueden ser importados desde el campo @code{modules}.
it: Gli snippet potrebbero aver bisogno di moduli Guile aggiuntivi che possono essere importati dal campo @code{modules}.
pt_br: Os snippets podem precisar de módulos Guile adicionais que podem ser importados do campo @code{modules}.
sk: Kusy kódu môžu vyžadovať prídavné moduly Guilu, ktoré je možné načítať pomocou poľa @code{modules}.

source: Inputs
es: Entradas
it: Input
pt_br: Entradas
sk: Vstupy
sv: Inmatningar

source: There are 3 different input types. In short:
es: Hay tres tipos diferentes de entrada. Las cortas:
it: Ci sono 3 diversi tipi di input. In breve:
pt_br: Existem 3 tipos de entradas diferentes. Resumidamente:
sk: Jestvujú tri rôzne druhy vstupov. V skratke:

source: Required for building but not runtime -- installing a package through a substitute won't install these inputs.
es: Requerido para construir pero no en tiempo de ejecución -- instalando un paquete por un sustituto no instalaría estas entradas.
it: Richiesti per la compilazione ma non per il runtime -- l'installazione di un pacchetto tramite un sostituto non installerà questi input.
pt_br: Necessário para construção, mas não para tempo de execução - instalar um pacote por meio de um substituto não instalará essas entradas.
sk: Vyžadované pri zostavovaní ale nie pri spúšťaní. V prípade inštalácie balíka prostredníctvom náhrady sa tieto vstupy nebudú inštalovať.

source: Installed in the store but not in the profile, as well as being present at build time.
es: Instalado en el almacén pero no en el perfil, así como estando presente en tiempo de construcción.
it: Installati nello store ma non nel profilo, oltre ad essere presenti al momento della compilazione.
pt_br: Instalado no armazém mas não no perfil, além de estar presente na hora da construção.
sk: Inštalované do úložiska ale nie do profilu a prítomné pri zostavovaní.

source: Installed in the store and in the profile, as well as being present at build time.
es: Instalado en el almacén y en el perfil, además de estar presente en el momento de la construcción.
it: Installati nello store e nel profilo, oltre ad essere presenti al momento della compilazione.
pt_br: Instalado no armazém e no perfil, além de estar presente na hora da construção.
sk: Inštalované do úložiska aj do profilu a prítomné pri zostavovaní.

source: @xref{package Reference,,, guix, GNU Guix Reference Manual} for more details.
es: @xref{Referencia de package,,, guix.es, Manual de referencia de GNU Guix} para más detalles.
it: @xref{Riferimenti per 'package',,, guix.it, Manuale di riferimento di GNU Guix} per maggiori dettagli.
pt_br: @xref{Referência do package,,, guix.pt_BR, Manual de referência GNU Guix} para mais detalhes.
sk: @xref{package Reference,,, guix, GNU Guix Reference Manual} pre viac podrobností.

source: The distinction between the various inputs is important: if a dependency can be handled as an @emph{input} instead of a @emph{propagated input}, it should be done so, or else it ``pollutes'' the user profile for no good reason.
es: La distinción entre las distintas entradas es importante: si una dependencia puede tratarse como una @emph{entrada} en lugar de como una @emph{entrada propagada}, debe hacerse así, o de lo contrario ``contaminará'' el perfil de usuario sin una buena razón.
it: La distinzione tra i vari input è importante: se una dipendenza può essere gestita come un @emph{input} invece di un @emph{input propagato}, dovrebbe essere fatto così, altrimenti ``inquina'' il profilo utente senza una buona ragione.
pt_br: A distinção entre as diversas entradas é importante: se uma dependência puder ser tratada como uma @emph{input} em vez de uma @emph{propagated input}, isso deverá ser feito, caso contrário ela ``poluirá'' o perfil do usuário sem nenhuma boa razão.
sk: Správne rozlišovanie medzi jednotlivými druhmi vstupov je dôležité: ak je možné závislosť zaradiť ako @emph{input} namiesto @emph{propagated input}, tak by sa to tak malo urobiť. Inak bezdôvodne „znečistí“ používateľský profil.
