Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Currently all files with a name matching the regular expression @code{/gnu/store/.+-(guix-.+|profile)/bin/guix-daemon} are assigned the label @code{guix_daemon_exec_t}; this means that @emph{any} file with that name in any profile would be permitted to run in the @code{guix_daemon_t} domain. This is not ideal. An attacker could build a package that provides this executable and convince a user to install and run it, which lifts it into the @code{guix_daemon_t} domain. At that point SELinux could not prevent it from accessing files that are allowed for processes in that domain.
it: Attualmente, a tutti i file con un nome che corrisponde all'espressione regolare @code{/gnu/store/.+-(guix-.+|profile)/bin/guix-daemon} viene assegnata l'etichetta @code{guix_daemon_exec_t}; questo significa che @emph{any} file con quel nome in qualsiasi profilo sarebbe autorizzato a essere eseguito nel dominio @code{guix_daemon_t}. Questo non è l'ideale. Un aggressore potrebbe creare un pacchetto che fornisce questo eseguibile e convincere un utente a installarlo ed eseguirlo, il che lo eleva al dominio @code{guix_daemon_t}. A quel punto SELinux non potrebbe impedirgli di accedere ai file consentiti per i processi in quel dominio.
pt_br: Atualmente, todos os arquivos com um nome correspondente à expressão regular @code{/gnu/store/.+-(guix-.+|profile)/bin/guix-daemon} recebem o rótulo @code{guix_daemon_exec_t}; isso significa que @emph{qualquer} arquivo com esse nome em qualquer perfil poderá ser executado no domínio de @code{guix_daemon_t}. Isto não é o ideal. Um invasor pode criar um pacote que forneça esse executável e convencer um usuário a instalar e executá-lo, o que o eleva ao domínio de @code{guix_daemon_t}. Nesse ponto, o SELinux não poderia impedir o acesso a arquivos permitidos para processos nesse domínio.

source: You will need to relabel the store directory after all upgrades to @file{guix-daemon}, such as after running @code{guix pull}. Assuming the store is in @file{/gnu}, you can do this with @code{restorecon -vR /gnu}, or by other means provided by your operating system.
it: Dovrai rietichettare la directory dello store dopo tutti gli aggiornamenti a @file{guix-daemon}, come dopo aver eseguito @code{guix pull}. Supponendo che lo store sia in @file{/gnu}, puoi farlo con @code{restorecon -vR /gnu}, o con altri mezzi forniti dal tuo sistema operativo.
pt_br: Você precisará renomear o diretório store após todas as atualizações para @file{guix-daemon}, como após executar @code{guix pull}. Supondo que o store esteja em @file{/gnu}, você pode fazer isso com @code{restorecon -vR /gnu}, ou por outros meios fornecidos pelo seu sistema operacional.

source: We could generate a much more restrictive policy at installation time, so that only the @emph{exact} file name of the currently installed @code{guix-daemon} executable would be labelled with @code{guix_daemon_exec_t}, instead of using a broad regular expression. The downside is that root would have to install or upgrade the policy at installation time whenever the Guix package that provides the effectively running @code{guix-daemon} executable is upgraded.
it: Potremmo generare una policy molto più restrittiva al momento dell'installazione, in modo che solo il nome @emph{exact} del file dell'eseguibile @code{guix-daemon} attualmente installato verrebbe etichettato con @code{guix_daemon_exec_t}, invece di usare un'espressione regolare generica. Lo svantaggio è che l'utente root dovrebbe installare o aggiornare la policy al momento dell'installazione ogni volta che il pacchetto Guix che fornisce l'eseguibile @code{guix-daemon} effettivamente in esecuzione viene aggiornato.
pt_br: Poderíamos gerar uma política muito mais restritiva no momento da instalação, para que apenas o nome do arquivo @emph{exato} do executável @code{guix-daemon} atualmente instalado seja rotulado com @code{guix_daemon_exec_t}, em vez de usar um amplo expressão regular. A desvantagem é que o root precisaria instalar ou atualizar a política no momento da instalação sempre que o pacote Guix que fornece o executável @code{guix-daemon} em execução efetiva for atualizado.

source: Invoking @command{guix-daemon}
it: Invocare @command{guix-daemon}
pt_br: Invocando @command{guix-daemon}

source: The @command{guix-daemon} program implements all the functionality to access the store. This includes launching build processes, running the garbage collector, querying the availability of a build result, etc. It is normally run as @code{root} like this:
it: Il programma @command{guix-daemon} implementa tutte le funzionalità per accedere allo store. Ciò include l'avvio dei processi di build, l'esecuzione del garbage collector, l'interrogazione sulla disponibilità di un risultato di build, ecc. Di solito viene eseguito come @code{root} in questo modo:
pt_br: O programa @command{guix-daemon} implementa todas as funcionalidades para acessar o armazém. Isso inclui iniciar processos de compilação, executar o coletor de lixo, consultar a disponibilidade de um resultado da compilação etc. É normalmente executado como @code{root}, assim:

source: This daemon can also be started following the systemd ``socket activation'' protocol (@pxref{Service De- and Constructors, @code{make-systemd-constructor},, shepherd, The GNU Shepherd Manual}).
it: Questo demone può anche essere avviato seguendo il protocollo di ``attivazione socket'' di systemd (@pxref{Service De- and Constructors, @code{make-systemd-constructor},, shepherd, The GNU Shepherd Manual}).
pt_br: Este daemon também pode ser iniciado seguindo o protocolo de ``ativação de soquete'' do systemd (@pxref{Service De- and Constructors, @code{make-systemd-constructor},, shepherd, The GNU Shepherd Manual}).

source: For details on how to set it up, @pxref{Setting Up the Daemon}.
it: Per i dettagli su come configurarlo, @pxref{Setting Up the Daemon}.
pt_br: Para detalhes sobre como configurá-lo, @pxref{Setting Up the Daemon}.

source: container, build environment
it: container, ambiente di build
pt_br: contêiner, ambiente de compilação

source: reproducible builds
pt_br: compilações reproduzíveis

source: By default, @command{guix-daemon} launches build processes under different UIDs, taken from the build group specified with @option{--build-users-group}. In addition, each build process is run in a chroot environment that only contains the subset of the store that the build process depends on, as specified by its derivation (@pxref{Programming Interface, derivation}), plus a set of specific system directories. By default, the latter contains @file{/dev} and @file{/dev/pts}. Furthermore, on GNU/Linux, the build environment is a @dfn{container}: in addition to having its own file system tree, it has a separate mount name space, its own PID name space, network name space, etc. This helps achieve reproducible builds (@pxref{Features}).
pt_br: Por padrão, @command{guix-daemon} inicia processos de compilação sob diferentes UIDs, obtidos do grupo de compilação especificado com @option{--build-users-group}. Além disso, cada processo de compilação é executado em um ambiente chroot que contém apenas o subconjunto do armazém do qual o processo de compilação depende, conforme especificado por sua derivação (@pxref{Programming Interface, derivação}), mais um conjunto de diretórios de sistema específicos. Por padrão, o último contém @file{/dev} e @file{/dev/pts}. Além disso, no GNU/Linux, o ambiente de compilação é um @dfn{container}: além de ter sua própria árvore de sistema de arquivos, ele tem um espaço de nome de montagem separado, seu próprio espaço de nome PID, espaço de nome de rede, etc. Isso ajuda a obter compilações reproduzíveis (@pxref{Features}).

source: When the daemon performs a build on behalf of the user, it creates a build directory under @file{/tmp} or under the directory specified by its @env{TMPDIR} environment variable. This directory is shared with the container for the duration of the build, though within the container, the build tree is always called @file{/tmp/guix-build-@var{name}.drv-0}.
pt_br: Quando o daemon executa uma compilação em nome do usuário, ele cria um diretório de compilação em @file{/tmp} ou no diretório especificado por sua variável de ambiente @env{TMPDIR}. Esse diretório é compartilhado com o contêiner durante a compilação, embora dentro do contêiner, a árvore de compilação seja sempre chamada de @file{/tmp/guix-build-@var{name}.drv-0}.

source: The build directory is automatically deleted upon completion, unless the build failed and the client specified @option{--keep-failed} (@pxref{Common Build Options, @option{--keep-failed}}).
pt_br: O diretório de compilação é excluído automaticamente após a conclusão, a menos que a compilação falhe e o cliente tenha especificado @option{--keep-failed} (@pxref{Common Build Options, @option{--keep-failed}}).

source: The daemon listens for connections and spawns one sub-process for each session started by a client (one of the @command{guix} sub-commands). The @command{guix processes} command allows you to get an overview of the activity on your system by viewing each of the active sessions and clients. @xref{Invoking guix processes}, for more information.
pt_br: O daemon escuta conexões e gera um subprocesso para cada sessão iniciada por um cliente (um dos subcomandos @command{guix}). O comando @command{guix processes} permite que você tenha uma visão geral da atividade no seu sistema visualizando cada uma das sessões e clientes ativos. @xref{Invoking guix processes}, para mais informações.

source: The following command-line options are supported:
pt_br: As seguintes opções de linha de comando são suportadas:

source: --build-users-group=@var{group}
pt_br: --build-users-group=@var{grupo}

source: Take users from @var{group} to run build processes (@pxref{Setting Up the Daemon, build users}).
pt_br: Obtém os usuários do @var{grupo} para executar os processos de compilação (@pxref{Setting Up the Daemon, usuários de compilação}).

source: substitutes
pt_br: substitutos

source: Do not use substitutes for build products. That is, always build things locally instead of allowing downloads of pre-built binaries (@pxref{Substitutes}).
pt_br: Não use substitutos para compilar produtos. Ou seja, sempre crie coisas localmente, em vez de permitir downloads de binários pré-compilados (@pxref{Substitutes}).

source: When the daemon runs with @option{--no-substitutes}, clients can still explicitly enable substitution @i{via} the @code{set-build-options} remote procedure call (@pxref{The Store}).
pt_br: Quando o daemon é executado com @option{--no-substitutes}, os clientes ainda podem habilitar explicitamente a substituição por meio da chamada de procedimento remoto @code{set-build-options} (@pxref{The Store}).

source: This means that substitutes may be downloaded from @var{urls}, as long as they are signed by a trusted signature (@pxref{Substitutes}).
pt_br: Isso significa que os substitutos podem ser baixados de @var{urls}, desde que assinados por uma assinatura confiável (@pxref{Substitutes}).

source: @xref{Getting Substitutes from Other Servers}, for more information on how to configure the daemon to get substitutes from other servers.
pt_br: @xref{Getting Substitutes from Other Servers}, para mais informações sobre como configurar o daemon para obter substitutos de outros servidores.

source: Do not use offload builds to other machines (@pxref{Daemon Offload Setup}). That is, always build things locally instead of offloading builds to remote machines.
pt_br: Não use compilações de offload para outras máquinas (@pxref{Daemon Offload Setup}). Ou seja, sempre compile as coisas localmente em vez de descarregar compilações para máquinas remotas.

source: Cache build failures. By default, only successful builds are cached.
pt_br: Armazena em cache as compilações que falharam. Por padrão, apenas compilações bem-sucedidas são armazenadas em cache.

source: When this option is used, @command{guix gc --list-failures} can be used to query the set of store items marked as failed; @command{guix gc --clear-failures} removes store items from the set of cached failures. @xref{Invoking guix gc}.
pt_br: Quando essa opção é usada, o @command{guix gc --list-failures} pode ser usado para consultar o conjunto de itens do armazém marcados como com falha; O @command{guix gc --clear-failures} remove os itens do armazém do conjunto de falhas em cache. @xref{Invoking guix gc}.

source: Use @var{n} CPU cores to build each derivation; @code{0} means as many as available.
pt_br: Usa @var{n} núcleos de CPU para compilar cada derivação; @code{0} significa todos disponíveis.

source: The default value is @code{0}, but it may be overridden by clients, such as the @option{--cores} option of @command{guix build} (@pxref{Invoking guix build}).
pt_br: O valor padrão é @code{0}, mas pode ser substituído pelos clientes, como a opção @option{--cores} de @command{guix build} (@pxref{Invoking guix build}).

source: The effect is to define the @env{NIX_BUILD_CORES} environment variable in the build process, which can then use it to exploit internal parallelism---for instance, by running @code{make -j$NIX_BUILD_CORES}.
pt_br: O efeito é definir a variável de ambiente @env{NIX_BUILD_CORES} no processo de compilação, que pode então usá-la para explorar o paralelismo interno — por exemplo, executando @code{make -j$NIX_BUILD_CORES}.

source: Allow at most @var{n} build jobs in parallel. The default value is @code{1}. Setting it to @code{0} means that no builds will be performed locally; instead, the daemon will offload builds (@pxref{Daemon Offload Setup}), or simply fail.
pt_br: Permite no máximo @var{n} tarefas de compilação em paralelo. O valor padrão é @code{1}. Definir como @code{0} significa que nenhuma compilação será executada localmente; em vez disso, o daemon descarregará as compilações (@pxref{Daemon Offload Setup}) ou simplesmente falhará.

source: --max-silent-time=@var{seconds}
pt_br: --max-silent-time=@var{segundos}

source: When the build or substitution process remains silent for more than @var{seconds}, terminate it and report a build failure.
pt_br: Quando o processo de compilação ou substituição permanecer em silêncio por mais de @var{segundos}, encerra-o e relata uma falha de compilação.

source: The value specified here can be overridden by clients (@pxref{Common Build Options, @option{--max-silent-time}}).
pt_br: O valor especificado aqui pode ser substituído pelos clientes (@pxref{Common Build Options, @option{--max-silent-time}}).

source: --timeout=@var{seconds}
pt_br: --timeout=@var{segundos}

source: Likewise, when the build or substitution process lasts for more than @var{seconds}, terminate it and report a build failure.
pt_br: Da mesma forma, quando o processo de compilação ou substituição durar mais que @var{segundos}, encerra-o e relata uma falha de compilação.

source: The default value is 24 hours.
pt_br: O valor padrão é 24 horas.

source: The value specified here can be overridden by clients (@pxref{Common Build Options, @option{--timeout}}).
pt_br: O valor especificado aqui pode ser substituído pelos clientes (@pxref{Common Build Options, @option{--timeout}}).

source: Build each derivation @var{n} times in a row, and raise an error if consecutive build results are not bit-for-bit identical. Note that this setting can be overridden by clients such as @command{guix build} (@pxref{Invoking guix build}).
pt_br: Compila cada derivação @var{n} vezes seguidas e gera um erro se os resultados consecutivos da compilação não forem idênticos bit a bit. Observe que essa configuração pode ser substituída por clientes como @command{guix build} (@pxref{Invoking guix build}).

source: When used in conjunction with @option{--keep-failed}, the differing output is kept in the store, under @file{/gnu/store/@dots{}-check}. This makes it easy to look for differences between the two results.
pt_br: Quando usado em conjunto com @option{--keep-failed}, uma saída de comparação é mantida no armazém, sob @file{/gnu/store/@dots{}-check}. Isso facilita procurar por diferenças entre os dois resultados.

source: Produce debugging output.
pt_br: Produz uma saída de depuração.

source: This is useful to debug daemon start-up issues, but then it may be overridden by clients, for example the @option{--verbosity} option of @command{guix build} (@pxref{Invoking guix build}).
pt_br: Isso é útil para depurar problemas de inicialização do daemon, mas pode ser substituído pelos clientes, por exemplo, a opção @option{--verbosity} de @command{guix build} (@pxref{Invoking guix build}).

source: Add @var{dir} to the build chroot.
pt_br: adiciona @var{dir} ao chroot de compilação.

source: Doing this may change the result of build processes---for instance if they use optional dependencies found in @var{dir} when it is available, and not otherwise. For that reason, it is not recommended to do so. Instead, make sure that each derivation declares all the inputs that it needs.
pt_br: Isso pode alterar o resultado dos processos de compilação -- por exemplo, se eles usam dependências opcionais encontradas em @var{dir} quando estão disponíveis, e não o contrário. Por esse motivo, não é recomendável fazê-lo. Em vez disso, verifique se cada derivação declara todas as entradas necessárias.

source: Disable chroot builds.
pt_br: Desabilita compilações em chroot.

source: --log-compression=@var{type}
pt_br: --log-compression=@var{tipo}

source: Compress build logs according to @var{type}, one of @code{gzip}, @code{bzip2}, or @code{none}.
pt_br: Compacta logs de compilação de aconrdo com @var{tipo}, que pode ser um entre @code{gzip}, @code{bzip2} e @code{none}.

source: Unless @option{--lose-logs} is used, all the build logs are kept in the @var{localstatedir}. To save space, the daemon automatically compresses them with gzip by default.
pt_br: A menos que @option{--lose-logs} seja usado, todos os logs de build são mantidos em @var{localstatedir}. Para economizar espaço, o daemon os compacta automaticamente com gzip por padrão.

source: Whether to discover substitute servers on the local network using mDNS and DNS-SD.
pt_br: Se deve descobrir servidores substitutos na rede local usando mDNS e DNS-SD.

source: This feature is still experimental. However, here are a few considerations.
pt_br: Este recurso ainda é experimental. No entanto, aqui estão algumas considerações.

source: It might be faster/less expensive than fetching from remote servers;
pt_br: Pode ser mais rápido/menos caro do que buscar em servidores remotos;

source: There are no security risks, only genuine substitutes will be used (@pxref{Substitute Authentication});
pt_br: Não há riscos de segurança, apenas substitutos genuínos serão usados (@pxref{Substitute Authentication});

source: An attacker advertising @command{guix publish} on your LAN cannot serve you malicious binaries, but they can learn what software you’re installing;
pt_br: Um invasor anunciando @command{guix publish} na sua LAN não pode fornecer binários maliciosos, mas pode descobrir qual software você está instalando;

source: Servers may serve substitute over HTTP, unencrypted, so anyone on the LAN can see what software you’re installing.
pt_br: Os servidores podem servir substitutos via HTTP, sem criptografia, para que qualquer pessoa na LAN possa ver qual software você está instalando.

source: It is also possible to enable or disable substitute server discovery at run-time by running:
pt_br: Também é possível habilitar ou desabilitar a descoberta de servidor substituto em tempo de execução executando:

source: deduplication
it: deduplicazione
pt_br: deduplicação

source: Disable automatic file ``deduplication'' in the store.
pt_br: Desabilita ``deduplicação'' automática de arquivos no armazém.

source: By default, files added to the store are automatically ``deduplicated'': if a newly added file is identical to another one found in the store, the daemon makes the new file a hard link to the other file. This can noticeably reduce disk usage, at the expense of slightly increased input/output load at the end of a build process. This option disables this optimization.
pt_br: Por padrão, os arquivos adicionados ao armazém são automaticamente ``deduplicados'': se um arquivo recém-adicionado for idêntico a outro encontrado no armazém, o daemon tornará o novo arquivo um link físico para o outro arquivo. Isso pode reduzir notavelmente o uso do disco, às custas de um leve aumento na carga de entrada/saída no final de um processo de criação. Esta opção desativa essa otimização.

source: Tell whether the garbage collector (GC) must keep outputs of live derivations.
pt_br: Diz se o coletor de lixo (GC) deve manter as saídas de derivações vivas.

source: GC roots
pt_br: raízes de GC

source: garbage collector roots
pt_br: raízes de coletor de lixo

source: When set to @code{yes}, the GC will keep the outputs of any live derivation available in the store---the @file{.drv} files. The default is @code{no}, meaning that derivation outputs are kept only if they are reachable from a GC root. @xref{Invoking guix gc}, for more on GC roots.
pt_br: Quando definido como @code{yes}, o GC manterá as saídas de qualquer derivação ativa disponível no armazém---os arquivos @file{.drv}. O padrão é @code{no}, o que significa que as saídas de derivação são mantidas somente se forem acessíveis a partir de uma raiz do GC. @xref{Invoking guix gc}, para mais informações sobre raízes do GC.

source: Tell whether the garbage collector (GC) must keep derivations corresponding to live outputs.
pt_br: Diz se o coletor de lixo (GC) deve manter as derivações correspondentes às saídas vivas.

source: When set to @code{yes}, as is the case by default, the GC keeps derivations---i.e., @file{.drv} files---as long as at least one of their outputs is live. This allows users to keep track of the origins of items in their store. Setting it to @code{no} saves a bit of disk space.
pt_br: Quando definido como @code{yes}, como é o caso por padrão, o GC mantém derivações---ou seja, arquivos @file{.drv}---desde que pelo menos uma de suas saídas esteja ativa. Isso permite que os usuários acompanhem as origens dos itens em seu armazém. Defini-lo como @code{no} economiza um pouco de espaço em disco.

source: In this way, setting @option{--gc-keep-derivations} to @code{yes} causes liveness to flow from outputs to derivations, and setting @option{--gc-keep-outputs} to @code{yes} causes liveness to flow from derivations to outputs. When both are set to @code{yes}, the effect is to keep all the build prerequisites (the sources, compiler, libraries, and other build-time tools) of live objects in the store, regardless of whether these prerequisites are reachable from a GC root. This is convenient for developers since it saves rebuilds or downloads.
pt_br: Dessa forma, definir @option{--gc-keep-derivations} como @code{yes} faz com que a vivacidade flua das saídas para as derivações, e definir @option{--gc-keep-outputs} como @code{yes} faz com que a vivacidade flua das derivações para as saídas. Quando ambos são definidos como @code{yes}, o efeito é manter todos os pré-requisitos de compilação (as fontes, o compilador, as bibliotecas e outras ferramentas de tempo de compilação) de objetos ativos no armazém, independentemente de esses pré-requisitos serem acessíveis a partir de uma raiz GC. Isso é conveniente para desenvolvedores, pois economiza reconstruções ou downloads.

source: On Linux-based systems, impersonate Linux 2.6. This means that the kernel's @command{uname} system call will report 2.6 as the release number.
pt_br: Em sistemas baseados em Linux, personifique o Linux 2.6. Isso significa que a chamada de sistema @command{uname} do kernel relatará 2.6 como o número da versão.
