Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: ;; Preserve timestamps (set to the Epoch) on the copied tree so that ;; things work deterministically. (copy-recursively source "." #:keep-mtime? #t) ;; Make the source checkout files writable, for convenience. (for-each (lambda (f) (false-if-exception (make-file-writable f))) (find-files "."))) (begin (cond ((string-suffix? ".zip" source) (invoke "unzip" source)) ((tarball? source) (invoke "tar" "xvf" source)) (else (let ((name (strip-store-file-name source)) (command (compressor source))) (copy-file source name) (when command (invoke command "--decompress" name))))) ;; Attempt to change into child directory. (and=> (first-subdirectory ".") chdir))))
es: ;; Conserva el sello horario y fecha (pone en la Epoch) en el árbol copiado tal que ;; las cosas funcionen determinísticamente. (copy-recursively source "." #:keep-mtime? #t) ;; Hacer que los archivos fuente sean grabables, por conveniencia. (for-each (lambda (f) (false-if-exception (make-file-writable f))) (find-files "."))) (begin (cond ((string-suffix? ".zip" source) (invoke "unzip" source)) ((tarball? source) (invoke "tar" "xvf" source)) (else (let ((name (strip-store-file-name source)) (command (compressor source))) (copy-file source name) (when command (invoke command "--decompress" name))))) ;; Intenta cambiar en directorio heredado. (and=> (first-subdirectory ".") chdir))))
it: ;; Preserva i timestamp (impostati sull'Epoch) sull'albero copiato in modo che ;; le cose funzionino in modo deterministico. (copy-recursively source "." #:keep-mtime? #t) ;; Rendi scrivibili i file del checkout sorgente, per comodità. (for-each (lambda (f) (false-if-exception (make-file-writable f))) (find-files "."))) (begin (cond ((string-suffix? ".zip" source) (invoke "unzip" source)) ((tarball? source) (invoke "tar" "xvf" source)) (else (let ((name (strip-store-file-name source)) (command (compressor source))) (copy-file source name) (when command (invoke command "--decompress" name))))) ;; Tenta di cambiare nella directory figlia. (and=> (first-subdirectory ".") chdir))))
pt_br: ;; Preservar os carimbos de data/hora (definidos para a Época) na árvore copiada para que ;; as coisas funcionem deterministicamente. (copy-recursively source "." #:keep-mtime? #t) ;; Faz com que os arquivos fonte tenham permissão de escrita, por conveniência. (for-each (lambda (f) (false-if-exception (make-file-writable f))) (find-files "."))) (begin (cond ((string-suffix? ".zip" source) (invoke "unzip" source)) ((tarball? source) (invoke "tar" "xvf" source)) (else (let ((name (strip-store-file-name source)) (command (compressor source))) (copy-file source name) (when command (invoke command "--decompress" name))))) ;; Tentar mudar para o diretório filho. (and=> (first-subdirectory ".") chdir))))

source: Note the @code{chdir} call: it changes the working directory to where the source was unpacked. Thus every phase following the @code{unpack} will use the source as a working directory, which is why we can directly work on the source files. That is to say, unless a later phase changes the working directory to something else.
es: Nota la invocación @code{chdir}: modifica el directorio de trabajo para donde la fuente fue desempaquetada. Por tanto cada fase sigue el desempaquetado (@code{unpack}) utilizará la fuente como un directorio de trabajo, el cual es porqué podemos trabajar directamente en los archivos de fuentes. Esto es decir, a no ser que una fase posterior cambia el directorio de trabajo a algo más.
it: Nota la chiamata @code{chdir}: cambia la directory di lavoro dove il sorgente è stato decompresso. Quindi ogni fase successiva a @code{unpack} userà il sorgente come directory di lavoro, ecco perché possiamo lavorare direttamente sui file sorgente. Cioè, a meno che una fase successiva non cambi la directory di lavoro in qualcos'altro.
pt_br: Observe a chamada @code{chdir}: ela altera o diretório de trabalho para onde a fonte foi descompactada. Assim, cada fase após o @code{unpack} usará a fonte como diretório de trabalho, e é por isso que podemos trabalhar diretamente nos arquivos de origem. Isto é, a menos que uma fase posterior mude o diretório de trabalho para outro.
sk: Všimnite si volanie @code{chdir}: zmení súčasný priečinok na umiestnenie, kde boli rozbalené zdrojové súbory. To znamená, že kroky nasledujúce po @code{unpack} použijú priečinok so zdrojovými súbormi ako ich pracovný priečinok. Preto môžeme priamo narábať so zdrojovými súbormi. Teda aspoň dovtedy, kým niektorý ďalší krok nezmení pracovný priečinok na iný.

source: We modify the list of @code{%standard-phases} of the build system with the @code{modify-phases} macro as per the list of specified modifications, which may have the following forms:
es: Modificamos el listado de fases @code{%standard-phases} del sistema de construcción con la macro @code{modify-phases} como por el listado de modificaciones especificadas, las cuales pueden tener los formularios siguientes:
it: Modifichiamo l'elenco di @code{%standard-phases} del sistema di compilazione con la macro @code{modify-phases} secondo l'elenco delle modifiche specificate, che possono avere le seguenti forme:
pt_br: Modificamos a lista de @code{%standard-phases} do sistema de construção com a macro @code{modify-phases} conforme a lista de modificações especificadas, que pode ter os seguintes formatos:
sk: Zoznam krokov @code{%standard-phases} zostavovacieho systému upravujeme pomocou makra @code{modify-phases} určujúceho aké úpravy sa majú vykonať, čo môže vyzerať asi takto:

source: @code{(add-before @var{phase} @var{new-phase} @var{procedure})}: Run @var{procedure} named @var{new-phase} before @var{phase}.
es: @code{(add-before @var{phase} @var{new-phase} @var{procedure})}: Ejecute @var{procedure} nombrado @var{new-phase} antes que @var{phase}.
it: @code{(add-before @var{phase} @var{new-phase} @var{procedure})}: Esegue la @var{procedure} denominata @var{new-phase} prima di @var{phase}.
pt_br: @code{(add-before @var{phase} @var{new-phase} @var{procedure})}: Execute @var{procedure} chamado @var{new-phase} antes de @var{phase}.
sk: @code{(add-before @var{krok} @var{novy-krok} @var{funkcia})}: Spustiť @var{funkcia} s názvom @var{novy-krok} pred @var{krok}.

source: @code{(add-after @var{phase} @var{new-phase} @var{procedure})}: Same, but afterwards.
es: @code{(add-after @var{phase} @var{new-phase} @var{procedure})}: Lo mismo, pero posteriores.
it: @code{(add-after @var{phase} @var{new-phase} @var{procedure})}: Idem, ma dopo.
pt_br: @code{(add-after @var{phase} @var{new-phase} @var{procedure})}: O mesmo, mas depois.
sk: @code{(add-after @var{krok} @var{novy-krok} @var{funkcia})}: Tak isto, ale za @var{krok}.

source: The @var{procedure} supports the keyword arguments @code{inputs} and @code{outputs}. Each input (whether @emph{native}, @emph{propagated} or not) and output directory is referenced by their name in those variables. Thus @code{(assoc-ref outputs "out")} is the store directory of the main output of the package. A phase procedure may look like this:
es: La @var{procedimiento} admite los argumentos de palabra clave @code{entradas} y @code{salidas}. Cada directorio de entrada (ya sea @emph{nativo}, @emph{propagado} o no) y salida se referencia por su nombre en esas variables. Así @code{(assoc-ref salidas "out")} es el directorio de almacenamiento de la salida principal del paquete. Un procedimiento de fase puede tener este aspecto:
it: La @var{procedure} supporta gli argomenti con parola chiave @code{inputs} e @code{outputs}. Ogni input (sia @emph{native}, @emph{propagato} o meno) e la directory di output sono referenziati dai loro nomi in quelle variabili. Quindi @code{(assoc-ref outputs "out")} è la directory dello store dell'output principale del pacchetto. Una procedura di fase può apparire così:
pt_br: O @var{procedure} suporta os argumentos de palavra-chave @code{inputs} e @code{outputs}. Cada entrada (seja @emph{native}, @emph{propagated} ou não) e diretório de saída são referenciados por seus nomes nessas variáveis. Assim @code{(assoc-ref outputs "out")} é o diretório de armazém da saída principal do pacote. Um procedimento de fase pode ser assim:
sk: @var{Funkcia} prijíma parametre @code{inputs} a @code{outputs} v tvare kľúčových slov. Každý vstup (či už @emph{pôvodný}, @emph{rozšírený} alebo nie) a výstupný priečinok je označený svojim názvom v týchto premenných. Takže @code{(assoc-ref outputs "out")} predstavuje priečinok úložiska hlavného výstupu balíka. Funkcia kroku vyzerá nasledovne:

source: Its return value is ignored.
es: Su valor de retorno se ignora.
it: Il suo valore di ritorno viene ignorato.
pt_br: Seu valor de retorno é ignorado.

source: The astute reader may have noticed the quasi-quote and comma syntax in the argument field. Indeed, the build code in the package declaration should not be evaluated on the client side, but only when passed to the Guix daemon. This mechanism of passing code around two running processes is called @uref{https://arxiv.org/abs/1709.00833, code staging}.
es: El lector astuto puede haber notado la sintaxis de comillas y comas en el campo de argumentos. De hecho, el código de construcción en la declaración del paquete no debe ser evaluado en el lado del cliente, sino sólo cuando se pasa al daemon Guix. Este mecanismo de pasar código entre dos procesos en ejecución se denomina @uref{https://arxiv.org/abs/1709.00833, code staging}.
it: Il lettore attento potrebbe aver notato la sintassi di quasi-citazione e virgola nel campo argomento. Infatti, il codice di compilazione nella dichiarazione del pacchetto non dovrebbe essere valutato lato client, ma solo quando passato al demone Guix. Questo meccanismo di passaggio di codice tra due processi in esecuzione è chiamato @uref{https://arxiv.org/abs/1709.00833, staging del codice}.
pt_br: O leitor astuto deve ter notado a sintaxe de crase e vírgula no campo do argumento. Na verdade, o código de construção na declaração do pacote não deve ser avaliado no lado do cliente, mas apenas quando passado para o daemon Guix. Esse mecanismo de passagem de código entre dois processos em execução é chamado @uref{https://arxiv.org/abs/1709.00833, preparação de código}.
sk: Ak ste boli pozorní, mohli ste si všimnúť obrátenú úvodzovku a čiarku v poli parametrov. Vskutku, zdrojový kód zostavenia v zadaní balíka by sa nemal vykonávať na strane klienta, ale až vtedy, keď sa odovzdá démonovi Guixu. Toto odovzdávanie zdrojového kódu medzi dvoma procesmi nazývame @uref{https://arxiv.org/abs/1709.00833, oddialené vykonanie}.

source: Utility functions
es: Funciones de utilidad
it: Funzioni di utilità
pt_br: Funções utilitárias
sk: Pomocné funkcie

source: When customizing @code{phases}, we often need to write code that mimics the equivalent system invocations (@code{make}, @code{mkdir}, @code{cp}, etc.)@: commonly used during regular ``Unix-style'' installations.
es: Cuando personalizamos @code{phases}, a menudo necesitamos escribir código que imite las invocaciones equivalentes del sistema (@code{make}, @code{mkdir}, @code{cp}, etc.)@: comúnmente usadas durante instalaciones regulares ``al estilo Unix''.
it: Quando si personalizzano le @code{phases}, spesso è necessario scrivere codice che imita le invocazioni di sistema equivalenti (@code{make}, @code{mkdir}, @code{cp}, ecc.)@: comunemente usate durante le normali installazioni in ``stile Unix''.
pt_br: Ao personalizar @code{phases}, muitas vezes precisamos escrever código que imite as invocações equivalentes do sistema (@code{make}, @code{mkdir}, @code{cp}, etc.)@: comumente usado durante `` Instalações regulares no estilo Unix''.
sk: Pri prispôsobovaní @code{phases} budete často potrebovať funkcie zodpovedajúce systémovým volaniam (@code{make}, @code{mkdir}, @code{cp}, atď.), ktoré sú zvyčajne dostupné na Unixových systémoch.

source: Some like @code{chmod} are native to Guile. @xref{,,, guile, Guile reference manual} for a complete list.
es: Algunos como @code{chmod} son nativos para Guile. @xref{,,, guile, Manual de referencia de Guile} para un listado completo.
it: Alcune come @code{chmod} sono native di Guile. @xref{,,, guile, Manuale di riferimento di Guile} per un elenco completo.
pt_br: Alguns como @code{chmod} são nativos do Guile. @xref{,,, guile, manual de referência do Guile} para obter uma lista completa.
sk: Niektoré z nich, ako napríklad @code{chmod}, sú priamo dostupné v jazyku Guile. Viď úplný zoznam v @ref{,,, guile, Guile reference manual}.

source: Guix provides additional helper functions which prove especially handy in the context of package management.
es: Proporciona funciones ayudantes adicionales Guix las cual prueba especialmente manipular en el contexto de gestor de paquete.
it: Guix fornisce funzioni helper aggiuntive che si rivelano particolarmente utili nel contesto della gestione dei pacchetti.
pt_br: Guix fornece funções auxiliares adicionais que são especialmente úteis no contexto de gerenciamento de pacotes.
sk: Guix poskytuje ďalšie pomocné funkcie, užitočné najmä v súvislosti so správou balíkov.

source: Some of those functions can be found in @samp{$GUIX_CHECKOUT/guix/guix/build/utils.scm}. Most of them mirror the behaviour of the traditional Unix system commands:
es: Algunas de estas funciones pueden encontrarse en @samp{$GUIX_CHECKOUT/guix/guix/build/utils.scm}. La mayoría de ellas reflejan el comportamiento de los comandos tradicionales del sistema Unix:
it: Alcune di queste funzioni si trovano in @samp{$GUIX_CHECKOUT/guix/guix/build/ utils.scm}. La maggior parte di esse riflette il comportamento dei comandi di sistema Unix tradizionali:
pt_br: Algumas dessas funções podem ser encontradas em @samp{$GUIX_CHECKOUT/guix/guix/build/utils.scm}. A maioria delas reflete o comportamento dos comandos tradicionais do sistema Unix:
sk: Niektoré z týchto funkcií sa nachádzajú v @samp{$GUIX_CHECKOUT/guix/guix/build/utils.scm}. Väčšinou napodobňujú správanie pôvodných Unixových systémových príkazov:

source: Like the @samp{which} system command.
es: Como la instrucción del sistema @samp{which}.
it: Come il comando di sistema @samp{which}.
pt_br: Como o comando do sistema @samp{which}.
sk: Rovnaká ako systémový príkaz @samp{which}.

source: Akin to the @samp{find} system command.
es: Similar al comando de sistema @samp{find}.
it: Simile al comando di sistema @samp{find}.
pt_br: Semelhante ao comando do sistema @samp{find}.
sk: Podobná príkazu @samp{find}.

source: Like @samp{mkdir -p}, which creates all parents as needed.
es: Como @samp{mkdir -p}, que crea todos los padres según sea necesario.
it: Come @samp{mkdir -p}, che crea tutti i genitori se necessario.
pt_br: Como @samp{mkdir -p}, que cria todos os diretórios conforme necessário.
sk: Rovnaká ako príkaz @samp{mkdir -p}, ktorý v prípade potreby vytvorí aj všetky nadradené priečinky.

source: Similar to @samp{install} when installing a file to a (possibly non-existing) directory. Guile has @code{copy-file} which works like @samp{cp}.
es: Similar a @samp{install} cuando se instala un archivo en un directorio (posiblemente inexistente). Guile tiene @code{copy-file} que funciona como @samp{cp}.
it: Simile a @samp{install} quando si installa un file in una directory (possibilmente non esistente). Guile ha @code{copy-file} che funziona come @samp{cp}.
pt_br: Semelhante a @samp{install} ao instalar um arquivo em um diretório (possivelmente inexistente). Guile tem @code{copy-file} que funciona como @samp{cp}.
sk: Podobná ako príkaz @samp{install} na inštaláciu súboru do priečinka (aj nejestvujúceho). Guile má funkciu @code{copy-file}, ktorá funguje ako príkaz @samp{cp}.

source: Like @samp{cp -r}.
es: Como @samp{cp -r}.
it: Come @samp{cp -r}.
pt_br: Como @samp{cp -r}.
sk: Ako @samp{cp -r}.

source: Like @samp{rm -rf}.
es: Como @samp{rm -rf}.
it: Come @samp{rm -rf}.
pt_br: Como @samp{rm -rf}.
sk: Ako @samp{rm -rf}.

source: Run an executable. This should be used instead of @code{system*}.
es: Ejecuta un ejecutable. Esto sería utilizado en vez de @code{system*}.
it: Esegui un eseguibile. Questo dovrebbe essere usato al posto di @code{system*}.
pt_br: Executar um executável. Deve ser usado em vez de @code{system*}.
sk: Vyvolať spustiteľný súbor. Toto by ste mali používať namiesto @code{system*}.

source: Run the body in a different working directory, then restore the previous working directory.
es: Ejecuta el cuerpo de un directorio de trabajo diferente, posteriormente restaura el directorio de trabajo anterior.
it: Esegui il corpo in una diversa directory di lavoro, quindi ripristina la precedente directory di lavoro.
pt_br: Execute o corpo em um diretório de trabalho diferente e restaure o diretório de trabalho anterior.
sk: Vykoná telo funkcie v odlišnom pracovnom priečinku a následne obnoví pôvodný pracovný priečinok.

source: A ``@command{sed}-like'' function.
es: Una función ``@command{sed}'' similar.
it: Una funzione ``simile a @command{sed}''.
pt_br: Uma função do tipo ``@command{sed}''.
sk: Funkcia podobná príkazu @command{sed}.

source: @xref{Build Utilities,,, guix, GNU Guix Reference Manual}, for more information on these utilities.
es: @xref{Utilidades de construcción,,, guix.es, Manual referencia de GNU Guix}, para más información sobre estas utilidades.
it: @xref{Utilità di build,,, guix.it, Manuale di riferimento di GNU Guix}, per maggiori informazioni su queste utilità.
pt_br: @xref{Construir utilitários,,, guix.pt_BR, Manual de Referência GNU Guix}, para obter mais informações sobre esses utilitários.
sk: Viď @ref{Build Utilities,,, guix, GNU Guix Reference Manual} pre viac podrobností o pomocných funkciách.

source: Module prefix
es: Prefijo módulo
it: Prefisso modulo
pt_br: Prefixo do módulo
sk: Predpony modulov

source: The license in our last example needs a prefix: this is because of how the @code{license} module was imported in the package, as @code{#:use-module ((guix licenses) #:prefix license:)}. The Guile module import mechanism (@pxref{Using Guile Modules,,, guile, Guile reference manual}) gives the user full control over namespacing: this is needed to avoid clashes between, say, the @samp{zlib} variable from @samp{licenses.scm} (a @emph{license} value) and the @samp{zlib} variable from @samp{compression.scm} (a @emph{package} value).
es: La licencia en nuestro último ejemplo necesita un prefijo: esto se debe a cómo el módulo @code{license} fue importado en el paquete, como @code{#:use-module ((guix licenses) #:prefix license:)}. El mecanismo de importación de módulos de Guile (@pxref{Uso de módulos Guile,,, guile, Manual de referencia de Guile}) da al usuario control total sobre el espaciado de nombres: esto es necesario para evitar conflictos entre, digamos, la variable @samp{zlib} de @samp{licenses.scm} (un valor @emph{license}) y la variable @samp{zlib} de @samp{compression.scm} (un valor @emph{package}).
it: La licenza nel nostro ultimo esempio richiede un prefisso: ciò è dovuto a come il modulo @code{license} è stato importato nel pacchetto, come @code{#:use-module ((guix licenses) #:prefix license:)}. Il meccanismo di importazione dei moduli Guile (@pxref{Using Guile Modules,,, guile, Manuale di riferimento di Guile}) offre all'utente il controllo completo sulla gestione degli spazi dei nomi: ciò è necessario per evitare conflitti tra, ad esempio, la variabile @samp{zlib} di @samp{licenses.scm} (un valore di @emph{license}) e la variabile @samp{zlib} di @samp{compression.scm} (un valore di @emph{package}).
pt_br: A licença em nosso último exemplo precisa de um prefixo: isso se deve à forma como o módulo @code{license} foi importado no pacote, como @code{#:use-module ((guix Licenses) #:prefix License:)}. O mecanismo de importação do módulo Guile (@pxref{Using Guile Modules,,, guile, manual de referência do Guile}) dá ao usuário controle total sobre o namespace: isso é necessário para evitar conflitos entre, digamos, a variável @samp{zlib} de @samp{licenses.scm} (um valor @emph{license}) e a variável @samp{zlib} de @samp{compression.scm} (um valor @emph{package}).
sk: Licencia v našom predošlom príklade je uvedená s predponou vzhľadom na spôsob akým bol načítaný modul @code{licenses} v tomto balíku: @code{#:use-module ((guix licenses) #:prefix license:)}. Spôsob načítavania modulov v Guile (@pxref{Using Guile Modules,,, guile, Guile reference manual}) používateľovi dáva úplnú kontrolu nad menným priestorom. Môže sa tak predísť rozporom, povedzme, medzi premennou @samp{zlib} zo súboru @samp{licenses.scm} (názov @emph{licencie}) a premennou @samp{zlib} zo súboru @samp{compression.scm} (názov @emph{balíka}).

source: What we've seen so far covers the majority of packages using a build system other than the @code{trivial-build-system}. The latter does not automate anything and leaves you to build everything manually. This can be more demanding and we won't cover it here for now, but thankfully it is rarely necessary to fall back on this system.
es: Lo que hemos visto hasta ahora cubre la mayoría de los paquetes que utilizan un sistema de construcción distinto del @code{trivial-build-system}. Este último no automatiza nada y te deja construir todo manualmente. Esto puede ser más exigente y no lo cubriremos aquí por ahora, pero afortunadamente rara vez es necesario recurrir a este sistema.
it: Quanto abbiamo visto finora copre la maggior parte dei pacchetti che utilizzano un sistema di compilazione diverso da @code{trivial-build-system}. Quest'ultimo non automatizza nulla e ti lascia il compito di compilare tutto manualmente. Questo può essere più impegnativo e per ora non lo tratteremo qui, ma fortunatamente è raramente necessario ricorrere a questo sistema.
pt_br: O que vimos até agora cobre a maioria dos pacotes que usam um sistema de compilação diferente do @code{trivial-build-system}. Este último não automatiza nada e deixa você construir tudo manualmente. Isso pode ser mais exigente e não abordaremos isso aqui por enquanto, mas felizmente raramente é necessário recorrer a este sistema.
sk: To čo sme doteraz videli pokrýva väčšinu balíkov využívajúcich iný zostavovací systém ako je @code{trivial-build-system}, ktorý nič neautomatizuje a nechá vás všetko zostaviť ručne. Tento postup môže byť náročnejší a zatiaľ sa tu ním nebudeme zaoberať. Našťastie je nutné uchýliť sa k nemu len zriedkavo.

source: For the other build systems, such as ASDF, Emacs, Perl, Ruby and many more, the process is very similar to the GNU build system except for a few specialized arguments.
es: Para los demás sistemas de construcción, como ASDF, Emacs, Perl, Ruby y muchos más, el proceso es muy similar al del sistema de construcción de GNU, excepto por algunos argumentos especializados.
it: Per gli altri sistemi di compilazione, come ASDF, Emacs, Perl, Ruby e molti altri, il processo è molto simile al sistema di compilazione GNU, ad eccezione di alcuni argomenti specializzati.
pt_br: Para outros sistemas de construção, como ASDF, Emacs, Perl, Ruby e muitos outros, o processo é muito semelhante ao sistema de construção GNU, exceto por alguns argumentos especializados.
sk: Pri ostatných zostavovacích systémoch, ako sú ASDF, Emacs, Perl, Ruby a mnoho ďalších, je postup, okrem niekoľkých zvláštnych parametrov, veľmi podobný zostavovaciemu systému GNU.
