Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: If you want to enjoy a similar development experience to that in the perfect setup, you should install several plugins to configure the editor. Vim (and NeoVim) have the equivalent to Paredit, @uref{https://www.vim.org/scripts/script.php?script_id=3998, @code{paredit.vim}}, that will help you with the structural editing of Scheme files (the support for very large files is not great, though).
it: Se vuoi godere di un'esperienza di sviluppo simile a quella della configurazione perfetta, dovresti installare diversi plugin per configurare l'editor. Vim (e NeoVim) hanno l'equivalente di Paredit, @uref{https://www.vim.org/scripts/script.php?script_id=3998, @code{paredit.vim}}, che ti aiuterà con la modifica strutturale dei file Scheme (il supporto per file molto grandi non è eccezionale, però).
pt_br: Se você deseja desfrutar de uma experiência de desenvolvimento semelhante à configuração perfeita, você deve instalar vários plugins para configurar o editor. O Vim (e o NeoVim) têm o equivalente ao Paredit, @uref{https://www.vim.org/scripts/script.php?script_id=3998, @code{paredit.vim}}, que irá ajudá-lo com a estrutura edição de arquivos Scheme (embora o suporte para arquivos muito grandes não seja ótimo).

source: We also recommend that you run @code{:set autoindent} so that your code is automatically indented as you type.
it: Raccomandiamo anche di eseguire @code{:set autoindent} in modo che il tuo codice venga indentato automaticamente mentre scrivi.
pt_br: Também recomendamos que você execute @code{:set autoindent} para que seu código seja recuado automaticamente conforme você digita.

source: For the interaction with Git, @uref{https://www.vim.org/scripts/script.php?script_id=2975, @code{fugitive.vim}} is the most commonly used plugin:
it: Per l'interazione con Git, @uref{https://www.vim.org/scripts/script.php?script_id=2975, @code{fugitive.vim}} è il plugin più comunemente usato:
pt_br: Para a interação com Git, @uref{https://www.vim.org/scripts/script.php?script_id=2975, @code{fugitive.vim}} é o plugin mais comumente usado:

source: And of course if you want to interact with Guix directly from inside of vim, using the built-in terminal emulator, we have our very own @code{guix.vim} package!
it: E ovviamente se vuoi interagire con Guix direttamente dall'interno di vim, usando l'emulatore di terminale integrato, abbiamo il nostro pacchetto @code{guix.vim}!
pt_br: E claro, se você quiser interagir com o Guix diretamente de dentro do vim, usando o emulador de terminal integrado, temos nosso próprio pacote @code{guix.vim}!

source: In NeoVim you can even make a similar setup to Geiser using @url{https://conjure.fun/, Conjure} that lets you connect to a running Guile process and inject your code there live (sadly it's not packaged in Guix yet).
it: In NeoVim puoi persino creare una configurazione simile a Geiser usando @url{https://conjure.fun/, Conjure} che ti permette di connetterti a un processo Guile in esecuzione e di iniettare il tuo codice lì in tempo reale (purtroppo non è ancora pacchettizzato in Guix).
pt_br: No NeoVim você pode até fazer uma configuração semelhante ao Geiser usando @url{https://conjure.fun/, Conjure} que permite conectar-se a um processo Guile em execução e injetar seu código ao vivo (infelizmente ainda não está empacotado no Guix) .

source: structure, of the source tree
it: struttura, dell'albero dei sorgenti
pt_br: estrutura da árvore de origem

source: If you're willing to contribute to Guix beyond packages, or if you'd like to learn how it all fits together, this section provides a guided tour in the code base that you may find useful.
it: Se sei disposto a contribuire a Guix oltre ai pacchetti, o se vuoi imparare come tutto si incastra, questa sezione fornisce una visita guidata alla base di codice che potresti trovare utile.
pt_br: Se você estiver disposto a contribuir com o Guix além dos pacotes, ou se quiser aprender como tudo se encaixa, esta seção fornece um tour guiado na base de código que pode ser útil.

source: Overall, the Guix source tree contains almost exclusively Guile @dfn{modules}, each of which can be seen as an independent library (@pxref{Modules,,, guile, GNU Guile Reference Manual}).
it: In generale, l'albero dei sorgenti di Guix contiene quasi esclusivamente @dfn{modules} Guile, ognuno dei quali può essere visto come una libreria indipendente (@pxref{Modules,,, guile, GNU Guile Reference Manual}).
pt_br: No geral, a árvore de origem do Guix contém quase exclusivamente Guile @dfn{módulos}, cada um dos quais pode ser visto como uma biblioteca independente (@pxref{Modules,,, guile, Manual de Referência do GNU Guile}).

source: The following table gives an overview of the main directories and what they contain. Remember that in Guile, each module name is derived from its file name---e.g., the module in file @file{guix/packages.scm} is called @code{(guix packages)}.
it: La seguente tabella offre una panoramica delle directory principali e del loro contenuto. Ricorda che in Guile, ogni nome di modulo deriva dal nome del suo file --- ad esempio, il modulo nel file @file{guix/packages.scm} si chiama @code{(guix packages)}.
pt_br: A tabela a seguir fornece uma visão geral dos principais diretórios e o que eles contêm. Lembre-se de que no Guile, cada nome de módulo é derivado de seu nome de arquivo---por exemplo, o módulo no arquivo @file{guix/packages.scm} é chamado @code{(guix packages)}.

source: This is the location of core Guix mechanisms. To illustrate what is meant by ``core'', here are a few examples, starting from low-level tools and going towards higher-level tools:
it: Questa è la posizione dei meccanismi principali di Guix. Per illustrare cosa si intende per ``core'', ecco alcuni esempi, partendo dagli strumenti a basso livello e procedendo verso quelli di livello superiore:
pt_br: Esta é a localização dos mecanismos principais do Guix. Para ilustrar o que significa ``core'', aqui estão alguns exemplos, começando com ferramentas de baixo nível e indo em direção a ferramentas de nível mais alto:

source: Connecting to and interacting with the build daemon (@pxref{The Store}).
it: Connessione e interazione con il demone di compilazione (@pxref{The Store}).
pt_br: Conectando e interagindo com o daemon de compilação (@pxref{The Store}).

source: Creating derivations (@pxref{Derivations}).
it: Creazione di derivazioni (@pxref{Derivations}).
pt_br: Criando derivações (@pxref{Derivations}).

source: Writing G-expressions (@pxref{G-Expressions}).
it: Scrittura di G-expressions (@pxref{G-Expressions}).
pt_br: Escrevendo expressões-G (@pxref{G-Expressions}).

source: Defining packages and origins (@pxref{package Reference}).
it: Definizione di pacchetti e origini (@pxref{package Reference}).
pt_br: Definindo pacotes e origens (@pxref{package Reference}).

source: The @code{url-fetch} and @code{git-fetch} origin download methods (@pxref{origin Reference}).
it: I metodi di download dell'origine @code{url-fetch} e @code{git-fetch} (@pxref{origin Reference}).
pt_br: Os métodos de download de origem @code{url-fetch} e @code{git-fetch} (@pxref{origin Reference}).

source: Fetching source code from the @uref{https://archive.softwareheritage.org,Software Heritage archive}.
it: Recupero del codice sorgente dall'archivio @uref{https://archive.softwareheritage.org,Software Heritage}.
pt_br: Obtendo código-fonte do @uref{https://archive.softwareheritage.org, arquivo Software Heritage}.

source: Implementing search paths (@pxref{Search Paths}).
it: Implementazione dei percorsi di ricerca (@pxref{Search Paths}).
pt_br: Implementando caminhos de pesquisa (@pxref{Search Paths}).

source: The build system interface (@pxref{Build Systems}).
it: L'interfaccia del sistema di compilazione (@pxref{Build Systems}).
pt_br: A interface do sistema de compilação (@pxref{Build Systems}).

source: Implementing profiles.
it: Implementazione dei profili.
pt_br: Implementando perfis.

source: build system, directory structure
it: sistema di compilazione, struttura della directory
pt_br: sistema de construção, estrutura de diretório

source: This directory contains specific build system implementations (@pxref{Build Systems}), such as:
it: Questa directory contiene implementazioni specifiche del sistema di compilazione (@pxref{Build Systems}), come:
pt_br: Este diretório contém implementações específicas do sistema de compilação (@pxref{Build Systems}), como:

source: the GNU build system;
pt_br: o sistema de compilação do GNU;

source: the CMake build system;
pt_br: o sistema de compilação CMake;

source: The Python ``pyproject'' build system.
it: Il sistema di compilazione ``pyproject'' di Python.
pt_br: O sistema de compilção ``pyproject'' do Python

source: This contains code generally used on the ``build side'' (@pxref{G-Expressions, strata of code}). This includes code used to build packages or other operating system components, as well as utilities:
it: Contiene codice generalmente usato sul ``lato build'' (@pxref{G-Expressions, strata of code}). Questo include codice usato per costruire pacchetti o altri componenti del sistema operativo, così come utility:
pt_br: Isto contém código geralmente usado no ``lado da construção'' (@pxref{G-Expressions, strata of code}). Isto inclui código usado para construir pacotes ou outros componentes do sistema operacional, assim como utilitários:

source: Utilities for package definitions and more (@pxref{Build Utilities}).
it: Utility per le definizioni di pacchetti e altro (@pxref{Build Utilities}).
pt_br: Utilitários para definições de pacotes e muito mais (@pxref{Build Utilities}).

source: Implementation of build systems, and in particular definition of their build phases (@pxref{Build Phases}).
it: Implementazione dei sistemi di compilazione, e in particolare la definizione delle loro fasi di compilazione (@pxref{Build Phases}).
pt_br: Implementação de sistemas de construção e, em particular, definição de suas fases de construção (@pxref{Build Phases}).

source: Interface to the C library and to Linux system calls.
it: Interfaccia alla libreria C e alle chiamate di sistema Linux.
pt_br: Interface para a biblioteca C e para chamadas de sistema Linux.

source: command-line tools, as Guile modules
it: strumenti a riga di comando, come moduli Guile
pt_br: ferramentas de linha de comando, como módulos Guile

source: command modules
pt_br: módulos de comando

source: This contains modules corresponding to @command{guix} sub-commands. For example, the @code{(guix scripts shell)} module exports the @code{guix-shell} procedure, which directly corresponds to the @command{guix shell} command (@pxref{Invoking guix shell}).
it: Contiene moduli corrispondenti ai sotto-comandi di @command{guix}. Ad esempio, il modulo @code{(guix scripts shell)} esporta la procedura @code{guix-shell}, che corrisponde direttamente al comando @command{guix shell} (@pxref{Invoking guix shell}).
pt_br: Isto contém módulos correspondentes aos subcomandos @command{guix}. Por exemplo, o módulo @code{(guix scripts shell)} exporta o procedimento @code{guix-shell}, que corresponde diretamente ao comando @command{guix shell} (@pxref{Invoking guix shell}).

source: importer modules
pt_br: módulos importadores

source: This contains supporting code for the importers and updaters (@pxref{Invoking guix import}, and @pxref{Invoking guix refresh}). For example, @code{(guix import pypi)} defines the interface to PyPI, which is used by the @command{guix import pypi} command.
it: Contiene codice di supporto per gli importatori e gli aggiornatori (@pxref{Invoking guix import}, e @pxref{Invoking guix refresh}). Ad esempio, @code{(guix import pypi)} definisce l'interfaccia a PyPI, che è usata dal comando @command{guix import pypi}.
pt_br: Isto contém código de suporte para os importadores e atualizadores (@pxref{Invoking guix import} e @pxref{Invoking guix refresh}). Por exemplo, @code{(guix import pypi)} define a interface para PyPI, que é usada pelo comando @command{guix import pypi}.

source: The directories we have seen so far all live under @file{guix/}. The other important place is the @file{gnu/} directory, which contains primarily package definitions as well as libraries and tools for Guix System (@pxref{System Configuration}) and Guix Home (@pxref{Home Configuration}), all of which build upon functionality provided by @code{(guix @dots{})} modules@footnote{For this reason, @code{(guix @dots{})} modules must generally not depend on @code{(gnu @dots{})} modules, with notable exceptions: @code{(guix build-system @dots{})} modules may look up packages at run time---e.g., @code{(guix build-system cmake)} needs to access the @code{cmake} variable at run time---, @code{(guix scripts @dots{})} often rely on @code{(gnu @dots{})} modules, and the same goes for some of the @code{(guix import @dots{})} modules.}.
it: Le directory che abbiamo visto finora si trovano tutte sotto @file{guix/}. L'altro posto importante è la directory @file{gnu/}, che contiene principalmente definizioni di pacchetti, nonché librerie e strumenti per Guix System (@pxref{System Configuration}) e Guix Home (@pxref{Home Configuration}), tutti basati su funzionalità fornite dai moduli @code{(guix @dots{})}@footnote{Per questo motivo, i moduli @code{(guix @dots{})} non devono generalmente dipendere dai moduli @code{(gnu @dots{})}, con alcune eccezioni notevoli: i moduli @code{(guix build-system @dots{})} possono cercare pacchetti a runtime---ad esempio, @code{(guix build-system cmake)} deve accedere alla variabile @code{cmake} a runtime---, i moduli @code{(guix scripts @dots{})} si basano spesso sui moduli @code{(gnu @dots{})}, e lo stesso vale per alcuni dei moduli @code{(guix import @dots{})}.}.
pt_br: Todos os diretórios que vimos até agora estão em @file{guix/}. O outro lugar importante é o diretório @file{gnu/}, que contém principalmente definições de pacotes, bem como bibliotecas e ferramentas para Guix System (@pxref{System Configuration}) e Guix Home (@pxref{Home Configuration}), todos os quais se baseiam na funcionalidade fornecida pelos módulos @code{(guix @dots{})}@footnote{Por esse motivo, os módulos @code{(guix @dots{})} geralmente não devem depender dos módulos @code{(gnu @dots{})}, com exceções notáveis: os módulos @code{(guix build-system @dots{})} podem procurar pacotes em tempo de execução --- por exemplo, @code{(guix build-system cmake)} precisa acessar a variável @code{cmake} em tempo de execução ---, @code{(guix scripts @dots{})} geralmente dependem dos módulos @code{(gnu @dots{})}, e o mesmo vale para alguns dos módulos @code{(guix import @dots{})} módulos.}.

source: package modules
it: moduli di pacchetti
pt_br: módulos de pacote

source: This is by far the most crowded directory of the source tree: it contains @dfn{package modules} that export package definitions (@pxref{Package Modules}). A few examples:
it: Questa è di gran lunga la directory più affollata dell'albero dei sorgenti: contiene @dfn{moduli di pacchetti} che esportano definizioni di pacchetti (@pxref{Package Modules}). Alcuni esempi:
pt_br: Este é de longe o diretório mais lotado da árvore de fontes: ele contém @dfn{package modules} que exportam definições de pacotes (@pxref{Package Modules}). Alguns exemplos:

source: Module providing ``base'' packages: @code{glibc}, @code{coreutils}, @code{grep}, etc.
it: Modulo che fornisce i pacchetti di ``base'': @code{glibc}, @code{coreutils}, @code{grep}, ecc.
pt_br: Módulo que fornece pacotes ``base'': @code{glibc}, @code{coreutils}, @code{grep}, etc.

source: Guile and core Guile packages.
it: Guile e pacchetti Guile principali.
pt_br: Guile e pacotes principais do Guile.

source: The Linux-libre kernel and related packages.
it: Il kernel Linux-libre e i pacchetti correlati.
pt_br: O kernel Linux-libre e pacotes relacionados.

source: Python and core Python packages.
it: Python e pacchetti Python principali.
pt_br: Python e pacotes principais do Python.

source: Miscellaneous Python packages (we were not very creative).
it: Pacchetti Python vari (non siamo stati molto creativi).
pt_br: Pacotes Python diversos (não fomos muito criativos).

source: In any case, you can jump to a package definition using @command{guix edit} (@pxref{Invoking guix edit}) and view its location with @command{guix show} (@pxref{Invoking guix package}).
it: In ogni caso, puoi saltare alla definizione di un pacchetto usando @command{guix edit} (@pxref{Invoking guix edit}) e visualizzare la sua posizione con @command{guix show} (@pxref{Invoking guix package}).
pt_br: Em qualquer caso, você pode pular para uma definição de pacote usando @command{guix edit} (@pxref{Invoking guix edit}) e visualizar sua localização com @command{guix show} (@pxref{Invoking guix package}).

source: This directory contains patches applied against packages and obtained using the @code{search-patches} procedure.
it: Questa directory contiene le patch applicate ai pacchetti e ottenute usando la procedura @code{search-patches}.
pt_br: Este diretório contém patches aplicados aos pacotes e obtidos usando o procedimento @code{search-patches}.

source: This contains service definitions, primarily for Guix System (@pxref{Services}) but some of them are adapted and reused for Guix Home as we will see below. Examples:
it: Contiene definizioni di servizi, principalmente per Guix System (@pxref{Services}) ma alcuni di essi sono adattati e riutilizzati per Guix Home, come vedremo più avanti. Esempi:
pt_br: Isto contém definições de serviço, principalmente para Guix System (@pxref{Services}), mas algumas delas são adaptadas e reutilizadas para Guix Home, como veremos abaixo. Exemplos:

source: The service framework itself, which defines the service and service type data types (@pxref{Service Composition}).
it: Il framework dei servizi stesso, che definisce i tipi di dati di servizio e di tipo di servizio (@pxref{Service Composition}).
pt_br: A estrutura do serviço em si, que define os tipos de dados do serviço e do tipo de serviço (@pxref{Service Composition}).

source: ``Base'' services (@pxref{Base Services}).
it: Servizi di ``base'' (@pxref{Base Services}).
pt_br: Serviços ``básicos'' (@pxref{Base Services}).

source: ``Desktop'' services (@pxref{Desktop Services}).
pt_br: Serviços ``desktop'' (@pxref{Desktop Services}).

source: Support for Shepherd services (@pxref{Shepherd Services}).
it: Supporto per i servizi Shepherd (@pxref{Shepherd Services}).
pt_br: Apoio aos serviços Shepherd (@pxref{Shepherd Services}).

source: You can jump to a service definition using @command{guix system edit} and view its location with @command{guix system search} (@pxref{Invoking guix system}).
it: Puoi saltare alla definizione di un servizio usando @command{guix system edit} e visualizzare la sua posizione con @command{guix system search} (@pxref{Invoking guix system}).
pt_br: Você pode pular para uma definição de serviço usando @command{guix system edit} e visualizar sua localização com @command{guix system search} (@pxref{Invoking guix system}).

source: These are core Guix System modules, such as:
it: Questi sono i moduli principali di Guix System, come:
pt_br: Estes são os principais módulos do sistema Guix, como:

source: Defines @code{operating-system} (@pxref{operating-system Reference}).
it: Definisce @code{operating-system} (@pxref{operating-system Reference}).
pt_br: Define @code{operating-system} (@pxref{operating-system Reference}).

source: Defines @code{file-system} (@pxref{File Systems}).
it: Definisce @code{file-system} (@pxref{File Systems}).
pt_br: Define @code{file-system} (@pxref{File Systems}).

source: Defines @code{mapped-device} (@pxref{Mapped Devices}).
it: Definisce @code{mapped-device} (@pxref{Mapped Devices}).
pt_br: Define @code{mapped-device} (@pxref{Mapped Devices}).

source: These are modules that are either used on the ``build side'' when building operating systems or packages, or at run time by operating systems.
it: Questi sono moduli usati sul ``lato build'' quando si costruiscono sistemi operativi o pacchetti, o a runtime dai sistemi operativi.
pt_br: Esses são módulos que são usados no ``lado da compilação'' ao criar sistemas operacionais ou pacotes, ou em tempo de execução pelos sistemas operacionais.

source: Creating @file{/etc/passwd}, @file{/etc/shadow}, etc. (@pxref{User Accounts}).
it: Creazione di @file{/etc/passwd}, @file{/etc/shadow}, ecc. (@pxref{User Accounts}).
pt_br: Criando @file{/etc/passwd}, @file{/etc/shadow}, etc. (@pxref{User Accounts}).

source: Activating an operating system at boot time or reconfiguration time.
it: Attivazione di un sistema operativo all'avvio o durante la riconfigurazione.
pt_br: Ativar um sistema operacional no momento da inicialização ou da reconfiguração.

source: Searching, checking, and mounting file systems.
it: Ricerca, controllo e montaggio dei file system.
pt_br: Pesquisar, verificar e montar sistemas de arquivos.

source: Booting GNU/Linux and GNU/Hurd operating systems.
it: Avvio dei sistemi operativi GNU/Linux e GNU/Hurd.
pt_br: Inicializando sistemas operacionais GNU/Linux e GNU/Hurd.

source: Creating a Linux initial RAM disk (@pxref{Initial RAM Disk}).
it: Creazione di un disco RAM iniziale di Linux (@pxref{Initial RAM Disk}).
pt_br: Criando um disco RAM inicial do Linux (@pxref{Initial RAM Disk}).

source: This contains all things Guix Home (@pxref{Home Configuration}); examples:
it: Contiene tutto ciò che riguarda Guix Home (@pxref{Home Configuration}); esempi:
pt_br: Isso contém todas as coisas do Guix Home (@pxref{Home Configuration}); exemplos:

source: Core services such as @code{home-files-service-type}.
pt_br: Serviços principais como @code{home-files-service-type}.

source: SSH-related services (@pxref{Secure Shell}).
it: Servizi relativi a SSH (@pxref{Secure Shell}).
pt_br: Serviços relacionados a SSH (@pxref{Secure Shell}).

source: This contains the text-mode graphical system installer (@pxref{Guided Graphical Installation}).
it: Contiene l'installatore di sistema grafico in modalità testo (@pxref{Guided Graphical Installation}).
pt_br: Isso contém o instalador do sistema gráfico em modo texto (@pxref{Guided Graphical Installation}).

source: These are the @dfn{machine abstractions} used by @command{guix deploy} (@pxref{Invoking guix deploy}).
it: Queste sono le @dfn{astrazioni di macchina} usate da @command{guix deploy} (@pxref{Invoking guix deploy}).
pt_br: Estas são as @dfn{abstrações de máquina} usadas por @command{guix deploy} (@pxref{Invoking guix deploy}).

source: This contains system tests---tests that spawn virtual machines to check that system services work as expected (@pxref{Running the Test Suite}).
it: Contiene i test di sistema --- test che avviano macchine virtuali per verificare che i servizi di sistema funzionino come previsto (@pxref{Running the Test Suite}).
pt_br: Isso contém testes de sistema — testes que geram máquinas virtuais para verificar se os serviços do sistema funcionam conforme o esperado (@pxref{Running the Test Suite}).

source: Last, there's also a few directories that contain files that are @emph{not} Guile modules:
it: Infine, ci sono anche alcune directory che contengono file che @emph{not} sono moduli Guile:
pt_br: Por fim, há também alguns diretórios que contêm arquivos que não são módulos Guile:

source: This is the C++ implementation of @command{guix-daemon}, inherited from Nix (@pxref{Invoking guix-daemon}).
it: Questa è l'implementazione C++ di @command{guix-daemon}, ereditata da Nix (@pxref{Invoking guix-daemon}).
pt_br: Esta é a implementação C++ do @command{guix-daemon}, herdada do Nix (@pxref{Invoking guix-daemon}).
