Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The nar format is comparable in spirit to `tar', but with differences that make it more appropriate for our purposes. First, rather than recording all Unix metadata for each file, the nar format only mentions the file type (regular, directory, or symbolic link); Unix permissions and owner/group are dismissed. Second, the order in which directory entries are stored always follows the order of file names according to the C locale collation order. This makes archive production fully deterministic.
pt_br: O formato nar é comparável em espírito ao `tar', mas com diferenças que o tornam mais apropriado para nossos propósitos. Primeiro, em vez de registrar todos os metadados Unix para cada arquivo, o formato nar menciona apenas o tipo de arquivo (regular, diretório ou ligação simbólica); permissões Unix e proprietário/grupo são descartados. Segundo, a ordem em que as entradas de diretório são armazenadas sempre segue a ordem dos nomes de arquivo de acordo com a ordem de agrupamento de localidade C. Isso torna a produção de arquivo totalmente determinística.

source: That nar bundle format is essentially the concatenation of zero or more nars along with metadata for each store item it contains: its file name, references, corresponding derivation, and a digital signature.
pt_br: O formato da embalagem nar é essencialmente a concatenação de zero ou mais nars junto com metadados para cada item de armazém que ele contém: seu nome de arquivo, referências, derivação correspondente e uma assinatura digital.

source: When exporting, the daemon digitally signs the contents of the archive, and that digital signature is appended. When importing, the daemon verifies the signature and rejects the import in case of an invalid signature or if the signing key is not authorized.
pt_br: Ao exportar, o daemon assina digitalmente o conteúdo do arquivamento, e essa assinatura digital é anexada. Ao importar, o daemon verifica a assinatura e rejeita a importação em caso de uma assinatura inválida ou se a chave de assinatura não for autorizada.

source: The main options are:
pt_br: As principais opções são:

source: Export the specified store files or packages (see below). Write the resulting archive to the standard output.
pt_br: Exporte os arquivos de armazém ou pacotes especificados (veja abaixo). Grave o arquivo resultante na saída padrão.

source: Dependencies are @emph{not} included in the output, unless @option{--recursive} is passed.
pt_br: Dependências @emph{não} são incluídas na saída, a menos que @option{--recursive} seja passado.

source: When combined with @option{--export}, this instructs @command{guix archive} to include dependencies of the given items in the archive. Thus, the resulting archive is self-contained: it contains the closure of the exported store items.
pt_br: Quando combinado com @option{--export}, isso instrui @command{guix archive} a incluir dependências dos itens fornecidos no arquivo. Assim, o arquivo resultante é autocontido: ele contém o fechamento dos itens exportados do armazém.

source: Read an archive from the standard input, and import the files listed therein into the store. Abort if the archive has an invalid digital signature, or if it is signed by a public key not among the authorized keys (see @option{--authorize} below).
pt_br: Leia um arquivo da entrada padrão e importe os arquivos listados nele para o armazém. Aborte se o arquivo tiver uma assinatura digital inválida ou se for assinado por uma chave pública que não esteja entre as chaves autorizadas (veja @option{--authorize} abaixo).

source: Read a list of store file names from the standard input, one per line, and write on the standard output the subset of these files missing from the store.
pt_br: Leia uma lista de nomes de arquivos do armazém da entrada padrão, um por linha, e escreva na saída padrão o subconjunto desses arquivos que faltam no armazém.

source: --generate-key[=@var{parameters}]
pt_br: --generate-key[=@var{parâmetros}]

source: signing, archives
pt_br: assinatura, arquivos

source: Generate a new key pair for the daemon. This is a prerequisite before archives can be exported with @option{--export}. This operation is usually instantaneous but it can take time if the system's entropy pool needs to be refilled. On Guix System, @code{guix-service-type} takes care of generating this key pair the first boot.
pt_br: Gere um novo par de chaves para o daemon. Este é um pré-requisito antes que os arquivos possam ser exportados com @option{--export}. Esta operação é geralmente instantânea, mas pode levar algum tempo se o pool de entropia do sistema precisar ser recarregado. No Guix System, @code{guix-service-type} cuida da geração deste par de chaves na primeira inicialização.

source: The generated key pair is typically stored under @file{/etc/guix}, in @file{signing-key.pub} (public key) and @file{signing-key.sec} (private key, which must be kept secret). When @var{parameters} is omitted, an ECDSA key using the Ed25519 curve is generated, or, for Libgcrypt versions before 1.6.0, it is a 4096-bit RSA key. Alternatively, @var{parameters} can specify @code{genkey} parameters suitable for Libgcrypt (@pxref{General public-key related Functions, @code{gcry_pk_genkey},, gcrypt, The Libgcrypt Reference Manual}).
pt_br: O par de chaves gerado é normalmente armazenado em @file{/etc/guix}, em @file{signing-key.pub} (chave pública) e @file{signing-key.sec} (chave privada, que deve ser mantida em segredo). Quando @var{parâmetros} é omitido, uma chave ECDSA usando a curva Ed25519 é gerada ou, para versões do Libgcrypt anteriores a 1.6.0, é uma chave RSA de 4096 bits. Como alternativa, @var{parâmetros} pode especificar parâmetros @code{genkey} adequados para Libgcrypt (@pxref{General public-key related Functions, @code{gcry_pk_genkey},, gcrypt, Manual de referência do Libgcrypt}).

source: authorizing, archives
pt_br: autorizando, arquivamentos

source: Authorize imports signed by the public key passed on standard input. The public key must be in ``s-expression advanced format''---i.e., the same format as the @file{signing-key.pub} file.
pt_br: Autorize importações assinadas pela chave pública passada na entrada padrão. A chave pública deve estar em ``s-expression advanced format''---i.e., o mesmo formato do arquivo @file{signing-key.pub}.

source: The list of authorized keys is kept in the human-editable file @file{/etc/guix/acl}. The file contains @url{https://people.csail.mit.edu/rivest/Sexp.txt, ``advanced-format s-expressions''} and is structured as an access-control list in the @url{https://theworld.com/~cme/spki.txt, Simple Public-Key Infrastructure (SPKI)}.
pt_br: A lista de chaves autorizadas é mantida no arquivo editável por humanos @file{/etc/guix/acl}. O arquivo contém @url{https://people.csail.mit.edu/rivest/Sexp.txt, ``advanced-format s-expressions''} e é estruturado como uma lista de controle de acesso no @url{https://theworld.com/~cme/spki.txt, Simple Public-Key Infrastructure (SPKI)}.

source: --extract=@var{directory}
pt_br: --extract=@var{diretório}

source: -x @var{directory}
pt_br: -x @var{diretório}

source: Read a single-item archive as served by substitute servers (@pxref{Substitutes}) and extract it to @var{directory}. This is a low-level operation needed in only very narrow use cases; see below.
pt_br: Leia um arquivo de item único conforme servido por servidores substitutos (@pxref{Substitutes}) e extraia-o para @var{diretório}. Esta é uma operação de baixo nível necessária apenas em casos de uso muito restritos; veja abaixo.

source: For example, the following command extracts the substitute for Emacs served by @code{@value{SUBSTITUTE-SERVER-1}} to @file{/tmp/emacs}:
pt_br: Por exemplo, o comando a seguir extrai o substituto para o Emacs servido por @code{@value{SUBSTITUTE-SERVER-1}} para @file{/tmp/emacs}:

source: Single-item archives are different from multiple-item archives produced by @command{guix archive --export}; they contain a single store item, and they do @emph{not} embed a signature. Thus this operation does @emph{no} signature verification and its output should be considered unsafe.
pt_br: Arquivamentos de item único são diferentes de arquivamentos de itens múltiplos produzidos por @command{guix archive --export}; eles contêm um único item de armazém e não @emph{incorporam} uma assinatura. Portanto, essa operação não faz @emph{nenhuma} verificação de assinatura e sua saída deve ser considerada insegura.

source: The primary purpose of this operation is to facilitate inspection of archive contents coming from possibly untrusted substitute servers (@pxref{Invoking guix challenge}).
pt_br: O objetivo principal desta operação é facilitar a inspeção de conteúdos de arquivamento provenientes de servidores substitutos possivelmente não confiáveis (@pxref{Invoking guix challenge}).

source: Read a single-item archive as served by substitute servers (@pxref{Substitutes}) and print the list of files it contains, as in this example:
pt_br: Leia um arquivamento de item único servido por servidores substitutos (@pxref{Substitutes}) e exiba a lista de arquivos que ele contém, como neste exemplo:

source: @command{guix pull}, configuration file
pt_br: @command{guix pull}, arquivo de configuração

source: configuration of @command{guix pull}
pt_br: configuração de @command{guix pull}

source: Guix and its package collection are updated by running @command{guix pull}. By default @command{guix pull} downloads and deploys Guix itself from the official GNU@tie{}Guix repository. This can be customized by providing a file specifying the set of @dfn{channels} to pull from (@pxref{Invoking guix pull}). A channel specifies the URL and branch of a Git repository to be deployed, and @command{guix pull} can be instructed to pull from one or more channels. In other words, channels can be used to @emph{customize} and to @emph{extend} Guix, as we will see below. Guix is able to take into account security concerns and deal with authenticated updates.
pt_br: Guix e sua coleção de pacotes são atualizados executando @command{guix pull}. Por padrão, @command{guix pull} baixa e implementa o próprio Guix do repositório oficial GNU@tie{}Guix. Isso pode ser personalizado fornecendo um arquivo especificando o conjunto de @dfn{canais} para extrair de (@pxref{Invoking guix pull}). Um canal especifica a URL e a ramificação de um repositório Git a ser implantado, e @command{guix pull} pode ser instruído a extrair de um ou mais canais. Em outras palavras, os canais podem ser usados para @emph{personalizar} e @emph{estender} o Guix, como veremos abaixo. O Guix é capaz de levar em conta preocupações de segurança e lidar com atualizações autenticadas.

source: extending the package collection (channels)
pt_br: estendendo a coleção de pacotes (canais)

source: variant packages (channels)
pt_br: pacotes variantes (canais)

source: You can specify @emph{additional channels} to pull from. To use a channel, write @code{~/.config/guix/channels.scm} to instruct @command{guix pull} to pull from it @emph{in addition} to the default Guix channel(s):
pt_br: Você pode especificar @emph{canais adicionais} para puxar. Para usar um canal, escreva @code{~/.config/guix/channels.scm} para instruir @command{guix pull} para puxar dele @emph{além} do(s) canal(ais) Guix padrão:

source: ;; Add variant packages to those Guix provides. (cons (channel (name 'variant-packages) (url "https://example.org/variant-packages.git")) %default-channels)
pt_br: ;; Adicione pacotes variantes aos fornecidos pelo Guix. (cons (channel (name 'variant-packages) (url "https://example.org/variant-packages.git")) %default-channels)

source: Note that the snippet above is (as always!)@: Scheme code; we use @code{cons} to add a channel the list of channels that the variable @code{%default-channels} is bound to (@pxref{Pairs, @code{cons} and lists,, guile, GNU Guile Reference Manual}). With this file in place, @command{guix pull} builds not only Guix but also the package modules from your own repository. The result in @file{~/.config/guix/current} is the union of Guix with your own package modules:
pt_br: Note que o snippet acima é (como sempre!)@: código do Scheme; usamos @code{cons} para adicionar um canal à lista de canais aos quais a variável @code{%default-channels} está vinculada (@pxref{Pairs, @code{cons} and lists,, guile, GNU Guile Reference Manual}). Com esse arquivo no lugar, @command{guix pull} compila não apenas o Guix, mas também os módulos do pacote do seu próprio repositório. O resultado em @file{~/.config/guix/current} é a união do Guix com seus próprios módulos do pacote:

source: $ guix describe Generation 19 Aug 27 2018 16:20:48 guix d894ab8 repository URL: https://git.guix.gnu.org/guix.git branch: master commit: d894ab8e9bfabcefa6c49d9ba2e834dd5a73a300 variant-packages dd3df5e repository URL: https://example.org/variant-packages.git branch: master commit: dd3df5e2c8818760a8fc0bd699e55d3b69fef2bb
pt_br: $ guix describe Geração 19 27 ago 2018 16:20:48 guix d894ab8 URL do repositório: https://git.guix.gnu.org/guix.git ramo: master commit: d894ab8e9bfabcefa6c49d9ba2e834dd5a73a300 variant-packages dd3df5e URL do repositório: https://example.org/variant-packages.git ramo: master commit: dd3df5e2c8818760a8fc0bd699e55d3b69fef2bb

source: The output of @command{guix describe} above shows that we're now running Generation@tie{}19 and that it includes both Guix and packages from the @code{variant-packages} channel (@pxref{Invoking guix describe}).
pt_br: A saída do @command{guix describe} acima mostra que agora estamos executando o geração@tie{}19 e que ele inclui o Guix e os pacotes do canal @code{variant-packages} (@pxref{Invoking guix describe}).

source: The channel called @code{guix} specifies where Guix itself---its command-line tools as well as its package collection---should be downloaded. For instance, suppose you want to update from another copy of the Guix repository at @code{example.org}, and specifically the @code{super-hacks} branch, you can write in @code{~/.config/guix/channels.scm} this specification:
pt_br: O canal chamado @code{guix} especifica onde o próprio Guix---suas ferramentas de linha de comando, bem como sua coleção de pacotes---deve ser baixado. Por exemplo, suponha que você queira atualizar de outra cópia do repositório Guix em @code{example.org}, e especificamente o branch @code{super-hacks}, você pode escrever em @code{~/.config/guix/channels.scm} esta especificação:

source: ;; Tell 'guix pull' to use another repo. (list (channel (name 'guix) (url "https://example.org/another-guix.git") (branch "super-hacks")))
pt_br: ;; Diga ao 'guix pull' para usar outro repositório. (list (channel (name 'guix) (url "https://example.org/another-guix.git") (branch "super-hacks")))

source: From there on, @command{guix pull} will fetch code from the @code{super-hacks} branch of the repository at @code{example.org}. The authentication concern is addressed below (@pxref{Channel Authentication}).
pt_br: A partir daí, @command{guix pull} buscará o código do branch @code{super-hacks} do repositório em @code{example.org}. A preocupação com a autenticação é abordada abaixo (@pxref{Channel Authentication}).

source: Note that you can specify a local directory on the @code{url} field above if the channel that you intend to use resides on a local file system. However, in this case @command{guix} checks said directory for ownership before any further processing. This means that if the user is not the directory owner, but wants to use it as their default, they will then need to set it as a safe directory in their global git configuration file. Otherwise, @command{guix} will refuse to even read it. Supposing your system-wide local directory is at @code{/src/guix.git}, you would then create a git configuration file at @code{~/.gitconfig} with the following contents:
pt_br: Note que você pode especificar um diretório local no campo @code{url} acima se o canal que você pretende usar residir em um sistema de arquivos local. No entanto, neste caso, @command{guix} verifica o diretório em busca de propriedade antes de qualquer processamento posterior. Isso significa que se o usuário não for o proprietário do diretório, mas quiser usá-lo como padrão, ele precisará defini-lo como um diretório seguro em seu arquivo de configuração global do git. Caso contrário, @command{guix} se recusará até mesmo a lê-lo. Supondo que seu diretório local de todo o sistema esteja em @code{/src/guix.git}, você criaria um arquivo de configuração do git em @code{~/.gitconfig} com o seguinte conteúdo:

source: This also applies to the root user unless when called with @command{sudo} by the directory owner.
pt_br: Isso também se aplica ao usuário root, a menos que seja chamado com @command{sudo} pelo proprietário do diretório.

source: The @command{guix describe} command shows precisely which commits were used to build the instance of Guix we're using (@pxref{Invoking guix describe}). We can replicate this instance on another machine or at a different point in time by providing a channel specification ``pinned'' to these commits that looks like this:
pt_br: O comando @command{guix describe} mostra precisamente quais commits foram usados para construir a instância do Guix que estamos usando (@pxref{Invoking guix describe}). Podemos replicar essa instância em outra máquina ou em um ponto diferente no tempo fornecendo uma especificação de canal ``fixada'' a esses commits que se parece com isso:

source: ;; Deploy specific commits of my channels of interest. (list (channel (name 'guix) (url "https://git.guix.gnu.org/guix.git") (commit "6298c3ffd9654d3231a6f25390b056483e8f407c")) (channel (name 'variant-packages) (url "https://example.org/variant-packages.git") (commit "dd3df5e2c8818760a8fc0bd699e55d3b69fef2bb")))
pt_br: ;; Implantar commits específicos dos meus canais de interesse. (list (channel (name 'guix) (url "https://git.guix.gnu.org/guix.git") (commit "6298c3ffd9654d3231a6f25390b056483e8f407c")) (channel (name 'variant-packages) (url "https://example.org/variant-packages.git") (commit "dd3df5e2c8818760a8fc0bd699e55d3b69fef2bb")))

source: To obtain this pinned channel specification, the easiest way is to run @command{guix describe} and to save its output in the @code{channels} format in a file, like so:
pt_br: Para obter essa especificação de canal fixado, a maneira mais fácil é executar @command{guix describe} e salvar sua saída no formato @code{channels} em um arquivo, assim:

source: The resulting @file{channels.scm} file can be passed to the @option{-C} option of @command{guix pull} (@pxref{Invoking guix pull}) or @command{guix time-machine} (@pxref{Invoking guix time-machine}), as in this example:
pt_br: O arquivo @file{channels.scm} resultante pode ser passado para a opção @option{-C} de @command{guix pull} (@pxref{Invoking guix pull}) ou @command{guix time-machine} (@pxref{Invoking guix time-machine}), como neste exemplo:

source: Given the @file{channels.scm} file, the command above will always fetch the @emph{exact same Guix instance}, then use that instance to run the exact same Python (@pxref{Invoking guix shell}). On any machine, at any time, it ends up running the exact same binaries, bit for bit.
pt_br: Dado o arquivo @file{channels.scm}, o comando acima sempre buscará a @emph{exatamente a mesma instância Guix}, então usará essa instância para executar exatamente o mesmo Python (@pxref{Invoking guix shell}). Em qualquer máquina, a qualquer momento, ele acaba executando exatamente os mesmos binários, bit por bit.

source: lock files
pt_br: arquivo de bloqueio

source: Pinned channels address a problem similar to ``lock files'' as implemented by some deployment tools---they let you pin and reproduce a set of packages. In the case of Guix though, you are effectively pinning the entire package set as defined at the given channel commits; in fact, you are pinning all of Guix, including its core modules and command-line tools. You're also getting strong guarantees that you are, indeed, obtaining the exact same software.
pt_br: Os canais fixados abordam um problema semelhante a ``arquivos de bloqueio'' conforme implementado por algumas ferramentas de implantação --- eles permitem que você fixe e reproduza um conjunto de pacotes. No caso do Guix, no entanto, você está efetivamente fixando o conjunto de pacotes inteiro conforme definido nos commits de canal fornecidos; na verdade, você está fixando todo o Guix, incluindo seus módulos principais e ferramentas de linha de comando. Você também está obtendo fortes garantias de que está, de fato, obtendo exatamente o mesmo software.

source: This gives you super powers, allowing you to track the provenance of binary artifacts with very fine grain, and to reproduce software environments at will---some sort of ``meta reproducibility'' capabilities, if you will. @xref{Inferiors}, for another way to take advantage of these super powers.
pt_br: Isso lhe dá superpoderes, permitindo que você rastreie a procedência de artefatos binários com granularidade muito fina e reproduza ambientes de software à vontade --- algum tipo de capacidade de ``meta reprodutibilidade'', se preferir. @xref{Inferiors}, para outra maneira de aproveitar esses superpoderes.

source: channels, for the default Guix
pt_br: canais, para o Guix padrão

source: If you're running Guix System or building system images with it, maybe you will want to customize the system-wide @command{guix} it provides---specifically, @file{/run/current-system/profile/bin/guix}. For example, you might want to provide additional channels or to pin its revision.
pt_br: Se você estiver executando o Guix System ou construindo imagens de sistema com ele, talvez você queira personalizar o @command{guix} de todo o sistema que ele fornece---especificamente, @file{/run/current-system/profile/bin/guix}. Por exemplo, você pode querer fornecer canais adicionais ou fixar sua revisão.

source: This can be done using the @code{guix-for-channels} procedure, which returns a package for the given channels, and using it as part of your operating system configuration, as in this example:
pt_br: Isso pode ser feito usando o procedimento @code{guix-for-channels}, que retorna um pacote para os canais fornecidos e o usa como parte da configuração do seu sistema operacional, como neste exemplo:

source: (define my-channels ;; Channels that should be available to ;; /run/current-system/profile/bin/guix. (append (list (channel (name 'guix-science) (url "https://codeberg.org/guix-science/guix-science") (branch "master"))) %default-channels))
pt_br: (define my-channels ;; Canais que devem estar disponíveis para ;; /run/current-system/profile/bin/guix. (append (list (channel (name 'guix-science) (url "https://codeberg.org/guix-science/guix-science") (branch "master"))) %default-channels))

source: The resulting operating system will have both the @code{guix} and the @code{guix-science} channels visible by default. The @code{channels} field of @code{guix-configuration} above further ensures that @file{/etc/guix/channels.scm}, which is used by @command{guix pull}, specifies the same set of channels (@pxref{guix-configuration-channels, @code{channels} field of @code{guix-configuration}}).
pt_br: O sistema operacional resultante terá os canais @code{guix} e @code{guix-science} visíveis por padrão. O campo @code{channels} de @code{guix-configuration} acima garante ainda mais que @file{/etc/guix/channels.scm}, que é usado por @command{guix pull}, especifica o mesmo conjunto de canais (@pxref{guix-configuration-channels, campo @code{channels} de @code{guix-configuration}}).
