Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: It is customary for cluster nodes to have access at best to a @emph{white list} of hosts. Our head node needs at least @code{ci.guix.gnu.org} in this white list since this is where it gets pre-built binaries from by default, for all the packages that are in Guix proper.
it: È consuetudine che i nodi del cluster abbiano accesso, nella migliore delle ipotesi, a una @emph{white list} di host. Il nostro nodo principale ha bisogno almeno di @code{ci.guix.gnu.org} in questa white list, poiché è da qui che ottiene i binari precompilati per impostazione predefinita, per tutti i pacchetti presenti in Guix.
pt_br: É costume que nós de cluster tenham acesso, na melhor das hipóteses, a uma @emph{white list} de hosts. Nosso nó principal precisa de pelo menos @code{ci.guix.gnu.org} nessa lista branca, pois é de lá que ele obtém binários pré-construídos por padrão, para todos os pacotes que estão no Guix propriamente dito.
sk: Uzly v zhluku počítačov majú obvykle prístup len k hostiteľom zaradeným na @emph{bielej listine}. Pre náš hlavný uzol je dôležité na túto bielu listinu zaradiť aspoň @code{ci.guix.gnu.org}, odkiaľ predvolene získava pred-zostavené náhrady pre všetky balíky prítomné v samotnom Guixe.

source: Incidentally, @code{ci.guix.gnu.org} also serves as a @emph{content-addressed mirror} of the source code of those packages. Consequently, it is sufficient to have @emph{only} @code{ci.guix.gnu.org} in that white list.
it: Per inciso, @code{ci.guix.gnu.org} funge anche da @emph{mirror con indirizzamento per contenuto} del codice sorgente di tali pacchetti. Di conseguenza, è sufficiente avere @emph{only} @code{ci.guix.gnu.org} in quella white list.
pt_br: A propósito, @code{ci.guix.gnu.org} também serve como um @emph{content-addressed mirror} do código-fonte desses pacotes. Consequentemente, é suficiente ter @emph{unicamente} @code{ci.guix.gnu.org} nessa lista branca.
sk: @code{ci.guix.gnu.org} naschvál slúži aj ako @emph{zrkadlo s asociatívnym prístupom} pre získavanie zdrojových kódov balíkov. Preto stačí na bielu listinu pridať @emph{len} @code{ci.guix.gnu.org}.

source: Software packages maintained in a separate repository such as one of the various @uref{https://hpc.guix.info/channels, HPC channels} are of course unavailable from @code{ci.guix.gnu.org}. For these packages, you may want to extend the white list such that source and pre-built binaries (assuming this-party servers provide binaries for these packages) can be downloaded. As a last resort, users can always download source on their workstation and add it to the cluster's @file{/gnu/store}, like this:
it: I pacchetti software mantenuti in un repository separato, come uno dei vari @uref{https://hpc.guix.info/channels, canali HPC}, non sono disponibili da @code{ci.guix.gnu.org}. Per questi pacchetti, potresti voler estendere la white list in modo che il sorgente e i binari precompilati (supponendo che i server di terze parti forniscano binari per questi pacchetti) possano essere scaricati. Come ultima risorsa, gli utenti possono sempre scaricare il sorgente sulla propria workstation e aggiungerlo a @file{/gnu/store} del cluster, in questo modo:
pt_br: Pacotes de software mantidos em um repositório separado, como um dos vários @uref{https://hpc.guix.info/channels, canais HPC}, obviamente não estão disponíveis em @code{ci.guix.gnu.org}. Para esses pacotes, você pode querer estender a lista branca de modo que os binários de origem e pré-construídos (assumindo que os servidores desta parte forneçam binários para esses pacotes) possam ser baixados. Como último recurso, os usuários sempre podem baixar o código-fonte em sua estação de trabalho e adicioná-lo ao @file{/gnu/store} do cluster, assim:
sk: Balíky spravované vrámci iných repozitárov, napr. v rozličných @uref{https://hpc.guix.info/channels, HPC kanáloch}, samozrejme nie sú na @code{ci.guix.gnu.org} dostupné. Pre zahrnutie týchto balíkov môžete bielu listinu rozšíriť tak, aby bolo možné sťahovať príslušné zdrojové kódy a pred-zostavené binárne súbory (predpokladajúc, že tieto servery tretej strany pred-zostavené binárne súbory pre dotknuté balíky poskytujú). Ako poslednú možnosť si používatelia môžu zdrojový kód stiahnuť na svojom počítači a potom ho takto pridať do @file{/gnu/store} na zhluku počítačov:

source: The above command downloads @code{starpu-1.2.3.tar.gz} @emph{and} sends it to the cluster's @code{guix-daemon} instance over SSH.
it: Il comando sopra scarica @code{starpu-1.2.3.tar.gz} @emph{and} lo invia all'istanza @code{guix-daemon} del cluster tramite SSH.
pt_br: O comando acima baixa @code{starpu-1.2.3.tar.gz} @emph{e} o envia para a instância @code{guix-daemon} do cluster via SSH.
sk: Horeuvedený príkaz stiahne @code{starpu-1.2.3.tar.gz} @emph{a} cez SSH ho odošle démonovi @code{guix-daemon} na zhluku počítačov.

source: Air-gapped clusters require more work. At the moment, our suggestion would be to download all the necessary source code on a workstation running Guix. For instance, using the @option{--sources} option of @command{guix build} (@pxref{Invoking guix build,,, guix, GNU Guix Reference Manual}), the example below downloads all the source code the @code{openmpi} package depends on:
it: I cluster isolati richiedono più lavoro. Al momento, il nostro suggerimento sarebbe quello di scaricare tutto il codice sorgente necessario su una workstation che esegue Guix. Ad esempio, usando l'opzione @option{--sources} di @command{guix build} (@pxref{Invocare guix build,,, guix.it, Manuale di riferimento di GNU Guix}), l'esempio seguente scarica tutto il codice sorgente da cui dipende il pacchetto @code{openmpi}:
pt_br: Clusters com air-gapped exigem mais trabalho. No momento, nossa sugestão seria baixar todo o código-fonte necessário em uma estação de trabalho executando Guix. Por exemplo, usando a opção @option{--sources} de @command{guix build} (@pxref{Invocando guix build,,, guix.pt_BR, Manual de Referência do GNU Guix}), o exemplo abaixo baixa todo o código-fonte do qual o pacote @code{openmpi} depende:
sk: Zhluky počítačov odpojené od vonkajšej siete vyžadujú väčšie úsilie. V tejto chvíli vám odporúčame stiahnuť všetok potrebný zdrojový kód na pracovnej stanici s Guixom. V nižšie uvedenom príklade uvádzame ako sa dá stiahnuť všetok zdrojový kód, na ktorom závisí balík @code{openmpi} pomocou voľby @option{--sources} príkazu @command{guix build} (@pxref{Invoking guix build,,, guix, GNU Guix Reference Manual}):

source: (In case you're wondering, that's more than 320@ MiB of @emph{compressed} source code.)
it: (Nel caso ti stia chiedendo, si tratta di più di 320 MiB di codice sorgente @emph{compressed}.)
pt_br: (Caso você esteja se perguntando, isso é mais de 320@ MiB de código-fonte @emph{compactado}.)
sk: (Pre lepšiu predstavu, jedná sa o približne 320@ MiB @emph{stlačeného} zdrojového kódu.)
sv: (Ifall du undrar är det där mer än 320 MiB av @emph{komprimerad} källkod.)

source: We can then make a big archive containing all of this (@pxref{Invoking guix archive,,, guix, GNU Guix Reference Manual}):
it: Possiamo quindi creare un grande archivio contenente tutto questo (@pxref{Invocare guix archive,,, guix.it, Manuale di riferimento di GNU Guix}):
pt_br: Podemos então criar um grande arquivamento contendo tudo isso (@pxref{Invocando guix archive,,, guix.pt_BR, Manual de Referência GNU Guix}):
sk: Všetko to potom môžme zbaliť do jedného veľkého stlačeného súboru (@pxref{Invoking guix archive,,, guix, GNU Guix Reference Manual}):

source: @dots{} and we can eventually transfer that archive to the cluster on removable storage and unpack it there:
it: @dots{} e possiamo eventualmente trasferire quell'archivio al cluster su memoria rimovibile e decomprimerlo lì:
pt_br: @dots{} e podemos eventualmente transferir esse arquivamento para o cluster em armazenamento removível e descompactá-lo lá:
sk: @dots{} presunúť na zhluk počítačov na vymeniteľnom zariadení a rozbaliť:

source: This process has to be repeated every time new source code needs to be brought to the cluster.
it: Questo processo deve essere ripetuto ogni volta che è necessario portare nuovo codice sorgente al cluster.
pt_br: Esse processo precisa ser repetido toda vez que um novo código-fonte precisa ser trazido para o cluster.
sk: Tento postup je potrebné zopakovať zakaždým, keď potrebujeme na zhluk počítačov preniesť ďalší zdrojový kód.

source: As we write this, the research institutes involved in Guix-HPC do not have air-gapped clusters though. If you have experience with such setups, we would like to hear feedback and suggestions.
it: Mentre scriviamo, gli istituti di ricerca coinvolti in Guix-HPC non hanno cluster isolati. Se hai esperienza con tali configurazioni, ci piacerebbe ricevere il tuo feedback e suggerimenti.
pt_br: Enquanto escrevemos isso, os institutos de pesquisa envolvidos no Guix-HPC não têm clusters air-gapped. Se você tem experiência com essas configurações, gostaríamos de ouvir feedback e sugestões.
sk: V čase keď bolo toto napísané, nemali vedecké zariadenia zapojené do Guix-HPC zhluky počítačov neprístupné z vonkajšej siete. Ak s takýmto nastavením máte skúsenosti, radi by sme si vypočuli vašu spätnú väzbu a návrhy.

source: Disk Usage
it: Utilizzo del Disco
pt_br: Uso do Disco
ru: Использование диска
sk: Využitie úložného priestoru
sv: Diskanvändning

source: disk usage, on a cluster
it: utilizzo del disco, su un cluster
pt_br: uso de disco, em um cluster
sk: využitie úložného priestoru, na zhluku počítačov

source: A common concern of sysadmins' is whether this is all going to eat a lot of disk space. If anything, if something is going to exhaust disk space, it's going to be scientific data sets rather than compiled software---that's our experience with almost ten years of Guix usage on HPC clusters. Nevertheless, it's worth taking a look at how Guix contributes to disk usage.
it: Una preoccupazione comune degli amministratori di sistema è se tutto questo consumerà molto spazio su disco. Semmai, se qualcosa esaurirà lo spazio su disco, saranno i set di dati scientifici piuttosto che il software compilato --- questa è la nostra esperienza con quasi dieci anni di utilizzo di Guix sui cluster HPC. Ciononostante, vale la pena dare un'occhiata a come Guix contribuisce all'utilizzo del disco.
pt_br: Uma preocupação comum dos administradores de sistemas é se tudo isso vai consumir muito espaço em disco. Se alguma coisa vai esgotar o espaço em disco, serão conjuntos de dados científicos em vez de software compilado --- essa é nossa experiência com quase dez anos de uso do Guix em clusters HPC. No entanto, vale a pena dar uma olhada em como o Guix contribui para o uso do disco.
sk: Spoločnou otázkou systémových správcov je, či to všetko zožerie veľa úložného priestoru. Ak má niečo vyčerpať miesto na disku, tak to budú skôr vedecké údaje ako zostavené programové vybavenie---to je naša viac ako desaťročná skúsenosť s používaním Guixu na vysokovýkonných zhlukoch počítačov. Avšak, stojí za to pozrieť sa na to, ako Guix vplýva na využitie úložného priestoru.

source: First, having several versions or variants of a given package in @file{/gnu/store} does not necessarily cost much, because @command{guix-daemon} implements deduplication of identical files, and package variants are likely to have a number of common files.
it: Innanzitutto, avere diverse versioni o varianti di un dato pacchetto in @file{/gnu/store} non costa necessariamente molto, perché @command{guix-daemon} implementa la deduplicazione di file identici, e le varianti dei pacchetti probabilmente avranno un certo numero di file comuni.
pt_br: Primeiro, ter várias versões ou variantes de um determinado pacote em @file{/gnu/store} não custa necessariamente muito, porque @command{guix-daemon} implementa a desduplicação de arquivos idênticos, e as variantes de pacote provavelmente terão vários arquivos em comum.
sk: V prvom rade, uchovávanie viacerých verzií daného balíka v @file{/gnu/store} nutne nestojí veľa, pretože @command{guix-daemon} si dokáže účinne poradiť s ukladaním podvojných súborov a spomínané verzie balíkov pravdepodobne zdieľajú veľké množstvo rovnakých súborov.

source: As mentioned above, we recommend having a cron job to run @code{guix gc} periodically, which removes @emph{unused} software from @file{/gnu/store}. However, there's always a possibility that users will keep lots of software in their profiles, or lots of old generations of their profiles, which is ``live'' and cannot be deleted from the viewpoint of @command{guix gc}.
it: Come accennato in precedenza, consigliamo di avere un cron job per eseguire @code{guix gc} periodicamente, che rimuove il software @emph{unused} da @file{/gnu/store}. Tuttavia, c'è sempre la possibilità che gli utenti mantengano molto software nei loro profili, o molte vecchie generazioni dei loro profili, che è ``vivo'' e non può essere eliminato dal punto di vista di @command{guix gc}.
pt_br: Conforme mencionado acima, recomendamos ter um cron job para executar @code{guix gc} periodicamente, o que remove o software @emph{não utilizado} de @file{/gnu/store}. No entanto, sempre há a possibilidade de que os usuários mantenham muitos softwares em seus perfis, ou muitas gerações antigas de seus perfis, que são ``ativos'' e não podem ser excluídos do ponto de vista do @command{guix gc}.
sk: Ako sme už spomínali, odporúčame nastaviť si cron úlohu, ktorá by pravidelne spúšťala @code{guix gc}, čo odstráni @emph{nepotrebné} programové vybavenie z @file{/gnu/store}. Avšak, používatelia si aj tak môžu vo svojich profiloch uchovávať veľké množstvo programov a predošlých pokolení profilov, ktoré sa z pohľadu @command{guix gc} nedajú odstrániť.

source: The solution to this is for users to regularly remove old generations of their profile. For instance, the following command removes generations that are more than two-month old:
it: La soluzione a questo è che gli utenti rimuovano regolarmente le vecchie generazioni del loro profilo. Ad esempio, il seguente comando rimuove le generazioni più vecchie di due mesi:
pt_br: A solução para isso é que os usuários removam regularmente gerações antigas de seus perfis. Por exemplo, o comando a seguir remove gerações com mais de dois meses de idade:
sk: Riešením pre používateľov je pravidelne odstraňovať staré pokolenia profilov. Napríklad, nasledovný príkaz odstráni pokolenia, ktoré sú staršie ako dva mesiace:
sv: Lösningen till det här är för användarna att regelbundet ta bort gamla generationer av sina profiler. Exempelvis kommer följande kommando att ta bort generationer som är mer än två månader gamla:

source: Likewise, it's a good idea to invite users to regularly upgrade their profile, which can reduce the number of variants of a given piece of software stored in @file{/gnu/store}:
it: Allo stesso modo, è una buona idea invitare gli utenti ad aggiornare regolarmente il proprio profilo, il che può ridurre il numero di varianti di un dato pezzo di software memorizzato in @file{/gnu/store}:
pt_br: Da mesma forma, é uma boa ideia convidar os usuários a atualizarem regularmente seus perfis, o que pode reduzir o número de variantes de um determinado software armazenado em @file{/gnu/store}:
sk: Podobne je dobré nabádať používateľov, aby si pravidelne aktualizovali profil, čo zníži počet verzií daných balíkov uložených v @file{/gnu/store}:
sv: Dessutom är det en god idé att uppmuntra användare till att regelbundet uppgradera sina profiler, vilket kan reducera antalet varianter av en given programvara som lagras i @file{/gnu/store}:

source: As a last resort, it is always possible for sysadmins to do some of this on behalf of their users. Nevertheless, one of the strengths of Guix is the freedom and control users get on their software environment, so we strongly recommend leaving users in control.
it: Come ultima risorsa, è sempre possibile per gli amministratori di sistema fare parte di questo per conto dei loro utenti. Tuttavia, uno dei punti di forza di Guix è la libertà e il controllo che gli utenti ottengono sul loro ambiente software, quindi raccomandiamo vivamente di lasciare gli utenti in controllo.
pt_br: Como último recurso, é sempre possível para os administradores de sistemas fazerem parte disso em nome de seus usuários. No entanto, um dos pontos fortes do Guix é a liberdade e o controle que os usuários têm sobre seu ambiente de software, então recomendamos fortemente deixar os usuários no controle.
sk: V krajnom prípade môžu systémoví správcovia niektoré z týchto úkonov vykonať aj v mene používateľov. Napriek tomu, jednou z myšlienok Guixu je slobodné zaobchádzanie a úplný dohľad nad prostrediami s programovým vybavením, takže dôrazne odporúčame nechať používateľom voľnú ruku.
sv: Som en sista utväg är det alltid möjligt för systemadministratörer att göra en del av det här på deras användares vägnar. Trots allt är en av Guix styrkor den frihet och kontroll över sin programmiljö som Guix skänker sina användare, därför rekommenderar vi starkt att lämna över kontrollen till användarna.

source: Security Considerations
it: Considerazioni sulla Sicurezza
pt_br: Considerações de segurança
sk: Úvahy o zabezpečení

source: security, on a cluster
it: sicurezza, su un cluster
pt_br: segurança, em um cluster
sk: bezpečnosť, na zhluku počítačov

source: On an HPC cluster, Guix is typically used to manage scientific software. Security-critical software such as the operating system kernel and system services such as @code{sshd} and the batch scheduler remain under control of sysadmins.
it: Su un cluster HPC, Guix è tipicamente usato per gestire software scientifico. Software critici per la sicurezza come il kernel del sistema operativo e i servizi di sistema come @code{sshd} e lo scheduler di batch rimangono sotto il controllo degli amministratori di sistema.
pt_br: Em um cluster HPC, o Guix é normalmente usado para gerenciar software científico. Softwares críticos de segurança, como o kernel do sistema operacional e serviços do sistema, como @code{sshd} e o agendador de lotes, permanecem sob o controle dos administradores de sistema.
sk: Vrámci vysokovýkonného zhluku počítačov sa Guix obvykle využíva na správu vedecky zameraného programového vybavenia. Pre bezpečnosť nevyhnutné vybavenie ako je jadro operačného systému a služby ako @code{sshd} a plánovač dávkových úloh zostávajú pod dohľadom systémových správcov.

source: The Guix project has a good track record delivering security updates in a timely fashion (@pxref{Security Updates,,, guix, GNU Guix Reference Manual}). To get security updates, users have to run @code{guix pull && guix upgrade}.
it: Il progetto Guix ha un buon track record nel fornire aggiornamenti di sicurezza in modo tempestivo (@pxref{Aggiornamenti di sicurezza,,, guix.it, Manuale di riferimento di GNU Guix}). Per ottenere gli aggiornamenti di sicurezza, gli utenti devono eseguire @code{guix pull && guix upgrade}.
pt_br: O projeto Guix tem um bom histórico de entrega de atualizações de segurança em tempo hábil (@pxref{Atualizações de segurança,,, guix.pt_BR, Manual de Referência do GNU Guix}). Para obter atualizações de segurança, os usuários precisam executar @code{guix pull && guix upgrade}.
sk: Projekt Guix má dobré výsledky v oblasti včasného poskytovania aktualizácií zabezpečenia (@pxref{Security Updates,,, guix, GNU Guix Reference Manual}). Aktualizácie sa získavajú vykonaním @code{guix pull && guix upgrade}.
sv: Guix-projektet har en god vana av att tillhandahålla säkerhetsuppdateringar i rättan tid (@pxref{Security Updates,,, guix, GNU Guix Reference Manual}). För att få säkerhetsuppdateringar behöver användare köra @code{guix pull && guix upgrade}.

source: Because Guix uniquely identifies software variants, it is easy to see if a vulnerable piece of software is in use. For instance, to check whether the glibc@ 2.25 variant without the mitigation patch against ``@uref{https://www.qualys.com/2017/06/19/stack-clash/stack-clash.txt,Stack Clash}'', one can check whether user profiles refer to it at all:
it: Poiché Guix identifica in modo univoco le varianti del software, è facile vedere se un pezzo di software vulnerabile è in uso. Ad esempio, per verificare se la variante glibc@ 2.25 senza la patch di mitigazione contro ``@uref{https://www.qualys.com/2017/06/19/stack-clash/stack-clash.txt,Stack Clash}'', si può controllare se i profili utente vi fanno riferimento in assoluto:
pt_br: Como o Guix identifica exclusivamente variantes de software, é fácil ver se um pedaço vulnerável de software está em uso. Por exemplo, para verificar se a variante glibc@ 2.25 sem o patch de mitigação contra ``@uref{https://www.qualys.com/2017/06/19/stack-clash/stack-clash.txt,Stack Clash}'', pode-se verificar se os perfis de usuário fazem referência a ela:
sk: Vďaka tomu, že Guix osobitne označuje rozličné verzie programov, je jednoduché zistiť, či sa používa nejaký zraniteľný program. Napríklad, pomocou nasledovného príkazu môžeme zistiť, či niektorý z používateľských profilov odkazuje na glibc@ 2.25 bez zaplátanej zraniteľnosti „@uref{https://www.qualys.com/2017/06/19/stack-clash/stack-clash.txt,Stack Clash}“:

source: This will report whether profiles exist that refer to this specific glibc variant.
it: Questo riporterà se esistono profili che fanno riferimento a questa specifica variante di glibc.
pt_br: Isso informará se existem perfis que se referem a essa variante glibc específica.
sk: Takto sa dozvieme, či jestvujú profily, ktoré odkazujú na presne túto verziu glibc.
sv: Det här kommer att rapportera om profiler som refererar till den här specifika glibc-varianten existerar.

source: system management
it: gestione del sistema
pt_br: Gerenciamento do Sistema
ru: управление системой

source: sysadmin
it: amministratore di sistema
pt_br: Administrador de sistema
sv: systemadministratör

source: Since Guix does not handle packaging, system configuration and services the way other (more ``classical'') distributions do, some workflows tend to unfold slightly different as we are used to and need slight adjustment. This chapter intends to help with such manners.
it: Poiché Guix non gestisce il packaging, la configurazione del sistema e i servizi nel modo in cui lo fanno altre distribuzioni (più ``classiche''), alcuni flussi di lavoro tendono a svolgersi in modo leggermente diverso da come siamo abituati e necessitano di un leggero adattamento. Questo capitolo intende aiutare con tali questioni.
pt_br: Como o Guix não lida com empacotamento, configuração do sistema e serviços da mesma forma que outras distribuições (mais ``clássicas'') fazem, alguns fluxos de trabalho tendem a ser um pouco diferente do que estamos acostumados e precisam de pequenos ajustes. Este capítulo pretende ajudar com essas diferenças.

source: With the deprecation of the default value for the postgres package in postgresql-configuration (see b93434e656eba4260df82158a96c295000d3ff44), system upgrades need some manual action before they can take place. Here's a handy guide on how to.
it: Con la deprecazione del valore predefinito per il pacchetto postgres in postgresql-configuration (vedi b93434e656eba4260df82158a96c295000d3ff44), gli aggiornamenti di sistema richiedono alcune azioni manuali prima di poter aver luogo. Ecco una pratica guida su come fare.
pt_br: Com a descontinuação do valor padrão do pacote postgres em postgresql-configuration (veja b93434e656eba4260df82158a96c295000d3ff44), é necessário fazer algumas ações manuais antes de atualizar o sistema. Aqui está um guia prático sobre como fazer isso.
