Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Development needs go beyond development environments though. How can developers perform continuous integration of their code in Guix build environments? How can they deliver their code straight to adventurous users? This chapter describes a set of files developers can add to their repository to set up Guix-based development environments, continuous integration, and continuous delivery---all at once@footnote{This chapter is adapted from a @uref{https://guix.gnu.org/en/blog/2023/from-development-environments-to-continuous-integrationthe-ultimate-guide-to-software-development-with-guix/, blog post} published in June 2023 on the Guix web site.}.
it: Le esigenze di sviluppo vanno oltre gli ambienti di sviluppo. Come possono gli sviluppatori eseguire l'integrazione continua del loro codice negli ambienti di costruzione di Guix? Come possono consegnare il loro codice direttamente agli utenti più avventurosi? Questo capitolo descrive un insieme di file che gli sviluppatori possono aggiungere al loro repository per configurare ambienti di sviluppo basati su Guix, integrazione continua e consegna continua --- tutto in una volta sola@footnote{Questo capitolo è adattato da un @uref{https://guix.gnu.org/en/blog/2023/from-development-environments-to-continuous-integrationthe-ultimate-guide-to-software-development-with-guix/, post del blog} pubblicato a giugno 2023 sul sito web di Guix.}.
pt_br: As necessidades de desenvolvimento vão além dos ambientes de desenvolvimento. Como os desenvolvedores podem realizar a integração contínua de seu código em ambientes de construção Guix? Como eles podem entregar seu código diretamente para usuários aventureiros? Este capítulo descreve um conjunto de arquivos que os desenvolvedores podem adicionar ao seu repositório para configurar ambientes de desenvolvimento baseados em Guix, integração contínua e entrega contínua --- tudo de uma vez @footnote{Este capítulo é uma adaptação de uma postagem de blog do @uref{https://guix.gnu.org/en/blog/2023/from-development-environments-to-continuous-integrationthe-ultimate-guide-to-software-development-with-guix/} publicada em junho de 2023 no site Guix.}.

source: How do we go about ``Guixifying'' a repository? The first step, as we've seen, will be to add a @file{guix.scm} at the root of the repository in question. We'll take @uref{https://www.gnu.org/software/guile,Guile} as an example in this chapter: it's written in Scheme (mostly) and C, and has a number of dependencies---a C compilation tool chain, C libraries, Autoconf and its friends, LaTeX, and so on. The resulting @file{guix.scm} looks like the usual package definition (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}), just without the @code{define-public} bit:
it: Come ``Guixificare'' un repository? Il primo passo, come abbiamo visto, sarà aggiungere un file @file{guix.scm} alla radice del repository in questione. Prenderemo @uref{https://www.gnu.org/software/guile,Guile} come esempio in questo capitolo: è scritto principalmente in Scheme e C, e ha una serie di dipendenze --- una toolchain di compilazione C, librerie C, Autoconf e i suoi amici, LaTeX, e così via. Il file @file{guix.scm} risultante assomiglia alla solita definizione di pacchetto (@pxref{Definire i pacchetti,,, guix, Manuale di riferimento GNU Guix}), solo senza il pezzo @code{define-public}:
pt_br: Como fazemos para ``Guixificar'' um repositório? O primeiro passo, como vimos, será adicionar um @file{guix.scm} na raiz do repositório em questão. Usaremos @uref{https://www.gnu.org/software/guile,Guile} como exemplo neste capítulo: ele é escrito em Scheme (principalmente) e C, e tem várias dependências --- uma cadeia de ferramentas de compilação C, bibliotecas C, Autoconf e seus amigos, LaTeX, e assim por diante. O @file{guix.scm} resultante se parece com a definição de pacote usual (@pxref{Definindo pacotes,,, guix.pt_BR, Manual de Referência GNU Guix}), só que sem o bit @code{define-public}:

source: ;; The ‘guix.scm’ file for Guile, for use by ‘guix shell’.
it: ;; Il file «guix.scm» per Guile, da usare con «guix shell».
pt_br: ;; O arquivo ‘guix.scm’ para Guile, para uso pelo ‘guix shell’.

source: (package (name "guile") (version "3.0.99-git") ;funky version number (source #f) ;no source (build-system gnu-build-system) (native-inputs (append (list autoconf automake libtool gnu-gettext flex texinfo texlive-base ;for "make pdf" texlive-epsf gperf git gdb strace readline lzip pkg-config)
it: (package (name "guile") (version "3.0.99-git") ;numero di versione strano (source #f) ;nessuna fonte (build-system gnu-build-system) (native-inputs (append (list autoconf automake libtool gnu-gettext flex texinfo texlive-base ;per "make pdf" texlive-epsf gperf git gdb strace readline lzip pkg-config)
pt_br: (package (name "guile") (version "3.0.99-git") ;número da versão funky (source #f) ;nenhuma fonte (build-system gnu-build-system) (native-inputs (append (list autoconf automake libtool gnu-gettext flex texinfo texlive-base ;para "make pdf" texlive-epsf gperf git gdb strace readline lzip pkg-config)

source: ;; When cross-compiling, a native version of Guile itself is ;; needed. (if (%current-target-system) (list this-package) '()))) (inputs (list libffi bash-minimal)) (propagated-inputs (list libunistring libgc))
it: ;; Quando si esegue la compilazione incrociata, è necessaria una ;; versione nativa di Guile. (if (%current-target-system) (list this-package) '()))) (inputs (list libffi bash-minimal)) (propagated-inputs (list libunistring libgc))
pt_br: ;; Ao compilar cruzadamente, uma versão nativa do próprio Guile é ;; needed. (if (%current-target-system) (list this-package) '()))) (inputs (list libffi bash-minimal)) (propagated-inputs (list libunistring libgc))

source: (native-search-paths (list (search-path-specification (variable "GUILE_LOAD_PATH") (files '("share/guile/site/3.0"))) (search-path-specification (variable "GUILE_LOAD_COMPILED_PATH") (files '("lib/guile/3.0/site-ccache"))))) (synopsis "Scheme implementation intended especially for extensions") (description "Guile is the GNU Ubiquitous Intelligent Language for Extensions, and it's actually a full-blown Scheme implementation!") (home-page "https://www.gnu.org/software/guile/") (license license:lgpl3+))
it: (native-search-paths (list (search-path-specification (variable "GUILE_LOAD_PATH") (files '("share/guile/site/3.0"))) (search-path-specification (variable "GUILE_LOAD_COMPILED_PATH") (files '("lib/guile/3.0/site-ccache"))))) (synopsis "Implementazione Scheme destinata in particolare alle estensioni") (description "Guile è il Linguaggio Intelligente Onnipresente GNU per le Estensioni, ed è in realtà un'implementazione Scheme completa!") (home-page "https://www.gnu.org/software/guile/") (license license:lgpl3+))

source: Quite a bit of boilerplate, but now someone who'd like to hack on Guile now only needs to run:
it: Un bel po' di codice standard, ma ora chiunque voglia mettere mano a Guile deve solo eseguire:
pt_br: um pouco de clichê, mas agora alguém que queira hackear o Guile só precisa executar:

source: That gives them a shell containing all the dependencies of Guile: those listed above, but also @emph{implicit dependencies} such as the GCC tool chain, GNU@ Make, sed, grep, and so on. @xref{Invoking guix shell,,, guix, GNU Guix Reference Manual}, for more info on @command{guix shell}.
it: Questo fornisce loro una shell contenente tutte le dipendenze di Guile: quelle elencate sopra, ma anche @emph{dipendenze implicite} come la tool chain GCC, GNU Make, sed, grep e così via. @xref{Invocare guix shell,,, guix.it, Manuale di riferimento GNU Guix}, per maggiori informazioni su @command{guix shell}.
pt_br: Isso lhes dá um shell contendo todas as dependências do Guile: aquelas listadas acima, mas também @emph{dependências implícitas}, como a cadeia de ferramentas GCC, GNU@ Make, sed, grep e assim por diante. @xref{Invocando guix shell,,, guix.pt_BR, Manual de Referência do GNU Guix}, para mais informações sobre @command{guix shell}.

source: The chef's recommendation
it: Il consiglio dello chef
pt_br: Recomendação do chef

source: Our suggestion is to create development environments like this:
it: Il nostro suggerimento è di creare ambienti di sviluppo come questo:
pt_br: Nossa sugestão é criar ambientes de desenvolvimento como este:

source: ... or, for short:
it: ... o, in breve:
pt_br: ... ou, para abreviar:

source: That gives a shell in an isolated container, and all the dependencies show up in @code{$HOME/.guix-profile}, which plays well with caches such as @file{config.cache} (@pxref{Cache Files,,, autoconf, Autoconf}) and absolute file names recorded in generated @code{Makefile}s and the likes. The fact that the shell runs in a container brings peace of mind: nothing but the current directory and Guile's dependencies is visible inside the container; nothing from the system can possibly interfere with your development.
it: Questo fornisce una shell in un contenitore isolato, e tutte le dipendenze appaiono in @code{$HOME/.guix-profile}, che funziona bene con le cache come @file{config.cache} (@pxref{File Cache,,, autoconf, Autoconf}) e i nomi di file assoluti registrati nei @code{Makefile} generati e simili. Il fatto che la shell venga eseguita in un contenitore porta tranquillità: nulla, tranne la directory corrente e le dipendenze di Guile, è visibile all'interno del contenitore; nulla del sistema può interferire con il tuo sviluppo.
pt_br: Isso dá um shell em um contêiner isolado, e todas as dependências aparecem em @code{$HOME/.guix-profile}, que funciona bem com caches como @file{config.cache} (@pxref{Cache Files,,, autoconf, Autoconf}) e nomes de arquivos absolutos registrados em @code{Makefile}s gerados e similares. O fato de o shell rodar em um contêiner traz paz de espírito: nada além do diretório atual e das dependências do Guile é visível dentro do contêiner; nada do sistema pode interferir no seu desenvolvimento.

source: Level 1: Building with Guix
it: Livello 1: Costruire con Guix
pt_br: Nível 1: Construindo com Guix

source: Now that we have a package definition (@pxref{Getting Started}), why not also take advantage of it so we can build Guile with Guix? We had left the @code{source} field empty, because @command{guix shell} above only cares about the @emph{inputs} of our package---so it can set up the development environment---not about the package itself.
it: Ora che abbiamo una definizione di pacchetto (@pxref{Getting Started}), perché non approfittarne anche per costruire Guile con Guix? Avevamo lasciato il campo @code{source} vuoto, perché @command{guix shell} si occupa solo degli @emph{inputs} del nostro pacchetto --- in modo da poter configurare l'ambiente di sviluppo --- non del pacchetto stesso.
pt_br: Agora que temos uma definição de pacote (@pxref{Getting Started}), por que não tirar vantagem dela também para que possamos construir o Guile com o Guix? Deixamos o campo @code{source} vazio, porque o @command{guix shell} acima só se importa com as @emph{inputs} do nosso pacote---para que ele possa configurar o ambiente de desenvolvimento---não com o pacote em si.

source: To build the package with Guix, we'll need to fill out the @code{source} field, along these lines:
it: Per costruire il pacchetto con Guix, dovremo compilare il campo @code{source}, seguendo queste linee:
pt_br: Para construir o pacote com Guix, precisaremos preencher o campo @code{source}, desta forma:

source: (use-modules (guix) (guix git-download) ;for ‘git-predicate’ @dots{})
it: (use-modules (guix) (guix git-download) ;per ‘git-predicate’ @dots{})
pt_br: (use-modules (guix) (guix git-download) ;para ‘git-predicate’ @dots{})

source: (define vcs-file? ;; Return true if the given file is under version control. (or (git-predicate (current-source-directory)) (const #t))) ;not in a Git checkout
it: (define vcs-file? ;; Restituisce vero se il file dato è sotto controllo di versione. (or (git-predicate (current-source-directory)) (const #t))) ;non in un checkout Git
pt_br: (define vcs-file? ;; Retorna verdadeiro se o arquivo fornecido estiver sob controle de versão. (or (git-predicate (current-source-directory)) (const #t))) ;não em um checkout do Git

source: (package (name "guile") (version "3.0.99-git") ;funky version number (source (local-file "." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{})
it: (package (name "guile") (version "3.0.99-git") ;numero di versione strano (source (local-file "." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{})
pt_br: (package (name "guile") (version "3.0.99-git") ;número da versão funky (source (local-file "." "guile-checkout" #:recursive? #t #:select? vcs-file?)) @dots{})

source: Here's what we changed compared to the previous section:
it: Ecco cosa abbiamo cambiato rispetto alla sezione precedente:
pt_br: Aqui está o que mudamos em comparação à seção anterior:

source: We added @code{(guix git-download)} to our set of imported modules, so we can use its @code{git-predicate} procedure.
it: Abbiamo aggiunto @code{(guix git-download)} al nostro set di moduli importati, in modo da poter utilizzare la sua procedura @code{git-predicate}.
pt_br: Adicionamos @code{(guix git-download)} ao nosso conjunto de módulos importados, para que possamos usar seu procedimento @code{git-predicate}.

source: We defined @code{vcs-file?} as a procedure that returns true when passed a file that is under version control. For good measure, we add a fallback case for when we're not in a Git checkout: always return true.
it: Abbiamo definito @code{vcs-file?} come una procedura che restituisce vero quando le viene passato un file sotto controllo di versione. Per sicurezza, aggiungiamo un caso di fallback per quando non siamo in un checkout Git: restituiamo sempre vero.
pt_br: Definimos @code{vcs-file?} como um procedimento que retorna true quando passado um arquivo que está sob controle de versão. Para uma boa medida, adicionamos um caso de fallback para quando não estamos em um checkout do Git: sempre retorna true.

source: We set @code{source} to a @uref{https://guix.gnu.org/manual/devel/en/html_node/G_002dExpressions.html#index-local_002dfile,@code{local-file}}---a recursive copy of the current directory (@code{"."}), limited to files under version control (the @code{#:select?} bit).
it: Abbiamo impostato @code{source} su un @uref{https://guix.gnu.org/manual/devel/it/html_node/G_002dexpression.html#index-local_002dfile,@code{local-file}} --- una copia ricorsiva della directory corrente (@code{"."}), limitata ai file sotto controllo di versione (il pezzo @code{#:select?}).
pt_br: Definimos @code{source} como um @uref{https://guix.gnu.org/manual/devel/pt-br/html_node/Expressoes_002dG.html#index-local_002dfile,@code{local-file}}---uma cópia recursiva do diretório atual (@code{"."}), limitado a arquivos sob controle de versão (o bit @code{#:select?}).

source: From there on, our @file{guix.scm} file serves a second purpose: it lets us build the software with Guix. The whole point of building with Guix is that it's a ``clean'' build---you can be sure nothing from your working tree or system interferes with the build result---and it lets you test a variety of things. First, you can do a plain native build:
it: Da qui in poi, il nostro file @file{guix.scm} serve a un secondo scopo: ci permette di costruire il software con Guix. Il punto principale della costruzione con Guix è che si tratta di una costruzione ``pulita'' --- puoi essere sicuro che nulla dal tuo albero di lavoro o dal sistema interferisca con il risultato della costruzione --- e ti permette di testare una varietà di cose. Innanzitutto, puoi fare una semplice costruzione nativa:
pt_br: A partir daí, nosso arquivo @file{guix.scm} serve a um segundo propósito: ele nos permite construir o software com Guix. O ponto principal de construir com Guix é que é uma construção ``limpa'' --- você pode ter certeza de que nada da sua árvore de trabalho ou sistema interfere no resultado da construção --- e ele permite que você teste uma variedade de coisas. Primeiro, você pode fazer uma construção nativa simples:

source: But you can also build for another system (possibly after setting up @pxref{Daemon Offload Setup, offloading,, guix, GNU Guix Reference Manual} or @pxref{Virtualization Services, transparent emulation,, guix, GNU Guix Reference Manual}):
it: Ma puoi anche costruire per un altro sistema (eventualmente dopo aver configurato @pxref{Configurazione dello scarico del demone, scaricamento,, guix.it, Manuale di riferimento GNU Guix} o @pxref{Servizi di virtualizzazione, emulazione trasparente,, guix.it, Manuale di riferimento GNU Guix}):
pt_br: Mas você também pode compilar para outro sistema (possivelmente após configurar @pxref{Daemon Offload Setup, offloading,, guix, GNU Guix Reference Manual} ou @pxref{Serviços de virtualização, emulação transparente,, guix.pt_BR, Manual de referência do GNU Guix}):

source: @dots{} or cross-compile:
it: @dots{} o compilare incrociando:
pt_br: @dots{} ou compilação cruzada:

source: You can also use @dfn{package transformations} to test package variants (@pxref{Package Transformation Options,,, guix, GNU Guix Reference Manual}):
it: È inoltre possibile utilizzare le @dfn{trasformazioni di pacchetto} per testare le varianti di pacchetto (@pxref{Opzioni di trasformazione dei pacchetti,,, guix.it, Manuale di riferimento GNU Guix}):
pt_br: Você também pode usar @dfn{transformações de pacotes} para testar variantes de pacotes (@pxref{Opções de transformação de pacote,,, guix.pt_BR, Manual de referência do GNU Guix}):

source: # What if we built with Clang instead of GCC? guix build -f guix.scm \ --with-c-toolchain=guile@@3.0.99-git=clang-toolchain
it: # E se costruissimo con Clang invece di GCC? guix build -f guix.scm \ --with-c-toolchain=guile@@3.0.99-git=clang-toolchain
pt_br: # E se construíssemos com Clang em vez de GCC? guix build -f guix.scm \ --with-c-toolchain=guile@@3.0.99-git=clang-toolchain

source: # What about that under-tested configure flag? guix build -f guix.scm \ --with-configure-flag=guile@@3.0.99-git=--disable-networking
it: # E quel flag di configurazione poco testato? guix build -f guix.scm \ --with-configure-flag=guile@@3.0.99-git=--disable-networking
pt_br: # E quanto ao sinalizador configure pouco testado? guix build -f guix.scm \ --with-configure-flag=guile@@3.0.99-git=--disable-networking

source: Handy!
it: Comodo!
pt_br: Útil!
sv: Användningsbar!

source: Level 2: The Repository as a Channel
it: Livello 2: Il Repository come Canale
pt_br: Nível 2: O Repositório como Canal

source: We now have a Git repository containing (among other things) a package definition (@pxref{Building with Guix}). Can't we turn it into a @dfn{channel} (@pxref{Channels,,, guix, GNU Guix Reference Manual})? After all, channels are designed to ship package definitions to users, and that's exactly what we're doing with our @file{guix.scm}.
it: Ora abbiamo un repository Git contenente (tra le altre cose) una definizione di pacchetto (@pxref{Building with Guix}). Non possiamo trasformarlo in un @dfn{channel} (@pxref{Canali,,, guix.it, Manuale di riferimento GNU Guix})? Dopotutto, i canali sono progettati per spedire le definizioni dei pacchetti agli utenti, ed è esattamente quello che stiamo facendo con il nostro @file{guix.scm}.
pt_br: Agora temos um repositório Git contendo (entre outras coisas) uma definição de pacote (@pxref{Building with Guix}). Não podemos transformá-lo em um @dfn{channel} (@pxref{Canais,,, guix.pt_BR, Manual de referência do GNU Guix})? Afinal, os canais são projetados para enviar definições de pacotes aos usuários, e é exatamente isso que estamos fazendo com nosso @file{guix.scm}.

source: Turns out we can indeed turn it into a channel, but with one caveat: we must create a separate directory for the @code{.scm} file(s) of our channel so that @command{guix pull} doesn't load unrelated @code{.scm} files when someone pulls the channel---and in Guile, there are lots of them! So we'll start like this, keeping a top-level @file{guix.scm} symlink for the sake of @command{guix shell}:
it: Si scopre che possiamo effettivamente trasformarlo in un canale, ma con una cautela: dobbiamo creare una directory separata per il/i file @code{.scm} del nostro canale in modo che @command{guix pull} non carichi file @code{.scm} non correlati quando qualcuno scarica il canale --- e in Guile ce ne sono molti! Quindi inizieremo così, mantenendo un symlink @file{guix.scm} di primo livello per il bene di @command{guix shell}:
pt_br: Acontece que podemos realmente transformá-lo em um canal, mas com uma ressalva: precisamos criar um diretório separado para o(s) arquivo(s) @code{.scm} do nosso canal para que @command{guix pull} não carregue arquivos @code{.scm} não relacionados quando alguém puxar o canal --- e no Guile, há muitos deles! Então, começaremos assim, mantendo um link simbólico @file{guix.scm} de nível superior para o bem do @command{guix shell}:

source: To make it usable as part of a channel, we need to turn our @file{guix.scm} file into a @dfn{package module} (@pxref{Package Modules,,, guix, GNU Guix Reference Manual}): we do that by changing the @code{use-modules} form at the top to a @code{define-module} form. We also need to actually @emph{export} a package variable, with @code{define-public}, while still returning the package value at the end of the file so we can still use @command{guix shell} and @command{guix build -f guix.scm}. The end result looks like this (not repeating things that haven't changed):
it: Per renderlo utilizzabile come parte di un canale, dobbiamo trasformare il nostro file @file{guix.scm} in un @dfn{modulo pacchetto} (@pxref{Moduli di pacchetti,,, guix.it, Manuale di riferimento GNU Guix}): lo facciamo cambiando la forma @code{use-modules} in alto in una forma @code{define-module}. Dobbiamo anche effettivamente @emph{export} una variabile pacchetto, con @code{define-public}, pur restituendo il valore del pacchetto alla fine del file in modo da poter ancora usare @command{guix shell} e @command{guix build -f guix.scm}. Il risultato finale assomiglia a questo (non ripetendo cose che non sono cambiate):
pt_br: Para torná-lo utilizável como parte de um canal, precisamos transformar nosso arquivo @file{guix.scm} em um @dfn{módulo de pacote} (@pxref{Módulos de pacote,,, guix.pt_BR, Manual de referência do GNU Guix}): fazemos isso alterando o formulário @code{use-modules} no topo para um formulário @code{define-module}. Também precisamos realmente @emph{exportar} uma variável de pacote, com @code{define-public}, enquanto ainda retornamos o valor do pacote no final do arquivo para que ainda possamos usar @command{guix shell} e @command{guix build -f guix.scm}. O resultado final se parece com isso (não repetindo coisas que não mudaram):

source: (define-module (guile-package) #:use-module (guix) #:use-module (guix git-download) ;for ‘git-predicate’ @dots{})
it: (define-module (guile-package) #:use-module (guix) #:use-module (guix git-download) ;per ‘git-predicate’ @dots{})
pt_br: (define-module (guile-package) #:use-module (guix) #:use-module (guix git-download) ;para ‘git-predicate’ @dots{})

source: (define vcs-file? ;; Return true if the given file is under version control. (or (git-predicate (dirname (dirname (current-source-directory)))) (const #t))) ;not in a Git checkout
it: (define vcs-file? ;; Restituisce vero se il file dato è sotto controllo di versione. (or (git-predicate (dirname (dirname (current-source-directory)))) (const #t))) ;non in un checkout Git
pt_br: (define vcs-file? ;; Retorna verdadeiro se o arquivo fornecido estiver sob controle de versão. (or (git-predicate (dirname (dirname (current-source-directory)))) (const #t))) ;não em um checkout do Git
