Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Normally branches will be merged in a ``first come, first merged'' manner, tracked through the guix-patches issues. If you agree on a different order with those involved, you can track this by updating which issues block@footnote{You can mark an issue as blocked by another by emailing @email{control@@debbugs.gnu.org} with the following line in the body of the email: @code{block XXXXX by YYYYY}. Where @code{XXXXX} is the number for the blocked issue, and @code{YYYYY} is the number for the issue blocking it.} which other issues. Therefore, to know which branch is at the front of the queue, look for the oldest issue, or the issue that isn't @dfn{blocked} by any other branch merges. An ordered list of branches with the open issues is available at @url{https://qa.guix.gnu.org}.
it: Normalmente i rami vengono uniti in modo ``primo arrivato, primo unito'', tracciato attraverso gli issue guix-patches. Se concordi un ordine diverso con i coinvolti, puoi tracciarlo aggiornando quali issue bloccano@footnote{Puoi contrassegnare un issue come bloccato da un altro inviando un'email a @email{control@@debbugs.gnu.org} con la seguente riga nel corpo dell'email: @code{block XXXXX by YYYYY}. Dove @code{XXXXX} è il numero dell'issue bloccato e @code{YYYYY} è il numero dell'issue che lo blocca.} quali altri issue. Pertanto, per sapere quale ramo è in testa alla coda, cerca l'issue più vecchio o l'issue che non è @dfn{bloccato} da nessun altro merge di ramo. Un elenco ordinato dei rami con gli issue aperti è disponibile su @url{https://qa.guix.gnu.org}.
pt_br: Normalmente, os branches serão mesclados de uma maneira ``primeiro a chegar, primeiro a ser mesclado'', rastreados por meio dos problemas guix-patches. Se você concordar com uma ordem diferente com os envolvidos, você pode rastrear isso atualizando which issues block@footnote{Você pode marcar um issue como bloqueado por outro enviando um e-mail para @email{control@@debbugs.gnu.org} com a seguinte linha no corpo do e-mail: @code{block XXXXX by YYYYY}. Onde @code{XXXXX} é o número do issue bloqueado, e @code{YYYYY} é o número do issue que o está bloqueando.} which other issues. Portanto, para saber qual branch está na frente da fila, procure o issue mais antigo, ou o issue que não está @dfn{bloqueado} por nenhuma outra branch merges. Uma lista ordenada de branches com os issues abertos está disponível em @url{https://qa.guix.gnu.org}.

source: Once a branch is at the front of the queue, wait until sufficient time has passed for the build farms to have processed the changes, and for the necessary testing to have happened. For example, you can check @indicateurl{https://qa.guix.gnu.org/branch/@var{branch}} to see information on some builds and substitute availability.
it: Una volta che un ramo è in testa alla coda, attendi che sia passato tempo sufficiente affinché le build farm elaborino le modifiche e siano stati effettuati i test necessari. Ad esempio, puoi controllare @indicateurl{https://qa.guix.gnu.org/branch/@var{branch}} per vedere informazioni su alcune build e sulla disponibilità di sostituti.
pt_br: Uma vez que um branch esteja na frente da fila, espere até que tenha passado tempo suficiente para que as farms de build tenham processado as mudanças, e para que os testes necessários tenham acontecido. Por exemplo, você pode verificar @indicateurl{https://qa.guix.gnu.org/branch/@var{branch}} para ver informações sobre alguns builds e disponibilidade de substitutos.

source: Once the branch has been merged, the issue should be closed and the branch deleted.
it: Una volta che il ramo è stato unito, l'issue dovrebbe essere chiuso e il ramo eliminato.
pt_br: Depois que a ramificação for mesclada, o problema deverá ser fechado e a ramificação excluída.

source: Web interface
it: Interfaccia web
pt_br: Interfaces web

source: mumi, web interface for issues
it: mumi, interfaccia web per gli issue
pt_br: mumi, interface web para issues

source: A web interface (actually @emph{two} web interfaces!) are available to browse issues:
it: Un'interfaccia web (in realtà @emph{due} interfacce web!) è disponibile per sfogliare gli issue:
pt_br: Uma interface web (na verdade @emph{duas} interfaces web!) está disponível para navegar pelos problemas:

source: @url{https://issues.guix.gnu.org} provides a pleasant interface powered by mumi@footnote{Mumi is a nice piece of software written in Guile, and you can help! See @url{https://codeberg.org/guix/mumi}.} to browse bug reports and patches, and to participate in discussions; mumi also has a command-line interface as we will see below;
it: @url{https://issues.guix.gnu.org} fornisce un'interfaccia piacevole alimentata da mumi@footnote{Mumi è un bel software scritto in Guile, e puoi aiutare! Vedi @url{https://codeberg.org/guix/mumi}.} per sfogliare report di bug e patch e partecipare alle discussioni; mumi ha anche un'interfaccia a riga di comando come vedremo sotto;
pt_br: @url{https://issues.guix.gnu.org} fornece uma interface agradável alimentada por mumi@footnote{Mumi é um bom software escrito em Guile, e você pode ajudar! Veja @url{https://codeberg.org/guix/mumi}.} para navegar por relatórios de bugs e patches, e para participar de discussões; mumi também tem uma interface de linha de comando como veremos abaixo;

source: @url{https://bugs.gnu.org/guix} lists bug reports;
it: @url{https://bugs.gnu.org/guix} elenca i report di bug;
pt_br: @url{https://bugs.gnu.org/guix} lista relatórios de bugs;

source: @url{https://bugs.gnu.org/guix-patches} lists patch submissions.
it: @url{https://bugs.gnu.org/guix-patches} elenca le sottomissioni di patch.
pt_br: @url{https://bugs.gnu.org/guix-patches} lista envios de patches.

source: To view discussions related to issue number @var{n}, go to @indicateurl{https://issues.guix.gnu.org/@var{n}} or @indicateurl{https://bugs.gnu.org/@var{n}}.
it: Per visualizzare le discussioni relative all'issue numero @var{n}, vai su @indicateurl{https://issues.guix.gnu.org/@var{n}} o @indicateurl{https://bugs.gnu.org/@var{n}}.
pt_br: Para visualizar discussões relacionadas ao problema número @var{n}, acesse @indicateurl{https://issues.guix.gnu.org/@var{n}} ou @indicateurl{https://bugs.gnu.org/@var{n}}.

source: Command-Line Interface
it: Interfaccia a Righe di Comando
pt_br: Interface de linha de comando

source: mumi command-line interface
it: interfaccia a riga di comando di mumi
pt_br: interface de linha de comando mumi

source: Mumi also comes with a command-line interface that can be used to search existing issues, open new issues, compose replies, apply and send patches. You do not need to use Emacs to use the mumi command-line client. You interact with it only on the command-line.
it: Mumi include anche un'interfaccia a riga di comando che può essere usata per cercare issue esistenti, aprire nuovi issue, comporre risposte, applicare e inviare patch. Non è necessario usare Emacs per usare il client a riga di comando di mumi. Interagisci con esso solo dalla riga di comando.
pt_br: O Mumi também vem com uma interface de linha de comando que pode ser usada para pesquisar problemas existentes, abrir novos problemas, compor respostas, aplicar e enviar patches. Você não precisa usar o Emacs para usar o cliente de linha de comando mumi. Você interage com ele apenas na linha de comando.

source: To use the mumi command-line interface, navigate to a local clone of the Guix git repository, and drop into a shell with mumi, git and git:send-email installed.
it: Per usare l'interfaccia a riga di comando di mumi, naviga in una copia locale del repository git di Guix ed entra in una shell con mumi, git e git:send-email installati.
pt_br: Para usar a interface de linha de comando mumi, navegue até um clone local do repositório git Guix e entre em um shell com mumi, git e git:send-email instalados.

source: To search for issues, say all open issues about "zig", run
it: Per cercare issue, ad esempio tutti gli issue aperti su "zig", esegui
pt_br: Para procurar problemas, diga todos os problemas abertos sobre "zig", execute

source: Pick an issue and make it the "current" issue.
it: Scegli un issue e rendilo l'issue "corrente".
pt_br: Escolha uma questão e torne-a a questão "atual".

source: Once an issue is the current issue, you can open the issue in a web browser, compose replies, apply patches, send patches, etc. with short succinct commands.
it: Una volta che un issue è l'issue corrente, puoi aprirlo in un browser web, comporre risposte, applicare patch, inviare patch, ecc. con comandi brevi e succinti.
pt_br: Quando um problema é o problema atual, você pode abri-lo em um navegador da web, redigir respostas, aplicar patches, enviar patches, etc. com comandos curtos e sucintos.

source: Open the issue in your web browser using
it: Apri l'issue nel tuo browser web usando
pt_br: Abra o problema no seu navegador da web usando

source: Compose a reply using
it: Componi una risposta usando
pt_br: Redija uma resposta usando

source: Compose a reply and close the issue using
it: Componi una risposta e chiudi l'issue usando
pt_br: Redija uma resposta e feche o problema usando

source: @command{mumi compose} opens your mail client by passing @samp{mailto:} URIs to @command{xdg-open}. So, you need to have @command{xdg-open} set up to open your mail client correctly.
it: @command{mumi compose} apre il tuo client di posta passando URI @samp{mailto:} a @command{xdg-open}. Quindi, devi avere @command{xdg-open} configurato per aprire correttamente il tuo client di posta.
pt_br: @command{mumi compose} abre seu cliente de e-mail passando URIs @samp{mailto:} para @command{xdg-open}. Então, você precisa ter @command{xdg-open} configurado para abrir seu cliente de e-mail corretamente.

source: Apply the latest patchset from the issue using
it: Applica l'ultimo set di patch dall'issue usando
pt_br: Aplique o patchset mais recente do problema usando

source: You may also apply a patchset of a specific version (say, v3) using
it: Puoi anche applicare un set di patch di una versione specifica (ad esempio, v3) usando
pt_br: Você também pode aplicar um patchset de uma versão específica (digamos, v3) usando

source: Or, you may apply a patch from a specific e-mail message. For example, to apply the patch from the 4th message (message index starts from 0), run
it: Oppure, puoi applicare una patch da un messaggio email specifico. Ad esempio, per applicare la patch dal 4° messaggio (l'indice del messaggio inizia da 0), esegui
pt_br: Ou você pode aplicar um patch de uma mensagem de e-mail específica. Por exemplo, para aplicar o patch da 4ª mensagem (o índice da mensagem começa em 0), execute

source: @command{mumi am} is a wrapper around @command{git am}. You can pass @command{git am} arguments to it after a @samp{--}. For example, to add a Signed-off-by trailer, run
it: @command{mumi am} è un wrapper attorno a @command{git am}. Puoi passare argomenti di @command{git am} dopo un @samp{--}. Ad esempio, per aggiungere un trailer Signed-off-by, esegui
pt_br: @command{mumi am} é um wrapper em torno de @command{git am}. Você pode passar argumentos @command{git am} para ele depois de um @samp{--}. Por exemplo, para adicionar um trailer Signed-off-by, execute

source: Create and send patches to the issue using
it: Crea e invia patch all'issue usando
pt_br: Crie e envie patches para o problema usando

source: Note that you do not have to pass in @samp{--to} or @samp{--cc} arguments to @command{git format-patch}. @command{mumi send-email} will put them in correctly when sending the patches.
it: Nota che non devi passare argomenti @samp{--to} o @samp{--cc} a @command{git format-patch}. @command{mumi send-email} li inserirà correttamente quando invia le patch.
pt_br: Observe que você não precisa passar os argumentos @samp{--to} ou @samp{--cc} para @command{git format-patch}. @command{mumi send-email} os inserirá corretamente ao enviar os patches.

source: To open a new issue, run
it: Per aprire un nuovo issue, esegui
pt_br: Para abrir um novo problema, execute

source: and send an email (using @command{mumi compose}) or patches (using @command{mumi send-email}).
it: e invia un'email (usando @command{mumi compose}) o patch (usando @command{mumi send-email}).
pt_br: e enviar um e-mail (usando @command{mumi compose}) ou patches (usando @command{mumi send-email}).

source: @command{mumi send-email} is really a wrapper around @command{git send-email} that automates away all the nitty-gritty of sending patches. It uses the current issue state to automatically figure out the correct @samp{To} address to send to, other participants to @samp{Cc}, headers to add, etc.
it: @command{mumi send-email} è in realtà un wrapper attorno a @command{git send-email} che automatizza tutti i dettagli tecnici dell'invio di patch. Usa lo stato corrente dell'issue per capire automaticamente il corretto indirizzo @samp{To} a cui inviare, altri partecipanti a @samp{Cc}, intestazioni da aggiungere, ecc.
pt_br: @command{mumi send-email} é realmente um wrapper em torno de @command{git send-email} que automatiza todos os detalhes do envio de patches. Ele usa o estado atual do problema para descobrir automaticamente o endereço @samp{To} correto para enviar, outros participantes para @samp{Cc}, cabeçalhos para adicionar, etc.

source: Also note that, unlike @command{git send-email}, @command{mumi send-email} works perfectly well with single and multiple patches alike. It automates away the debbugs dance of sending the first patch, waiting for a response from debbugs and sending the remaining patches. It does so by sending the first patch, polling the server for a response, and then sending the remaining patches. This polling can unfortunately take a few minutes. So, please be patient.
it: Nota inoltre che, a differenza di @command{git send-email}, @command{mumi send-email} funziona perfettamente sia con patch singole che multiple. Automatizza la danza di debbugs di inviare la prima patch, attendere una risposta da debbugs e inviare le patch rimanenti. Lo fa inviando la prima patch, interrogando il server per una risposta e poi inviando le patch rimanenti. Sfortunatamente, questo polling può richiedere alcuni minuti. Quindi, per favore sii paziente.
pt_br: Observe também que, diferentemente de @command{git send-email}, @command{mumi send-email} funciona perfeitamente bem com patches únicos e múltiplos. Ele automatiza a dança dos debbugs de enviar o primeiro patch, esperar por uma resposta dos debbugs e enviar os patches restantes. Ele faz isso enviando o primeiro patch, sondando o servidor para uma resposta e, em seguida, enviando os patches restantes. Infelizmente, essa sondagem pode levar alguns minutos. Então, seja paciente.

source: Emacs Interface
it: Interfaccia Emacs
pt_br: Interfaces com Emacs

source: If you use Emacs, you may find it more convenient to interact with issues using @file{debbugs.el}, which you can install with:
it: Se usi Emacs, potresti trovarlo più conveniente per interagire con gli issue usando @file{debbugs.el}, che puoi installare con:
pt_br: Se você usa o Emacs, pode achar mais conveniente interagir com problemas usando @file{debbugs.el}, que pode ser instalado com:

source: For example, to list all open issues on @code{guix-patches}, hit:
it: Ad esempio, per elencare tutti gli issue aperti su @code{guix-patches}, premi:
pt_br: Por exemplo, para listar todos os problemas abertos em @code{guix-patches}, clique em:

source: For a more convenient (shorter) way to access both the bugs and patches submissions, you may want to configure the @code{debbugs-gnu-default-packages} and @code{debbugs-gnu-default-severities} Emacs variables (@pxref{Viewing Bugs within Emacs}).
it: Per un modo più conveniente (più breve) per accedere sia ai bug che alle sottomissioni di patch, potresti voler configurare le variabili Emacs @code{debbugs-gnu-default-packages} e @code{debbugs-gnu-default-severities} (@pxref{Viewing Bugs within Emacs}).
pt_br: Para uma maneira mais conveniente (mais curta) de acessar os envios de bugs e patches, você pode configurar as variáveis @code{debbugs-gnu-default-packages} e @code{debbugs-gnu-default-severities} do Emacs (@pxref{Viewing Bugs within Emacs}).

source: To search for bugs, @samp{@kbd{M-x} debbugs-gnu-guix-search} can be used.
it: Per cercare bug, può essere usato @samp{@kbd{M-x} debbugs-gnu-guix-search}.
pt_br: Para procurar bugs, @samp{@kbd{M-x} debbugs-gnu-guix-search} pode ser usado.

source: @xref{Top,,, debbugs-ug, Debbugs User Guide}, for more information on this nifty tool!
it: @xref{Top,,, debbugs-ug, Debbugs User Guide}, per maggiori informazioni su questo utile strumento!
pt_br: @xref{Top,,, debbugs-ug, Guia do usuário do Debbugs}, para mais informações sobre esta ferramenta bacana!

source: usertags, for debbugs
it: usertags, per debbugs
pt_br: usertags, para debbugs

source: Debbugs usertags
it: Usertags di Debbugs
pt_br: Debuga as tags do usuário

source: Debbugs provides a feature called @dfn{usertags} that allows any user to tag any bug with an arbitrary label. Bugs can be searched by usertag, so this is a handy way to organize bugs@footnote{The list of usertags is public information, and anyone can modify any user's list of usertags, so keep that in mind if you choose to use this feature.}. If you use Emacs Debbugs, the entry-point to consult existing usertags is the @samp{C-u M-x debbugs-gnu-usertags} procedure. To set a usertag, press @samp{C} while consulting a bug within the *Guix-Patches* buffer opened with @samp{C-u M-x debbugs-gnu-bugs} buffer, then select @code{usertag} and follow the instructions.
it: Debbugs fornisce una funzionalità chiamata @dfn{usertags} che permette a qualsiasi utente di etichettare qualsiasi bug con un'etichetta arbitraria. I bug possono essere cercati per usertag, quindi questo è un modo pratico per organizzare i bug@footnote{L'elenco degli usertags è informazione pubblica, e chiunque può modificare l'elenco degli usertags di qualsiasi utente, quindi tienilo a mente se scegli di usare questa funzionalità.}. Se usi Debbugs in Emacs, il punto di ingresso per consultare gli usertags esistenti è la procedura @samp{C-u M-x debbugs-gnu-usertags}. Per impostare un usertag, premi @samp{C} durante la consultazione di un bug nel buffer *Guix-Patches* aperto con il buffer @samp{C-u M-x debbugs-gnu-bugs}, quindi seleziona @code{usertag} e segui le istruzioni.
pt_br: O Debbugs fornece um recurso chamado @dfn{usertags} que permite que qualquer usuário marque qualquer bug com um rótulo arbitrário. Os bugs podem ser pesquisados por usertag, então esta é uma maneira útil de organizar bugs@footnote{A lista de usertags é uma informação pública, e qualquer um pode modificar a lista de usertags de qualquer usuário, então tenha isso em mente se você escolher usar este recurso.}. Se você usa o Emacs Debbugs, o ponto de entrada para consultar usertags existentes é o procedimento @samp{C-u M-x debbugs-gnu-usertags}. Para definir um usertag, pressione @samp{C} enquanto consulta um bug dentro do buffer *Guix-Patches* aberto com o buffer @samp{C-u M-x debbugs-gnu-bugs}, então selecione @code{usertag} e siga as instruções.

source: For example, to view all the bug reports (or patches, in the case of @code{guix-patches}) tagged with the usertag @code{powerpc64le-linux} for the user @code{guix}, open a URL like the following in a web browser: @url{https://debbugs.gnu.org/cgi-bin/pkgreport.cgi?tag=powerpc64le-linux;users=guix}.
it: Ad esempio, per visualizzare tutti i report di bug (o patch, nel caso di @code{guix-patches}) etichettati con l'usertag @code{powerpc64le-linux} per l'utente @code{guix}, apri un URL come il seguente in un browser web: @url{https://debbugs.gnu.org/cgi-bin/pkgreport.cgi?tag=powerpc64le-linux;users=guix}.
pt_br: Por exemplo, para visualizar todos os relatórios de bugs (ou patches, no caso de @code{guix-patches}) marcados com a usertag @code{powerpc64le-linux} para o usuário @code{guix}, abra uma URL como a seguinte em um navegador da web: @url{https://debbugs.gnu.org/cgi-bin/pkgreport.cgi?tag=powerpc64le-linux;users=guix}.

source: For more information on how to use usertags, please refer to the documentation for Debbugs or the documentation for whatever tool you use to interact with Debbugs.
it: Per ulteriori informazioni su come usare gli usertags, consulta la documentazione di Debbugs o la documentazione dello strumento che usi per interagire con Debbugs.
pt_br: Para mais informações sobre como usar usertags, consulte a documentação do Debbugs ou a documentação de qualquer ferramenta que você use para interagir com o Debbugs.

source: In Guix, we are experimenting with usertags to keep track of architecture-specific issues, as well as reviewed ones. To facilitate collaboration, all our usertags are associated with the single user @code{guix}. The following usertags currently exist for that user:
it: In Guix, stiamo sperimentando gli usertags per tenere traccia di issue specifici dell'architettura, nonché di quelli revisionati. Per facilitare la collaborazione, tutti i nostri usertags sono associati all'unico utente @code{guix}. I seguenti usertags esistono attualmente per quell'utente:
pt_br: No Guix, estamos experimentando usertags para manter o controle de problemas específicos da arquitetura, bem como os revisados. Para facilitar a colaboração, todos os nossos usertags estão associados ao usuário único @code{guix}. Os seguintes usertags existem atualmente para esse usuário:

source: The purpose of this usertag is to make it easy to find the issues that matter most for the @code{powerpc64le-linux} system type. Please assign this usertag to bugs or patches that affect @code{powerpc64le-linux} but not other system types. In addition, you may use it to identify issues that for some reason are particularly important for the @code{powerpc64le-linux} system type, even if the issue affects other system types, too.
it: Lo scopo di questo usertag è facilitare la ricerca degli issue più importanti per il tipo di sistema @code{powerpc64le-linux}. Assegna questo usertag a bug o patch che influenzano @code{powerpc64le-linux} ma non altri tipi di sistema. Inoltre, puoi usarlo per identificare issue che per qualche ragione sono particolarmente importanti per il tipo di sistema @code{powerpc64le-linux}, anche se l'issue influisce anche su altri tipi di sistema.
pt_br: O propósito desta usertag é facilitar a localização dos problemas mais importantes para o tipo de sistema @code{powerpc64le-linux}. Atribua esta usertag a bugs ou patches que afetam o @code{powerpc64le-linux}, mas não outros tipos de sistema. Além disso, você pode usá-la para identificar problemas que, por algum motivo, são particularmente importantes para o tipo de sistema @code{powerpc64le-linux}, mesmo que o problema afete outros tipos de sistema também.

source: reproducibility
it: riproducibilità
pt_br: reprodutibilidade

source: For issues related to reproducibility. For example, it would be appropriate to assign this usertag to a bug report for a package that fails to build reproducibly.
it: Per issue relativi alla riproducibilità. Ad esempio, sarebbe appropriato assegnare questo usertag a un report di bug per un pacchetto che non viene costruito in modo riproducibile.
pt_br: Para problemas relacionados à reprodutibilidade. Por exemplo, seria apropriado atribuir esta usertag a um relatório de bug para um pacote que falha em construir de forma reprodutível.

source: You have reviewed the series and it looks good to you (LGTM).
it: Hai revisionato la serie e ti sembra buona (LGTM).
pt_br: Você analisou a série e ela parece boa para você (LGTM).
