Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: These are unit tests, each file corresponding more or less to one module, in particular @code{(guix @dots{})} modules (@pxref{Running the Test Suite}).
it: Questi sono i test unitari, ogni file corrisponde più o meno a un modulo, in particolare ai moduli @code{(guix @dots{})} (@pxref{Running the Test Suite}).
pt_br: Esses são testes unitários, cada arquivo correspondendo mais ou menos a um módulo, em particular os módulos @code{(guix @dots{})} (@pxref{Running the Test Suite}).

source: This is the documentation in the form of Texinfo files: this manual and the Cookbook. @xref{Writing a Texinfo File,,, texinfo, GNU Texinfo}, for information on Texinfo markup language.
it: Questa è la documentazione in forma di file Texinfo: questo manuale e il Cookbook. @xref{Writing a Texinfo File,,, texinfo, GNU Texinfo}, per informazioni sul linguaggio di markup Texinfo.
pt_br: Esta é a documentação na forma de arquivos Texinfo: este manual e o Livro de receitas. @xref{Writing a Texinfo File,,, texinfo, GNU Texinfo}, para informações sobre a linguagem de marcação Texinfo.

source: This is the location of translations of Guix itself, of package synopses and descriptions, of the manual, and of the cookbook. Note that @file{.po} files that live here are pulled directly from Weblate (@pxref{Translating Guix}).
it: Questa è la posizione delle traduzioni di Guix stesso, delle sinossi e descrizioni dei pacchetti, del manuale e del cookbook. Nota che i file @file{.po} che si trovano qui sono prelevati direttamente da Weblate (@pxref{Translating Guix}).
pt_br: Este é o local das traduções do próprio Guix, das sinopses e descrições dos pacotes, do manual e do livro de receitas. Note que os arquivos @file{.po} que vivem aqui são retirados diretamente do Weblate (@pxref{Translating Guix}).

source: Miscellaneous files: shell completions, support for systemd and other init systems, Git hooks, etc.
it: File vari: completamenti della shell, supporto per systemd e altri sistemi di init, hook di Git, ecc.
pt_br: Arquivos diversos: conclusões de shell, suporte para systemd e outros sistemas init, ganchos do Git, etc.

source: With all this, a fair chunk of your operating system is at your fingertips! Beyond @command{grep} and @command{git grep}, @pxref{The Perfect Setup} on how to navigate code from your editor, and @pxref{Using Guix Interactively} for information on how to use Scheme modules interactively. Enjoy!
it: Con tutto questo, una buona parte del tuo sistema operativo è a portata di mano! Oltre a @command{grep} e @command{git grep}, @pxref{The Perfect Setup} su come navigare nel codice dal tuo editor, e @pxref{Using Guix Interactively} per informazioni su come usare i moduli Scheme in modo interattivo. Divertiti!
pt_br: Com tudo isso, uma boa parte do seu sistema operacional está na ponta dos seus dedos! Além de @command{grep} e @command{git grep}, @pxref{The Perfect Setup} sobre como navegar no código do seu editor e @pxref{Using Guix Interactively} para obter informações sobre como usar módulos Scheme interativamente. Aproveite!

source: packages, creating
it: pacchetti, creazione
pt_br: pacotes, criação

source: The GNU distribution is nascent and may well lack some of your favorite packages. This section describes how you can help make the distribution grow.
it: La distribuzione GNU è nascente e potrebbe mancare di alcuni dei tuoi pacchetti preferiti. Questa sezione descrive come puoi contribuire a far crescere la distribuzione.
pt_br: A distribuição do GNU é incipiente e pode muito bem não ter alguns dos seus pacotes favoritos. Esta seção descreve como você pode ajudar a fazer a distribuição crescer.

source: Free software packages are usually distributed in the form of @dfn{source code tarballs}---typically @file{tar.gz} files that contain all the source files. Adding a package to the distribution means essentially two things: adding a @dfn{recipe} that describes how to build the package, including a list of other packages required to build it, and adding @dfn{package metadata} along with that recipe, such as a description and licensing information.
it: I pacchetti di software libero sono solitamente distribuiti sotto forma di @dfn{tarball di codice sorgente}---tipicamente file @file{tar.gz} che contengono tutti i file sorgente. Aggiungere un pacchetto alla distribuzione significa essenzialmente due cose: aggiungere una @dfn{recipe} che descrive come costruire il pacchetto, inclusa una lista di altri pacchetti richiesti per costruirlo, e aggiungere @dfn{metadati del pacchetto} insieme a quella ricetta, come una descrizione e informazioni sulla licenza.
pt_br: Pacotes de software livre geralmente são distribuídos na forma de @dfn{tarballs de código-fonte} -- geralmente arquivos @file{tar.gz} que contêm todos os arquivos fonte. Adicionar um pacote à distribuição significa essencialmente duas coisas: adicionar uma @dfn{receita} que descreve como criar o pacote, incluindo uma lista de outros pacotes necessários para compilá-lo e adicionar @dfn{metadados de pacote} junto com essa receita, como uma descrição e informações de licenciamento.

source: In Guix all this information is embodied in @dfn{package definitions}. Package definitions provide a high-level view of the package. They are written using the syntax of the Scheme programming language; in fact, for each package we define a variable bound to the package definition, and export that variable from a module (@pxref{Package Modules}). However, in-depth Scheme knowledge is @emph{not} a prerequisite for creating packages. For more information on package definitions, @pxref{Defining Packages}.
it: In Guix tutte queste informazioni sono incarnate nelle @dfn{definizioni di pacchetto}. Le definizioni di pacchetto forniscono una visione di alto livello del pacchetto. Sono scritte usando la sintassi del linguaggio di programmazione Scheme; infatti, per ogni pacchetto definiamo una variabile associata alla definizione del pacchetto, e esportiamo quella variabile da un modulo (@pxref{Package Modules}). Tuttavia, una conoscenza approfondita di Scheme @emph{non} è un prerequisito per creare pacchetti. Per maggiori informazioni sulle definizioni di pacchetto, @pxref{Defining Packages}.
pt_br: No Guix, todas essas informações estão incorporadas em @dfn{configurações de pacote}. As definições de pacote fornecem uma visão de alto nível do pacote. Elas são escritas usando a sintaxe da linguagem de programação Scheme; de fato, para cada pacote, definimos uma variável vinculada à definição do pacote e exportamos essa variável de um módulo (@pxref{Package Modules}). No entanto, o conhecimento profundo de Scheme @emph{não} é um pré-requisito para a criação de pacotes. Para mais informações sobre definições de pacotes, @pxref{Defining Packages}.

source: Once a package definition is in place, stored in a file in the Guix source tree, it can be tested using the @command{guix build} command (@pxref{Invoking guix build}). For example, assuming the new package is called @code{gnew}, you may run this command from the Guix build tree (@pxref{Running Guix Before It Is Installed}):
it: Una volta che una definizione di pacchetto è al suo posto, salvata in un file nell'albero dei sorgenti di Guix, può essere testata usando il comando @command{guix build} (@pxref{Invoking guix build}). Ad esempio, assumendo che il nuovo pacchetto si chiami @code{gnew}, puoi eseguire questo comando dall'albero di compilazione di Guix (@pxref{Running Guix Before It Is Installed}):
pt_br: Quando uma definição de pacote está em vigor, armazenada em um arquivo na árvore de fontes do Guix, ela pode ser testada usando o comando @command{guix build} (@pxref{Invoking guix build}). Por exemplo, supondo que o novo pacote seja chamado @code{gnew}, você pode executar este comando na árvore de construção do Guix (@pxref{Running Guix Before It Is Installed}):

source: Using @code{--keep-failed} makes it easier to debug build failures since it provides access to the failed build tree. Another useful command-line option when debugging is @code{--log-file}, to access the build log.
it: L'uso di @code{--keep-failed} rende più facile il debug dei fallimenti di compilazione poiché fornisce accesso all'albero di compilazione fallito. Un'altra opzione utile della riga di comando durante il debug è @code{--log-file}, per accedere al log di compilazione.
pt_br: O uso de @code{--keep-failed} facilita a depuração de falhas de compilação, pois fornece acesso à árvore de compilação com falha. Outra opção útil da linha de comando ao depurar é @code{--log-file}, para acessar o log de compilação.

source: If the package is unknown to the @command{guix} command, it may be that the source file contains a syntax error, or lacks a @code{define-public} clause to export the package variable. To figure it out, you may load the module from Guile to get more information about the actual error:
it: Se il pacchetto è sconosciuto al comando @command{guix}, potrebbe essere che il file sorgente contenga un errore di sintassi, o manchi una clausola @code{define-public} per esportare la variabile del pacchetto. Per capirlo, puoi caricare il modulo da Guile per ottenere maggiori informazioni sull'errore effettivo:
pt_br: Se o pacote for desconhecido para o comando @command{guix}, pode ser que o arquivo fonte contenha um erro de sintaxe ou não tenha uma cláusula @code{define-public} para exportar a variável do pacote. Para descobrir isso, você pode carregar o módulo do Guile para obter mais informações sobre o erro real:

source: Once your package builds correctly, please send us a patch (@pxref{Submitting Patches}). Well, if you need help, we will be happy to help you too. Once the patch is committed in the Guix repository, the new package automatically gets built on the supported platforms by @url{https://@value{SUBSTITUTE-SERVER-1}, our continuous integration system}.
it: Una volta che il tuo pacchetto si compila correttamente, inviaci una patch (@pxref{Submitting Patches}). Beh, se hai bisogno di aiuto, saremo felici di aiutarti anche noi. Una volta che la patch è stata committata nel repository di Guix, il nuovo pacchetto viene automaticamente costruito sulle piattaforme supportate da @url{https://@value{SUBSTITUTE-SERVER-1}, il nostro sistema di integrazione continua}.
pt_br: Assim que seu pacote for compilado corretamente, envie-nos um patch (@pxref{Submitting Patches}). Bem, se precisar de ajuda, ficaremos felizes em ajudá-lo também. Depois que o patch é confirmado no repositório Guix, o novo pacote é compilado automaticamente nas plataformas suportadas por @url{https://@value{SUBSTITUTE-SERVER-1}, nosso sistema de integração contínua}.

source: substituter
it: sostituto
pt_br: substituidor

source: Users can obtain the new package definition simply by running @command{guix pull} (@pxref{Invoking guix pull}). When @code{@value{SUBSTITUTE-SERVER-1}} is done building the package, installing the package automatically downloads binaries from there (@pxref{Substitutes}). The only place where human intervention is needed is to review and apply the patch.
it: Gli utenti possono ottenere la nuova definizione di pacchetto semplicemente eseguendo @command{guix pull} (@pxref{Invoking guix pull}). Quando @code{@value{SUBSTITUTE-SERVER-1}} ha finito di costruire il pacchetto, l'installazione del pacchetto scarica automaticamente i binari da lì (@pxref{Substitutes}). L'unico punto in cui è necessario l'intervento umano è per la revisione e l'applicazione della patch.
pt_br: Os usuários podem obter a nova definição de pacote simplesmente executando @command{guix pull} (@pxref{Invoking guix pull}). Quando @code{@value{SUBSTITUTE-SERVER-1}} termina de construir o pacote, a instalação do pacote baixa automaticamente os binários de lá (@pxref{Substitutes}). O único lugar onde a intervenção humana é necessária é para revisar e aplicar o patch.

source: Software Freedom
it: Libertà del software
pt_br: Liberdade de software

source: What may go into the distribution.
it: Cosa può essere incluso nella distribuzione.
pt_br: O que pode ir na distribuição.

source: Package Naming
it: Denominazione dei pacchetti
pt_br: Nomeando um pacote

source: What's in a name?
it: Cosa c'è in un nome?
pt_br: Que há em um nome?

source: Version Numbers
it: Numeri di versione
pt_br: Números de versão

source: When the name is not enough.
it: Quando il nome non basta.
pt_br: Quando o nome não é suficiente.

source: Synopses and Descriptions
it: Sinossi e descrizioni
pt_br: Sinopses e descrições

source: Helping users find the right package.
it: Aiutare gli utenti a trovare il pacchetto giusto.
pt_br: Ajudando usuários a localizar o pacote certo.

source: Whether to use a snippet, or a build phase.
it: Se usare uno snippet o una fase di compilazione.
pt_br: Seja para usar um snippet ou uma fase de construção.

source: Cyclic Module Dependencies
it: Dipendenze cicliche tra moduli
pt_br: Dependências do módulo cíclico

source: Going full circle.
it: Chiudere il cerchio.
pt_br: Fazendo um círculo completo.

source: Bulk Updates
pt_br: Atualizações em massa

source: This Little Maneuver's Gonna Cost Us 51 Years.
pt_br: Essa pequena manobra nos custará 51 anos.

source: Emacs Packages
it: Pacchetti Emacs
pt_br: Pacotes Emacs

source: Your Elisp fix.
it: La tua dose di Elisp.
pt_br: Sua correção Elisp.

source: Python Modules
it: Moduli Python
pt_br: Módulos Python

source: A touch of British comedy.
it: Un tocco di commedia britannica.
pt_br: Um toque de comédia britânica.

source: Perl Modules
it: Moduli Perl
pt_br: Módulos Perl

source: Little pearls.
it: Piccole perle.
pt_br: Pequenas pérolas.

source: Java Packages
it: Pacchetti Java
pt_br: Pacotes Java

source: Coffee break.
it: Pausa caffè.
pt_br: Parada para o café.

source: Beware of oxidation.
it: Attenzione all'ossidazione.
pt_br: Cuidado com a oxidação.

source: Elm Packages
it: Pacchetti Elm
pt_br: Pacotes Elm

source: Trees of browser code
it: Alberi di codice per browser
pt_br: Árvores de código do navegador

source: Fonts
it: Font
pt_br: Fontes

source: Fond of fonts.
it: Amante dei font.
pt_br: Vício em fontes.

source: free software
it: software libero
pt_br: software livre

source: The GNU operating system has been developed so that users can have freedom in their computing. GNU is @dfn{free software}, meaning that users have the @url{https://www.gnu.org/philosophy/free-sw.html,four essential freedoms}: to run the program, to study and change the program in source code form, to redistribute exact copies, and to distribute modified versions. Packages found in the GNU distribution provide only software that conveys these four freedoms.
it: Il sistema operativo GNU è stato sviluppato affinché gli utenti possano avere libertà nella loro informatica. GNU è @dfn{software libero}, il che significa che gli utenti hanno le @url{https://www.gnu.org/philosophy/free-sw.html, quattro libertà essenziali}: eseguire il programma, studiare e modificare il programma in forma di codice sorgente, ridistribuire copie esatte e distribuire versioni modificate. I pacchetti trovati nella distribuzione GNU forniscono solo software che trasmette queste quattro libertà.
pt_br: O sistema operacional GNU foi desenvolvido para que os usuários possam ter liberdade em sua computação. GNU é @dfn{software livre}, o que significa que os usuários têm a @url{https://www.gnu.org/philosophy/free-sw.html,quatro liberdades essenciais}: executar o programa, estudar e alterar o programa em forma de código-fonte, para redistribuir cópias exatas e para distribuir versões modificadas. Os pacotes encontrados na distribuição GNU fornecem apenas softwares que transmitem essas quatro liberdades.

source: In addition, the GNU distribution follow the @url{https://www.gnu.org/distros/free-system-distribution-guidelines.html,free software distribution guidelines}. Among other things, these guidelines reject non-free firmware, recommendations of non-free software, and discuss ways to deal with trademarks and patents.
it: Inoltre, la distribuzione GNU segue le @url{https://www.gnu.org/distros/free-system-distribution-guidelines.html, linee guida per la distribuzione di software libero}. Tra le altre cose, queste linee guida rifiutano il firmware non libero, le raccomandazioni di software non libero, e discutono i modi per affrontare i marchi e i brevetti.
pt_br: Além disso, a distribuição GNU segue o @url{https://www.gnu.org/distros/free-system-distribution-guidelines.html,diretrizes de distribuição de software livre}. Entre outras coisas, estas diretrizes rejeitam firmware não-livre, recomendações de software não-livre e discutem formas de lidar com marcas registradas e patentes.

source: Some otherwise free upstream package sources contain a small and optional subset that violates the above guidelines, for instance because this subset is itself non-free code. When that happens, the offending items are removed with appropriate patches or code snippets in the @code{origin} form of the package (@pxref{Defining Packages}). This way, @code{guix build --source} returns the ``freed'' source rather than the unmodified upstream source.
it: Alcuni pacchetti sorgente upstream, altrimenti liberi, contengono un piccolo sottoinsieme opzionale che viola le linee guida sopra menzionate, ad esempio perché questo sottoinsieme è esso stesso codice non libero. Quando ciò accade, gli elementi problematici vengono rimossi con patch o frammenti di codice appropriati nel modulo @code{origin} del pacchetto (@pxref{Defining Packages}). In questo modo, @code{guix build --source} restituisce il codice sorgente ``liberato'' piuttosto che il codice sorgente upstream non modificato.
pt_br: Algumas fontes de pacotes upstream livres de outra forma contêm um subconjunto pequeno e opcional que viola as diretrizes acima, por exemplo, porque esse subconjunto é ele próprio um código não livre. Quando isso acontece, os itens incorretos são removidos com patches ou trechos de código apropriados no formato @code{origin} do pacote (@pxref{Defining Packages}). Dessa forma, o @code{guix build --source} retorna a fonte ``lançada'' em vez da fonte upstream não modificada.

source: package name
it: nome del pacchetto
pt_br: nome de pacote

source: A package actually has two names associated with it. First, there is the name of the @emph{Scheme variable}, the one following @code{define-public}. By this name, the package can be made known in the Scheme code, for instance as input to another package. Second, there is the string in the @code{name} field of a package definition. This name is used by package management commands such as @command{guix package} and @command{guix build}.
it: Un pacchetto ha in realtà due nomi associati. Innanzitutto, c'è il nome della @emph{variabile Scheme}, quella che segue @code{define-public}. Con questo nome, il pacchetto può essere reso noto nel codice Scheme, ad esempio come input per un altro pacchetto. In secondo luogo, c'è la stringa nel campo @code{name} di una definizione di pacchetto. Questo nome è usato dai comandi di gestione dei pacchetti come @command{guix package} e @command{guix build}.
pt_br: Um pacote na verdade tem dois nomes associados a ele. Primeiro, há o nome da @emph{variável Scheme}, a que segue @code{define-public}. Por esse nome, o pacote pode ser tornado conhecido no código Scheme, por exemplo, como entrada para outro pacote. Segundo, há a string no campo @code{name} de uma definição de pacote. Esse nome é usado por comandos de gerenciamento de pacotes, como @command{guix package} e @command{guix build}.

source: Both are usually the same and correspond to the lowercase conversion of the project name chosen upstream, with underscores replaced with hyphens. For instance, GNUnet is available as @code{gnunet}, and SDL_net as @code{sdl-net}.
it: Entrambi sono di solito uguali e corrispondono alla conversione in minuscolo del nome del progetto scelto upstream, con i trattini bassi sostituiti da trattini. Ad esempio, GNUnet è disponibile come @code{gnunet}, e SDL_net come @code{sdl-net}.
pt_br: Ambos são geralmente iguais e correspondem à conversão em minúscula do nome do projeto escolhido a montante, com os sublinhados substituídos por hífenes. Por exemplo, o GNUnet está disponível como @code{gnunet} e SDL_net como @code{sdl-net}.

source: A noteworthy exception to this rule is when the project name is only a single character, or if an older maintained project with the same name already exists---regardless of whether it has already been packaged for Guix. Use common sense to make such names unambiguous and meaningful. For example, Guix's package for the shell called ``s'' upstream is @code{s-shell} and @emph{not} @code{s}. Feel free to ask your fellow hackers for inspiration.
it: Un'eccezione degna di nota a questa regola è quando il nome del progetto è un singolo carattere, o se esiste già un progetto più vecchio mantenuto con lo stesso nome --- indipendentemente dal fatto che sia già stato pacchettizzato per Guix. Usa il buon senso per rendere tali nomi non ambigui e significativi. Ad esempio, il pacchetto di Guix per la shell chiamata ``s'' upstream è @code{s-shell} e @emph{not} @code{s}. Sentiti libero di chiedere ispirazione ai tuoi compagni hacker.
pt_br: Uma exceção digna de nota a esta regra é quando o nome do projeto é apenas um único caractere, ou se já existe um projeto mantido mais antigo com o mesmo nome - independentemente de já ter sido empacotado para Guix. Use o bom senso para tornar esses nomes inequívocos e significativos. Por exemplo, o pacote do Guix para o shell chamado ``s'' upstream é @code{s-shell} e @emph{não} @code{s}. Sinta-se à vontade para pedir inspiração a seus colegas hackers.

source: We do not add @code{lib} prefixes for library packages, unless these are already part of the official project name. But @pxref{Python Modules} and @ref{Perl Modules} for special rules concerning modules for the Python and Perl languages.
it: Non aggiungiamo prefissi @code{lib} per i pacchetti di librerie, a meno che non facciano già parte del nome ufficiale del progetto. Ma vedi @pxref{Python Modules} e @ref{Perl Modules} per le regole speciali riguardanti i moduli per i linguaggi Python e Perl.
pt_br: Não adicionamos prefixos @code{lib} para pacotes de bibliotecas, a menos que eles já façam parte do nome oficial do projeto. Mas @pxref{Python Modules} e @ref{Perl Modules} para regras especiais relativas a módulos para as linguagens Python e Perl.

source: Font package names are handled differently, @pxref{Fonts}.
it: I nomi dei pacchetti di font sono gestiti in modo diverso, @pxref{Fonts}.
pt_br: Nomes de pacote de fontes são lidados de forma diferente. @xref{Fonts}.

source: package version
it: versione del pacchetto
pt_br: versão de pacote
