Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Depending on the target machine, that can go from a standard @code{x86_64} machine to a small ARM single board computer such as the Pine64, the image constraints can vary a lot. The hardware manufacturers will impose different image formats with various partition sizes and offsets.
es: Dependiendo de la máquina de destino, que puede ir desde una máquina @code{x86_64} estándar hasta un pequeño ordenador ARM de placa única como el Pine64, las restricciones de la imagen pueden variar mucho. Los fabricantes de hardware impondrán diferentes formatos de imagen con varios tamaños de partición y desplazamientos.
it: A seconda della macchina di destinazione, che può variare da una macchina @code{x86_64} standard a un piccolo computer a scheda singola ARM come la Pine64, i vincoli dell'immagine possono variare molto. I produttori di hardware imporranno diversi formati di immagine con varie dimensioni e offset delle partizioni.
pt_br: Dependendo da máquina de destino, que pode ir de uma máquina @code{x86_64} padrão a um pequeno computador de placa única ARM, como o Pine64, as restrições de imagem podem variar muito. Os fabricantes de hardware imporão diferentes formatos de imagem com vários tamanhos de partição e deslocamentos.
sk: Požiadavky na obraz sa môžu značne líšiť v závislosti na cieľovom stroji, čo môže byť obvyklý @code{x86_64} alebo malý jednodoskový počítač ako Pine64. Výrobcovia technického vybavenia presadzujú rôzne formáty obrazov s rôznymi veľkosťami a umiestneniami oddielov.

source: To create images suitable for all those machines, a new abstraction is necessary: that's the goal of the @code{image} record. This record contains all the required information to be transformed into a standalone image, that can be directly booted on any target machine.
es: Para crear imágenes adecuadas para todas esas máquinas, es necesaria una nueva abstracción: ese es el objetivo del registro @code{image}. Este registro contiene toda la información necesaria para transformarse en una imagen independiente, que puede arrancarse directamente en cualquier máquina de destino.
it: Per creare immagini adatte a tutte quelle macchine, è necessaria una nuova astrazione: questo è l'obiettivo del record @code{image}. Questo record contiene tutte le informazioni necessarie per essere trasformate in un'immagine standalone, che può essere avviata direttamente su qualsiasi macchina di destinazione.
pt_br: Para criar imagens adequadas para todas essas máquinas, é necessária uma nova abstração: esse é o objetivo do registro @code{image}. Este registro contém todas as informações necessárias para ser transformada em uma imagem autônoma, que pode ser inicializada diretamente em qualquer máquina de destino.
sk: Na vytváranie obrazov vhodných pre všetky tieto stroje je nevyhnutné ďalšie zovšeobecnenie, čo je cieľom záznamu @code{image}. Tento záznam obsahuje všetky potrebné údaje k premene na samostatný obraz, ktorý je možno priamo zaviesť na hocijakom cieľovom stroji.

source: (define-record-type* <image> image make-image image? (name image-name ;symbol (default #f)) (format image-format) ;symbol (target image-target (default #f)) (size image-size ;size in bytes as integer (default 'guess)) (operating-system image-operating-system ;<operating-system> (default #f)) (partitions image-partitions ;list of <partition> (default '())) (compression? image-compression? ;boolean (default #t)) (volatile-root? image-volatile-root? ;boolean (default #t)) (substitutable? image-substitutable? ;boolean (default #t)))
es: (define-record-type* <image> image make-image image? (name image-name ;symbol (default #f)) (format image-format) ;symbol (target image-target (default #f)) (size image-size ;tamaño en bytes como entero (default 'guess)) (operating-system image-operating-system ;<operating-system> (default #f)) (partitions image-partitions ;list of <partición> (default '())) (compression? image-compression? ;boolean (default #t)) (volatile-root? image-volatile-root? ;boolean (default #t)) (substitutable? image-substitutable? ;boolean (default #t)))
it: (define-record-type* <image> image make-image image? (name image-name ;simbolo (default #f)) (format image-format) ;simbolo (target image-target (default #f)) (size image-size ;dimensione in byte come intero (default 'guess)) (operating-system image-operating-system ;<operating-system> (default #f)) (partitions image-partitions ;lista di <partition> (default '())) (compression? image-compression? ;booleano (default #t)) (volatile-root? image-volatile-root? ;booleano (default #t)) (substitutable? image-substitutable? ;booleano (default #t)))

source: This record contains the operating-system to instantiate. The @code{format} field defines the image type and can be @code{efi-raw}, @code{qcow2} or @code{iso9660} for instance. In the future, it could be extended to @code{docker} or other image types.
es: Este registro contiene el sistema operativo a instanciar. El campo @code{format} define el tipo de imagen y puede ser @code{efi-raw}, @code{qcow2} o @code{iso9660}, por ejemplo. En el futuro, podría ampliarse a @code{docker} u otros tipos de imagen.
it: Questo record contiene il sistema operativo da istanziare. Il campo @code{format} definisce il tipo di immagine e può essere @code{efi-raw}, @code{qcow2} o @code{iso9660} per esempio. In futuro, potrebbe essere esteso a @code{docker} o altri tipi di immagine.
pt_br: Este registro contém o sistema operacional a ser instanciado. O campo @code{format} define o tipo de imagem e pode ser @code{efi-raw}, @code{qcow2} ou @code{iso9660} por exemplo. No futuro, poderá ser estendido para @code{docker} ou outros tipos de imagem.
sk: Tento záznam obsahuje operačný systém na zostavenie. Pole @code{format} určuje druh obrazu a medzi jeho platné hodnoty patria @code{efi-raw}, @code{qcow2} alebo @code{iso9660}. V budúcnosti by sa mohli rozšíriť o @code{docker} a ďalšie druhy obrazov.

source: A new directory in the Guix sources is dedicated to images definition. For now there are four files:
es: Un nuevo directorio en las fuentes de Guix está dedicado a la definición de imágenes. Por ahora hay cuatro archivos:
it: Una nuova directory nelle fonti Guix è dedicata alla definizione delle immagini. Per ora ci sono quattro file:
pt_br: Um novo diretório nas fontes do Guix é dedicado à definição de imagens. Por enquanto existem quatro arquivos:
sk: Na zadávanie obrazov bol spomedzi zdrojových súborov Guixu vyhradený nový priečinok. Zatiaľ sa v ňom nachádzajú štyri súbory:

source: Let's have a look to @file{pine64.scm}. It contains the @code{pine64-barebones-os} variable which is a minimal definition of an operating-system dedicated to the @b{Pine A64 LTS} board.
es: Echemos un vistazo a @file{pine64.scm}. Contiene la variable @code{pine64-barebones-os} que es una definición mínima de un sistema operativo dedicado a la placa @b{Pine A64 LTS}.
it: Diamo un'occhiata a @file{pine64.scm}. Contiene la variabile @code{pine64-barebones-os} che è una definizione minima di un sistema operativo dedicata alla scheda @b{Pine A64 LTS}.
pt_br: Vamos dar uma olhada em @file{pine64.scm}. Ele contém a variável @code{pine64-barebones-os} que é uma definição mínima de um sistema operacional dedicado à placa @b{Pine A64 LTS}.
sk: Pozrime sa na @file{pine64.scm}. Obsahuje premennú @code{pine64-barebones-os} predstavujúcu najmenšie možné zadanie operačného systému určeného pre dosku @b{Pine A64 LTS}.

source: (define pine64-barebones-os (operating-system (host-name "vignemale") (timezone "Europe/Paris") (locale "en_US.utf8") (bootloader (bootloader-configuration (bootloader u-boot-pine64-lts-bootloader) (targets '("/dev/vda")))) (initrd-modules '()) (kernel linux-libre-arm64-generic) (file-systems (cons (file-system (device (file-system-label "my-root")) (mount-point "/") (type "ext4")) %base-file-systems)) (services (cons (service agetty-service-type (agetty-configuration (extra-options '("-L")) ; no carrier detect (baud-rate "115200") (term "vt100") (tty "ttyS0"))) %base-services))))
es: (define pine64-barebones-os (operating-system (host-name "vignemale") (timezone "Europe/Paris") (locale "en_US.utf8") (bootloader (bootloader-configuration (bootloader u-boot-pine64-lts-bootloader) (targets '("/dev/vda")))) (initrd-modules '()) (kernel linux-libre-arm64-generic) (file-systems (cons (file-system (device (file-system-label "my-root")) (mount-point "/") (type "ext4")) %base-file-systems)) (services (cons (service agetty-service-type (agetty-configuration (extra-options '("-L")) ; ningún carro detectado (baud-rate "115200") (term "vt100") (tty "ttyS0"))) %base-services))))
it: (define pine64-barebones-os (operating-system (host-name "vignemale") (timezone "Europe/Paris") (locale "en_US.utf8") (bootloader (bootloader-configuration (bootloader u-boot-pine64-lts-bootloader) (targets '("/dev/vda")))) (initrd-modules '()) (kernel linux-libre-arm64-generic) (file-systems (cons (file-system (device (file-system-label "my-root")) (mount-point "/") (type "ext4")) %base-file-systems)) (services (cons (service agetty-service-type (agetty-configuration (extra-options '("-L")) ; nessun rilevamento portante (baud-rate "115200") (term "vt100") (tty "ttyS0"))) %base-services))))
pt_br: (define pine64-barebones-os (operating-system (host-name "vignemale") (timezone "Europe/Paris") (locale "en_US.utf8") (bootloader (bootloader-configuration (bootloader u-boot-pine64-lts-bootloader) (targets '("/dev/vda")))) (initrd-modules '()) (kernel linux-libre-arm64-generic) (file-systems (cons (file-system (device (file-system-label "my-root")) (mount-point "/") (type "ext4")) %base-file-systems)) (services (cons (service agetty-service-type (agetty-configuration (extra-options '("-L")) ; sem detecção de portadora (baud-rate "115200") (term "vt100") (tty "ttyS0"))) %base-services))))
sk: (define pine64-barebones-os (operating-system (host-name "vignemale") (timezone "Europe/Bratislava") (locale "sk_SK.utf8") (bootloader (bootloader-configuration (bootloader u-boot-pine64-lts-bootloader) (targets '("/dev/vda")))) (initrd-modules '()) (kernel linux-libre-arm64-generic) (file-systems (cons (file-system (device (file-system-label "moj-korenovy-system")) (mount-point "/") (type "ext4")) %base-file-systems)) (services (cons (service agetty-service-type (agetty-configuration (extra-options '("-L")) ; bez zisťovania nosného signálu (baud-rate "115200") (term "vt100") (tty "ttyS0"))) %base-services))))

source: The @code{kernel} and @code{bootloader} fields are pointing to packages dedicated to this board.
es: Los campos @code{kernel} y @code{bootloader} apuntan a paquetes dedicados a esta placa.
it: I campi @code{kernel} e @code{bootloader} puntano a pacchetti dedicati a questa scheda.
pt_br: Os campos @code{kernel} e @code{bootloader} apontam para pacotes dedicados a esta placa.
sk: Polia @code{kernel} a @code{bootloader} odkazujú na balíky určené pre túto dosku.

source: Right below, the @code{pine64-image-type} variable is also defined.
es: Justo debajo, también se define la variable @code{pine64-image-type}.
it: Subito sotto, è definita anche la variabile @code{pine64-image-type}.
pt_br: Logo abaixo, a variável @code{pine64-image-type} também está definida.
sk: Tesne pod nimi je zadaná aj premenná @code{pine64-image-type}.

source: It's using a record we haven't talked about yet, the @code{image-type} record, defined this way:
es: Utiliza un registro del que aún no hemos hablado, el registro @code{image-type}, definido de esta manera:
it: Sta usando un record di cui non abbiamo ancora parlato, il record @code{image-type}, definito in questo modo:
pt_br: Ele está usando um registro do qual ainda não falamos, o registro @code{image-type}, definido desta forma:
sk: Využíva záznam, o ktorom sme ešte nehovorili, a teda @code{image-type}, zadaný nasledovne:

source: (define-record-type* <image-type> image-type make-image-type image-type? (name image-type-name) ;symbol (constructor image-type-constructor)) ;<operating-system> -> <image>
it: (define-record-type* <image-type> image-type make-image-type image-type? (name image-type-name) ;simbolo (constructor image-type-constructor)) ;<operating-system> -> <image>
sk: (define-record-type* <image-type> image-type make-image-type image-type? (name image-type-name) ; znak (constructor image-type-constructor)) ; <operating-system> -> <image>

source: The main purpose of this record is to associate a name to a procedure transforming an @code{operating-system} to an image. To understand why it is necessary, let's have a look to the command producing an image from an @code{operating-system} configuration file:
es: El objetivo principal de este registro es asociar un nombre a un procedimiento que transforma un @code{operating-system} en una imagen. Para entender por qué es necesario, echemos un vistazo al comando que produce una imagen a partir de un archivo de configuración @code{operating-system}:
it: Lo scopo principale di questo record è associare un nome a una procedura che trasforma un @code{operating-system} in un'immagine. Per capire perché è necessario, diamo un'occhiata al comando che produce un'immagine da un file di configurazione @code{operating-system}:
pt_br: O objetivo principal deste registro é associar um nome a um procedimento que transforma um @código{operating-system} em uma imagem. Para entender por que isso é necessário, vamos dar uma olhada no comando que produz uma imagem de um arquivo de configuração @code{operating-system}:
sk: Hlavným účelom tohto záznamu je priradiť názov funkcii pretvárajúcej @code{operating-system} na obraz. Aby sme pochopili, prečo je to dôležité, pozrime sa na príkaz vytvárajúci obraz zo súboru nastavení @code{operating-system}:

source: This command expects an @code{operating-system} configuration but how should we indicate that we want an image targeting a Pine64 board? We need to provide an extra information, the @code{image-type}, by passing the @code{--image-type} or @code{-t} flag, this way:
es: Este comando espera una configuración @code{operating-system} pero ¿cómo debemos indicar que queremos una imagen dirigida a una placa Pine64? Necesitamos proporcionar una información extra, el @code{image-type}, pasando la bandera @code{--image-type} o @code{-t}, de esta manera:
it: Questo comando si aspetta una configurazione @code{operating-system} ma come dovremmo indicare che vogliamo un'immagine destinata a una scheda Pine64? Dobbiamo fornire un'informazione extra, il @code{image-type}, passando il flag @code {--image-type} o @code{-t}, in questo modo:
pt_br: Este comando espera uma configuração @code{operating-system} mas como devemos indicar que queremos uma imagem direcionada a uma placa Pine64? Precisamos fornecer uma informação extra, o @code{image-type}, passando o sinalizador @code{--image-type} ou @code{-t}, desta forma:
sk: Tento príkaz očakáva nastavenie druhu @code{operating-system}, ale ako by sme mali určiť, že chceme obraz pre dosku Pine64? Musíme poskytnúť doplňujúci údaj, @code{image-type}, pomocou voľby @code{--image-type} alebo @code{-t} a to takto:

source: This @code{image-type} parameter points to the @code{pine64-image-type} defined above. Hence, the @code{operating-system} declared in @code{my-os.scm} will be applied the @code{(cut image-with-os arm64-disk-image <>)} procedure to turn it into an image.
es: Este parámetro @code{image-type} apunta al @code{pine64-image-type} definido anteriormente. Por lo tanto, al @code{operating-system} declarado en @code{my-os.scm} se le aplicará el procedimiento @code{(cut image-with-os arm64-disk-image &lt;&gt;)} para convertirlo en una imagen.
it: Questo parametro @code{image-type} punta al @code{pine64-image-type} definito sopra. Quindi, il @code{operating-system} dichiarato in @code{my-os.scm} verrà applicato alla procedura @code{(cut image-with-os arm64-disk-image <>)} per trasformarlo in un'immagine.
pt_br: Este parâmetro @code{image-type} aponta para o @code{pine64-image-type} definido acima. Portanto, ao @code{operating-system} declarado em @code{my-os.scm} será aplicado o procedimento @code{(cut image-with-os arm64-disk-image <>)} para transformá-lo em um imagem.
sk: Tento @code{image-type} parameter odkazuje na @code{pine64-image-type} uvedený vyššie. Na @code{operating-system} zadaný v @code{moj-os.scm} sa teda použije funkcia @code{(cut image-with-os arm64-disk-image <>)} pre vytvorenie obrazu.

source: The resulting image looks like:
es: La imagen resultante tiene este aspecto:
it: L'immagine risultante si presenta così:
pt_br: A imagem resultante se parece com:
sk: Výsledný obraz vyzerá asi takto:

source: which is the aggregation of the @code{operating-system} defined in @code{my-os.scm} to the @code{arm64-disk-image} record.
es: que es la agregación del @code{operating-system} definido en @code{my-os.scm} al registro @code{arm64-disk-image}.
it: che è l'aggregazione del @code{operating-system} definito in @code{my-os.scm} al record @code{arm64-disk-image}.
pt_br: que é a agregação do @code{operating-system} definido em @code{my-os.scm} ao registro @code{arm64-disk-image}.
sk: čo je združenie člena @code{operating-system} zadaného v @code{moj-os.scm} so záznamom @code{arm64-disk-image}.

source: But enough Scheme madness. What does this image API bring to the Guix user?
es: Pero basta de locuras de esquemas. ¿Qué aporta esta API de imágenes al usuario de Guix?
it: Ma basta follia Scheme. Cosa porta questa API immagine all'utente Guix?
pt_br: Mas chega de loucura do Scheme. O que essa API de imagem traz para o usuário do Guix?
sk: Stačilo už tohto Scheme šialenstva. Čo toto API prináša používateľom Guixu?

source: One can run:
es: Se puede ejecutar:
it: Si può eseguire:
pt_br: Pode-se executar:
sk: Môžete spustiť:

source: mathieu@@cervin:~$ guix system --list-image-types The available image types are:
es: mathieu@@cervin:~$ guix system --list-image-types Los tipos de imagen disponibles son:
it: mathieu@@cervin:~$ guix system --list-image-types I tipi di immagine disponibili sono:
pt_br: mathieu@@cervin:~$ guix system --list-image-types Os tipos de imagem disponíveis são:
sk: mathieu@@cervin:~$ guix system --list-image-types Dostupné druhy obrazov sú:

source: and by writing an @code{operating-system} file based on @code{pine64-barebones-os}, you can customize your image to your preferences in a file (@file{my-pine-os.scm}) like this:
es: y escribiendo un archivo @code{operating-system} basado en @code{pine64-barebones-os}, puede personalizar su imagen según sus preferencias en un archivo (@file{my-pine-os.scm}) como este:
it: e scrivendo un file @code{operating-system} basato su @code{pine64-barebones-os}, puoi personalizzare la tua immagine secondo le tue preferenze in un file (@file{my-pine-os.scm}) come questo:
pt_br: e escrevendo um arquivo @code{operating-system} baseado em @code{pine64-barebones-os}, você pode personalizar sua imagem de acordo com suas preferências em um arquivo (@file{my-pine-os.scm}) como este :
sk: a vytvorením súboru druhu @code{operating-system}, založenom na @code{pine64-barebones-os}, si môžete váš obraz prispôsobiť v súbore (@file{moj-pine-os.scm}) asi takto:

source: run:
es: ejecuta:
it: esegui:
pt_br: execute:
sk: spustite:
sv: kör:

source: or,
es: o,
it: o,
pt_br: ou,
sk: alebo
sv: eller,

source: to get an image that can be written directly to a hard drive and booted from.
es: para obtener una imagen que se puede escribir directamente en un disco duro y arrancar desde ella.
it: per ottenere un'immagine che può essere scritta direttamente su un disco rigido e avviata.
pt_br: para obter uma imagem que pode ser gravada diretamente em um disco rígido e inicializada.
sk: pre získanie obrazu, ktorý možno zapísať priamo na pevný disk a zaviesť.

source: Without changing anything to @code{my-hurd-os.scm}, calling:
es: Sin cambiar nada a @code{my-hurd-os.scm}, invocando:
it: Senza cambiare nulla in @code{my-hurd-os.scm}, chiamando:
pt_br: Sem alterar nada em @code{my-hurd-os.scm}, chamando:
sk: Bezo zmeny v @code{moj-hurd-os.scm}, volanie:

source: will instead produce a Hurd QEMU image.
es: producirá en su lugar una imagen Hurd QEMU.
it: produrrà invece un'immagine Hurd QEMU.
pt_br: em vez disso, produzirá uma imagem Hurd QEMU.
sk: namiesto toho vytvorí Hurd QEMU obraz.

source: 2FA, two-factor authentication
es: 2FA, autenticación de dos factores
it: 2FA, autenticazione a due fattori
pt_br: 2FA, autenticação de dois fatores
sk: 2FA, dvojstupňové overenie

source: U2F, Universal 2nd Factor
es: U2F, segundo factor universal
it: U2F, Secondo Fattore Universale
pt_br: U2F, 2º Fator Universal
sk: U2F, všeobecný druhý stupeň

source: security key, configuration
es: clave de seguridad, configuración
it: chiave di sicurezza, configurazione
pt_br: chave de segurança, configuração
sk: bezpečnostný kľúč, nastavenie

source: The use of security keys can improve your security by providing a second authentication source that cannot be easily stolen or copied, at least for a remote adversary (something that you have), to the main secret (a passphrase -- something that you know), reducing the risk of impersonation.
es: El uso de claves de seguridad puede mejorar su seguridad al proporcionar una segunda fuente de autenticación que no puede ser fácilmente robada o copiada, al menos para un adversario remoto (algo que usted tiene), al secreto principal (una frase de contraseña -- algo que usted conoce), reduciendo el riesgo de suplantación.
it: L'uso delle chiavi di sicurezza può migliorare la tua sicurezza fornendo una seconda fonte di autenticazione che non può essere facilmente rubata o copiata, almeno per un avversario remoto (qualcosa che hai), al segreto principale (una passphrase -- qualcosa che sai), riducendo il rischio di impersonificazione.
pt_br: O uso de chaves de segurança pode melhorar sua segurança, fornecendo uma segunda fonte de autenticação que não pode ser facilmente roubada ou copiada, pelo menos para um adversário remoto (algo que você possui), para o segredo principal (uma senha - algo que você conhece). , reduzindo o risco de falsificação de identidade.
sk: Používanie bezpečnostných kľúčov môže zvýšiť vašu bezpečnosť tým, že hlavnému predmetu utajenia (heslo - niečo, čo poznáte) poskytne podružný zdroj overenia, ktorý nemožno jednoducho ukradnúť alebo skopírovať (niečo, čo vlastníte), aspoň v prípade vzdialených protivníkov, čo znižuje riziko krádeže totožnosti.

source: The example configuration detailed below showcases what minimal configuration needs to be made on your Guix System to allow the use of a Yubico security key. It is hoped the configuration can be useful for other security keys as well, with minor adjustments.
es: El ejemplo de configuración detallado a continuación muestra la configuración mínima que debe realizarse en su sistema Guix para permitir el uso de una llave de seguridad Yubico. Se espera que la configuración pueda ser útil también para otras claves de seguridad, con pequeños ajustes.
it: L'esempio di configurazione dettagliato di seguito mostra quali configurazioni minime devono essere apportate al tuo sistema Guix per consentire l'uso di una chiave di sicurezza Yubico. Si spera che la configurazione possa essere utile anche per altre chiavi di sicurezza, con piccole modifiche.
pt_br: O exemplo de configuração detalhado abaixo mostra qual configuração mínima precisa ser feita em seu sistema Guix para permitir o uso de uma chave de segurança Yubico. Espera-se que a configuração também possa ser útil para outras chaves de segurança, com pequenos ajustes.
sk: Nižšie uvedený podrobný príklad znázorňuje najstručnejšie možné nastavenie potrebné pre umožnenie používania bezpečnostného kľúča Yubico v systéme Guix. Dúfame, že toto nastavenie bude, s menšími úpravami, možné použiť aj pre iné bezpečnostné kľúče.
