Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: @code{user-name} (default: @code{#f})
pt_br: @code{user-name} (padrão: @code{#f})

source: The name of an account that has read-access to the repository, if the repository isn't public.
pt_br: O nome de uma conta que tem acesso de leitura ao repositório, se o repositório não for público.

source: @code{password} (default: @code{#f})
pt_br: @code{password} (padrão: @code{#f})

source: Password to access the Subversion repository, if required.
pt_br: Senha para acessar o repositório Subversion, se necessário.

source: For Bazaar repositories, the module @code{(guix bzr-download)} defines the @code{bzr-fetch} origin method and @code{bzr-reference} data type for support of the Bazaar version control system.
pt_br: Para repositórios Bazaar, o módulo @code{(guix bzr-download)} define o método de origem @code{bzr-fetch} e o tipo de dados @code{bzr-reference} para suporte ao sistema de controle de versão Bazaar.

source: {Procedure} bzr-fetch ref hash-algo hash [name]
pt_br: {Procedimento} bzr-fetch ref hash-algo hash [nome]

source: Return a fixed-output derivation that fetches @var{ref}, a @code{<bzr-reference>} object. The output is expected to have recursive hash @var{hash} of type @var{hash-algo} (a symbol). Use @var{name} as the file name, or a generic name if @code{#f}.
pt_br: Retorna uma derivação de saída fixa que busca @var{ref}, um objeto @code{<bzr-reference>}. Espera-se que a saída tenha hash recursivo @var{hash} do tipo @var{hash-algo} (um símbolo). Use @var{nome} como o nome do arquivo, ou um nome genérico se @code{#f}.

source: {Data Type} bzr-reference
pt_br: {Tipo de dados} bzr-reference

source: This data type represents a Bazaar reference for @code{bzr-fetch} to retrieve.
pt_br: Este tipo de dado representa uma referência Bazaar para @code{bzr-fetch} a recuperar.

source: The URL of the Bazaar repository to clone.
pt_br: A URL do repositório Bazaar a ser clonado.

source: This string denotes revision to fetch specified as a number.
pt_br: Esta sequência de caracteres denota a revisão a ser buscada especificada como um número.

source: For CVS repositories, the module @code{(guix cvs-download)} defines the @code{cvs-fetch} origin method and @code{cvs-reference} data type for support of the Concurrent Versions System (CVS).
pt_br: Para repositórios CVS, o módulo @code{(guix cvs-download)} define o método de origem @code{cvs-fetch} e o tipo de dados @code{cvs-reference} para suporte ao Concurrent Versions System (CVS).

source: {Procedure} cvs-fetch ref hash-algo hash [name]
pt_br: {Procedimento} cvs-fetch ref hash-algo hash [nome]

source: Return a fixed-output derivation that fetches @var{ref}, a @code{<cvs-reference>} object. The output is expected to have recursive hash @var{hash} of type @var{hash-algo} (a symbol). Use @var{name} as the file name, or a generic name if @code{#f}.
pt_br: Retorna uma derivação de saída fixa que busca @var{ref}, um objeto @code{<cvs-reference>}. Espera-se que a saída tenha hash recursivo @var{hash} do tipo @var{hash-algo} (um símbolo). Use @var{nome} como o nome do arquivo, ou um nome genérico se @code{#f}.

source: {Data Type} cvs-reference
pt_br: {Tipo de dados} cvs-reference

source: This data type represents a CVS reference for @code{cvs-fetch} to retrieve.
pt_br: Este tipo de dado representa uma referência CVS para @code{cvs-fetch} a recuperar.

source: The CVS root directory.
pt_br: O diretório raiz do CVS.

source: Module to fetch.
pt_br: Módulo a ser buscado.

source: Revision to fetch.
pt_br: Revisão para buscar.

source: The example below denotes a version of gnu-standards to fetch:
pt_br: O exemplo abaixo denota uma versão do gnu-standards para buscar:

source: customizing packages
pt_br: personalizando pacotes

source: variants, of packages
pt_br: variantes, de pacotes

source: One of the nice things with Guix is that, given a package definition, you can easily @emph{derive} variants of that package---for a different upstream version, with different dependencies, different compilation options, and so on. Some of these custom packages can be defined straight from the command line (@pxref{Package Transformation Options}). This section describes how to define package variants in code. This can be useful in ``manifests'' (@pxref{Writing Manifests}) and in your own package collection (@pxref{Creating a Channel}), among others!
pt_br: Uma das coisas boas com o Guix é que, dada uma definição de pacote, você pode facilmente @emph{derivar} variantes desse pacote---para uma versão upstream diferente, com dependências diferentes, opções de compilação diferentes e assim por diante. Alguns desses pacotes personalizados podem ser definidos diretamente da linha de comando (@pxref{Package Transformation Options}). Esta seção descreve como definir variantes de pacotes no código. Isso pode ser útil em ``manifestos'' (@pxref{Writing Manifests}) e em sua própria coleção de pacotes (@pxref{Creating a Channel}), entre outros!

source: inherit, for package definitions
pt_br: herdar, para definições de pacotes

source: As discussed earlier, packages are first-class objects in the Scheme language. The @code{(guix packages)} module provides the @code{package} construct to define new package objects (@pxref{package Reference}). The easiest way to define a package variant is using the @code{inherit} keyword together with @code{package}. This allows you to inherit from a package definition while overriding the fields you want.
pt_br: Conforme discutido anteriormente, os pacotes são objetos de primeira classe na linguagem Scheme. O módulo @code{(guix packages)} fornece a construção @code{package} para definir novos objetos de pacote (@pxref{package Reference}). A maneira mais fácil de definir uma variante de pacote é usando a palavra-chave @code{inherit} junto com @code{package}. Isso permite que você herde de uma definição de pacote enquanto substitui os campos que deseja.

source: For example, given the @code{hello} variable, which contains a definition for the current version of GNU@tie{}Hello, here's how you would define a variant for version 2.2 (released in 2006, it's vintage!):
pt_br: Por exemplo, dada a variável @code{hello}, que contém uma definição para a versão atual do GNU@tie{}Hello, veja como você definiria uma variante para a versão 2.2 (lançada em 2006, é vintage!):

source: (use-modules (gnu packages base)) ;for 'hello'
pt_br: (use-modules (gnu packages base)) ;para 'hello'

source: The example above corresponds to what the @option{--with-version} or @option{--with-source} package transformations option do. Essentially @code{hello-2.2} preserves all the fields of @code{hello}, except @code{version} and @code{source}, which it overrides. Note that the original @code{hello} variable is still there, in the @code{(gnu packages base)} module, unchanged. When you define a custom package like this, you are really @emph{adding} a new package definition; the original one remains available.
pt_br: O exemplo acima corresponde ao que as opções de transformação de pacote @option{--with-version} ou @option{--with-source} fazem. Essencialmente, @code{hello-2.2} preserva todos os campos de @code{hello}, exceto @code{version} e @code{source}, que ele substitui. Observe que a variável @code{hello} original ainda está lá, no módulo @code{(gnu packages base)}, inalterada. Quando você define um pacote personalizado como este, você está realmente @emph{adicionando} uma nova definição de pacote; a original permanece disponível.

source: You can just as well define variants with a different set of dependencies than the original package. For example, the default @code{gdb} package depends on @code{guile}, but since that is an optional dependency, you can define a variant that removes that dependency like so:
pt_br: Você pode também definir variantes com um conjunto diferente de dependências do que o pacote original. Por exemplo, o pacote padrão @code{gdb} depende de @code{guile}, mas como essa é uma dependência opcional, você pode definir uma variante que remova essa dependência assim:

source: (use-modules (gnu packages gdb)) ;for 'gdb'
pt_br: (use-modules (gnu packages gdb)) ;para 'gdb'

source: The @code{modify-inputs} form above removes the @code{"guile"} package from the @code{inputs} field of @code{gdb}. The @code{modify-inputs} macro is a helper that can prove useful anytime you want to remove, add, or replace package inputs.
pt_br: O formulário @code{modify-inputs} acima remove o pacote @code{"guile"} do campo @code{inputs} de @code{gdb}. A macro @code{modify-inputs} é um auxiliar que pode ser útil sempre que você quiser remover, adicionar ou substituir entradas de pacote.

source: modify-inputs inputs clauses
pt_br: modify-inputs entradas cláusulas

source: Modify the given package inputs, as returned by @code{package-inputs} & co., according to the given clauses. Each clause must have one of the following forms:
pt_br: Modifique as entradas do pacote fornecido, conforme retornado por @code{package-inputs} & co., de acordo com as cláusulas fornecidas. Cada cláusula deve ter uma das seguintes formas:

source: (delete @var{name}@dots{})
pt_br: (delete @var{nome}@dots{})

source: Delete from the inputs packages with the given @var{name}s (strings).
pt_br: Exclua dos pacotes de entrada os @var{nome}s (strings) fornecidos.

source: (prepend @var{package}@dots{})
pt_br: (prepend @var{pacote}@dots{})

source: Add @var{package}s to the front of the input list.
pt_br: Adicione @var{pacote}s à frente da lista de entrada.

source: (append @var{package}@dots{})
pt_br: (append @var{pacote}@dots{})

source: Add @var{package}s to the end of the input list.
pt_br: Adicione @var{pacote}s ao final da lista de entrada.

source: (replace @var{name} @var{replacement})
pt_br: (replace @var{nome} @var{substituição})

source: Replace the package called @var{name} with @var{replacement}.
pt_br: Substitua o pacote chamado @var{nome} por @var{substituição}.

source: The example below removes the GMP and ACL inputs of Coreutils and adds libcap to the front of the input list:
pt_br: O exemplo abaixo remove as entradas GMP e ACL do Coreutils e adiciona libcap à frente da lista de entradas:

source: The example below replaces the @code{guile} package from the inputs of @code{guile-redis} with @code{guile-2.2}:
pt_br: O exemplo abaixo substitui o pacote @code{guile} das entradas de @code{guile-redis} por @code{guile-2.2}:

source: In some cases, you may find it useful to write functions (``procedures'', in Scheme parlance) that return a package based on some parameters. For example, consider the @code{luasocket} library for the Lua programming language. We want to create @code{luasocket} packages for major versions of Lua. One way to do that is to define a procedure that takes a Lua package and returns a @code{luasocket} package that depends on it:
pt_br: Em alguns casos, você pode achar útil escrever funções (``procedimentos'', no jargão do Scheme) que retornam um pacote com base em alguns parâmetros. Por exemplo, considere a biblioteca @code{luasocket} para a linguagem de programação Lua. Queremos criar pacotes @code{luasocket} para as principais versões do Lua. Uma maneira de fazer isso é definir um procedimento que pega um pacote Lua e retorna um pacote @code{luasocket} que depende dele:

source: Here we have defined packages @code{lua5.1-socket} and @code{lua5.2-socket} by calling @code{make-lua-socket} with different arguments. @xref{Procedures,,, guile, GNU Guile Reference Manual}, for more info on procedures. Having top-level public definitions for these two packages means that they can be referred to from the command line (@pxref{Package Modules}).
pt_br: Aqui definimos os pacotes @code{lua5.1-socket} e @code{lua5.2-socket} chamando @code{make-lua-socket} com argumentos diferentes. @xref{Procedures,,, guile, GNU Guile Reference Manual}, para mais informações sobre procedimentos. Ter definições públicas de nível superior para esses dois pacotes significa que eles podem ser referenciados a partir da linha de comando (@pxref{Package Modules}).

source: package transformations
pt_br: transformações de pacotes

source: These are pretty simple package variants. As a convenience, the @code{(guix transformations)} module provides a high-level interface that directly maps to the more sophisticated package transformation options (@pxref{Package Transformation Options}):
pt_br: Essas são variantes de pacote bem simples. Como uma conveniência, o módulo @code{(guix transformations)} fornece uma interface de alto nível que mapeia diretamente para as opções de transformação de pacote mais sofisticadas (@pxref{Package Transformation Options}):

source: {Procedure} options->transformation opts
pt_br: {Procedimento} options->transformation opções

source: Return a procedure that, when passed an object to build (package, derivation, etc.), applies the transformations specified by @var{opts} and returns the resulting objects. @var{opts} must be a list of symbol/string pairs such as:
pt_br: Retorna um procedimento que, quando passado um objeto para construção (pacote, derivação, etc.), aplica as transformações especificadas por @var{opções} e retorna os objetos resultantes. @var{opções} deve ser uma lista de pares símbolo/string como:

source: Each symbol names a transformation and the corresponding string is an argument to that transformation.
pt_br: Cada símbolo nomeia uma transformação e a string correspondente é um argumento para essa transformação.

source: For instance, a manifest equivalent to this command:
pt_br: Por exemplo, um manifesto equivalente a este comando:

source: ... would look like this:
pt_br: ... ficaria assim:

source: input rewriting
pt_br: reescrita de entrada

source: dependency graph rewriting
pt_br: reescrita de grafo de dependência

source: The @code{options->transformation} procedure is convenient, but it's perhaps also not as flexible as you may like. How is it implemented? The astute reader probably noticed that most package transformation options go beyond the superficial changes shown in the first examples of this section: they involve @dfn{input rewriting}, whereby the dependency graph of a package is rewritten by replacing specific inputs by others.
pt_br: O procedimento @code{options->transformation} é conveniente, mas talvez também não seja tão flexível quanto você gostaria. Como ele é implementado? O leitor astuto provavelmente notou que a maioria das opções de transformação de pacotes vai além das mudanças superficiais mostradas nos primeiros exemplos desta seção: elas envolvem @dfn{reescrita de entrada}, por meio da qual o grafo de dependência de um pacote é reescrito pela substituição de entradas específicas por outras.

source: Dependency graph rewriting, for the purposes of swapping packages in the graph, is what the @code{package-input-rewriting} procedure in @code{(guix packages)} implements.
pt_br: A reescrita do grafo de dependência, para fins de troca de pacotes no grafo, é o que o procedimento @code{package-input-rewriting} em @code{(guix packages)} implementa.

source: {Procedure} package-input-rewriting replacements [rewrite-name] @
pt_br: {Procedimento} package-input-rewriting substituições [nome-da-reescrita] @

source: [#:deep? #t] [#:recursive? #f] Return a procedure that, when passed a package, replaces its direct and indirect dependencies, including implicit inputs when @var{deep?} is true, according to @var{replacements}. @var{replacements} is a list of package pairs; the first element of each pair is the package to replace, and the second one is the replacement.
pt_br: [#:deep? #t] [#:recursive? #f] Retorna um procedimento que, quando recebe um pacote, substitui suas dependências diretas e indiretas, incluindo entradas implícitas quando @var{deep?} é verdadeiro, de acordo com @var{substituições}. @var{substituições} é uma lista de pares de pacotes; o primeiro elemento de cada par é o pacote a ser substituído, e o segundo é a substituição.

source: Optionally, @var{rewrite-name} is a one-argument procedure that takes the name of a package and returns its new name after rewrite.
pt_br: Opcionalmente, @var{nome-da-reescrita} é um procedimento de um argumento que recebe o nome de um pacote e retorna seu novo nome após a reescrita.

source: Consider this example:
pt_br: Considere este exemplo:

source: Here we first define a rewriting procedure that replaces @var{openssl} with @var{libressl}. Then we use it to define a @dfn{variant} of the @var{git} package that uses @var{libressl} instead of @var{openssl}. This is exactly what the @option{--with-input} command-line option does (@pxref{Package Transformation Options, @option{--with-input}}).
pt_br: Aqui, primeiro definimos um procedimento de reescrita que substitui @var{openssl} por @var{libressl}. Então, o usamos para definir uma @dfn{variante} do pacote @var{git} que usa @var{libressl} em vez de @var{openssl}. É exatamente isso que a opção de linha de comando @option{--with-input} faz (@pxref{Package Transformation Options, @option{--with-input}}).

source: The following variant of @code{package-input-rewriting} can match packages to be replaced by name rather than by identity.
pt_br: A seguinte variante de @code{package-input-rewriting} pode corresponder a pacotes a serem substituídos por nome em vez de identidade.

source: {Procedure} package-input-rewriting/spec @var{replacements} @
pt_br: {Procedimento} package-input-rewriting/spec @var{substituições} @

source: [#:deep? #t] [#:replace-hidden? #t] Return a procedure that, given a package, applies the given @var{replacements} to all the package graph, including implicit inputs unless @var{deep?} is false.
pt_br: [#:deep? #t] [#:replace-hidden? #t] Retorna um procedimento que, dado um pacote, aplica as @var{substituições} fornecidas a todo o grafo do pacote, incluindo entradas implícitas, a menos que @var{deep?} seja falso.

source: The example above could be rewritten this way:
pt_br: O exemplo acima poderia ser reescrito desta forma:

source: (define libressl-instead-of-openssl ;; Replace all the packages called "openssl" with LibreSSL. (package-input-rewriting/spec `(("openssl" . ,(const libressl)))))
pt_br: (define libressl-instead-of-openssl ;; Substitua todos os pacotes chamados "openssl" por LibreSSL. (package-input-rewriting/spec `(("openssl" . ,(const libressl)))))

source: The key difference here is that, this time, packages are matched by spec and not by identity. In other words, any package in the graph that is called @code{openssl} will be replaced.
pt_br: A principal diferença aqui é que, dessa vez, os pacotes são correspondidos por spec e não por identidade. Em outras palavras, qualquer pacote no grafo que seja chamado @code{openssl} será substituído.

source: A more generic procedure to rewrite a package dependency graph is @code{package-mapping}: it supports arbitrary changes to nodes in the graph.
pt_br: Um procedimento mais genérico para reescrever um grafo de dependência de pacote é @code{package-mapping}: ele suporta alterações arbitrárias em nós no grafo.

source: {Procedure} package-mapping proc [cut?] [#:deep? #f]
pt_br: {Procedimento} package-mapping proc [cortar?] [#:deep? #f]

source: Return a procedure that, given a package, applies @var{proc} to all the packages depended on and returns the resulting package. The procedure stops recursion when @var{cut?} returns true for a given package. When @var{deep?} is true, @var{proc} is applied to implicit inputs as well.
pt_br: Retorna um procedimento que, dado um pacote, aplica @var{proc} a todos os pacotes dependentes e retorna o pacote resultante. O procedimento para a recursão quando @var{cortar?} retorna true para um determinado pacote. Quando @var{deep?} é true, @var{proc} é aplicado a entradas implícitas também.

source: Tips
pt_br: Dicas

source: Understanding what a variant really looks like can be difficult as one starts combining the tools shown above. There are several ways to inspect a package before attempting to build it that can prove handy:
pt_br: Entender como uma variante realmente se parece pode ser difícil quando se começa a combinar as ferramentas mostradas acima. Há várias maneiras de inspecionar um pacote antes de tentar construí-lo que podem ser úteis:

source: You can inspect the package interactively at the REPL, for instance to view its inputs, the code of its build phases, or its configure flags (@pxref{Using Guix Interactively}).
pt_br: Você pode inspecionar o pacote interativamente no REPL, por exemplo, para visualizar suas entradas, o código de suas fases de construção ou seus sinalizadores de configuração (@pxref{Using Guix Interactively}).

source: When rewriting dependencies, @command{guix graph} can often help visualize the changes that are made (@pxref{Invoking guix graph}).
pt_br: Ao reescrever dependências, @command{guix graph} geralmente pode ajudar a visualizar as alterações feitas (@pxref{Invoking guix graph}).

source: manifest
pt_br: manifesto

source: bill of materials (manifests)
pt_br: lista de materiais (manifestos)

source: @command{guix} commands let you specify package lists on the command line. This is convenient, but as the command line becomes longer and less trivial, it quickly becomes more convenient to have that package list in what we call a @dfn{manifest}. A manifest is some sort of a ``bill of materials'' that defines a package set. You would typically come up with a code snippet that builds the manifest, store it in a file, say @file{manifest.scm}, and then pass that file to the @option{-m} (or @option{--manifest}) option that many @command{guix} commands support. For example, here's what a manifest for a simple package set might look like:
pt_br: Os comandos @command{guix} permitem que você especifique listas de pacotes na linha de comando. Isso é conveniente, mas conforme a linha de comando se torna mais longa e menos trivial, rapidamente se torna mais conveniente ter essa lista de pacotes no que chamamos de @dfn{manifesto}. Um manifesto é algum tipo de ``lista de materiais'' que define um conjunto de pacotes. Você normalmente criaria um trecho de código que constrói o manifesto, o armazenaria em um arquivo, digamos @file{manifest.scm}, e então passaria esse arquivo para a opção @option{-m} (ou @option{--manifest}) que muitos comandos @command{guix} suportam. Por exemplo, aqui está como um manifesto para um conjunto de pacotes simples pode se parecer:

source: ;; Manifest for three packages. (specifications->manifest '("gcc-toolchain" "make" "git"))
pt_br: ;; Manifesto para três pacotes. (specifications->manifest '("gcc-toolchain" "make" "git"))

source: Once you have that manifest, you can pass it, for example, to @command{guix package} to install just those three packages to your profile (@pxref{profile-manifest, @option{-m} option of @command{guix package}}):
pt_br: Depois de ter esse manifesto, você pode passá-lo, por exemplo, para @command{guix package} para instalar apenas esses três pacotes no seu perfil (@pxref{profile-manifest, @option{-m} opção de @command{guix package}}):

source: ... or you can pass it to @command{guix shell} (@pxref{shell-manifest, @command{-m} option of @command{guix shell}}) to spawn an ephemeral environment:
pt_br: ... ou você pode passá-lo para @command{guix shell} (@pxref{shell-manifest, @command{-m} opção de @command{guix shell}}) para gerar um ambiente efêmero:
