Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Sometimes, you instead want to find which package provides a given file, and this is where @command{guix locate} comes in. Here is how you can find which package provides the @command{ls} command:
pt_br: Às vezes, você deseja descobrir qual pacote fornece um determinado arquivo, e é aí que entra @command{guix locate}. Veja como você pode encontrar o comando @command{ls}:

source: Of course the command works for any file, not just commands:
pt_br: É claro que o comando funciona para qualquer arquivo, não apenas para comandos:

source: You may also specify @dfn{glob patterns} with wildcards. For example, here is how you would search for packages providing @file{.service} files:
pt_br: Você também pode especificar @dfn{padrões de globo} com curingas. Por exemplo, aqui está como você procuraria pacotes que fornecem arquivos @file{.service}:

source: The @command{guix locate} command relies on a database that maps file names to package names. By default, it automatically creates that database if it does not exist yet by traversing packages available @emph{locally}, which can take a few minutes (depending on the size of your store and the speed of your storage device).
pt_br: O comando @command{guix locate} depende de um banco de dados que mapeia nomes de arquivos para nomes de pacotes. Por padrão, ele cria automaticamente esse banco de dados, caso ele ainda não exista, percorrendo os pacotes disponíveis @emph{localmente}, o que pode levar alguns minutos (dependendo do tamanho do seu armazém e da velocidade do seu dispositivo de armazenamento).

source: For now, @command{guix locate} builds its database based on purely local knowledge---meaning that you will not find packages that never reached your store. Eventually it will support downloading a pre-built database so you can potentially find more packages.
pt_br: Por enquanto, @command{guix locate} constrói seu banco de dados baseado em conhecimento puramente local – o que significa que você não encontrará pacotes que nunca chegaram ao sue armazém. Eventualmente, ele suportará o download de um banco de dados pré-construído para que você possa encontrar mais pacotes.

source: By default, @command{guix locate} first tries to look for a system-wide database, usually under @file{/var/cache/guix/locate}; if it does not exist or is too old, it falls back to the per-user database, by default under @file{~/.cache/guix/locate}. On a multi-user system, administrators may want to periodically update the system-wide database so that all users can benefit from it, for instance by setting up @code{package-database-service-type} (@pxref{File Search Services, @code{package-database-service-type}}).
pt_br: Por padrão, @command{guix locate} primeiro tenta procurar um banco de dados de todo o sistema, geralmente em @file{/var/cache/guix/locate}; Se não existir ou for muito antigo, ele retornará ao banco de dados por usuário, por padrão em @file{~/.cache/guix/locate}. Em um sistema multiusuário, os administradores podem querer atualizar periodicamente o banco de dados de todo o sistema para que todos os usuários possam se beneficiar dele, por exemplo, configurando @code{package-database-service-type} (@pxref{File Search Services, @code{package-database-service-type}}).

source: The general syntax is:
pt_br: A sintaxe geral é:

source: guix locate [@var{options}@dots{}] @var{file}@dots{}
pt_br: guix locate [@var{opções}@dots{}] @var{arquivo}@dots{}

source: ... where @var{file} is the name of a file to search for (specifically, the ``base name'' of the file: files whose parent directories are called @var{file} are not matched).
pt_br: ... onde @var{arquivo} é o nome de um arquivo a ser pesquisado (especificamente, o "nome base" do arquivo: arquivos cujos diretórios pais são chamados @var{arquivo} não são correspondidos).

source: The available options are as follows:
pt_br: As opções disponíveis são as seguintes:

source: Interpret @var{file}@dots{} as @dfn{glob patterns}---patterns that may include wildcards, such as @samp{*.scm} to denote all files ending in @samp{.scm}.
pt_br: Interprete @var{arquivo}@dots{} como @dfn{padrões de globo}---padrões que podem incluir caracteres curinga, como @samp{*.scm} para denotar todos os arquivos que terminam em @samp{.scm}.

source: Display database statistics.
pt_br: Exibir estatísticas do banco de dados.

source: Update the file database.
it: Aggiorna il database dei file.
pt_br: Atualize o banco de dados dos arquivos.

source: By default, the database is automatically updated when it is too old.
pt_br: Por padrão, o banco de dados é atualizado automaticamente quando é muito antigo.

source: Clear the database and re-populate it.
pt_br: Limpe o banco de dados e preencha-o novamente.

source: This option lets you start anew, ensuring old data is removed from the database, which also avoids having an endlessly growing database. By default @command{guix locate} automatically does that periodically, though infrequently.
pt_br: Esta opção permite começar de novo, garantindo que os dados antigos sejam removidos do banco de dados, o que também evita ter um banco de dados em constante crescimento. Por padrão, @command{guix locate} faz isso automaticamente periodicamente, embora com pouca frequência.

source: --database=@var{file}
pt_br: --database=@var{arquivo}

source: Use @var{file} as the database, creating it if necessary.
pt_br: Use @var{arquivo} como banco de dados, criando-o se necessário.

source: By default, @command{guix locate} picks the database under @file{~/.cache/guix} or @file{/var/cache/guix}, whichever is the most recent one.
pt_br: Por padrão, @command{guix locate} escolhe o banco de dados em @file{~/.cache/guix} ou @file{/var/cache/guix}, o que for mais recente.

source: --method=@var{method}
pt_br: --method=@var{método}

source: -m @var{method}
pt_br: -m @var{método}

source: Use @var{method} to select the set of packages to index. Possible values are:
pt_br: Use @var{método} para selecionar o conjunto de pacotes a serem indexados. Os valores possíveis são:

source: This is the default method: it works by traversing profiles on the machine and recording packages it encounters---packages you or other users of the machine installed, directly or indirectly. It is fast but it can miss other packages available in the store but not referred to by any profile.
pt_br: Este é o método padrão: ele funciona percorrendo perfis na máquina e gravando os pacotes que encontra – pacotes instalados por você ou por outros usuários da máquina, direta ou indiretamente. É rápido mas você pode perder outros pacotes disponíveis no armazém mas não referenciados por nenhum perfil.

source: This is a slower but more exhaustive method: it checks among all the existing packages those that are available in the store and records them.
pt_br: Este é um método mais lento, porém mais exaustivo: verifica entre todos os pacotes existentes aqueles que estão disponíveis no armazém e os registra.

source: Invoking @command{guix gc}
pt_br: Invocando @command{guix gc}

source: garbage collector
pt_br: coletor de lixo

source: disk space
pt_br: espaço em disco

source: Packages that are installed, but not used, may be @dfn{garbage-collected}. The @command{guix gc} command allows users to explicitly run the garbage collector to reclaim space from the @file{/gnu/store} directory. It is the @emph{only} way to remove files from @file{/gnu/store}---removing files or directories manually may break it beyond repair!
pt_br: Pacotes instalados mas não usados podem ser @dfn{garbage-collected}. O comando @command{guix gc} permite que os usuários executem explicitamente o coletor de lixo para recuperar espaço do diretório @file{/gnu/store}. É a maneira @emph{única} de remover arquivos de @file{/gnu/store} --- remover arquivos ou diretórios manualmente pode quebrá-los sem possibilidade de reparo!

source: The garbage collector has a set of known @dfn{roots}: any file under @file{/gnu/store} reachable from a root is considered @dfn{live} and cannot be deleted; any other file is considered @dfn{dead} and may be deleted. The set of garbage collector roots (``GC roots'' for short) includes default user profiles; by default, the symlinks under @file{/var/guix/gcroots} represent these GC roots. New GC roots can be added with @command{guix build --root}, for example (@pxref{Invoking guix build}). The @command{guix gc --list-roots} command lists them.
pt_br: O coletor de lixo possui um conjunto de @dfn{raizes} conhecidos: qualquer arquivo em @file{/gnu/store} acessível a partir de uma raiz é considerado @dfn{live} e não pode ser excluído; Qualquer outro arquivo é considerado @dfn{dead} e pode ser excluído. O conjunto de raízes do coletor de lixo (abreviadamente ``Raízes GC'') inclui perfis de usuário padrão; por padrão, as ligações simbólicas em @file{/var/guix/gcroots} representam essas raízes do GC. Novas raízes de GC podem ser adicionadas com @command{guix build --root}, por exemplo (@pxref{Invoking guix build}). O comando @command{guix gc --list-roots} os lista.

source: Prior to running @code{guix gc --collect-garbage} to make space, it is often useful to remove old generations from user profiles; that way, old package builds referenced by those generations can be reclaimed. This is achieved by running @code{guix package --delete-generations} (@pxref{Invoking guix package}).
pt_br: Antes de executar @code{guix gc --collect-garbage} para liberar espaço, geralmente é útil remover gerações antigas dos perfis de usuário; dessa forma, compilações de pacotes antigos referenciadas por essas gerações podem ser recuperadas. Isso é conseguido executando @code{guix package --delete-generations} (@pxref{Invoking guix package}).

source: Our recommendation is to run a garbage collection periodically, or when you are short on disk space. For instance, to guarantee that at least 5@tie{}GB are available on your disk, simply run:
pt_br: Nossa recomendação é executar uma coleta de lixo periodicamente ou quando houver pouco espaço em disco. Por exemplo, para garantir que pelo menos 5@tie{}GB estejam disponíveis no disco, basta executar:

source: It is perfectly safe to run as a non-interactive periodic job (@pxref{Scheduled Job Execution}, for how to set up such a job). Running @command{guix gc} with no arguments will collect as much garbage as it can, but that is often inconvenient: you may find yourself having to rebuild or re-download software that is ``dead'' from the GC viewpoint but that is necessary to build other pieces of software---e.g., the compiler tool chain.
pt_br: É perfeitamente seguro executar como um trabalho periódico não interativo (@pxref{Scheduled Job Execution}, para saber como configurar tal trabalho). Executar @command{guix gc} sem argumentos coletará o máximo de lixo possível, mas isso geralmente é inconveniente: você pode ter que reconstruir ou baixar novamente um software que está "morto" do ponto de vista do GC, mas que é necessário para construir outras peças de software - por exemplo, a cadeia de ferramentas do compilador.

source: The @command{guix gc} command has three modes of operation: it can be used to garbage-collect any dead files (the default), to delete specific files (the @option{--delete} option), to print garbage-collector information, or for more advanced queries. The garbage collection options are as follows:
pt_br: O comando @command{guix gc} tem três modos de operação: pode ser usado para coletar o lixo de quaisquer arquivos mortos (o padrão), para excluir arquivos específicos (a opção @option{--delete}), para imprimir lixo- informações do coletor ou para consultas mais avançadas. As opções de coleta de lixo são as seguintes:

source: Collect garbage---i.e., unreachable @file{/gnu/store} files and sub-directories. This is the default operation when no option is specified.
pt_br: Colete lixo, ou seja, arquivos e subdiretórios @file{/gnu/store} inacessíveis. Esta é a operação padrão quando nenhuma opção é especificada.

source: When @var{min} is given, stop once @var{min} bytes have been collected. @var{min} may be a number of bytes, or it may include a unit as a suffix, such as @code{MiB} for mebibytes and @code{GB} for gigabytes (@pxref{Block size, size specifications,, coreutils, GNU Coreutils}).
pt_br: Quando @var{min} for fornecido, pare quando @var{min} bytes forem coletados. @var{min} pode ser um número de bytes ou pode incluir uma unidade como sufixo, como @code{MiB} para mebibytes e @code{GB} para gigabytes (@pxref{Block size, especificações de tamanho,, coreutils, GNU Coreutils}).

source: When @var{min} is omitted, collect all the garbage.
pt_br: Quando @var{min} for omitido, colete todo o lixo.

source: Collect garbage until @var{free} space is available under @file{/gnu/store}, if possible; @var{free} denotes storage space, such as @code{500MiB}, as described above.
pt_br: Colete o lixo até que o espaço @var{free} esteja disponível em @file{/gnu/store}, se possível; @var{free} denota espaço de armazenamento, como @code{500MiB}, conforme descrito acima.

source: When @var{free} or more is already available in @file{/gnu/store}, do nothing and exit immediately.
pt_br: Quando @var{free} ou mais já estiver disponível em @file{/gnu/store}, não faça nada e saia imediatamente.

source: --delete-generations[=@var{duration}]
pt_br: --delete-generations[=@var{duração}]

source: -d [@var{duration}]
pt_br: -d [@var{duração}]

source: Before starting the garbage collection process, delete all the generations older than @var{duration}, for all the user profiles and home environment generations; when run as root, this applies to all the profiles @emph{of all the users}.
pt_br: Antes de iniciar o processo de coleta de lixo, exclua todas as gerações anteriores a @var{duração}, para todos os perfis de usuário e gerações do ambiente pessoal. Quando executado como root, isso se aplica a todos os perfis @emph{de todos os usuários}.

source: For example, this command deletes all the generations of all your profiles that are older than 2 months (except generations that are current), and then proceeds to free space until at least 10 GiB are available:
pt_br: Por exemplo, este comando exclui todas as gerações de todos os seus perfis com mais de 2 meses (exceto as gerações atuais) e depois libera espaço até que pelo menos 10 GiB estejam disponíveis:

source: Attempt to delete all the store files and directories specified as arguments. This fails if some of the files are not in the store, or if they are still live.
pt_br: Tentativa de excluir todos os arquivos e diretórios de armazém especificados como argumentos. Isso falhará se alguns dos arquivos não estiverem no armazém ou se ainda estiverem ativos.

source: List store items corresponding to cached build failures.
pt_br: Listar itens de armazém correspondentes a falhas de compilação em cache.

source: This prints nothing unless the daemon was started with @option{--cache-failures} (@pxref{Invoking guix-daemon, @option{--cache-failures}}).
pt_br: Isso não imprime nada, a menos que o daemon tenha sido iniciado com @option{--cache-failures} (@pxref{Invoking guix-daemon, @option{--cache-failures}}).

source: List the GC roots owned by the user; when run as root, list @emph{all} the GC roots.
pt_br: Listar as raízes do GC de propriedade do usuário; quando executado como root, listar @emph{todas} as raízes do GC.

source: List store items in use by currently running processes. These store items are effectively considered GC roots: they cannot be deleted.
pt_br: Listar itens de armazém em uso por processos em execução no momento. Esses itens de armazém são efetivamente considerados raízes GC: eles não podem ser excluídos.

source: Remove the specified store items from the failed-build cache.
pt_br: Remova os itens de armazém especificados do cache de compilação com falha.

source: Again, this option only makes sense when the daemon is started with @option{--cache-failures}. Otherwise, it does nothing.
pt_br: Novamente, essa opção só faz sentido quando o daemon é iniciado com @option{--cache-failures}. Caso contrário, não faz nada.

source: Show the list of dead files and directories still present in the store---i.e., files and directories no longer reachable from any root.
pt_br: Exibe a lista de arquivos e diretórios mortos ainda presentes no armazém, ou seja, arquivos e diretórios que não podem mais ser acessados de nenhuma raiz.

source: Show the list of live store files and directories.
pt_br: Exibe a lista de arquivos e diretórios do armazém ativa.

source: In addition, the references among existing store files can be queried:
pt_br: Além disso, as referências entre arquivos de armazém existentes podem ser consultadas:

source: package dependencies
pt_br: dependências de pacotes

source: List the references (respectively, the referrers) of store files given as arguments.
pt_br: Listar as referências (respectivamente, os referenciadores) dos arquivos de armazém fornecidos como argumentos.

source: List the requisites of the store files passed as arguments. Requisites include the store files themselves, their references, and the references of these, recursively. In other words, the returned list is the @dfn{transitive closure} of the store files.
pt_br: Liste os requisitos dos arquivos de armazém passados como argumentos. Os requisitos incluem os próprios arquivos de armazém, suas referências e as referências destes, recursivamente. Em outras palavras, a lista retornada é o @dfn{fechamento transitivo} dos arquivos de armazém.

source: @xref{Invoking guix size}, for a tool to profile the size of the closure of an element. @xref{Invoking guix graph}, for a tool to visualize the graph of references.
pt_br: @xref{Invoking guix size}, para uma ferramenta para criar o perfil do tamanho do fechamento de um elemento. @xref{Invoking guix graph}, para uma ferramenta para visualizar o grafo de referências.

source: Return the derivation(s) leading to the given store items (@pxref{Derivations}).
pt_br: Retorna a(s) derivação(ões) que levam aos itens de armazém fornecidos (@pxref{Derivations}).

source: For example, this command:
pt_br: Por exemplo, este comando:

source: returns the @file{.drv} file(s) leading to the @code{emacs} package installed in your profile.
pt_br: retorna o(s) arquivo(s) @file{.drv} que levam ao pacote @code{emacs} instalado no seu perfil.

source: Note that there may be zero matching @file{.drv} files, for instance because these files have been garbage-collected. There can also be more than one matching @file{.drv} due to fixed-output derivations.
pt_br: Note que pode haver zero arquivos @file{.drv} correspondentes, por exemplo porque esses arquivos foram coletados como lixo. Também pode haver mais de um @file{.drv} correspondente devido a derivações de saída fixa.

source: Lastly, the following options allow you to check the integrity of the store and to control disk usage.
pt_br: Por fim, as seguintes opções permitem que você verifique a integridade do armazém e controle o uso do disco.

source: --verify[=@var{options}]
pt_br: --verify[=@var{opções}]

source: integrity, of the store
pt_br: integridade do armazém

source: integrity checking
pt_br: verificação de integridade

source: Verify the integrity of the store.
pt_br: Verifique a integridade do armazém.

source: By default, make sure that all the store items marked as valid in the database of the daemon actually exist in @file{/gnu/store}.
pt_br: Por padrão, certifique-se de que todos os itens de armazém marcados como válidos no banco de dados do daemon realmente existam em @file{/gnu/store}.

source: When provided, @var{options} must be a comma-separated list containing one or more of @code{contents} and @code{repair}.
pt_br: Quando fornecido, @var{opções} deve ser uma lista separada por vírgulas contendo um ou mais de @code{contents} e @code{repair}.

source: When passing @option{--verify=contents}, the daemon computes the content hash of each store item and compares it against its hash in the database. Hash mismatches are reported as data corruptions. Because it traverses @emph{all the files in the store}, this command can take a long time, especially on systems with a slow disk drive.
pt_br: Ao passar @option{--verify=contents}, o daemon calcula o hash de conteúdo de cada item do armazém e o compara com seu hash no banco de dados. Incompatibilidades de hash são relatadas como corrupções de dados. Como ele percorre @emph{todos os arquivos no armazém}, esse comando pode levar muito tempo, especialmente em sistemas com uma unidade de disco lenta.

source: repairing the store
pt_br: consertando o armazém

source: corruption, recovering from
pt_br: corrupção, recuperando-se de

source: Using @option{--verify=repair} or @option{--verify=contents,repair} causes the daemon to try to repair corrupt store items by fetching substitutes for them (@pxref{Substitutes}). Because repairing is not atomic, and thus potentially dangerous, it is available only to the system administrator. A lightweight alternative, when you know exactly which items in the store are corrupt, is @command{guix build --repair} (@pxref{Invoking guix build}).
pt_br: Usar @option{--verify=repair} ou @option{--verify=contents,repair} faz com que o daemon tente reparar itens corrompidos do armazém buscando substitutos para eles (@pxref{Substitutes}). Como o reparo não é atômico e, portanto, potencialmente perigoso, ele está disponível apenas para o administrador do sistema. Uma alternativa leve, quando você sabe exatamente quais itens no armazém estão corrompidos, é @command{guix build --repair} (@pxref{Invoking guix build}).

source: Optimize the store by hard-linking identical files---this is @dfn{deduplication}.
pt_br: Otimize o armazém vinculando fisicamente arquivos idênticos — isso é @dfn{deduplication}.

source: The daemon performs deduplication after each successful build or archive import, unless it was started with @option{--disable-deduplication} (@pxref{Invoking guix-daemon, @option{--disable-deduplication}}). Thus, this option is primarily useful when the daemon was running with @option{--disable-deduplication}.
pt_br: O daemon executa a desduplicação após cada importação bem-sucedida de build ou archive, a menos que tenha sido iniciado com @option{--disable-deduplication} (@pxref{Invoking guix-daemon, @option{--disable-deduplication}}). Portanto, essa opção é útil principalmente quando o daemon estava em execução com @option{--disable-deduplication}.

source: vacuum the store database
pt_br: aspirar o banco de dados do armazém

source: Guix uses an sqlite database to keep track of the items in the store (@pxref{The Store}). Over time it is possible that the database may grow to a large size and become fragmented. As a result, one may wish to clear the freed space and join the partially used pages in the database left behind from removed packages or after running the garbage collector. Running @command{sudo guix gc --vacuum-database} will lock the database and @code{VACUUM} the store, defragmenting the database and purging freed pages, unlocking the database when it finishes.
pt_br: Guix usa um banco de dados sqlite para manter o controle dos itens no armazém (@pxref{The Store}). Com o tempo, é possível que o banco de dados cresça muito e se torne fragmentado. Como resultado, pode-se desejar limpar o espaço liberado e juntar as páginas parcialmente usadas no banco de dados deixadas para trás por pacotes removidos ou após executar o coletor de lixo. Executar @command{sudo guix gc --vacuum-database} bloqueará o banco de dados e @code{VACUUM} o store, desfragmentando o banco de dados e expurgando as páginas liberadas, desbloqueando o banco de dados quando terminar.

source: Invoking @command{guix pull}
pt_br: Invocando @command{guix pull}

source: upgrading Guix
pt_br: atualizando Guix
