Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Anything that does not fall in the previous categories goes to @code{inputs}, for example programs or C libraries required for building Python packages containing C extensions.
it: Tutto ciò che non rientra nelle categorie precedenti va in @code{inputs}, ad esempio programmi o librerie C richiesti per la compilazione di pacchetti Python contenenti estensioni C.
pt_br: Qualquer coisa que não encaixar nas categorias anteriores vai para @code{inputs}. Por exemplo, programas ou bibliotecas C necessárias para compilar pacotes Python contendo extensões C.

source: If a Python package has optional dependencies (@code{extras_require}), it is up to you to decide whether to add them or not, based on their usefulness/overhead ratio (@pxref{Submitting Patches, @command{guix size}}).
it: Se un pacchetto Python ha dipendenze opzionali (@code{extras_require}), sta a te decidere se aggiungerle o meno, in base al loro rapporto utilità/sovraccarico (@pxref{Submitting Patches, @command{guix size}}).
pt_br: Se um pacote Python tem dependências opcionais (@code{extras_require}), fica a seu critério adicioná-las ou não, com base na sua proporção de utilidade/sobrecarga (@pxref{Submitting Patches, @command{guix size}}).

source: Perl programs standing for themselves are named as any other package, using the lowercase upstream name. For Perl packages containing a single class, we use the lowercase class name, replace all occurrences of @code{::} by dashes and prepend the prefix @code{perl-}. So the class @code{XML::Parser} becomes @code{perl-xml-parser}. Modules containing several classes keep their lowercase upstream name and are also prepended by @code{perl-}. Such modules tend to have the word @code{perl} somewhere in their name, which gets dropped in favor of the prefix. For instance, @code{libwww-perl} becomes @code{perl-libwww}.
it: I programmi Perl autonomi sono nominati come qualsiasi altro pacchetto, usando il nome upstream in minuscolo. Per i pacchetti Perl che contengono una singola classe, usiamo il nome della classe in minuscolo, sostituiamo tutte le occorrenze di @code{::} con trattini e anteponiamo il prefisso @code{perl-}. Così la classe @code{XML::Parser} diventa @code{perl-xml-parser}. I moduli che contengono diverse classi mantengono il loro nome upstream in minuscolo e sono anch'essi preceduti da @code{perl-}. Tali moduli tendono ad avere la parola @code{perl} da qualche parte nel loro nome, che viene omessa in favore del prefisso. Ad esempio, @code{libwww-perl} diventa @code{perl-libwww}.
pt_br: Os programas Perl próprios são nomeados como qualquer outro pacote, usando o nome upstream em letras minúsculas. Para pacotes Perl que contêm uma única classe, usamos o nome da classe em letras minúsculas, substituímos todas as ocorrências de @code{::} por traços e precede o prefixo @code{perl-}. Portanto, a classe @code{XML::Parser} se torna @code{perl-xml-parser}. Módulos contendo várias classes mantêm seu nome upstream em minúsculas e também são precedidos por @code{perl-}. Esses módulos tendem a ter a palavra @code{perl} em algum lugar do nome, que é descartada em favor do prefixo. Por exemplo, @code{libwww-perl} se torna @code{perl-libwww}.

source: Java programs standing for themselves are named as any other package, using the lowercase upstream name.
it: I programmi Java autonomi sono nominati come qualsiasi altro pacchetto, usando il nome upstream in minuscolo.
pt_br: Os programas Java próprios são nomeados como qualquer outro pacote, usando o nome do upstream em letras minúsculas.

source: To avoid confusion and naming clashes with other programming languages, it is desirable that the name of a package for a Java package is prefixed with @code{java-}. If a project already contains the word @code{java}, we drop this; for instance, the package @code{ngsjava} is packaged under the name @code{java-ngs}.
it: Per evitare confusione e conflitti di nomi con altri linguaggi di programmazione, è desiderabile che il nome di un pacchetto per un pacchetto Java sia preceduto dal prefisso @code{java-}. Se un progetto contiene già la parola @code{java}, la omettiamo; ad esempio, il pacchetto @code{ngsjava} è pacchettizzato con il nome @code{java-ngs}.
pt_br: Para evitar confusão e conflitos de nomes com outras linguagens de programação, é desejável que o nome de um pacote para um pacote Java seja prefixado com @code{java-}. Se um projeto já contém a palavra @code{java}, descartamos isso; por exemplo, o pacote @code{ngsjava} é empacotado com o nome @code{java-ngs}.

source: For Java packages containing a single class or a small class hierarchy, we use the lowercase class name, replace all occurrences of @code{.} by dashes and prepend the prefix @code{java-}. So the class @code{apache.commons.cli} becomes package @code{java-apache-commons-cli}.
it: Per i pacchetti Java che contengono una singola classe o una piccola gerarchia di classi, usiamo il nome della classe in minuscolo, sostituiamo tutte le occorrenze di @code{.} con trattini e anteponiamo il prefisso @code{java-}. Così la classe @code{apache.commons.cli} diventa il pacchetto @code{java-apache-commons-cli}.
pt_br: Para pacotes Java que contêm uma única classe ou uma pequena hierarquia de classes, usamos o nome da classe em letras minúsculas, substitua todas as ocorrências de @code{.} por traços e acrescente o prefixo @code{java-}. Assim, a classe @code{apache.commons.cli} se torna o pacote @code{java-apache-commons-cli}.

source: Elm applications can be named like other software: their names need not mention Elm.
it: Le applicazioni Elm possono essere nominate come altri software: i loro nomi non devono necessariamente menzionare Elm.
pt_br: Os aplicativos Elm podem ser nomeados como outros softwares: seus nomes não precisam mencionar Elm.

source: Packages in the Elm sense (see @code{elm-build-system} under @ref{Build Systems}) are required use names of the format @var{author}@code{/}@var{project}, where both the @var{author} and the @var{project} may contain hyphens internally, and the @var{author} sometimes contains uppercase letters.
it: I pacchetti in senso Elm (vedi @code{elm-build-system} in @ref{Build Systems}) devono usare nomi nel formato @var{autore}@code{/}@var{progetto}, dove sia l'@var{autore} che il @var{progetto} possono contenere trattini al loro interno, e l'@var{author} a volte contiene lettere maiuscole.
pt_br: Pacotes no sentido Elm (veja @code{elm-build-system} em @ref{Build Systems}) devem usar nomes no formato @var{author}@code{/}@var{project}, onde tanto @var{author} quanto @var{project} podem conter hifens internamente, e @var{author} às vezes contém letras maiúsculas.

source: To form the Guix package name from the upstream name, we follow a convention similar to Python packages (@pxref{Python Modules}), adding an @code{elm-} prefix unless the name would already begin with @code{elm-}.
it: Per formare il nome del pacchetto Guix dal nome upstream, seguiamo una convenzione simile a quella dei pacchetti Python (@pxref{Python Modules}), aggiungendo un prefisso @code{elm-} a meno che il nome non inizi già con @code{elm-}.
pt_br: Para formar o nome do pacote Guix a partir do nome upstream, seguimos uma convenção semelhante aos pacotes Python (@pxref{Python Modules}), adicionando um prefixo @code{elm-}, a menos que o nome já comece com @code{elm-}.

source: In many cases we can reconstruct an Elm package's upstream name heuristically, but, since conversion to a Guix-style name involves a loss of information, this is not always possible. Care should be taken to add the @code{'upstream-name} property when necessary so that @samp{guix import elm} will work correctly (@pxref{Invoking guix import}). The most notable scenarios when explicitly specifying the upstream name is necessary are:
it: In molti casi possiamo ricostruire euristicamente il nome upstream di un pacchetto Elm, ma, poiché la conversione a un nome in stile Guix comporta una perdita di informazioni, questo non è sempre possibile. Bisogna fare attenzione ad aggiungere la proprietà @code{'upstream-name} quando necessario, in modo che @samp{guix import elm} funzioni correttamente (@pxref{Invoking guix import}). Gli scenari più notevoli in cui è necessario specificare esplicitamente il nome upstream sono:
pt_br: Em muitos casos, podemos reconstruir o nome upstream de um pacote Elm heuristicamente, mas, como a conversão para um nome no estilo Guix envolve perda de informações, isso nem sempre é possível. Deve-se tomar cuidado para adicionar a propriedade @code{'upstream-name} quando necessário para que @samp{guix import elm} funcione corretamente (@pxref{Invoking guix import}). Os cenários mais notáveis quando especificar explicitamente o nome upstream é necessário são:

source: When the @var{author} is @code{elm} and the @var{project} contains one or more hyphens, as with @code{elm/virtual-dom}; and
it: Quando l'@var{author} è @code{elm} e il @var{progetto} contiene uno o più trattini, come con @code{elm/virtual-dom}; e
pt_br: Quando @var{author} é @code{elm} e @var{project} contém um ou mais hifens, como em @code{elm/virtual-dom}; e

source: When the @var{author} contains hyphens or uppercase letters, as with @code{Elm-Canvas/raster-shapes}---unless the @var{author} is @code{elm-explorations}, which is handled as a special case, so packages like @code{elm-explorations/markdown} do @emph{not} need to use the @code{'upstream-name} property.
it: Quando l'@var{author} contiene trattini o lettere maiuscole, come con @code{Elm-Canvas/raster-shapes} --- a meno che l'@var{autore} non sia @code{elm-explorations}, che è gestito come un caso speciale, quindi pacchetti come @code{elm-explorations/markdown} @emph{non} hanno bisogno di usare la proprietà @code{'upstream-name}.
pt_br: Quando @var{author} contém hifens ou letras maiúsculas, como em @code{Elm-Canvas/raster-shapes}---a menos que @var{author} seja @code{elm-explorations}, que é tratado como um caso especial, então pacotes como @code{elm-explorations/markdown} @emph{não} precisam usar a propriedade @code{'upstream-name}.

source: The module @code{(guix build-system elm)} provides the following utilities for working with names and related conventions:
it: Il modulo @code{(guix build-system elm)} fornisce le seguenti utilità per lavorare con i nomi e le convenzioni correlate:
pt_br: O módulo @code{(guix build-system elm)} fornece os seguintes utilitários para trabalhar com nomes e convenções relacionadas:

source: {Procedure} elm-package-origin @var{elm-name} @var{version} @
pt_br: {Procedimento} elm-package-origin @var{nome-elm} @var{versão} @

source: @var{hash} Returns a Git origin using the repository naming and tagging regime required for a published Elm package with the upstream name @var{elm-name} at version @var{version} with sha256 checksum @var{hash}.
it: @var{hash} Restituisce un'origine Git usando il regime di denominazione e tagging del repository richiesto per un pacchetto Elm pubblicato con il nome upstream @var{elm-name} alla versione @var{version} con checksum sha256 @var{hash}.
pt_br: @var{hash} Retorna uma origem Git usando o regime de nomenclatura e marcação de repositório necessário para um pacote Elm publicado com o nome upstream @var{nome-elm} na versão @var{versão} com soma de verificação sha256 @var{hash}.

source: For example:
it: Per esempio:
pt_br: Por exemplo:

source: {Procedure} elm->package-name @var{elm-name}
pt_br: {Procedimento} elm->package-name @var{nome-elm}

source: Returns the Guix-style package name for an Elm package with upstream name @var{elm-name}.
it: Restituisce il nome del pacchetto in stile Guix per un pacchetto Elm con nome upstream @var{elm-name}.
pt_br: Retorna o nome do pacote no estilo Guix para um pacote Elm com nome upstream @var{nome-elm}.

source: Note that there is more than one possible @var{elm-name} for which @code{elm->package-name} will produce a given result.
it: Nota che c'è più di un possibile @var{elm-name} per cui @code{elm->package-name} produrrà un dato risultato.
pt_br: Observe que há mais de um @var{nome-elm} possível para o qual @code{elm->package-name} produzirá um determinado resultado.

source: {Procedure} guix-package->elm-name @var{package}
pt_br: {Procedimento} guix-package->elm-name @var{pacote}

source: Given an Elm @var{package}, returns the possibly-inferred upstream name, or @code{#f} the upstream name is not specified via the @code{'upstream-name} property and can not be inferred by @code{infer-elm-package-name}.
it: Dato un @var{package} Elm, restituisce il nome upstream possibilmente inferito, o @code{#f} se il nome upstream non è specificato tramite la proprietà @code{'upstream-name} e non può essere inferito da @code{infer-elm-package-name}.
pt_br: Dado um Elm @var{pacote}, retorna o nome upstream possivelmente inferido, ou @code{#f} o nome upstream não é especificado por meio da propriedade @code{'upstream-name} e não pode ser inferido por @code{infer-elm-package-name}.

source: {Procedure} infer-elm-package-name @var{guix-name}
pt_br: {Procedimento} infer-elm-package-name @var{guix-name}

source: Given the @var{guix-name} of an Elm package, returns the inferred upstream name, or @code{#f} if the upstream name can't be inferred. If the result is not @code{#f}, supplying it to @code{elm->package-name} would produce @var{guix-name}.
it: Dato il @var{guix-name} di un pacchetto Elm, restituisce il nome upstream inferito, o @code{#f} se il nome upstream non può essere inferito. Se il risultato non è @code{#f}, fornendolo a @code{elm->package-name} si otterrebbe @var{guix-name}.
pt_br: Dado o @var{guix-name} de um pacote Elm, retorna o nome upstream inferido, ou @code{#f} se o nome upstream não puder ser inferido. Se o resultado não for @code{#f}, fornecê-lo a @code{elm->package-name} produziria @var{guix-name}.

source: fonts
it: font
pt_br: fontes

source: For fonts that are in general not installed by a user for typesetting purposes, or that are distributed as part of a larger software package, we rely on the general packaging rules for software; for instance, this applies to the fonts delivered as part of the X.Org system or fonts that are part of TeX Live.
it: Per i font che in generale non sono installati da un utente per scopi di composizione tipografica, o che sono distribuiti come parte di un pacchetto software più grande, ci basiamo sulle regole generali di pacchettizzazione per il software; ad esempio, questo si applica ai font forniti come parte del sistema X.Org o ai font che fanno parte di TeX Live.
pt_br: Para fontes que geralmente não são instaladas por um usuário para fins de digitação ou que são distribuídas como parte de um pacote de software maior, contamos com as regras gerais de empacotamento de software; por exemplo, isso se aplica às fontes entregues como parte do sistema X.Org ou às fontes que fazem parte do TeX Live.

source: To make it easier for a user to search for fonts, names for other packages containing only fonts are constructed as follows, independently of the upstream package name.
it: Per facilitare la ricerca dei font da parte dell'utente, i nomi degli altri pacchetti che contengono solo font sono costruiti come segue, indipendentemente dal nome del pacchetto upstream.
pt_br: Para facilitar a busca de fontes por um usuário, os nomes de outros pacotes contendo apenas fontes são compilados da seguinte maneira, independentemente do nome do pacote upstream.

source: The name of a package containing only one font family starts with @code{font-}; it is followed by the foundry name and a dash @code{-} if the foundry is known, and the font family name, in which spaces are replaced by dashes (and as usual, all upper case letters are transformed to lower case). For example, the Gentium font family by SIL is packaged under the name @code{font-sil-gentium}.
it: Il nome di un pacchetto che contiene una sola famiglia di font inizia con @code{font-}; è seguito dal nome della fonderia e da un trattino @code{-} se la fonderia è nota, e dal nome della famiglia di font, in cui gli spazi sono sostituiti da trattini (e come al solito, tutte le lettere maiuscole sono trasformate in minuscole). Ad esempio, la famiglia di font Gentium di SIL è pacchettizzata con il nome @code{font-sil-gentium}.
pt_br: O nome de um pacote que contém apenas uma família de fontes começa com @code{font-}; é seguido pelo nome da fundição e um traço @code{-} se a fundição for conhecida e o nome da família da fonte, em que os espaços são substituídos por hífenes (e, como sempre, todas as letras maiúsculas são transformadas em minúsculas). Por exemplo, a família de fontes Gentium da SIL é empacotada com o nome @code{font-sil-gentium}.

source: For a package containing several font families, the name of the collection is used in the place of the font family name. For instance, the Liberation fonts consist of three families, Liberation Sans, Liberation Serif and Liberation Mono. These could be packaged separately under the names @code{font-liberation-sans} and so on; but as they are distributed together under a common name, we prefer to package them together as @code{font-liberation}.
it: Per un pacchetto che contiene diverse famiglie di font, il nome della collezione viene usato al posto del nome della famiglia di font. Ad esempio, i font Liberation consistono di tre famiglie, Liberation Sans, Liberation Serif e Liberation Mono. Questi potrebbero essere pacchettizzati separatamente con i nomi @code{font-liberation-sans} e così via; ma poiché sono distribuiti insieme sotto un nome comune, preferiamo pacchettizzarli insieme come @code{font-liberation}.
pt_br: Para um pacote que contém várias famílias de fontes, o nome da coleção é usado no lugar do nome da família de fontes. Por exemplo, as fontes Liberation consistem em três famílias, Liberation Sans, Liberation Serif e Liberation Mono. Eles podem ser empacotados separadamente com os nomes @code{font-liberation-sans} e assim por diante; mas como eles são distribuídos juntos com um nome comum, preferimos agrupá-los como @code{font-liberation}.

source: In the case where several formats of the same font family or font collection are packaged separately, a short form of the format, prepended by a dash, is added to the package name. We use @code{-ttf} for TrueType fonts, @code{-otf} for OpenType fonts and @code{-type1} for PostScript Type 1 fonts.
it: Nel caso in cui diversi formati della stessa famiglia di font o collezione di font siano pacchettizzati separatamente, una forma breve del formato, preceduta da un trattino, viene aggiunta al nome del pacchetto. Usiamo @code{-ttf} per i font TrueType, @code{-otf} per i font OpenType e @code{-type1} per i font PostScript Type 1.
pt_br: No caso de vários formatos da mesma família ou coleção de fontes serem empacotados separadamente, um formato abreviado do formato, precedido por um traço, é adicionado ao nome do pacote. Usamos @code{-ttf} para fontes TrueType, @code{-otf} para fontes OpenType e @code{-type1} para fontes PostScript Type 1.

source: In general our code follows the GNU Coding Standards (@pxref{Top,,, standards, GNU Coding Standards}). However, they do not say much about Scheme, so here are some additional rules.
it: In generale il nostro codice segue gli standard di codifica GNU (@pxref{Top,,, standards, GNU Coding Standards}). Tuttavia, non dicono molto su Scheme, quindi ecco alcune regole aggiuntive.
pt_br: Em geral, nosso código segue os Padrões de Codificação GNU (@pxref{Top ,,, standards, GNU Coding Standards}). No entanto, eles não dizem muito sobre Scheme, então aqui estão algumas regras adicionais.

source: Programming Paradigm
it: Paradigma di programmazione
pt_br: Paradigma de programação

source: How to compose your elements.
it: Come comporre i tuoi elementi.
pt_br: Como compor seus elementos.

source: Modules
it: Moduli
pt_br: Módulos

source: Where to store your code?
it: Dove conservare il tuo codice?
pt_br: Onde armazenar seu código?

source: Data Types and Pattern Matching
it: Tipi di dati e pattern matching
pt_br: Tipos de dados e correspondência de padrão

source: Implementing data structures.
it: Implementazione di strutture dati.
pt_br: Implementação de estruturas de dados.

source: Formatting Code
it: Formattazione del codice
pt_br: Formatação de código

source: Writing conventions.
it: Convenzioni di scrittura.
pt_br: Convenções de escrita.

source: Scheme code in Guix is written in a purely functional style. One exception is code that involves input/output, and procedures that implement low-level concepts, such as the @code{memoize} procedure.
it: Il codice Scheme in Guix è scritto in uno stile puramente funzionale. Un'eccezione è il codice che coinvolge l'input/output e le procedure che implementano concetti a basso livello, come la procedura @code{memoize}.
pt_br: O código Scheme no Guix é escrito em um estilo puramente funcional. Uma exceção é o código que envolve entrada/saída e procedimentos que implementam conceitos de baixo nível, como o procedimento @code{memoize}.

source: build-side modules
it: moduli lato-build
pt_br: módulos da banda de compilação

source: host-side modules
it: moduli lato-host
pt_br: módulos do lado do host

source: Guile modules that are meant to be used on the builder side must live in the @code{(guix build @dots{})} name space. They must not refer to other Guix or GNU modules. However, it is OK for a ``host-side'' module to use a build-side module. As an example, the @code{(guix search-paths)} module should not be imported and used by a package since it isn't meant to be used as a ``build-side'' module. It would also couple the module with the package's dependency graph, which is undesirable.
it: I moduli Guile destinati a essere usati sul lato del costruttore devono vivere nello spazio dei nomi @code{(guix build @dots{})}. Non devono fare riferimento ad altri moduli Guix o GNU. Tuttavia, è accettabile che un modulo ``lato-host'' usi un modulo lato-build. Ad esempio, il modulo @code{(guix search-paths)} non dovrebbe essere importato e usato da un pacchetto poiché non è destinato a essere usato come un modulo ``lato-build''. Ciò accoppierebbe anche il modulo con il grafo delle dipendenze del pacchetto, il che è indesiderabile.
pt_br: Os módulos do Guile que devem ser usados no lado do compilador devem residir no espaço de nomes @code{(guix build @dots{})}. Eles não devem fazer referência a outros módulos Guix ou GNU. No entanto, é aceitável que um módulo no lado do ``hospedeiro'' use um módulo na banda do compilador. Como um exemplo, o módulo @code{(guix search-paths)} não deveria ser importado e usado por um pacote desde que o mesmo não é feito para ser usado como módulo da ``banda de compilação''. Isso também acoplaria o módulo ao grafo de pacotes de dependência, o que não é desejado.

source: Modules that deal with the broader GNU system should be in the @code{(gnu @dots{})} name space rather than @code{(guix @dots{})}.
it: I moduli che si occupano del sistema GNU più ampio dovrebbero trovarsi nello spazio dei nomi @code{(gnu @dots{})} piuttosto che in @code{(guix @dots{})}.
pt_br: Módulos que lidam com o sistema GNU mais amplo devem estar no espaço de nome @code{(gnu @dots{})} em vez de @code{(guix @dots{})}.
