Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The example below shows how to add a package as a native input of itself when cross-compiling:
pt_br: O exemplo abaixo mostra como adicionar um pacote como uma entrada nativa de si mesmo durante a compilação cruzada:

source: ;; When cross-compiled, Guile, for example, depends on ;; a native version of itself. Add it here. (native-inputs (if (%current-target-system) (list this-package) '())))
pt_br: ;; Quando compilado de forma cruzada, Guile, por exemplo, depende de ;; uma versão nativa de si mesmo. Adicione aqui. (native-inputs (if (%current-target-system) (list this-package) '())))

source: It is an error to refer to @code{this-package} outside a package definition.
pt_br: É um erro fazer referência a @code{this-package} fora de uma definição de pacote.

source: The following helper procedures are provided to help deal with package inputs.
pt_br: Os seguintes procedimentos auxiliares são fornecidos para ajudar a lidar com entradas de pacotes.

source: {Procedure} lookup-package-input package name
pt_br: {Procedimento} lookup-package-input pacote nome

source: {Procedure} lookup-package-native-input package name
pt_br: {Procedimento} lookup-package-native-input pacote nome

source: {Procedure} lookup-package-propagated-input package name
pt_br: {Procedimento} lookup-package-propagated-input pacote nome

source: {Procedure} lookup-package-direct-input package name
pt_br: {Procedimento} lookup-package-direct-input pacote nome

source: Look up @var{name} among @var{package}'s inputs (or native, propagated, or direct inputs). Return it if found, @code{#f} otherwise.
pt_br: Procure @var{nome} entre as entradas de @var{pacote} (ou entradas nativas, propagadas ou diretas). Retorne-o se encontrado, @code{#f} caso contrário.

source: In this example we obtain the @code{gmp} package that is among the direct inputs of @code{coreutils}.
pt_br: Neste exemplo, obtemos o pacote @code{gmp} que está entre as entradas diretas de @code{coreutils}.

source: Sometimes you will want to obtain the list of inputs needed to @emph{develop} a package---all the inputs that are visible when the package is compiled. This is what the @code{package-development-inputs} procedure returns.
pt_br: Às vezes, você vai querer obter a lista de entradas necessárias para @emph{desenvolver} um pacote---todas as entradas que são visíveis quando o pacote é compilado. É isso que o procedimento @code{package-development-inputs} retorna.

source: {Procedure} package-development-inputs package [system] [#:target #f]
pt_br: {Procedimento} package-development-inputs pacote [sistema] [#:target #f]

source: Return the list of inputs required by @var{package} for development purposes on @var{system}. When @var{target} is true, return the inputs needed to cross-compile @var{package} from @var{system} to @var{target}, where @var{target} is a triplet such as @code{"aarch64-linux-gnu"}.
pt_br: Retorna a lista de entradas necessárias para @var{pacote} para fins de desenvolvimento em @var{sistema}. Quando @var{target} é verdadeiro, retorna as entradas necessárias para compilar cruzadamente @var{pacote} de @var{sistema} para o alvo @var{target}, onde @var{target} é um tripleto como @code{"aarch64-linux-gnu"}.

source: Note that the result includes both explicit inputs and implicit inputs---inputs automatically added by the build system (@pxref{Build Systems}). Let us take the @code{hello} package to illustrate that:
pt_br: Note que o resultado inclui entradas explícitas e entradas implícitas---entradas adicionadas automaticamente pelo sistema de construção (@pxref{Build Systems}). Vamos pegar o pacote @code{hello} para ilustrar isso:

source: In this example, @code{package-direct-inputs} returns the empty list, because @code{hello} has zero explicit dependencies. Conversely, @code{package-development-inputs} includes inputs implicitly added by @code{gnu-build-system} that are required to build @code{hello}: tar, gzip, GCC, libc, Bash, and more. To visualize it, @command{guix graph hello} would show you explicit inputs, whereas @command{guix graph -t bag hello} would include implicit inputs (@pxref{Invoking guix graph}).
pt_br: Neste exemplo, @code{package-direct-inputs} retorna a lista vazia, porque @code{hello} tem zero dependências explícitas. Por outro lado, @code{package-development-inputs} inclui entradas adicionadas implicitamente por @code{gnu-build-system} que são necessárias para construir @code{hello}: tar, gzip, GCC, libc, Bash e mais. Para visualizá-lo, @command{guix graph hello} mostraria entradas explícitas, enquanto @command{guix graph -t bag hello} incluiria entradas implícitas (@pxref{Invoking guix graph}).

source: Because packages are regular Scheme objects that capture a complete dependency graph and associated build procedures, it is often useful to write procedures that take a package and return a modified version thereof according to some parameters. Below are a few examples.
pt_br: Como os pacotes são objetos Scheme regulares que capturam um grafo de dependência completo e procedimentos de construção associados, geralmente é útil escrever procedimentos que pegam um pacote e retornam uma versão modificada dele de acordo com alguns parâmetros. Abaixo estão alguns exemplos.

source: tool chain, choosing a package's tool chain
pt_br: cadeia de ferramentas, escolhendo a cadeia de ferramentas de um pacote

source: {Procedure} package-with-c-toolchain package toolchain
pt_br: {Procedimento} package-with-c-toolchain pacote cadeia

source: Return a variant of @var{package} that uses @var{toolchain} instead of the default GNU C/C++ toolchain. @var{toolchain} must be a list of inputs (label/package tuples) providing equivalent functionality, such as the @code{gcc-toolchain} package.
pt_br: Retorna uma variante de @var{pacote} que usa @var{cadeia} de ferramentas em vez da cadeia de ferramentas padrão GNU C/C++. @var{cadeia} deve ser uma lista de entradas (tuplas de rótulo/pacote) que fornecem funcionalidade equivalente, como o pacote @code{gcc-toolchain}.

source: The example below returns a variant of the @code{hello} package built with GCC@tie{}10.x and the rest of the GNU tool chain (Binutils and the GNU C Library) instead of the default tool chain:
pt_br: O exemplo abaixo retorna uma variante do pacote @code{hello} criado com GCC@tie{}10.x e o restante da cadeia de ferramentas GNU (Binutils e a Biblioteca C GNU) em vez da cadeia de ferramentas padrão:

source: The build tool chain is part of the @dfn{implicit inputs} of packages---it's usually not listed as part of the various ``inputs'' fields and is instead pulled in by the build system. Consequently, this procedure works by changing the build system of @var{package} so that it pulls in @var{toolchain} instead of the defaults. @xref{Build Systems}, for more on build systems.
pt_br: A cadeia de ferramentas de construção é parte das @dfn{entradas implícitas} dos pacotes---geralmente não é listada como parte dos vários campos ``entradas'' e, em vez disso, é puxada pelo sistema de construção. Consequentemente, esse procedimento funciona alterando o sistema de construção de @var{pacote} para que ele puxe @var{cadeia} de ferramentas em vez dos padrões. @xref{Build Systems}, para mais informações sobre sistemas de construção.

source: @code{origin} Reference
pt_br: Referência do @code{origin}

source: This section documents @dfn{origins}. An @code{origin} declaration specifies data that must be ``produced''---downloaded, usually---and whose content hash is known in advance. Origins are primarily used to represent the source code of packages (@pxref{Defining Packages}). For that reason, the @code{origin} form allows you to declare patches to apply to the original source code as well as code snippets to modify it.
pt_br: Esta seção documenta @dfn{origens}. Uma declaração @code{origin} especifica dados que devem ser ``produzidos''---baixados, normalmente---e cujo hash de conteúdo é conhecido com antecedência. Origens são usados principalmente para representar o código-fonte de pacotes (@pxref{Defining Packages}). Por esse motivo, o formulário @code{origin} permite que você declare remendos para aplicar ao código-fonte original, bem como trechos de código para modificá-lo.

source: {Data Type} origin
pt_br: {Tipo de dados} origin

source: This is the data type representing a source code origin.
pt_br: Este é o tipo de dado que representa a origem do código-fonte.

source: An object containing the URI of the source. The object type depends on the @code{method} (see below). For example, when using the @var{url-fetch} method of @code{(guix download)}, the valid @code{uri} values are: a URL represented as a string, or a list thereof.
pt_br: Um objeto contendo o URI da fonte. O tipo de objeto depende do @code{method} (veja abaixo). Por exemplo, ao usar o método @var{url-fetch} de @code{(guix download)}, os valores válidos de @code{uri} são: uma URL representada como uma string, ou uma lista delas.

source: fixed-output derivations, for download
pt_br: derivações de saída fixa, para download

source: A monadic procedure that handles the given URI@. The procedure must accept at least three arguments: the value of the @code{uri} field and the hash algorithm and hash value specified by the @code{hash} field. It must return a store item or a derivation in the store monad (@pxref{The Store Monad}); most methods return a fixed-output derivation (@pxref{Derivations}).
pt_br: Um procedimento monádico que manipula o URI fornecido. O procedimento deve aceitar pelo menos três argumentos: o valor do campo @code{uri} e o algoritmo de hash e o valor de hash especificados pelo campo @code{hash}. Ele deve retornar um item do armazém ou uma derivação na mônada do armazém (@pxref{The Store Monad}); a maioria dos métodos retorna uma derivação de saída fixa (@pxref{Derivations}).

source: Commonly used methods include @code{url-fetch}, which fetches data from a URL, and @code{git-fetch}, which fetches data from a Git repository (see below).
pt_br: Os métodos comumente usados incluem @code{url-fetch}, que busca dados de uma URL, e @code{git-fetch}, que busca dados de um repositório Git (veja abaixo).

source: A bytevector containing the SHA-256 hash of the source. This is equivalent to providing a @code{content-hash} SHA256 object in the @code{hash} field described below.
pt_br: Um bytevector contendo o hash SHA-256 da fonte. Isso é equivalente a fornecer um objeto SHA256 @code{content-hash} no campo @code{hash} descrito abaixo.

source: The @code{content-hash} object of the source---see below for how to use @code{content-hash}.
pt_br: O objeto @code{content-hash} da fonte — veja abaixo como usar @code{content-hash}.

source: @code{file-name} (default: @code{#f})
pt_br: @code{file-name} (padrão: @code{#f})

source: The file name under which the source code should be saved. When this is @code{#f}, a sensible default value will be used in most cases. In case the source is fetched from a URL, the file name from the URL will be used. For version control checkouts, it is recommended to provide the file name explicitly because the default is not very descriptive.
pt_br: O nome do arquivo sob o qual o código-fonte deve ser salvo. Quando for @code{#f}, um valor padrão sensato será usado na maioria dos casos. Caso a fonte seja obtida de uma URL, o nome do arquivo da URL será usado. Para checkouts de controle de versão, é recomendado fornecer o nome do arquivo explicitamente porque o padrão não é muito descritivo.

source: @code{patches} (default: @code{'()})
pt_br: @code{patches} (padrão: @code{'()})

source: A list of file names, origins, or file-like objects (@pxref{G-Expressions, file-like objects}) pointing to patches to be applied to the source.
pt_br: Uma lista de nomes de arquivos, origens ou objetos tipo arquivo (@pxref{G-Expressions, objetos tipo arquivo}) apontando para remendos a serem aplicados à origem.

source: This list of patches must be unconditional. In particular, it cannot depend on the value of @code{%current-system} or @code{%current-target-system}.
pt_br: Esta lista de remendos deve ser incondicional. Em particular, não pode depender do valor de @code{%current-system} ou @code{%current-target-system}.

source: @code{snippet} (default: @code{#f})
pt_br: @code{snippet} (padrão: @code{#f})

source: A G-expression (@pxref{G-Expressions}) or S-expression that will be run in the source directory. This is a convenient way to modify the source, sometimes more convenient than a patch.
pt_br: Uma expressão G (@pxref{G-Expressions}) ou expressão S que será executada no diretório de origem. Esta é uma maneira conveniente de modificar a origem, às vezes mais conveniente do que um patch.

source: @code{patch-flags} (default: @code{'("-p1")})
pt_br: @code{patch-flags} (padrão: @code{'("-p1")})

source: A list of command-line flags that should be passed to the @code{patch} command.
pt_br: Uma lista de sinalizadores de linha de comando que devem ser passados para o comando @code{patch}.

source: @code{patch-inputs} (default: @code{#f})
pt_br: @code{patch-inputs} (padrão: @code{#f})

source: Input packages or derivations to the patching process. When this is @code{#f}, the usual set of inputs necessary for patching are provided, such as GNU@tie{}Patch.
pt_br: Pacotes de entrada ou derivações para o processo de patching. Quando este é @code{#f}, o conjunto usual de entradas necessárias para patching é fornecido, como GNU@tie{}Patch.

source: @code{modules} (default: @code{'()})
pt_br: @code{modules} (padrão: @code{'()})

source: A list of Guile modules that should be loaded during the patching process and while running the code in the @code{snippet} field.
pt_br: Uma lista de módulos Guile que devem ser carregados durante o processo de aplicação de remendos e durante a execução do código no campo @code{snippet}.

source: @code{patch-guile} (default: @code{#f})
pt_br: @code{patch-guile} (padrão: @code{#f})

source: The Guile package that should be used in the patching process. When this is @code{#f}, a sensible default is used.
pt_br: O pacote Guile que deve ser usado no processo de patching. Quando este é @code{#f}, um padrão sensato é usado.

source: {Data Type} content-hash @var{value} [@var{algorithm}]
pt_br: {Tipo de dados} content-hash @var{valor} [@var{algoritmo}]

source: Construct a content hash object for the given @var{algorithm}, and with @var{value} as its hash value. When @var{algorithm} is omitted, assume it is @code{sha256}.
pt_br: Construa um objeto hash de conteúdo para o @var{algoritmo} fornecido, e com @var{valor} como seu valor hash. Quando @var{algoritmo} é omitido, presuma que é @code{sha256}.

source: @var{value} can be a literal string, in which case it is base32-decoded, or it can be a bytevector.
pt_br: @var{valor} pode ser uma string literal, nesse caso ela é decodificada em base32, ou pode ser um bytevector.

source: The following forms are all equivalent:
pt_br: Os seguintes formulários são todos equivalentes:

source: Technically, @code{content-hash} is currently implemented as a macro. It performs sanity checks at macro-expansion time, when possible, such as ensuring that @var{value} has the right size for @var{algorithm}.
pt_br: Tecnicamente, @code{content-hash} é atualmente implementado como uma macro. Ele realiza verificações de sanidade no momento da expansão da macro, quando possível, como garantir que @var{valor} tenha o tamanho certo para @var{algoritmo}.

source: As we have seen above, how exactly the data an origin refers to is retrieved is determined by its @code{method} field. The @code{(guix download)} module provides the most common method, @code{url-fetch}, described below.
pt_br: Como vimos acima, como exatamente os dados aos quais uma origem se refere são recuperados é determinado pelo seu campo @code{method}. O módulo @code{(guix download)} fornece o método mais comum, @code{url-fetch}, descrito abaixo.

source: {Procedure} url-fetch url hash-algo hash [name] [#:executable? #f]
pt_br: {Procedimento} url-fetch url hash-algo hash [nome] [#:executable?? #f]

source: Return a fixed-output derivation that fetches data from @var{url} (a string, or a list of strings denoting alternate URLs), which is expected to have hash @var{hash} of type @var{hash-algo} (a symbol). By default, the file name is the base name of URL; optionally, @var{name} can specify a different file name. When @var{executable?} is true, make the downloaded file executable.
pt_br: Retorna uma derivação de saída fixa que busca dados de @var{url} (uma string, ou uma lista de strings denotando URLs alternativas), que deve ter hash @var{hash} do tipo @var{hash-algo} (um símbolo). Por padrão, o nome do arquivo é o nome base de URL; opcionalmente, @var{nome} pode especificar um nome de arquivo diferente. Quando @var{executable?} é verdadeiro, torna o arquivo baixado executável.

source: When one of the URL starts with @code{mirror://}, then its host part is interpreted as the name of a mirror scheme, taken from @file{%mirror-file}.
pt_br: Quando uma das URLs começa com @code{mirror://}, sua parte host é interpretada como o nome de um esquema de espelho, obtido de @file{%mirror-file}.

source: Alternatively, when URL starts with @code{file://}, return the corresponding file name in the store.
pt_br: Como alternativa, quando a URL começa com @code{file://}, retorne o nome do arquivo correspondente no armazém.

source: Likewise, the @code{(guix git-download)} module defines the @code{git-fetch} origin method, which fetches data from a Git version control repository, and the @code{git-reference} data type to describe the repository and revision to fetch.
pt_br: Da mesma forma, o módulo @code{(guix git-download)} define o método de origem @code{git-fetch}, que busca dados de um repositório de controle de versão Git, e o tipo de dados @code{git-reference} para descrever o repositório e a revisão a serem buscados.

source: {Procedure} git-fetch ref hash-algo hash [name]
pt_br: {Procedimento} git-fetch ref hash-algo hash [nome]

source: Return a fixed-output derivation that fetches @var{ref}, a @code{<git-reference>} object. The output is expected to have recursive hash @var{hash} of type @var{hash-algo} (a symbol). Use @var{name} as the file name, or a generic name if @code{#f}.
pt_br: Retorna uma derivação de saída fixa que busca @var{ref}, um objeto @code{<git-reference>}. Espera-se que a saída tenha hash recursivo @var{hash} do tipo @var{hash-algo} (um símbolo). Use @var{nome} como o nome do arquivo, ou um nome genérico se @code{#f}.

source: {Procedure} git-fetch/lfs ref hash-algo hash [name]
pt_br: {Procedimento} git-fetch/lfs ref hash-algo hash [nome]

source: This is a variant of the @code{git-fetch} procedure that supports the Git @acronym{LFS, Large File Storage} extension. This may be useful to pull some binary test data to run the test suite of a package, for example.
pt_br: Esta é uma variante do procedimento @code{git-fetch} que suporta a extensão Git @acronym{LFS, Large File Storage}. Isso pode ser útil para extrair alguns dados de teste binários para executar o conjunto de testes de um pacote, por exemplo.

source: {Data Type} git-reference
pt_br: {Tipo de dados} git-reference

source: This data type represents a Git reference for @code{git-fetch} to retrieve.
pt_br: Este tipo de dado representa uma referência Git para @code{git-fetch} a recuperar.

source: The URL of the Git repository to clone.
pt_br: A URL do repositório Git a ser clonado.

source: This string denotes either the commit to fetch (a hexadecimal string), or the tag to fetch. You can also use a ``short'' commit ID or a @command{git describe} style identifier such as @code{v1.0.1-10-g58d7909c97}.
pt_br: Esta string denota o commit a ser buscado (uma string hexadecimal) ou a tag a ser buscada. Você também pode usar um ID de commit ``curto'' ou um identificador de estilo @command{git describe} como @code{v1.0.1-10-g58d7909c97}.

source: @code{recursive?} (default: @code{#f})
pt_br: @code{recursive?} (padrão: @code{#f})

source: This Boolean indicates whether to recursively fetch Git sub-modules.
pt_br: Este booleano indica se os submódulos do Git devem ser buscados recursivamente.

source: The example below denotes the @code{v2.10} tag of the GNU@tie{}Hello repository:
pt_br: O exemplo abaixo denota a tag @code{v2.10} do repositório GNU@tie{}Hello:

source: This is equivalent to the reference below, which explicitly names the commit:
pt_br: Isso é equivalente à referência abaixo, que nomeia explicitamente o commit:

source: For Mercurial repositories, the module @code{(guix hg-download)} defines the @code{hg-fetch} origin method and @code{hg-reference} data type for support of the Mercurial version control system.
pt_br: Para repositórios Mercurial, o módulo @code{(guix hg-download)} define o método de origem @code{hg-fetch} e o tipo de dados @code{hg-reference} para suporte ao sistema de controle de versão Mercurial.

source: {Procedure} hg-fetch ref hash-algo hash [name]
pt_br: {Procedimento} hg-fetch ref hash-algo hash [nome]

source: Return a fixed-output derivation that fetches @var{ref}, a @code{<hg-reference>} object. The output is expected to have recursive hash @var{hash} of type @var{hash-algo} (a symbol). Use @var{name} as the file name, or a generic name if @code{#f}.
pt_br: Retorna uma derivação de saída fixa que busca @var{ref}, um objeto @code{<hg-reference>}. Espera-se que a saída tenha hash recursivo @var{hash} do tipo @var{hash-algo} (um símbolo). Use @var{nome} como o nome do arquivo, ou um nome genérico se @code{#f}.

source: {Data Type} hg-reference
pt_br: {Tipo de dados} hg-reference

source: This data type represents a Mercurial reference for @code{hg-fetch} to retrieve.
pt_br: Este tipo de dado representa uma referência Mercurial para @code{hg-fetch} a recuperar.

source: The URL of the Mercurial repository to clone.
pt_br: A URL do repositório Mercurial a ser clonado.

source: This string denotes the changeset to fetch.
pt_br: Esta sequência de caracteres indica a revisão a ser buscado.

source: For Subversion repositories, the module @code{(guix svn-download)} defines the @code{svn-fetch} origin method and @code{svn-reference} data type for support of the Subversion version control system.
pt_br: Para repositórios Subversion, o módulo @code{(guix svn-download)} define o método de origem @code{svn-fetch} e o tipo de dados @code{svn-reference} para suporte ao sistema de controle de versão Subversion.

source: {Procedure} svn-fetch ref hash-algo hash [name]
pt_br: {Procedimento} svn-fetch ref hash-algo hash [nome]

source: Return a fixed-output derivation that fetches @var{ref}, a @code{<svn-reference>} object. The output is expected to have recursive hash @var{hash} of type @var{hash-algo} (a symbol). Use @var{name} as the file name, or a generic name if @code{#f}.
pt_br: Retorna uma derivação de saída fixa que busca @var{ref}, um objeto @code{<svn-reference>}. Espera-se que a saída tenha hash recursivo @var{hash} do tipo @var{hash-algo} (um símbolo). Use @var{nome} como o nome do arquivo, ou um nome genérico se @code{#f}.

source: {Data Type} svn-reference
pt_br: {Tipo de dados} svn-reference

source: This data type represents a Subversion reference for @code{svn-fetch} to retrieve.
pt_br: Este tipo de dado representa uma referência Subversion para @code{svn-fetch} a recuperar.

source: The URL of the Subversion repository to clone.
pt_br: A URL do repositório Subversion a ser clonado.

source: This string denotes the revision to fetch specified as a number.
pt_br: Esta sequência de caracteres denota a revisão a ser buscada especificada como um número.

source: This Boolean indicates whether to recursively fetch Subversion ``externals''.
pt_br: Este booleano indica se deve-se buscar recursivamente ``externals'' do Subversion.
