Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Because archives produced with @command{guix pack} contain a collection of store items and because each @command{dpkg} package must not have conflicting files, in practice that means you likely won't be able to install more than one such archive on a given system. You can nonetheless pack as many Guix packages as you want in one such archive.
pt_br: Como os arquivos produzidos com @command{guix pack} contêm uma coleção de itens de armazém e como cada pacote @command{dpkg} não deve ter arquivos conflitantes, na prática isso significa que você provavelmente não conseguirá instalar mais de um desses arquivos em um dado sistema. Você pode, no entanto, empacotar quantos pacotes Guix quiser em um desses arquivos.

source: @command{dpkg} will assume ownership of any files contained in the pack that it does @emph{not} know about. It is unwise to install Guix-produced @samp{.deb} files on a system where @file{/gnu/store} is shared by other software, such as a Guix installation or other, non-deb packs.
pt_br: @command{dpkg} assumirá a propriedade de quaisquer arquivos contidos no pacote que ele @emph{não} saiba. Não é sensato instalar arquivos @samp{.deb} produzidos pelo Guix em um sistema onde @file{/gnu/store} é compartilhado por outro software, como uma instalação do Guix ou outras embalagens não deb.

source: RPM, build an RPM archive with guix pack
pt_br: RPM, construa um arquivo RPM com guix pack

source: This produces an RPM archive (a package with the @samp{.rpm} file extension) containing all the specified binaries and symbolic links, that can be installed on top of any RPM-based GNU/Linux distribution. The RPM format embeds checksums for every file it contains, which the @command{rpm} command uses to validate the integrity of the archive.
pt_br: Isso produz um arquivo RPM (um pacote com a extensão de arquivo @samp{.rpm}) contendo todos os binários e ligações simbólicas especificados, que podem ser instalados em cima de qualquer distribuição GNU/Linux baseada em RPM. O formato RPM incorpora somas de verificação para cada arquivo que ele contém, que o comando @command{rpm} usa para validar a integridade do arquivo.

source: Advanced RPM-related options are revealed via the @option{--help-rpm-format} option. These options allow embedding maintainer scripts that can run before or after the installation of the RPM archive, for example.
pt_br: Opções avançadas relacionadas a RPM são reveladas por meio da opção @option{--help-rpm-format}. Essas opções permitem incorporar scripts de mantenedor que podem ser executados antes ou depois da instalação do arquivo RPM, por exemplo.

source: The RPM format supports relocatable packages via the @option{--prefix} option of the @command{rpm} command, which can be handy to install an RPM package to a specific prefix.
pt_br: O formato RPM suporta pacotes relocáveis por meio da opção @option{--prefix} do comando @command{rpm}, o que pode ser útil para instalar um pacote RPM em um prefixo específico.

source: Contrary to Debian packages, conflicting but @emph{identical} files in RPM packages can be installed simultaneously, which means multiple @command{guix pack}-produced RPM packages can usually be installed side by side without any problem.
pt_br: Ao contrário dos pacotes Debian, arquivos conflitantes, mas @emph{idênticos} em pacotes RPM podem ser instalados simultaneamente, o que significa que vários pacotes RPM produzidos pelo @command{guix pack} geralmente podem ser instalados lado a lado sem nenhum problema.

source: @command{rpm} assumes ownership of any files contained in the pack, which means it will remove @file{/gnu/store} upon uninstalling a Guix-generated RPM package, unless the RPM package was installed with the @option{--prefix} option of the @command{rpm} command. It is unwise to install Guix-produced @samp{.rpm} packages on a system where @file{/gnu/store} is shared by other software, such as a Guix installation or other, non-rpm packs.
pt_br: @command{rpm} assume a propriedade de quaisquer arquivos contidos no pacote, o que significa que ele removerá @file{/gnu/store} ao desinstalar um pacote RPM gerado pelo Guix, a menos que o pacote RPM tenha sido instalado com a opção @option{--prefix} do comando @command{rpm}. Não é sensato instalar pacotes @samp{.rpm} produzidos pelo Guix em um sistema onde @file{/gnu/store} é compartilhado por outro software, como uma instalação do Guix ou outras embalagens não rpm.

source: This produces an @uref{https://appimage.org/, AppImage file} with the @samp{.AppImage} extension. AppImage is a SquashFS volume prefixed with a runtime that mounts the SquashFS file system and executes the binary provided with @option{--entry-point}. This results in a self-contained archive that bundles the software and all its requirements into a single file. When the file is made executable it runs the packaged software.
pt_br: Isto produz um @uref{https://appimage.org/, arquivo AppImage} com a extensão @samp{.AppImage}. Um AppImage é um volume SquashFS prefixado com uma execução que monta o sistema de arquivo SquashFS e executa o binário criado com o @option{--entry-point}. Isso resulta num arquivo auto-contido que agrupa o software e todos os requisitos num único arquivo. Quando o mesmo é executado, ele roda o software empacotado.

source: The runtime used by AppImages invokes the @command{fusermount3} command to mount the image quickly. If that command is unavailable, the AppImage fails to run, but it can still be started by passing the @option{--appimage-extract-and-run} flag.
pt_br: A execução usada pelos AppImages invoca o comando @command{fusermount3} para montar a imagem rapidamente. Se o comando está indiponível, o AppImage falha em executar, mas ele ainda pode ser iniciado com a opção @option{--appimage-extract-and-run}.

source: When building an AppImage, always @emph{pass} the @option{--relocatable} option (or @option{-R}, or @option{-RR}) to make sure the image can be used on systems where Guix is not installed. A warning is printed when this option is not used.
pt_br: Ao construir um AppImage, sempre @emph{passe} a opção @option{--relocatable} (ou @option{-R}, ou a @option{-RR}) para ter certeza que a imagem pode ser usada em sistemas onde o Guix não está instalado. Um aviso é impresso quando esta opção não é usada.

source: relocatable binaries
pt_br: binários realocáveis

source: Produce @dfn{relocatable binaries}---i.e., binaries that can be placed anywhere in the file system hierarchy and run from there.
pt_br: Produza @dfn{binários relocáveis}---ou seja, binários que podem ser colocados em qualquer lugar na hierarquia do sistema de arquivos e executados a partir daí.

source: When this option is passed once, the resulting binaries require support for @dfn{user namespaces} in the kernel Linux; when passed @emph{twice}@footnote{Here's a trick to memorize it: @code{-RR}, which adds PRoot support, can be thought of as the abbreviation of ``Really Relocatable''. Neat, isn't it?}, relocatable binaries fall to back to other techniques if user namespaces are unavailable, and essentially work anywhere---see below for the implications.
pt_br: Quando essa opção é passada uma vez, os binários resultantes requerem suporte para @dfn{user namespaces} no kernel Linux; quando passada @emph{duas vezes}@footnote{Aqui vai um truque para memorizá-la: @code{-RR}, que adiciona suporte a PRoot, pode ser pensado como a abreviação de ``Really Relocatable''. Legal, não é?}, binários relocáveis recorrem a outras técnicas se os namespaces de usuário não estiverem disponíveis, e essencialmente funcionam em qualquer lugar---veja abaixo as implicações.

source: For example, if you create a pack containing Bash with:
pt_br: Por exemplo, se você criar uma embalagem contendo Bash com:

source: ...@: you can copy that pack to a machine that lacks Guix, and from your home directory as a normal user, run:
pt_br: ...@: você pode copiar essa embalagem para uma máquina que não tenha Guix e, a partir do seu diretório pessoal, como um usuário normal, executar:

source: In that shell, if you type @code{ls /gnu/store}, you'll notice that @file{/gnu/store} shows up and contains all the dependencies of @code{bash}, even though the machine actually lacks @file{/gnu/store} altogether! That is probably the simplest way to deploy Guix-built software on a non-Guix machine.
pt_br: Nesse shell, se você digitar @code{ls /gnu/store}, você notará que @file{/gnu/store} aparece e contém todas as dependências de @code{bash}, mesmo que a máquina realmente não tenha @file{/gnu/store} completamente! Essa é provavelmente a maneira mais simples de implementar software construído pelo Guix em uma máquina não Guix.

source: By default, relocatable binaries rely on the @dfn{user namespace} feature of the kernel Linux, which allows unprivileged users to mount or change root. Old versions of Linux did not support it, and some GNU/Linux distributions turn it off.
pt_br: Por padrão, binários relocáveis dependem do recurso @dfn{user namespace} do kernel Linux, que permite que usuários sem privilégios montem ou alterem a raiz (chroot). Versões antigas do Linux não o suportavam, e algumas distribuições GNU/Linux o desativam.

source: To produce relocatable binaries that work even in the absence of user namespaces, pass @option{--relocatable} or @option{-R} @emph{twice}. In that case, binaries will try user namespace support and fall back to another @dfn{execution engine} if user namespaces are not supported. The following execution engines are supported:
pt_br: Para produzir binários relocáveis que funcionam mesmo na ausência de namespaces de usuário, passe @option{--relocatable} ou @option{-R} @emph{duas vezes}. Nesse caso, os binários tentarão o suporte a namespaces de usuário e retornarão a outro @dfn{mecanismo de execução} se os namespaces de usuário não forem suportados. Os seguintes mecanismos de execução são suportados:

source: Try user namespaces and fall back to PRoot if user namespaces are not supported (see below).
pt_br: Experimente usar namespaces de usuário e retorne ao PRoot se eles não forem suportados (veja abaixo).

source: Try user namespaces and fall back to Fakechroot if user namespaces are not supported (see below).
pt_br: Experimente usar namespaces de usuário e retorne ao Fakechroot se eles não forem suportados (veja abaixo).

source: Run the program through user namespaces and abort if they are not supported.
pt_br: Execute o programa por meio de namespaces de usuário e aborte se eles não forem suportados.

source: Run through PRoot. The @uref{https://proot-me.github.io/, PRoot} program provides the necessary support for file system virtualization. It achieves that by using the @code{ptrace} system call on the running program. This approach has the advantage to work without requiring special kernel support, but it incurs run-time overhead every time a system call is made.
pt_br: Execute através do PRoot. O programa @uref{https://proot-me.github.io/, PRoot} fornece o suporte necessário para virtualização do sistema de arquivos. Ele consegue isso usando a chamada de sistema @code{ptrace} no programa em execução. Essa abordagem tem a vantagem de funcionar sem exigir suporte especial do kernel, mas incorre em sobrecarga de tempo de execução toda vez que uma chamada de sistema é feita.

source: Run through Fakechroot. @uref{https://github.com/dex4er/fakechroot/, Fakechroot} virtualizes file system accesses by intercepting calls to C library functions such as @code{open}, @code{stat}, @code{exec}, and so on. Unlike PRoot, it incurs very little overhead. However, it does not always work: for example, some file system accesses made from within the C library are not intercepted, and file system accesses made @i{via} direct syscalls are not intercepted either, leading to erratic behavior.
pt_br: Execute através do Fakechroot. @uref{https://github.com/dex4er/fakechroot/, Fakechroot} virtualiza acessos ao sistema de arquivos interceptando chamadas para funções da biblioteca C, como @code{open}, @code{stat}, @code{exec} e assim por diante. Ao contrário do PRoot, ele incorre em muito pouca sobrecarga. No entanto, nem sempre funciona: por exemplo, alguns acessos ao sistema de arquivos feitos de dentro da biblioteca C não são interceptados, e acessos ao sistema de arquivos feitos @i{via} syscalls diretas também não são interceptados, levando a um comportamento errático.

source: When running a wrapped program, you can explicitly request one of the execution engines listed above by setting the @env{GUIX_EXECUTION_ENGINE} environment variable accordingly.
pt_br: Ao executar um programa encapsulado, você pode solicitar explicitamente um dos mecanismos de execução listados acima, definindo a variável de ambiente @env{GUIX_EXECUTION_ENGINE} adequadamente.

source: entry point, for Docker and Singularity images
pt_br: ponto de entrada para imagens Docker e Singularity

source: --entry-point=@var{command}
pt_br: --entry-point=@var{comando}

source: Use @var{command} as the @dfn{entry point} of the resulting pack, if the pack format supports it---currently @code{docker}, @code{appimage}, and @code{squashfs} (Singularity) support it. @var{command} must be relative to the profile contained in the pack.
pt_br: Use @var{comando} como o @dfn{ponto de entrada} da embalagem resultante, se o formato da embalagem for compatível — atualmente, @code{docker}, @code{appimage} e @code{squashfs} (Singularity) o são. @var{comando} deve ser relativo ao perfil contido na embalagem.

source: The entry point specifies the command that tools like @code{docker run} or @code{singularity run} automatically start by default. For example, you can do:
pt_br: O ponto de entrada especifica o comando que ferramentas como @code{docker run} ou @code{singularity run} iniciam automaticamente por padrão. Por exemplo, você pode fazer:

source: The resulting pack can easily be loaded and @code{docker run} with no extra arguments will spawn @code{bin/guile}:
pt_br: A embalagem resultante pode ser facilmente carregado e @code{docker run} sem argumentos extras irá gerar @code{bin/guile}:

source: entry point arguments, for docker images
pt_br: argumentos de ponto de entrada, para imagens docker

source: --entry-point-argument=@var{command}
pt_br: --entry-point-argument=@var{comando}

source: -A @var{command}
pt_br: -A @var{comando}

source: Use @var{command} as an argument to @dfn{entry point} of the resulting pack. This option is only valid in conjunction with @code{--entry-point} and can appear multiple times on the command line.
pt_br: Use @var{comando} como um argumento para @dfn{o ponto de entrada} da embalagem resultante. Esta opção é válida somente em conjunto com @code{--entry-point} e pode aparecer várias vezes na linha de comando.

source: maximum layers argument, for docker images
pt_br: argumento de camadas máximas, para imagens docker

source: Specifies the maximum number of Docker image layers allowed when building an image.
pt_br: Especifica o número máximo de camadas de imagem do Docker permitidas ao criar uma imagem.

source: This option allows you to limit the number of layers in a Docker image. Docker images are comprised of multiple layers, and each layer adds to the overall size and complexity of the image. By setting a maximum number of layers, you can control the following effects:
pt_br: Esta opção permite que você limite o número de camadas em uma imagem Docker. As imagens Docker são compostas de várias camadas, e cada camada adiciona ao tamanho geral e à complexidade da imagem. Ao definir um número máximo de camadas, você pode controlar os seguintes efeitos:

source: Disk Usage:
pt_br: Uso do disco:

source: Increasing the number of layers can help optimize the disk space required to store multiple images built with a similar package graph.
pt_br: Aumentar o número de camadas pode ajudar a otimizar o espaço em disco necessário para armazenar várias imagens criadas com um grafo de pacote semelhante.

source: Pulling:
pt_br: Puxar:

source: When transferring images between different nodes or systems, having more layers can reduce the time required to pull the image.
pt_br: Ao transferir imagens entre diferentes nós ou sistemas, ter mais camadas pode reduzir o tempo necessário para puxar a imagem.

source: Consider the package @var{expr} evaluates to.
pt_br: Considere o pacote que @var{expr} avalia.

source: This has the same purpose as the same-named option in @command{guix build} (@pxref{Additional Build Options, @option{--expression} in @command{guix build}}).
pt_br: Isso tem o mesmo propósito que a opção de mesmo nome em @command{guix build} (@pxref{Additional Build Options, @option{--expression} em @command{guix build}}).

source: Use the packages contained in the manifest object returned by the Scheme code in @var{file}. This option can be repeated several times, in which case the manifests are concatenated.
pt_br: Use os pacotes contidos no objeto manifesto retornado pelo código Scheme em @var{arquivo}. Esta opção pode ser repetida várias vezes, nesse caso os manifestos são concatenados.

source: This has a similar purpose as the same-named option in @command{guix package} (@pxref{profile-manifest, @option{--manifest}}) and uses the same manifest files. It allows you to define a collection of packages once and use it both for creating profiles and for creating archives for use on machines that do not have Guix installed. Note that you can specify @emph{either} a manifest file @emph{or} a list of packages, but not both.
pt_br: Isto tem um propósito similar à opção de mesmo nome em @command{guix package} (@pxref{profile-manifest, @option{--manifest}}) e usa os mesmos arquivos de manifesto. Ele permite que você defina uma coleção de pacotes uma vez e use-a tanto para criar perfis quanto para criar arquivos para uso em máquinas que não tenham o Guix instalado. Note que você pode especificar @emph{ou} um arquivo de manifesto @emph{ou} uma lista de pacotes, mas não ambos.

source: @xref{Writing Manifests}, for information on how to write a manifest. @xref{shell-export-manifest, @command{guix shell --export-manifest}}, for information on how to ``convert'' command-line options into a manifest.
pt_br: @xref{Writing Manifests}, para obter informações sobre como escrever um manifesto. @xref{shell-export-manifest, @command{guix shell --export-manifest}}, para obter informações sobre como ``converter'' opções de linha de comando em um manifesto.

source: --target=@var{triplet}
pt_br: --target=@var{tripleto}

source: cross-compilation
pt_br: compilação cruzada

source: Cross-build for @var{triplet}, which must be a valid GNU triplet, such as @code{"aarch64-linux-gnu"} (@pxref{Specifying target triplets, GNU configuration triplets,, autoconf, Autoconf}).
pt_br: Construção cruzada para @var{tripleto}, que deve ser um tripleto GNU válido, como @code{"aarch64-linux-gnu"} (@pxref{Specifying target triplets, tripletos de configuração GNU, autoconf, Autoconf}).

source: --compression=@var{tool}
pt_br: --compression=@var{ferramenta}

source: -C @var{tool}
pt_br: -C @var{ferramenta}

source: Compress the resulting tarball using @var{tool}---one of @code{gzip}, @code{zstd}, @code{bzip2}, @code{xz}, @code{lzip}, or @code{none} for no compression.
pt_br: Compacte o tarball resultante usando @var{ferramenta}---um dos seguintes: @code{gzip}, @code{zstd}, @code{bzip2}, @code{xz}, @code{lzip} ou @code{none} para nenhuma compactação.

source: Add the symlinks specified by @var{spec} to the pack. This option can appear several times.
pt_br: Adicione os symlinks especificados por @var{spec} à embalagem. Esta opção pode aparecer várias vezes.

source: @var{spec} has the form @code{@var{source}=@var{target}}, where @var{source} is the symlink that will be created and @var{target} is the symlink target.
pt_br: @var{spec} tem o formato @code{@var{fonte}=@var{alvo}}, onde @var{fonte} é a ligação simbólica que será criado e @var{alvo} é o destino da ligação simbólica.

source: For instance, @code{-S /opt/gnu/bin=bin} creates a @file{/opt/gnu/bin} symlink pointing to the @file{bin} sub-directory of the profile.
pt_br: Por exemplo, @code{-S /opt/gnu/bin=bin} cria uma ligação simbólica @file{/opt/gnu/bin} apontanda para o subdiretório @file{bin} do perfil.

source: Save provenance information for the packages passed on the command line. Provenance information includes the URL and commit of the channels in use (@pxref{Channels}).
pt_br: Salvar informações de procedência para os pacotes passados na linha de comando. As informações de procedência incluem a URL e o commit dos canais em uso (@pxref{Channels}).

source: Provenance information is saved in the @file{/gnu/store/@dots{}-profile/manifest} file in the pack, along with the usual package metadata---the name and version of each package, their propagated inputs, and so on. It is useful information to the recipient of the pack, who then knows how the pack was (supposedly) obtained.
pt_br: As informações de procedência são salvas no arquivo @file{/gnu/store/@dots{}-profile/manifest} na embalagem, junto com os metadados usuais do pacote --- o nome e a versão de cada pacote, suas entradas propagadas e assim por diante. São informações úteis para o destinatário da embalagem, que então sabe como a embalagem foi (supostamente) obtida.

source: This option is not enabled by default because, like timestamps, provenance information contributes nothing to the build process. In other words, there is an infinity of channel URLs and commit IDs that can lead to the same pack. Recording such ``silent'' metadata in the output thus potentially breaks the source-to-binary bitwise reproducibility property.
pt_br: Esta opção não é habilitada por padrão porque, assim como os timestamps, as informações de proveniência não contribuem em nada para o processo de construção. Em outras palavras, há uma infinidade de URLs de canais e IDs de commit que podem levar à mesma embalagem. Gravar esses metadados ``silenciosos'' na saída, portanto, potencialmente quebra a propriedade de reprodutibilidade bit a bit de origem para binário.

source: garbage collector root, for packs
pt_br: raiz do coletor de lixo, para embalagens

source: Make @var{file} a symlink to the resulting pack, and register it as a garbage collector root.
pt_br: Crie @var{arquivo} como uma ligação simbólica para a embalagem resultante e registre-a como uma raiz do coletor de lixo.

source: --profile-name=@var{name}
pt_br: --profile-name=@var{nome}

source: Include the ``local state directory'', @file{/var/guix}, in the resulting pack, and notably the @file{/var/guix/profiles/per-user/root/@var{name}} profile---by default @var{name} is @code{guix-profile}, which corresponds to @file{~root/.guix-profile}.
pt_br: Inclua o ``diretório de estado local'', @file{/var/guix}, na embalagem resultante, e principalmente o perfil @file{/var/guix/profiles/per-user/root/@var{nome}} --- por padrão, @var{nome} é @code{guix-profile}, que corresponde a @file{~root/.guix-profile}.

source: @file{/var/guix} contains the store database (@pxref{The Store}) as well as garbage-collector roots (@pxref{Invoking guix gc}). Providing it in the pack means that the store is ``complete'' and manageable by Guix; not providing it in the pack means that the store is ``dead'': items cannot be added to it or removed from it after extraction of the pack.
pt_br: @file{/var/guix} contém o banco de dados do armazém (@pxref{The Store}), bem como as raízes do coletor de lixo (@pxref{Invoking guix gc}). Fornecê-lo na embalagem significa que o armazém está ``completo'' e gerenciável pelo Guix; não fornecê-lo na embalagem significa que o armazém está ``morto'': itens não podem ser adicionados a ele ou removidos dele após a extração da embalagem.
