Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: The tendency in classical Lisp is to use lists to represent everything, and then to browse them ``by hand'' using @code{car}, @code{cdr}, @code{cadr}, and co. There are several problems with that style, notably the fact that it is hard to read, error-prone, and a hindrance to proper type error reports.
it: La tendenza nel Lisp classico è di usare le liste per rappresentare tutto, e poi di sfogliarle ``a mano'' usando @code{car}, @code{cdr}, @code{cadr} e co. Ci sono diversi problemi con questo stile, in particolare il fatto che è difficile da leggere, incline a errori e un ostacolo a corrette segnalazioni di errore di tipo.
pt_br: A tendência no Lisp clássico é usar listas para representar tudo e, em seguida, pesquisá-las ``à mão'' usando @code{car}, @code{cdr}, @code{cadr} e co. Existem vários problemas com esse estilo, notadamente o fato de que é difícil de ler, propenso a erros e um obstáculo para os relatórios de erros de tipos adequados.

source: pattern matching
pt_br: correspondência de padrão

source: Guix code should define appropriate data types (for instance, using @code{define-record-type*}) rather than abuse lists. In addition, it should use pattern matching, via Guile’s @code{(ice-9 match)} module, especially when matching lists (@pxref{Pattern Matching,,, guile, GNU Guile Reference Manual}); pattern matching for records is better done using @code{match-record} from @code{(guix records)}, which, unlike @code{match}, verifies field names at macro-expansion time.
it: Il codice Guix dovrebbe definire tipi di dati appropriati (ad esempio, usando @code{define-record-type*}) piuttosto che abusare delle liste. Inoltre, dovrebbe usare il pattern matching, tramite il modulo @code{(ice-9 match)} di Guile, specialmente quando si abbinano le liste (@pxref{Pattern Matching,,, guile, GNU Guile Reference Manual}); il pattern matching per i record è meglio farlo usando @code{match-record} da @code{(guix records)}, che, a differenza di @code{match}, verifica i nomi dei campi al momento dell'espansione della macro.
pt_br: O código Guix deve definir tipos de dados apropriados (por exemplo, usando @code{define-record-type*}) em vez de listas de abuso. Além disso, ele deve usar correspondência de padrões, por meio do módulo @code{(ice-9 match)} do Guile, especialmente ao corresponder listas (@pxref{Pattern Matching,,, guile, Manual de Referência do GNU Guile}); a correspondência de padrões para registros é melhor feita usando @code{match-record} do @code{(guix records)}, que, diferentemente do @code{match}, verifica nomes de campos no momento da macroexpansão.

source: When defining a new record type, keep the @dfn{record type descriptor} (RTD) private (@pxref{Records,,, guile, GNU Guile Reference Manual}, for more on records and RTDs). As an example, the @code{(guix packages)} module defines @code{<package>} as the RTD for package records but it does not export it; instead, it exports a type predicate, a constructor, and field accessors. Exporting RTDs would make it harder to change the application binary interface (because code in other modules might be matching fields by position) and would make it trivial for users to forge records of that type, bypassing any checks we may have in the official constructor (such as ``field sanitizers'').
it: Quando si definisce un nuovo tipo di record, mantenere privato il @dfn{descrittore di tipo di record} (RTD) (@pxref{Records,,, guile, GNU Guile Reference Manual}, per maggiori informazioni sui record e sugli RTD). Ad esempio, il modulo @code{(guix packages)} definisce @code{<package>} come RTD per i record di pacchetto, ma non lo esporta; invece, esporta un predicato di tipo, un costruttore e degli accessor ai campi. L'esportazione degli RTD renderebbe più difficile cambiare l'interfaccia binaria dell'applicazione (perché il codice in altri moduli potrebbe abbinare i campi per posizione) e renderebbe banale per gli utenti forgiare record di quel tipo, bypassando qualsiasi controllo che potremmo avere nel costruttore ufficiale (come i ``sanitizer di campo'').
pt_br: Ao definir um novo tipo de registro, mantenha o @dfn{record type descriptor} (RTD) privado (@pxref{Records,,, guile, Manual de Referência do GNU Guile}, para mais informações sobre registros e RTDs). Como exemplo, o módulo @code{(guix packages)} define @code{<package>} como o RTD para registros de pacote, mas não o exporta; em vez disso, ele exporta um predicado de tipo, um construtor e acessadores de campo. Exportar RTDs tornaria mais difícil alterar a interface binária do aplicativo (porque o código em outros módulos pode estar correspondendo campos por posição) e tornaria trivial para os usuários falsificar registros desse tipo, ignorando quaisquer verificações que possamos ter no construtor oficial (como ``sanitizadores de campo'').

source: formatting code
it: formattazione del codice
pt_br: formatação de código

source: coding style
it: stile di codifica
pt_br: estilo de codificação

source: When writing Scheme code, we follow common wisdom among Scheme programmers. In general, we follow the @url{https://mumble.net/~campbell/scheme/style.txt, Riastradh's Lisp Style Rules}. This document happens to describe the conventions mostly used in Guile’s code too. It is very thoughtful and well written, so please do read it.
it: Quando scriviamo codice Scheme, seguiamo la saggezza comune tra i programmatori Scheme. In generale, seguiamo le @url{https://mumble.net/~campbell/scheme/style.txt, Regole di stile Lisp di Riastradh}. Questo documento descrive anche le convenzioni più usate nel codice di Guile. È molto ben ponderato e ben scritto, quindi vi preghiamo di leggerlo.
pt_br: Ao escrever código Scheme, seguimos a sabedoria comum entre os programadores Scheme. Em geral, seguimos o @url{https://mumble.net/~campbell/scheme/style.txt, Riastradh's Lisp Style Rules}. Este documento descreve as convenções mais usadas no código de Guile também. Ele é muito bem pensado e bem escrito, então, por favor, leia.

source: Some special forms introduced in Guix, such as the @code{substitute*} macro, have special indentation rules. These are defined in the @file{.dir-locals.el} file, which Emacs automatically uses. Also note that Emacs-Guix provides @code{guix-devel-mode} mode that indents and highlights Guix code properly (@pxref{Development,,, emacs-guix, The Emacs-Guix Reference Manual}).
it: Alcune forme speciali introdotte in Guix, come la macro @code{substitute*}, hanno regole di indentazione speciali. Queste sono definite nel file @file{.dir-locals.el}, che Emacs usa automaticamente. Nota anche che Emacs-Guix fornisce la modalità @code{guix-devel-mode} che indenta ed evidenzia il codice Guix correttamente (@pxref{Development,,, emacs-guix, The Emacs-Guix Reference Manual}).
pt_br: Alguns formulários especiais introduzidos no Guix, como a macro @code{substitute*}, possuem regras especiais de recuo. Estes são definidos no arquivo @file{.dir-locals.el}, que o Emacs usa automaticamente. Observe também que o Emacs-Guix fornece o modo @code{guix-devel-mode} que recua e destaca o código Guix corretamente (@pxref{Development ,,, emacs-guix, O manual de referência do Emacs-Guix}).

source: indentation, of code
it: indentazione, del codice
pt_br: recuo, de código

source: formatting, of code
it: formattazione, del codice
pt_br: formatação, de código

source: If you do not use Emacs, please make sure your editor knows these rules. To automatically indent a package definition, you can also run:
it: Se non usi Emacs, assicurati che il tuo editor conosca queste regole. Per indentare automaticamente una definizione di pacchetto, puoi anche eseguire:
pt_br: Se você não usa o Emacs, por favor, certifique-se que o seu editor conhece estas regras. Para recuar automaticamente uma definição de pacote, você também pode executar:

source: @xref{Invoking guix style}, for more information.
it: @xref{Invoking guix style}, per maggiori informazioni.
pt_br: @xref{Invoking guix style}, para mais informações.

source: We require all top-level procedures to carry a docstring. This requirement can be relaxed for simple private procedures in the @code{(guix build @dots{})} name space, though.
it: Richiediamo che tutte le procedure di primo livello abbiano una docstring. Questo requisito può essere rilassato per semplici procedure private nello spazio dei nomi @code{(guix build @dots{})}, però.
pt_br: Nós exigimos que todos os procedimentos de nível superior carreguem uma docstring. Porém, este requisito pode ser relaxado para procedimentos privados simples no espaço de nomes @code{(guix build @dots{})}.

source: Procedures should not have more than four positional parameters. Use keyword parameters for procedures that take more than four parameters.
it: Le procedure non dovrebbero avere più di quattro parametri posizionali. Usa parametri con parola chiave per le procedure che accettano più di quattro parametri.
pt_br: Os procedimentos não devem ter mais de quatro parâmetros posicionais. Use os parâmetros de palavra-chave para procedimentos que levam mais de quatro parâmetros.

source: Development is done using the Git distributed version control system. Thus, access to the repository is not strictly necessary. We welcome contributions in one of the following forms:
it: Lo sviluppo avviene utilizzando il sistema di controllo versione distribuito Git. Pertanto, l'accesso al repository non è strettamente necessario. Accettiamo contributi in una delle seguenti forme:
pt_br: O desenvolvimento é feito utilizando o sistema de controle de versão distribuído Git. Portanto, o acesso ao repositório não é estritamente necessário. Contribuições são bem-vindas em um dos seguintes formatos:

source: pull request, for contributions
it: pull request, per i contributi
pt_br: pull request, para contribuidores

source: As a @dfn{pull request} (PR) at @url{https://codeberg.org/guix/guix/pulls/}. This is now the preferred form.
it: Come @dfn{pull request} (PR) su @url{https://codeberg.org/guix/guix/pulls/}. Questa è ora la forma preferita.
pt_br: Como um @dfn{pull request} (PR) em @url{https://codeberg.org/guix/guix/pulls/}. Este é atualmente o formato preferido.

source: Until December 31st, 2025@footnote{This date is the result of a decision made collectively in @uref{https://codeberg.org/guix/guix-consensus-documents/src/branch/main/002-codeberg.md, Guix Consensus Document 002} in May 2025.}, you may also send patches as produced by @code{git format-patch} to the @email{guix-patches@@gnu.org} mailing list (@pxref{Submitting patches to a project,,, git, Git User Manual}).
it: Fino al 31 dicembre 2025@footnote{Questa data è il risultato di una decisione presa collettivamente nel @uref{https://codeberg.org/guix/guix-consensus-documents/src/branch/main/002-codeberg.md, Documento di Consenso Guix 002} a maggio 2025.}, puoi anche inviare patch prodotte da @code{git format-patch} alla mailing list @email{guix-patches@@gnu.org} (@pxref{Submitting patches to a project,,, git, Git User Manual}).
pt_br: Até 31 de dezembro de 2025@footnote{Esta data é o resultado de uma decisão tomada coletivamente no @uref{https://codeberg.org/guix/guix-consensus-documents/src/branch/main/002-codeberg.md, Documento de Consenso Guix 002} em maio de 2025}, você também pode enviar patches produzidos pelo @code{git format-patch} para a lista de discussão @email{guix-patches@@gnu.org} (@pxref{Submitting patches to a project,,, git, Manual do usuário do Git}).

source: This mailing list is backed by a Debbugs instance, which allows us to keep track of submissions (@pxref{Tracking Bugs and Changes}). Each message sent to that mailing list gets a new tracking number assigned; people can then follow up on the submission by sending email to @code{@var{ISSUE_NUMBER}@@debbugs.gnu.org}, where @var{ISSUE_NUMBER} is the tracking number (@pxref{Sending a Patch Series}).
it: Questa mailing list è supportata da un'istanza di Debbugs, che ci permette di tenere traccia delle sottomissioni (@pxref{Tracking Bugs and Changes}). Ogni messaggio inviato a quella mailing list riceve un nuovo numero di tracciamento; le persone possono quindi seguire la sottomissione inviando un'email a @code{@var{ISSUE_NUMBER}@@debbugs.gnu.org}, dove @var{ISSUE_NUMBER} è il numero di tracciamento (@pxref{Sending a Patch Series}).
pt_br: Esta lista de discussão é apoiada por uma instância do Debbugs, o que nos permite acompanhar os envios (@pxref{Tracking Bugs and Changes}). Cada mensagem enviada para essa lista de discussão recebe um novo número de rastreamento atribuído; as pessoas podem então acompanhar o envio enviando um e-mail para @code{@var{NÚMERO_DE_ISSÃO}@@debbugs.gnu.org}, onde @var{NÚMERO_DE_ISSÃO} é o número de rastreamento (@pxref{Sending a Patch Series}).

source: Either way, contributors are encouraged to take a moment to set some Git repository options (@pxref{Configuring Git}) first, which can improve the readability of patches. Seasoned Guix developers may also want to look at the section on commit access (@pxref{Commit Access}).
it: In entrambi i casi, i contributori sono incoraggiati a dedicare un momento per impostare alcune opzioni del repository Git (@pxref{Configuring Git}) prima, il che può migliorare la leggibilità delle patch. Gli sviluppatori esperti di Guix potrebbero anche voler dare un'occhiata alla sezione sull'accesso ai commit (@pxref{Commit Access}).
pt_br: De qualquer forma, os colaboradores são encorajados a reservar um momento para definir algumas opções do repositório Git (@pxref{Configuring Git}) primeiro, o que pode melhorar a legibilidade dos patches. Desenvolvedores Guix experientes também podem querer dar uma olhada na seção sobre acesso de commit (@pxref{Commit Access}).

source: Please write commit logs in the ChangeLog format (@pxref{Change Logs,,, standards, GNU Coding Standards}); you can check the commit history for examples.
it: Per favore, scrivi i log dei commit nel formato ChangeLog (@pxref{Change Logs,,, standards, GNU Coding Standards}); puoi controllare la cronologia dei commit per degli esempi.
pt_br: Por favor, escreva os logs de commit no formato de ChangeLog (@pxref{Change Logs ,,, standards, GNU Coding Standards}); você pode verificar o histórico de commit para exemplos.

source: You can help make the review process more efficient, and increase the chance that your patch will be reviewed quickly, by describing the context of your patch and the impact you expect it to have. For example, if your patch is fixing something that is broken, describe the problem and how your patch fixes it. Tell us how you have tested your patch. Will users of the code changed by your patch have to adjust their workflow at all? If so, tell us how. In general, try to imagine what questions a reviewer will ask, and answer those questions in advance.
it: Puoi contribuire a rendere il processo di revisione più efficiente e aumentare le possibilità che la tua patch venga revisionata rapidamente, descrivendo il contesto della tua patch e l'impatto che ti aspetti che abbia. Ad esempio, se la tua patch corregge qualcosa che non funziona, descrivi il problema e come la tua patch lo risolve. Dicci come hai testato la tua patch. Gli utenti del codice modificato dalla tua patch dovranno adeguare in qualche modo il loro flusso di lavoro? Se sì, dicci come. In generale, cerca di immaginare quali domande porrà un revisore e rispondi a quelle domande in anticipo.
pt_br: Você pode ajudar a tornar o processo de revisão mais eficiente e aumentar a chance de que seu patch seja revisado rapidamente, descrevendo o contexto do seu patch e o impacto que você espera que ele tenha. Por exemplo, se seu patch estiver corrigindo algo que está quebrado, descreva o problema e como seu patch o corrige. Conte-nos como você testou seu patch. Os usuários do código alterado pelo seu patch terão que ajustar seu fluxo de trabalho? Se sim, conte-nos como. Em geral, tente imaginar quais perguntas um revisor fará e responda a essas perguntas com antecedência.

source: Before submitting a patch that adds or modifies a package definition, please run through this check list:
it: Prima di inviare una patch che aggiunge o modifica una definizione di pacchetto, per favore segui questa lista di controllo:
pt_br: Antes de enviar um patch que adicione ou modifique uma definição de pacote, execute esta lista de verificação:

source: If the authors of the packaged software provide a cryptographic signature for the release tarball, make an effort to verify the authenticity of the archive. For a detached GPG signature file this would be done with the @code{gpg --verify} command.
it: Se gli autori del software pacchettizzato forniscono una firma crittografica per il tarball di rilascio, fai uno sforzo per verificare l'autenticità dell'archivio. Per un file di firma GPG distaccato, questo verrebbe fatto con il comando @code{gpg --verify}.
pt_br: Se os autores do software empacotado fornecerem uma assinatura criptográfica para o tarball de lançamento, faça um esforço para verificar a autenticidade do arquivo. Para um arquivo de assinatura GPG separado, isso seria feito com o comando @code{gpg --verify}.

source: Take some time to provide an adequate synopsis and description for the package. @xref{Synopses and Descriptions}, for some guidelines.
it: Prenditi del tempo per fornire una sinossi e una descrizione adeguate per il pacchetto. @xref{Synopses and Descriptions}, per alcune linee guida.
pt_br: Reserve algum tempo para fornecer uma sinopse e descrição adequadas para o pacote. @xref{Synopses and Descriptions}, para algumas diretrizes.

source: Run @command{guix lint @var{package}}, where @var{package} is the name of the new or modified package, and fix any errors it reports (@pxref{Invoking guix lint}).
it: Esegui @command{guix lint @var{package}}, dove @var{package} è il nome del pacchetto nuovo o modificato, e correggi eventuali errori segnalati (@pxref{Invoking guix lint}).
pt_br: Execute @command{guix lint @var{pacote}}, sendo @var{pacote} o nome do pacote novo ou modificado e corrija quaisquer erros que forem relatados (@pxref{Invoking guix lint}).

source: Run @command{guix style @var{package}} to format the new package definition according to the project's conventions (@pxref{Invoking guix style}).
it: Esegui @command{guix style @var{package}} per formattare la nuova definizione di pacchetto secondo le convenzioni del progetto (@pxref{Invoking guix style}).
pt_br: Execute @command{guix style @var{pacote}}, para formatar a nova definição de pacote de acordo com as convençôes do projeto (@pxref{Invoking guix style}).

source: Make sure the package builds on your platform, using @command{guix build @var{package}}. Also build at least its direct dependents with @command{guix build --dependents=1 @var{package}} (@pxref{build-dependents, @command{guix build}}).
it: Assicurati che il pacchetto si compili sulla tua piattaforma, usando @command{guix build @var{package}}. Compila anche almeno i suoi dipendenti diretti con @command{guix build --dependents=1 @var{package}} (@pxref{build-dependents, @command{guix build}}).
pt_br: Certifique-se de que o pacote compila em sua plataforma, usando @command{guix build @var{pacote}}. Também compile pelo menos suas depêndencias diretas com @command{guix build --dependents=1 @var{pacote}} (@pxref{build-dependents, @command{guix build}}).

source: We recommend you also try building the package on other supported platforms. As you may not have access to actual hardware platforms, we recommend using the @code{qemu-binfmt-service-type} to emulate them. In order to enable it, add the @code{virtualization} service module and the following service to the list of services in your @code{operating-system} configuration:
it: Ti consigliamo di provare a costruire il pacchetto anche su altre piattaforme supportate. Poiché potresti non avere accesso a piattaforme hardware reali, ti consigliamo di usare il @code{qemu-binfmt-service-type} per emularle. Per abilitarlo, aggiungi il modulo di servizio @code{virtualization} e il seguente servizio alla lista dei servizi nella tua configurazione @code{operating-system}:
pt_br: Recomendamos que você também tente compilar o pacote em outras plataformas suportadas. Como você pode não ter acesso às plataformas de hardware reais, recomendamos o uso do @code{qemu-binfmt-service-type} para emulá-las. Para habilitar isso, adicione o módulo de serviço @code{virtualization} e o sequinte serviço à lista de serviços da sua configuração do @code{operating-system}:

source: Then reconfigure your system.
it: Quindi, riconfigura il tuo sistema.
pt_br: Então, reconfigure seu sistema.

source: You can then build packages for different platforms by specifying the @code{--system} option. For example, to build the "hello" package for the armhf or aarch64 architectures, you would run the following commands, respectively:
it: Puoi quindi costruire pacchetti per diverse piattaforme specificando l'opzione @code{--system}. Ad esempio, per costruire il pacchetto "hello" per le architetture armhf o aarch64, dovresti eseguire i seguenti comandi, rispettivamente:
pt_br: Você pode criar pacotes para plataformas diferentes especificando a opção @code{--system}. Por exemplo, para compilar o pacote "hello" para as arquiteturas armhf ou aarch64, você executaria os seguintes comandos, respectivamente:

source: bundling
it: raggruppamento
pt_br: incorporando

source: Make sure the package does not use bundled copies of software already available as separate packages.
it: Assicurati che il pacchetto non usi copie raggruppate di software già disponibili come pacchetti separati.
pt_br: Verifique se o pacote não usa cópias de software já disponíveis como pacotes separados.

source: Sometimes, packages include copies of the source code of their dependencies as a convenience for users. However, as a distribution, we want to make sure that such packages end up using the copy we already have in the distribution, if there is one. This improves resource usage (the dependency is built and stored only once), and allows the distribution to make transverse changes such as applying security updates for a given software package in a single place and have them affect the whole system---something that bundled copies prevent.
it: A volte, i pacchetti includono copie del codice sorgente delle loro dipendenze per comodità degli utenti. Tuttavia, come distribuzione, vogliamo assicurarci che tali pacchetti finiscano per usare la copia che abbiamo già nella distribuzione, se ce n'è una. Questo migliora l'uso delle risorse (la dipendenza viene costruita e archiviata solo una volta), e permette alla distribuzione di apportare modifiche trasversali come l'applicazione di aggiornamenti di sicurezza per un dato pacchetto software in un unico posto e far sì che influenzino l'intero sistema --- qualcosa che le copie incluse impediscono.
pt_br: Às vezes, os pacotes incluem cópias do código-fonte de suas dependências como uma conveniência para os usuários. No entanto, como uma distribuição, queremos garantir que esses pacotes acabem usando a cópia que já temos na distribuição, se houver. Isso melhora o uso de recursos (a dependência é criada e armazenada apenas uma vez) e permite que a distribuição faça alterações transversais, como aplicar atualizações de segurança para um determinado pacote de software em um único local e fazê-las afetar todo o sistema -- algo que cópias incluídas impedem.
