Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: The percentage @code{%} is typically used for read-only global variables in the build stage. Note that it is merely a convention, like @code{_} in C. Scheme treats @code{%} exactly the same as any other letter.
es: El porcentaje @code{%} es utilizado típicamente para variables locales de solo lectura en es estado de construcción. Note que es meramente una convención, como @code{_} en C. Scheme trata @code{%} exactamente lo mismo que cualquier otra letra.
it: La percentuale @code{%} è tipicamente usata per le variabili globali di sola lettura nella fase di compilazione. Notare che è solo una convenzione, come @code{_} in C. Scheme tratta @code{%} esattamente come qualsiasi altra lettera.
pt_br: A porcentagem @code{%} normalmente é usada para variáveis globais somente-leitura no estágio de construção. Observe que é apenas uma convenção, como @code{_} em C. Scheme trata @code{%} exatamente da mesma forma que qualquer outra letra.
sk: Znak percento @code{%} je bežne používaný pre globálne premenné s prístupom len na čítanie počas zostavovania. Všimnite si, že je to len všeobecným zvykom, ako napr. @code{_} v jazyku C. Scheme spracúva @code{%} ako hocijaký iný znak.

source: Modules are created with @code{define-module} (@pxref{Creating Guile Modules,,, guile, GNU Guile Reference Manual}). For instance
es: Los módulos son creados con @code{define-module} (@pxref{Creating Guile Modules,,, guile, Manual referencial de GNU Guile}). Por ejemplo
it: I moduli sono creati con @code{define-module} (@pxref{Creating Guile Modules,,, guile, Manuale di riferimento di GNU Guile}). Per esempio
pt_br: Os módulos são criados com @code{define-module} (@pxref{Creating Guile Modules,,, guile, Manual de referência do GNU Guile}). Por exemplo
sk: Moduly sa vytvárajú pomocou @code{define-module} (@pxref{Creating Guile Modules,,, guile, GNU Guile Reference Manual}). Napríklad

source: defines the module @code{guix build-system ruby} which must be located in @file{guix/build-system/ruby.scm} somewhere in the Guile load path. It depends on the @code{(guix store)} module and it exports two variables, @code{ruby-build} and @code{ruby-build-system}.
es: define el módulo @code{guix build-system ruby} el cual debe estar localizado en @file{guix/build-system/ruby.scm} donde sea en la ruta de carga Guile. Depende en el módulo @code{(guix store)} y exporta dos variables, @code{ruby-build} y @code{ruby-build-system}.
it: definisce il modulo @code{guix build-system ruby} che deve essere situato in @file{guix/build-system/ruby.scm} da qualche parte nel percorso di caricamento di Guile. Dipende dal modulo @code{(guix store)} ed esporta due variabili, @code{ruby-build} e @code{ruby-build-system}.
pt_br: define o módulo @code{guix build-system ruby} que deve estar localizado em @file{guix/build-system/ruby.scm} em algum lugar no caminho de carregamento do Guile. Depende do módulo @code{(guix store)} e exporta duas variáveis, @code{ruby-build} e @code{ruby-build-system}.
sk: určuje modul @code{guix build-system ruby}, ktorý má byť umiestnený v @file{guix/build-system/ruby.scm} niekde vo vyhľadávacej ceste Guilu. Závisí na module @code{(guix store)} a určuje dve premenné, @code{ruby-build} a @code{ruby-build-system}.

source: @xref{Package Modules,,, guix, GNU Guix Reference Manual}, for info on modules that define packages.
es: @xref{Módulos de paquetes,,, guix.es, Manual de referencia GNU Guix}, para info en módulos que define paquetes.
it: @xref{Moduli di pacchetti,,, guix.it, Manuale di riferimento di GNU Guix}, per informazioni sui moduli che definiscono i pacchetti.
pt_br: @xref{Módulos de pacote,,, guix.pt_BR, GNU Guix Reference Manual}, para informações sobre módulos que definem pacotes.
sk: Viď @ref{Package Modules,,, guix, GNU Guix Reference Manual}, pre viac podrobností o moduloch zadávajúcich balíky.

source: Going further
es: Más allá
it: Andare oltre
pt_br: Indo além
ru: Больше информации
sk: Dozvedieť sa viac

source: Scheme is a language that has been widely used to teach programming and you'll find plenty of material using it as a vehicle. Here's a selection of documents to learn more about Scheme:
es: Scheme es un lenguaje que ha sido ampliamente utilizado para enseñar a programar y lo encontraría plenamente en material utilizándolo como un vehículo. Aquí está una selección de documentos para aprender más sobre Scheme:
it: Scheme è un linguaggio ampiamente utilizzato per insegnare la programmazione e troverai molto materiale che lo usa come veicolo. Ecco una selezione di documenti per saperne di più su Scheme:
pt_br: Scheme é uma linguagem que tem sido amplamente utilizada para ensinar programação e você encontrará muito material usando-a como veículo. Aqui está uma seleção de documentos para saber mais sobre o Scheme:
sk: Scheme je jazyk, ktorý sa hojne využíva pri výuke programovania a sú na ňom založené mnohé podklady. V nasledovných dokumentoch sa môžete o Scheme dozvedieť viac:

source: @uref{https://spritely.institute/static/papers/scheme-primer.html, @i{A Scheme Primer}}, by Christine Lemmer-Webber and the Spritely Institute.
es: @uref{https://spritely.institute/static/papers/scheme-primer.html, @i{A Scheme Primer}}, por Christine Lemmer-Webber y el Instituto Spritely.
it: @uref{https://spritely.institute/static/papers/scheme-primer.html, @i{Un Primer di Scheme}}, di Christine Lemmer-Webber e lo Spritely Institute.
pt_br: @uref{https://spritely.institute/static/papers/scheme-primer.html, @i{A Scheme Primer}}, por Christine Lemmer-Webber e o Spritely Institute.
sk: @uref{https://spritely.institute/static/papers/scheme-primer.html, @i{A Scheme Primer}}, od Christine Lemmer-Webberovej a Spritely Institute.

source: @uref{http://www.troubleshooters.com/codecorn/scheme_guile/hello.htm, @i{Scheme at a Glance}}, by Steve Litt.
es: @uref{http://www.troubleshooters.com/codecorn/scheme_guile/hello.htm, @i{Scheme at a Glance}}, por Steve Litt.
it: @uref{http://www.troubleshooters.com/codecorn/scheme_guile/hello.htm, @i{Scheme in Sintesi}}, di Steve Litt.
pt_br: @uref{http://www.troubleshooters.com/codecorn/scheme_guile/hello.htm, @i{Scheme at a Glance}}, por Steve Litt.
sk: @uref{http://www.troubleshooters.com/codecorn/scheme_guile/hello.htm, @i{Scheme at a Glance}}, od Steva Litta.

source: @uref{https://sarabander.github.io/sicp/, @i{Structure and Interpretation of Computer Programs}}, by Harold Abelson and Gerald Jay Sussman, with Julie Sussman. Colloquially known as ``SICP'', this book is a reference.
es: @uref{https://sarabander.github.io/sicp/, @i{Structure and Interpretation of Computer Programs}}, por Harold Abelson y Gerald Jay Sussman, con Julie Sussman. Coloquialmente conocido como ``SICP'', este libro es una referencia.
it: @uref{https://sarabander.github.io/sicp/, @i{Struttura e Interpretazione dei Programmi per Elaboratore}}, di Harold Abelson e Gerald Jay Sussman, con Julie Sussman. Conosciuto colloquialmente come "SICP", questo libro è un riferimento.
pt_br: @uref{https://sarabander.github.io/sicp/, @i{Structure and Interpretation of Computer Programs}}, por Harold Abelson e Gerald Jay Sussman, com Julie Sussman. Coloquialmente conhecido como ``SICP'', este livro é uma referência.
sk: @uref{https://sarabander.github.io/sicp/, @i{Structure and Interpretation of Computer Programs}}, od Harolda Abelsona, Geralda Jay Sussmana a Julie Sussmanovej. Táto knižná príručka je bežne známa ako ``SICP''.

source: You can also install it and read it from your computer:
es: Además puede instalarlo desde su equipo:
it: Puoi anche installarlo e leggerlo dal tuo computer:
pt_br: Você também pode instalá-lo e lê-lo em seu computador:
sk: Môžete si ju tiež stiahnuť a prečítať na vašom počítači:

source: You'll find more books, tutorials and other resources at @url{https://schemers.org/}.
es: Encontrará más libros, tutoriales y otros recursos en @url{https://schemers.org/}.
it: Troverai altri libri, tutorial e altre risorse su @url{https://schemers.org/}.
pt_br: Você encontrará mais livros, tutoriais e outros recursos em @url{https://schemers.org/}.
sk: Ďalšie knihy, návody ako aj iné druhy zdrojov nájdete na @url{https://schemers.org/}.

source: packaging
es: empaquetar
it: impacchettamento
pt_br: Empacotamento
sk: zadávanie balíkov
sv: paketering

source: This chapter is dedicated to teaching you how to add packages to the collection of packages that come with GNU Guix. This involves writing package definitions in Guile Scheme, organizing them in package modules, and building them.
es: Este capítulo está dedicado para enseñanza de como añadir paquetes a la colección de paquetes que viene con GNU Guix. Esto involucra escrbir definiciones de paquete en Guile Scheme, organizándolos en módulos de paquete, y construyéndolos.
it: Questo capitolo è dedicato a insegnarti come aggiungere pacchetti alla collezione di pacchetti fornita con GNU Guix. Ciò comporta la scrittura di definizioni di pacchetti in Guile Scheme, l'organizzazione in moduli di pacchetti e la loro compilazione.
pt_br: Este capítulo é dedicado a ensinar como adicionar pacotes à coleção de pacotes que vem com o GNU Guix. Isso envolve escrever definições de pacotes no Guile Scheme, organizá-las em módulos de pacotes e construí-las.
sk: Tento oddiel je zameraný na pridávanie nových balíkov do zbierky balíkov GNU Guix, čo zahŕňa zadávanie balíkov v Guile Scheme, ich usporadúvanie do modulov a zostavovanie.

source: GNU Guix stands out as the @emph{hackable} package manager, mostly because it uses @uref{https://www.gnu.org/software/guile/, GNU Guile}, a powerful high-level programming language, one of the @uref{https://en.wikipedia.org/wiki/Scheme_%28programming_language%29, Scheme} dialects from the @uref{https://en.wikipedia.org/wiki/Lisp_%28programming_language%29, Lisp family}.
es: GNU Guix destaca como el gestor de paquetes @emph{hakeable}, principalmente porque utiliza @uref{https://www.gnu.org/software/guile/, GNU Guile}, un potente lenguaje de programación de alto nivel, uno de los dialectos @uref{https://en.wikipedia.org/wiki/Scheme_%28programming_language%29, Scheme} de la familia @uref{https://en.wikipedia.org/wiki/Lisp_%28programming_language%29, Lisp}.
it: GNU Guix si distingue come il gestore di pacchetti @emph{hackable}, principalmente perché utilizza @uref{https://www.gnu.org/software/guile/, GNU Guile}, un potente linguaggio di programmazione di alto livello, uno dei dialetti @uref{https://it.wikipedia.org/wiki/Scheme, Scheme} della famiglia @uref{https://it.wikipedia.org/wiki/Lisp, Lisp}.
pt_br: GNU Guix se destaca como o gerenciador de pacotes @emph{hackeável}, principalmente porque usa @uref{https://www.gnu.org/software/guile/, GNU Guile}, uma poderosa linguagem de programação de alto nível, um dos dialetos @uref{https://pt.wikipedia.org/wiki/Scheme, Scheme} da família @uref{https://pt.wikipedia.org/wiki/Lisp, Lisp}.
sk: GNU Guix sa vyznačuje ako @emph{prispôsobiteľný} správca balíkov hlavne preto, že používa @uref{https://www.gnu.org/software/guile/, GNU Guile}, výkonný vysokoúrovňový programovací jazyk, jedno z nárečí jazyka @uref{https://en.wikipedia.org/wiki/Scheme_%28programming_language%29, Scheme} z jazykovej rodiny @uref{https://en.wikipedia.org/wiki/Lisp_%28programming_language%29, Lispu}.

source: Package definitions are also written in Scheme, which empowers Guix in some very unique ways, unlike most other package managers that use shell scripts or simple languages.
es: Las definiciones de paquetes también se escriben en Scheme, lo cual dota a Guix de algunas capacidades muy únicas, a diferencia de otros gestores de empaquetado que utilizan guiones de intérpretes o lenguajes sencillos.
it: Anche le definizioni dei pacchetti sono scritte in Scheme, il che conferisce a Guix poteri unici, a differenza della maggior parte degli altri gestori di pacchetti che utilizzano script di shell o linguaggi semplici.
pt_br: As definições de pacotes também são escritas em Scheme, o que capacita o Guix de maneiras muito exclusivas, ao contrário da maioria dos outros gerenciadores de pacotes que usam shell scripts ou linguagens simples.
sk: Zadania balíkov sú rovnako písané v jazyku Scheme, čo dáva Guixu jedinečnú výhodu v porovnaní s ostatnými správcami balíkov, ktoré používajú skripty shellu alebo jednoduché programovacie jazyky.

source: Use functions, structures, macros and all of Scheme expressiveness for your package definitions.
es: Utilice funciones, estructuras, macros y toda la expresividad de Scheme para sus definiciones de paquetes.
it: Usa funzioni, strutture, macro e tutta l'espressività di Scheme per le tue definizioni di pacchetto.
pt_br: Utilize funções, estruturas, macros e toda a expressividade do Scheme para definições de seus pacotes.
sk: Vo vašich zadaniach balíkov môžete využiť funkcie, štruktúry, makrá a všetku schopnosť vyjadrovania jazyka Scheme.

source: Inheritance makes it easy to customize a package by inheriting from it and modifying only what is needed.
es: La herencia facilita la personalización de un paquete heredando de él y modificando sólo lo que es necesario.
it: L'ereditarietà rende facile personalizzare un pacchetto ereditando da esso e modificando solo ciò che è necessario.
pt_br: A herança facilita a personalização de um pacote, herdando-o e modificando apenas o que é necessário.
sk: Dedičnosť zjednodušuje prispôsobovanie balíka tým, že umožňuje zdediť vybraný jestvujúci balík a upraviť len to čo je potrebné.

source: Batch processing: the whole package collection can be parsed, filtered and processed. Building a headless server with all graphical interfaces stripped out? It's possible. Want to rebuild everything from source using specific compiler optimization flags? Pass the @code{#:make-flags "..."} argument to the list of packages. It wouldn't be a stretch to think @uref{https://wiki.gentoo.org/wiki/USE_flag, Gentoo USE flags} here, but this goes even further: the changes don't have to be thought out beforehand by the packager, they can be @emph{programmed} by the user!
es: Procesamiento por lotes: se puede interpretar, filtrar y procesar toda la colección de paquetes. ¿Construir un servidor sin cabeza con todos los interfaces gráficos recortados? Es posible. ¿Quieres recompilar todo desde el código fuente utilizando indicadores de optimización específicos del compilador? Pase el argumento @code{#:make-flags "..."} a la lista de paquetes. No sería exagerado pensar @uref{https://wiki.gentoo.org/wiki/USE_flag, Gentoo USE indicadores} aquí, pero esto va más allá: los cambios no tienen que ser pensados de antemano por el empaquetador, ¡pueden ser @emph{programados} por el usuario!
it: Elaborazione batch: l'intera collezione di pacchetti può essere analizzata, filtrata ed elaborata. Costruire un server headless con tutte le interfacce grafiche rimosse? È possibile. Vuoi ricompilare tutto dal sorgente usando flag di ottimizzazione del compilatore specifici? Passa l'argomento @code{#:make-flags "..."} alla lista dei pacchetti. Non sarebbe un'esagerazione pensare ai @uref{https://wiki.gentoo.org/wiki/USE_flag, flag USE di Gentoo} qui, ma questo va anche oltre: le modifiche non devono essere pensate in anticipo dal manutentore del pacchetto, possono essere @emph{programmed} dall'utente!
pt_br: Processamento em lote: toda a coleção de pacotes pode ser analisada, filtrada e processada. Construindo um servidor headless com todas as interfaces gráficas removidas? É possível. Quer reconstruir tudo, desde o código-fonte usando sinalizadores específicos de otimização do compilador? Passe o argumento @code{#:make-flags "..."} para a lista de pacotes. Não seria exagero pensar em @uref{https://wiki.gentoo.org/wiki/USE_flag, Gentoo USE flags} aqui, mas isso vai ainda mais longe: as mudanças não precisam ser pensadas de antemão pelo empacotador, elas podem ser @emph{programadas} pelo usuário!
sk: Dávkové spracovanie: celú zbierku balíkov je možné načítať, prefiltrovať a spracovať. Potrebujete zostaviť server bez grafického rozhrania? Dá sa to. Potrebujete opätovne zostaviť všetko zo zdrojových súborov s použitím odlišných optimalizačných príznakov? Pridajte parameter @code{#:make-flags "..."} do zoznamu balíkov. Tiež by nebolo od veci spomenúť @uref{https://wiki.gentoo.org/wiki/USE_flag, Gentoo príznak USE}, ale to je na dlhšie: tvorca balíkov nemusí vopred myslieť na tieto zmeny, pretože ich môže neskôr @emph{naprogramovať} koncový používateľ!

source: The following tutorial covers all the basics around package creation with Guix. It does not assume much knowledge of the Guix system nor of the Lisp language. The reader is only expected to be familiar with the command line and to have some basic programming knowledge.
es: El siguiente tutorial cubre todo lo básico sobre la creación de paquetes con Guix. No asume mucho conocimiento del sistema Guix ni del lenguaje Lisp. Sólo se espera que el lector esté familiarizado con la línea de comandos y que tenga algunos conocimientos básicos de programación.
it: Il seguente tutorial copre tutte le basi sulla creazione di pacchetti con Guix. Non presuppone molta conoscenza del sistema Guix né del linguaggio Lisp. Si presume che il lettore abbia familiarità con la riga di comando e abbia alcune conoscenze di programmazione di base.
pt_br: O tutorial a seguir cobre todos os fundamentos da criação de pacotes com Guix. Não pressupõe muito conhecimento do sistema Guix nem da linguagem Lisp. Espera-se apenas que o leitor esteja familiarizado com a linha de comando e tenha alguns conhecimentos básicos de programação.
sk: Nasledovný návod vysvetľuje základy vytvárania balíkov s Guixom. Nepredpokladá žiadnu znalosť systému Guix ani jazyka Lisp. Čitateľ by však mal byť oboznámený s príkazovým riadkom a mať aspoň základnú znalosť programovania.

source: The ``Defining Packages'' section of the manual introduces the basics of Guix packaging (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}). In the following section, we will partly go over those basics again.
es: La sección ``Definición de paquetes'' del manual introduce los fundamentos del empaquetado Guix (@pxref{Definición de paquetes,,, guix.es, Manual referencial de GNU Guix}). En la siguiente sección, repasaremos parcialmente esos fundamentos de nuevo.
it: La sezione "Definire i pacchetti" del manuale introduce le basi dell'impacchettamento con Guix (@pxref{Definire i pacchetti,,, guix.it, Manuale di riferimento di GNU Guix}). Nella sezione seguente, ripercorreremo in parte queste basi.
pt_br: A seção ``Definindo Pacotes'' do manual apresenta os fundamentos do empacotamento Guix (@pxref{Definindo pacotes,,, guix.pt_BR, Manual de Referência do GNU Guix}). Na seção seguinte, revisaremos parcialmente esses princípios básicos novamente.
sk: Oddiel „Zadávanie balíkov“ v príručke obsahuje základy tvorby balíkov s Guixom (@pxref{Defining Packages,,, guix, GNU Guix Reference Manual}). V nasledovnom oddieli si tieto základy z časti pripomenieme.

source: GNU@tie{}Hello is a dummy project that serves as an idiomatic example for packaging. It uses the GNU build system (@code{./configure && make && make install}). Guix already provides a package definition which is a perfect example to start with. You can look up its declaration with @code{guix edit hello} from the command line. Let's see how it looks:
es: GNU@tie{}Hello es un proyecto ficticio que sirve como ejemplo idiomático de empaquetado. Utiliza el sistema de construcción de GNU (@code{./configure && make && make install}). Guix ya proporciona una definición de paquete que es un ejemplo perfecto para empezar. Puedes buscar su declaración con @code{guix edit hello} desde la línea de comandos. Veamos cómo queda:
it: GNU@tie{}Hello è un progetto fittizio che serve come esempio idiomatico per l'impacchettamento. Utilizza il sistema di compilazione GNU (@code{./configure && make && make install}). Guix fornisce già una definizione di pacchetto che è un esempio perfetto da cui partire. Puoi consultare la sua dichiarazione con @code{guix edit hello} dalla riga di comando. Vediamo come appare:
pt_br: GNU@tie{}Hello é um projeto fictício que serve como exemplo idiomático para empacotamento. Ele usa o sistema de compilação GNU (@code{./configure && make && make install}). Guix já fornece uma definição de pacote que é um exemplo perfeito para começar. Você pode consultar sua declaração com @code{guix edit hello} na linha de comando. Vamos ver como fica:
sk: GNU@tie{}Hello je šablóna projektu, ktorá slúži ako základný príklad zadávania balíkov. Využíva zostavovací systém GNU (@code{./configure && make && make install}). Guix už obsahuje zadanie príslušného balíka, ktoré predstavuje vhodný odrazový bod. Môžete si zadanie balíka prezrieť zadaním @code{guix edit hello} do príkazového riadku. Pozrime sa ako toto zadania balíka vyzerá:

source: (define-public hello (package (name "hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hello, GNU world: An example GNU package") (description "GNU Hello prints the message \"Hello, world!\" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))
es: (define-public hello (package (name "hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hola, mundo GNU: Un ejemplo de paquete GNU") (description "GNU Hello imprime el mensaje \"Hello, world!\" y después sale. Sirve como un ejemplo de prácticas de codificación GNU estándar. Por tanto, admite argumentos de línea comando, múltiples lenguajes, y más.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))
it: (define-public hello (package (name "hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Ciao, mondo GNU: Un esempio di pacchetto GNU") (description "GNU Hello stampa il messaggio \"Ciao, mondo!\" e poi esce. Serve come esempio di pratiche di codifica standard GNU. Come tale, supporta argomenti da riga di comando, più lingue, e così via.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+)))

source: As you can see, most of it is rather straightforward. But let's review the fields together:
es: Como puede ver, muchos de estos es bastante sencillo. Pero revisaremos los campos juntos:
it: Come puoi vedere, la maggior parte è piuttosto semplice. Ma esaminiamo i campi insieme:
pt_br: Como você pode ver, a maior parte é bastante simples. Mas vamos revisar os campos juntos:
sk: Ako môžete vidieť, tá najobsiahlejšia časť je dosť jednoduchá. Ale prejdime si spoločne jednotlivé polia:
