Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: ... or you can pass it to @command{guix pack} in pretty much the same way (@pxref{pack-manifest, @option{-m} option of @command{guix pack}}). You can store the manifest under version control, share it with others so they can easily get set up, etc.
pt_br: ... ou você pode passá-lo para @command{guix pack} praticamente da mesma forma (@pxref{pack-manifest, @option{-m} opção de @command{guix pack}}). Você pode armazenar o manifesto sob controle de versão, compartilhá-lo com outros para que eles possam facilmente configurar, etc.

source: But how do you write your first manifest? To get started, maybe you'll want to write a manifest that mirrors what you already have in a profile. Rather than start from a blank page, @command{guix package} can generate a manifest for you (@pxref{export-manifest, @command{guix package --export-manifest}}):
pt_br: Mas como você escreve seu primeiro manifesto? Para começar, talvez você queira escrever um manifesto que espelhe o que você já tem em um perfil. Em vez de começar do zero, @command{guix package} pode gerar um manifesto para você (@pxref{export-manifest, @command{guix package --export-manifest}}):

source: # Write to 'manifest.scm' a manifest corresponding to the # default profile, ~/.guix-profile. guix package --export-manifest > manifest.scm
pt_br: # Escreva em 'manifest.scm' um manifesto correspondente ao # perfil padrão, ~/.guix-profile. guix package --export-manifest > manifest.scm

source: Or maybe you'll want to ``translate'' command-line arguments into a manifest. In that case, @command{guix shell} can help (@pxref{shell-export-manifest, @command{guix shell --export-manifest}}):
pt_br: Ou talvez você queira ``traduzir'' argumentos de linha de comando em um manifesto. Nesse caso, @command{guix shell} pode ajudar (@pxref{shell-export-manifest, @command{guix shell --export-manifest}}):

source: In both cases, the @option{--export-manifest} option tries hard to generate a faithful manifest; in particular, it takes package transformation options into account (@pxref{Package Transformation Options}).
pt_br: Em ambos os casos, a opção @option{--export-manifest} tenta arduamente gerar um manifesto fiel; em particular, ela leva em consideração as opções de transformação de pacotes (@pxref{Package Transformation Options}).

source: Manifests are @emph{symbolic}: they refer to packages of the channels @emph{currently in use} (@pxref{Channels}). In the example above, @code{gcc-toolchain} might refer to version 14 today, but it might refer to version 16 two years from now.
pt_br: Manifestos são @emph{simbólicos}: eles se referem a pacotes dos canais @emph{atualmente em uso} (@pxref{Channels}). No exemplo acima, @code{gcc-toolchain} pode se referir à versão 14 hoje, mas pode se referir à versão 16 daqui a dois anos.

source: If you want to ``pin'' your software environment to specific package versions and variants, you need an additional piece of information: the list of channel revisions in use, as returned by @command{guix describe}. @xref{Replicating Guix}, for more information.
pt_br: Se você quiser ``fixar'' seu ambiente de software em versões e variantes de pacotes específicos, precisará de uma informação adicional: a lista de revisões de canal em uso, conforme retornado por @command{guix describe}. @xref{Replicating Guix}, para mais informações.

source: Once you've obtained your first manifest, perhaps you'll want to customize it. Since your manifest is code, you now have access to all the Guix programming interfaces!
pt_br: Depois de obter seu primeiro manifesto, talvez você queira personalizá-lo. Como seu manifesto é código, agora você tem acesso a todas as interfaces de programação Guix!

source: Let's assume you want a manifest to deploy a custom variant of GDB, the GNU Debugger, that does not depend on Guile, together with another package. Building on the example seen in the previous section (@pxref{Defining Package Variants}), you can write a manifest along these lines:
pt_br: Vamos supor que você queira um manifesto para implantar uma variante personalizada do GDB, o GNU Debugger, que não depende do Guile, junto com outro pacote. Com base no exemplo visto na seção anterior (@pxref{Defining Package Variants}), você pode escrever um manifesto seguindo estas linhas:

source: (use-modules (guix packages) (gnu packages gdb) ;for 'gdb' (gnu packages version-control)) ;for 'git'
pt_br: (use-modules (guix packages) (gnu packages gdb) ;para 'gdb' (gnu packages version-control)) ;para 'git'

source: Note that in this example, the manifest directly refers to the @code{gdb} and @code{git} variables, which are bound to a @code{package} object (@pxref{package Reference}), instead of calling @code{specifications->manifest} to look up packages by name as we did before. The @code{use-modules} form at the top lets us access the core package interface (@pxref{Defining Packages}) and the modules that define @code{gdb} and @code{git} (@pxref{Package Modules}). Seamlessly, we're weaving all this together---the possibilities are endless, unleash your creativity!
pt_br: Observe que neste exemplo, o manifesto se refere diretamente às variáveis @code{gdb} e @code{git}, que são vinculadas a um objeto @code{package} (@pxref{package Reference}), em vez de chamar @code{specifications->manifest} para procurar pacotes por nome, como fizemos antes. O formulário @code{use-modules} no topo nos permite acessar a interface do pacote principal (@pxref{Defining Packages}) e os módulos que definem @code{gdb} e @code{git} (@pxref{Package Modules}). Sem problemas, estamos entrelaçando tudo isso — as possibilidades são infinitas, libere sua criatividade!

source: The data type for manifests as well as supporting procedures are defined in the @code{(guix profiles)} module, which is automatically available to code passed to @option{-m}. The reference follows.
pt_br: O tipo de dados para manifestos, bem como procedimentos de suporte, são definidos no módulo @code{(guix profiles)}, que está automaticamente disponível para o código passado para @option{-m}. A referência segue.

source: {Data Type} manifest
pt_br: {Tipo de dados} manifest

source: It currently has one field:
pt_br: Atualmente possui um campo:

source: This must be a list of @code{manifest-entry} records---see below.
pt_br: Esta deve ser uma lista de registros @code{manifest-entry} --- veja abaixo.

source: {Data Type} manifest-entry
pt_br: {Tipo de dados} manifest-entry

source: Data type representing a manifest entry. A manifest entry contains essential metadata: a name and version string, the object (usually a package) for that entry, the desired output (@pxref{Packages with Multiple Outputs}), and a number of optional pieces of information detailed below.
pt_br: Tipo de dado que representa uma entrada de manifesto. Uma entrada de manifesto contém metadados essenciais: uma string de nome e versão, o objeto (geralmente um pacote) para essa entrada, a saída desejada (@pxref{Packages with Multiple Outputs}) e uma série de informações opcionais detalhadas abaixo.

source: Most of the time, you won't build a manifest entry directly; instead, you will pass a package to @code{package->manifest-entry}, described below. In some unusual cases though, you might want to create manifest entries for things that are @emph{not} packages, as in this example:
pt_br: Na maioria das vezes, você não construirá uma entrada de manifesto diretamente; em vez disso, você passará um pacote para @code{package->manifest-entry}, descrito abaixo. Em alguns casos incomuns, no entanto, você pode querer criar entradas de manifesto para coisas que são @emph{não} pacotes, como neste exemplo:

source: Name and version string for this entry.
pt_br: Nome e sequência de versão para esta entrada.

source: A package or other file-like object (@pxref{G-Expressions, file-like objects}).
pt_br: Um pacote ou outro objeto tipo arquivo (@pxref{G-Expressions, objetos tipo arquivo}).

source: @code{output} (default: @code{"out"})
pt_br: @code{output} (padrão: @code{"out"})

source: Output of @code{item} to use, in case @code{item} has multiple outputs (@pxref{Packages with Multiple Outputs}).
pt_br: Saída de @code{item} a ser usada, caso @code{item} tenha múltiplas saídas (@pxref{Packages with Multiple Outputs}).

source: @code{dependencies} (default: @code{'()})
pt_br: @code{dependencies} (padrão: @code{'()})

source: List of manifest entries this entry depends on. When building a profile, dependencies are added to the profile.
pt_br: Lista de entradas de manifesto das quais esta entrada depende. Ao construir um perfil, dependências são adicionadas ao perfil.

source: Typically, the propagated inputs of a package (@pxref{package Reference, @code{propagated-inputs}}) end up having a corresponding manifest entry in among the dependencies of the package's own manifest entry.
pt_br: Normalmente, as entradas propagadas de um pacote (@pxref{package Reference, @code{propagated-inputs}}) acabam tendo uma entrada de manifesto correspondente entre as dependências da própria entrada de manifesto do pacote.

source: The list of search path specifications honored by this entry (@pxref{Search Paths}).
pt_br: A lista de especificações de caminhos de pesquisa respeitadas por esta entrada (@pxref{Search Paths}).

source: @code{properties} (default: @code{'()})
pt_br: @code{properties} (padrão: @code{'()})

source: List of symbol/value pairs. When building a profile, those properties get serialized.
pt_br: Lista de pares de símbolo/valor. Ao construir um perfil, essas propriedades são serializadas.

source: This can be used to piggyback additional metadata---e.g., the transformations applied to a package (@pxref{Package Transformation Options}).
pt_br: Isso pode ser usado para adicionar metadados adicionais, por exemplo, as transformações aplicadas a um pacote (@pxref{Package Transformation Options}).

source: @code{parent} (default: @code{(delay #f)})
pt_br: @code{parent} (padrão: @code{(delay #f)})

source: A promise pointing to the ``parent'' manifest entry.
pt_br: Uma promessa apontando para a entrada do manifesto ``pai''.

source: build system
pt_br: sistema de compilação

source: The main build system is @code{gnu-build-system}, which implements the standard build procedure for GNU and many other packages. It is provided by the @code{(guix build-system gnu)} module.
pt_br: O principal sistema de compilação é o @code{gnu-build-system}, que implementa o processo padrão de compilação para o GNU e muitos outros pacotes. É providenciado pelo módulo @code{(guix build-system gnu)}.

source: build phases
pt_br: fases de construção

source: This build system supports a number of keyword arguments, which can be passed @i{via} the @code{arguments} field of a package. Here are some of the main parameters:
pt_br: Esta sistema de compilação suporta um número de palavras-chave como argumentos, os quais podems er passados @i{via} o campo @code{arguments} de um pacote. Veja alguns dos principais parâmetros:

source: #:substitutable?
pt_br: #:substituível?

source: Most other build systems support these keyword arguments.
pt_br: Vários outros sistemas de compilação suportam tais argumentos em palavras-chave.

source: The build system assumes that packages install their public interface (header) files to the subdirectory @file{include} of the @code{out} output and their libraries to the subdirectory @file{lib} the @code{out} output.
pt_br: O sistema de compilação presume que os pacotes instalam seu prório arquivo (header) de interface pública no subdiretório @file{include} da saída @code{out} bem como suas próprias bibliotecas no subdirectório @file{lib} da saída @code{out}.

source: It's also assumed that the union of all the dependencies of a package has no conflicting files.
pt_br: Também é presumido que a união de todas as dependências de um pacote não possuem arquivos conflitantes.

source: Examples:
pt_br: Exemplos:

source: check
pt_br: marcar

source: This variable is exported by @code{(guix build-system texlive)}. It is used to build TeX packages in batch mode with a specified engine. The build system sets the @env{TEXINPUTS} variable to find all TeX source files in the inputs.
pt_br: Esta variável é exportada pelo @code{(guix build-system texlive)}. É usado para compilar os pacotes TeX no modo de lote com um moter especificado. O sistema de compilação configura a variável @env{TEXINPUTS} para encontrar todos os arquivos de fonte TeX na entrada.

source: {Data Type} search-path-specification
pt_br: {Tipo de dados} search-path-specification

source: store items
pt_br: itens do armazém

source: cross compilation
pt_br: compilação cruzada

source: #$@var{obj}:@var{output}
pt_br: #$@var{obj}:@var{saída}

source: (ungexp @var{obj} @var{output})
pt_br: (ungexp @var{obj} @var{saída})

source: #$output[:@var{output}]
pt_br: #$output[:@var{saída}]

source: (ungexp output [@var{output}])
pt_br: (ungexp output [@var{saída}])

source: Invoking @command{guix repl}
pt_br: Invocando @command{guix repl}

source: -t @var{type}
pt_br: -t @var{tipo}

source: -L @var{directory}
pt_br: -L @var{diretório}

source: package variants
pt_br: variantes de pacotes

source: --with-source=@var{source}
pt_br: --with-source=@var{fonte}

source: --with-source=@var{package}=@var{source}
pt_br: --with-source=@var{pacote}=@var{fonte}

source: --with-input=@var{package}=@var{replacement}
pt_br: --with-input=@var{pacote}=@var{substituto}

source: --with-git-url=@var{package}=@var{url}
pt_br: --with-git-url=@var{pacote}=@var{url}

source: continuous integration
pt_br: integração contínua

source: --with-branch=@var{package}=@var{branch}
pt_br: --with-branch=@var{pacote}=@var{ramo}

source: --with-commit=@var{package}=@var{commit}
pt_br: --with-commit=@var{pacote}=@var{commit}

source: determinism, checking
pt_br: determinismo, verificação

source: reproducibility, checking
pt_br: reprodutibilidade, verificação

source: Invoking @command{guix edit}
pt_br: Invocando @command{guix edit}

source: Invoking @command{guix download}
pt_br: Invocando @command{guix download}

source: --output=@var{file}
pt_br: --output=@var{arquivo}

source: -o @var{file}
pt_br: -o @var{arquivo}

source: Invoking @command{guix hash}
pt_br: Invocando @command{guix hash}

source: --lts-version=@var{version}
pt_br: --lts-version=@var{versão}

source: -l @var{version}
pt_br: -l @var{versão}

source: Invoking @command{guix refresh}
pt_br: Invocando @command{guix refresh}

source: Invoking @command{guix lint}
pt_br: Invocando @command{guix lint}

source: guix lint @var{options} @var{package}@dots{}
pt_br: guix lint @var{opções} @var{pacote}@dots{}

source: Invoking @command{guix size}
pt_br: Invocando @command{guix size}

source: --map-file=@var{file}
pt_br: --map-file=@var{arquivo}

source: Invoking @command{guix graph}
pt_br: Invocando @command{guix graph}

source: guix graph @var{options} @var{package}@dots{}
pt_br: guix graph @var{opções} @var{pacote}@dots{}

source: List the supported graph types.
pt_br: Lista os tipos de grafos disponíveis.

source: List the supported graph backends.
pt_br: Lista os backends de grafos disponíveis.

source: Invoking @command{guix publish}
pt_br: Invocando @command{guix publish}

source: --port=@var{port}
pt_br: --port=@var{porta}

source: -p @var{port}
pt_br: -p @var{porta}

source: Listen for HTTP requests on @var{port}.
pt_br: Ouve requisições HTTP na @var{porta}.

source: -r [@var{port}]
pt_br: -r [@var{porta}]

source: If your host distro uses the Upstart init system:
pt_br: Se sua distro hospedeira usa o sistema init Upstart:

source: Invoking @command{guix challenge}
pt_br: Invocando @command{guix challenge}

source: command
pt_br: comando

source: Invoking @command{guix copy}
pt_br: Invocando @command{guix copy}

source: Invoking @command{guix container}
pt_br: Invocando @command{guix container}

source: Invoking @command{guix weather}
pt_br: Invocando @command{guix weather}

source: --coverage[=@var{count}]
pt_br: --coverage[=@var{contagem}]

source: -c [@var{count}]
pt_br: -c [@var{contagem}]

source: Invoking @command{guix processes}
pt_br: Invocando @command{guix processes}

source: foreign architectures
pt_br: arquiteturas estrangeiras

source: system configuration
pt_br: configuração do sistema

source: Bootloader
pt_br: Carregador de inicialização

source: System Services
pt_br: Serviços do sistema

source: A graphical system with a choice of lightweight window managers instead of full-blown desktop environments would look like this:
pt_br: Um sistema gráfico com uma escolha de gerenciadores de janelas leves em vez de ambientes de desktop completos teria a seguinte aparência:

source: This example refers to the @file{/boot/efi} file system by its UUID, @code{1234-ABCD}. Replace this UUID with the right UUID on your system, as returned by the @command{blkid} command.
pt_br: Este exemplo faz referência ao sistema de arquivos @file{/boot/efi} por seu UUID, @code{1234-ABCD}. Substitua esse UUID pelo UUID correto no seu sistema, conforme retornado pelo comando @command{blkid}.

source: {Data Type} operating-system
pt_br: {Tipo de dados} operating-system

source: @code{keyboard-layout} (default: @code{#f})
pt_br: @code{keyboard-layout} (padrão: @code{#f})

source: {Data Type} file-system
pt_br: {Tipo de dados} file-system

source: type
pt_br: tipo

source: @code{options} (default: @code{#f})
pt_br: @code{options} (padrão: @code{#f})

source: @code{mount?} (default: @code{#t})
pt_br: @code{mount?} (padrão: @code{#t})

source: @code{check?} (default: @code{#t})
pt_br: @code{check?} (padrão: @code{#t})

source: {Data Type} mapped-device
pt_br: {Tipo de dados} mapped-device

source: {Data Type} swap-space
pt_br: {Tipo de dados} swap-space

source: users
pt_br: usuários

source: {Data Type} user-account
pt_br: {Tipo de dados} user-account

source: @code{uid} (default: @code{#f})
pt_br: @code{uid} (padrão: @code{#f})

source: @code{system?} (default: @code{#f})
pt_br: @code{system?} (padrão: @code{#f})

source: {Data Type} user-group
pt_br: {Tipo de dados} user-group

source: keyboard layout, definition
pt_br: disposição do teclado, definição

source: XKB, keyboard layouts
pt_br: XKB, disposições do teclado

source: keyboard layout, configuration
pt_br: disposição do teclado, configuração

source: locale
pt_br: localidade

source: {Data Type} locale-definition
pt_br: {Tipo de dados} locale-definition

source: system services
pt_br: serviços de sistema

source: {Data Type} login-configuration
pt_br: {Tipo de dados} login-configuration

source: {Data Type} mingetty-configuration
pt_br: {Tipo de dados} mingetty-configuration

source: {Data Type} agetty-configuration
pt_br: {Tipo de dados} agetty-configuration

source: @code{remote?} (default: @code{#f})
pt_br: @code{remote?} (padrão: @code{#f})

source: @code{no-issue?} (default: @code{#f})
pt_br: @code{no-issue?} (padrão: @code{#f})

source: @code{no-clear?} (default: @code{#f})
pt_br: @code{no-clear?} (padrão: @code{#f})

source: @code{no-newline?} (default: @code{#f})
pt_br: @code{no-newline?} (padrão: @code{#f})

source: @code{hangup?} (default: @code{#f})
pt_br: @code{hangup?} (padrão: @code{#f})

source: @code{no-hints?} (default: @code{#f})
pt_br: @code{no-hints?} (padrão: @code{#f})

source: {Data Type} kmscon-configuration
pt_br: {Tipo de dados} kmscon-configuration

source: {Data Type} nscd-configuration
pt_br: {Tipo de dados} nscd-configuration

source: {Data Type} nscd-cache
pt_br: {Tipo de dados} nscd-cache

source: @code{persistent?} (default: @code{#t})
pt_br: @code{persistent?} (padrão: @code{#t})

source: @code{shared?} (default: @code{#t})
pt_br: @code{shared?} (padrão: @code{#t})

source: {Data Type} syslog-configuration
pt_br: {Tipo de dados} syslog-configuration

source: {Data Type} guix-configuration
pt_br: {Tipo de dados} guix-configuration

source: {Data Type} guix-extension
pt_br: {Tipo de dados} guix-extension

source: {Data Type} udev-configuration
pt_br: {Tipo de dados} udev-configuration

source: {Data Type} gpm-configuration
pt_br: {Tipo de dados} gpm-configuration

source: The GPM package to use.
pt_br: O pacote GPM a ser usado.

source: {Data Type} guix-publish-configuration
pt_br: {Tipo de dados} guix-publish-configuration

source: @code{port} (default: @code{80})
pt_br: @code{port} (padrão: @code{80})

source: {Data Type} rngd-configuration
pt_br: {Tipo de dados} rngd-configuration

source: {Data Type} greetd-configuration
pt_br: {Tipo de dados} greetd-configuration

source: {Data Type} greetd-terminal-configuration
pt_br: {Tipo de dados} greetd-terminal-configuration

source: {Data Type} greetd-agreety-session
pt_br: {Tipo de dados} greetd-agreety-session

source: {Data Type} greetd-wlgreet-sway-session
pt_br: {Tipo de dados} greetd-wlgreet-sway-session

source: {Data Type} mcron-configuration
pt_br: {Tipo de dados} mcron-configuration

source: {Data Type} log-cleanup-configuration
pt_br: {Tipo de dados} log-cleanup-configuration

source: {Data Type} anonip-configuration
pt_br: {Tipo de dados} anonip-configuration

source: This data type represents the configuration of anonip. It has the following parameters:
pt_br: Este tipo de dado representa a configuração do anonip. Ele possui os seguintes parâmetros:

source: {Data Type} static-networking
pt_br: {Tipo de dados} static-networking

source: {Data Type} network-address
pt_br: {Tipo de dados} network-address

source: {Data Type} network-route
pt_br: {Tipo de dados} network-route

source: {Data Type} network-link
pt_br: {Tipo de dados} network-link

source: {Data Type} dhcp-client-configuration
pt_br: {Tipo de dados} dhcp-client-configuration

source: {Data Type} network-manager-configuration
pt_br: {Tipo de dados} network-manager-configuration

source: {Data Type} connman-configuration
pt_br: {Tipo de dados} connman-configuration

source: {Data Type} connman-general-configuration
pt_br: {Tipo de dados} connman-general-configuration

source: {Data Type} wpa-supplicant-configuration
pt_br: {Tipo de dados} wpa-supplicant-configuration

source: @code{dbus?} (default: @code{#t})
pt_br: @code{dbus?} (padrão: @code{#t})

source: {Data Type} modem-manager-configuration
pt_br: {Tipo de dados} modem-manager-configuration

source: {Data Type} usb-modeswitch-configuration
pt_br: {Tipo de dados} usb-modeswitch-configuration

source: {Data Type} dhcpd-configuration
pt_br: {Tipo de dados} dhcpd-configuration

source: {Data Type} hostapd-configuration
pt_br: {Tipo de dados} hostapd-configuration

source: {Data Type} iptables-configuration
pt_br: {Tipo de dados} iptables-configuration

source: {Data Type} nftables-configuration
pt_br: {Tipo de dados} nftables-configuration

source: {Data Type} ntp-configuration
pt_br: {Tipo de dados} ntp-configuration

source: {Data Type} ntp-server
pt_br: {Tipo de dados} ntp-server

source: {Data Type} openntpd-configuration
pt_br: {Tipo de dados} openntpd-configuration

source: {Data Type} inetd-configuration
pt_br: {Tipo de dados} inetd-configuration

source: {Data Type} inetd-entry
pt_br: {Tipo de dados} inetd-entry

source: @code{wait?} (default: @code{#t})
pt_br: @code{wait?} (padrão: @code{#t})

source: {Data Type} opendht-configuration
pt_br: {Tipo de dados} opendht-configuration

source: {Data Type} tor-configuration
pt_br: {Tipo de dados} tor-configuration

source: {Data Type} tor-onion-service-configuration
pt_br: {Tipo de dados} tor-onion-service-configuration

source: {Data Type} tor-transport-plugin
pt_br: {Tipo de dados} tor-transport-plugin

source: {Data Type} rsync-configuration
pt_br: {Tipo de dados} rsync-configuration

source: {Data Type} rsync-module
pt_br: {Tipo de dados} rsync-module

source: {Data Type} syncthing-configuration
pt_br: {Tipo de dados} syncthing-configuration

source: {Data Type} lsh-configuration
pt_br: {Tipo de dados} lsh-configuration
