Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: guix system image --image-type=hurd-raw my-hurd-os.scm
sk: guix system image --image-type=hurd-raw moj-hurd-os.scm

source: guix system image --image-type=hurd-qcow2 my-hurd-os.scm
sk: guix system image --image-type=hurd-qcow2 moj-hurd-os.scm

source: Filesystem: ext4
es: Sistema de archivo: ext4
sk: Filesystem (súborový systém): ext4

source: @file{/dev/sdb}: swap
sk: @file{/dev/sdb}: swap (odkladací priestor)

source: (services (cons* (service dhcp-client-service-type) (service openssh-service-type (openssh-configuration (openssh openssh-sans-x) (password-authentication? #false) (authorized-keys `(("janedoe" ,(local-file "janedoe_rsa.pub")) ("root" ,(local-file "janedoe_rsa.pub")))))) %base-services)))
sk: (services (cons* (service dhcp-client-service-type) (service openssh-service-type (openssh-configuration (openssh openssh-sans-x) (password-authentication? #false) (authorized-keys `(("jozkomrkvicka" ,(local-file "jozkomrkvicka_rsa.pub")) ("root" ,(local-file "jozkomrkvicka_rsa.pub")))))) %base-services)))

source: (use-modules (gnu)) (use-service-modules #;… web) (use-package-modules #;… lua) (operating-system ;; … (services ;; … (service nginx-service-type (nginx-configuration (modules (list (file-append nginx-lua-module "/etc/nginx/modules/ngx_http_lua_module.so"))) (lua-package-path (list lua-resty-core lua-resty-lrucache lua-resty-signal lua-tablepool lua-resty-shell)) (lua-package-cpath (list lua-resty-signal)) (server-blocks (list (nginx-server-configuration (server-name '("localhost")) (listen '("80")) (root "/etc") (locations (list (nginx-location-configuration (uri "/hello") (body (list #~(format #f "content_by_lua_file ~s;" #$(local-file "index.lua"))))))))))))))
sk: (use-modules (gnu)) (use-service-modules #;… web) (use-package-modules #;… lua) (operating-system ;; … (services ;; … (service nginx-service-type (nginx-configuration (modules (list (file-append nginx-lua-module "/etc/nginx/modules/ngx_http_lua_module.so"))) (lua-package-path (list lua-resty-core lua-resty-lrucache lua-resty-signal lua-tablepool lua-resty-shell)) (lua-package-cpath (list lua-resty-signal)) (server-blocks (list (nginx-server-configuration (server-name '("localhost")) (listen '("80")) (root "/etc") (locations (list (nginx-location-configuration (uri "/ahoj") (body (list #~(format #f "content_by_lua_file ~s;" #$(local-file "index.lua"))))))))))))))

source: $ guix shell --container --network --manifest=manifest.scm -- R
sk: $ guix shell --container --network --manifest=balikospis.scm -- R

source: pid=5983 ns="guix-test" host="veth-test" client="ceth-test"
sk: pid=5983 ns="guix-skuska" host="veth-skuska" client="ceth-skuska"

source: for i in $GUIX_EXTRA_PROFILES/*; do profile=$i/$(basename "$i") if [ -f "$profile"/etc/profile ]; then GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi unset profile done
sk: for i in $GUIX_DOPLNKOVE_PROFILY/*; do profile=$i/$(basename "$i") if [ -f "$profile"/etc/profile ]; then GUIX_PROFILE="$profile" . "$GUIX_PROFILE"/etc/profile fi unset profile done

source: guix package --search-paths=prefix --profile=$my_profile"
sk: guix package --search-paths=prefix --profile=$moj_profil"

source: for profile in "$GUIX_EXTRA_PROFILES"/*; do guix package --profile="$profile" \ --manifest="$HOME/.guix-manifests/guix-$profile-manifest.scm" done
sk: for profile in "$GUIX_DOPLNKOVE_PROFILY"/*; do guix package --profile="$profil" \ --manifest="$HOME/.guix-manifests/guix-$profil-balikospis.scm" done

source: guix install package-foo guix upgrade package-bar
sk: guix install balik-jablko guix upgrade balik-hruska

source: GUIX_EXTRA_PROFILES=$HOME/.guix-extra-profiles GUIX_EXTRA=$HOME/.guix-extra
sk: GUIX_DOPLNKOVE_PROFILY=$HOME/.guix-doplnkove-profily GUIX_DOPLNKY=$HOME/.guix-doplnky

source: @var{head-node}:/gnu/store /gnu/store nfs defaults,_netdev,vers=3 0 0 @var{head-node}:/var/guix /var/guix nfs defaults,_netdev,vers=3 0 0 @var{head-node}:/var/log/guix /var/log/guix nfs defaults,_netdev,vers=3 0 0
sk: @var{hlavny-uzol}:/gnu/store /gnu/store nfs defaults,_netdev,vers=3 0 0 @var{hlavny-uzol}:/var/guix /var/guix nfs defaults,_netdev,vers=3 0 0 @var{hlavny-uzol}:/var/log/guix /var/log/guix nfs defaults,_netdev,vers=3 0 0

source: GUIX_DAEMON_SOCKET="guix://@var{head-node}" export GUIX_DAEMON_SOCKET
sk: GUIX_DAEMON_SOCKET="guix://@var{hlavny-uzol}" export GUIX_DAEMON_SOCKET

source: GUIX_DAEMON_SOCKET=ssh://compute-node.example.org \ guix download http://starpu.gforge.inria.fr/files/starpu-1.2.3/starpu-1.2.3.tar.gz
sk: GUIX_DAEMON_SOCKET=ssh://vypoctovy-uzol.priklad.sk \ guix download http://starpu.gforge.inria.fr/files/starpu-1.2.3/starpu-1.2.3.tar.gz

source: $ guix archive --export \ `guix build --sources=transitive openmpi` \ > openmpi-source-code.nar
sk: $ guix archive --export \ `guix build --sources=transitive openmpi` \ > openmpi-zdrojovy-kod.nar

source: $ guix archive --import < openmpi-source-code.nar
sk: $ guix archive --import < openmpi-zdrojovy-kod.nar

source: This manual is also available in Simplified Chinese (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), French (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), German (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), Korean (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), Spanish (@pxref{Top,,, guix-cookbook.es, Libro de recetas de GNU Guix}), Italian (@pxref{Top,,, guix-cookbook.it, Ricettario di GNU Guix}), Brazilian Portuguese (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), Russian (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), Slovak (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}), and Swedish (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}). If you would like to translate this document in your native language, consider joining @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Translating Guix,,, guix, GNU Guix Reference Manual}).
es: Este manual también está disponible en inglés (@pxref{Top,,, guix-cookbook, GNU Guix Cookbook}), chino simplificado (@pxref{Top,,, guix-cookbook.zh_CN, GNU Guix 烹饪书}), francés (@pxref{Top,,, guix-cookbook.fr, Livre de recettes de GNU Guix}), alemán (@pxref{Top,,, guix-cookbook.de, GNU-Guix-Kochbuch}), coreano (@pxref{Top,,, guix-cookbook.ko, GNU Guix 쿡북}), italiano (@pxref{Top,,, guix-cookbook.it, Ricettario di GNU Guix}), portugués brasileño (@pxref{Top,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}), ruso (@pxref{Top,,, guix-cookbook.ru, GNU Guix Рецепты}), eslovaco (@pxref{Top,,, guix-cookbook.sk, Receptár GNU Guix}) y sueco (@pxref{Top,,, guix-cookbook.sv, Kokbok för GNU Guix}). Si estás dispuesto a traducir este documento a tu lengua materna, considera unirte a @uref{https://translate.codeberg.org/projects/guix/documentation-cookbook, Weblate} (@pxref{Traduciendo Guix,,, guix.es, Manual de referencia de GNU Guix}).

source: #:make-flags (list (string-append "prefix=" (assoc-ref %outputs "out")) "CC=gcc")
es: #:make-flags (list (string-append "prefix=" (assoc-ref %outputs "salida")) "CC=gcc")

source: $ make CC=gcc prefix=/gnu/store/...-<out>
es: $ make CC=gcc prefix=/gnu/store/...-<salida>

source: (add-to-load-path "/path/to/guix/checkout") ,use (guix build gnu-build-system) (map car %standard-phases) @result{} (set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)
es: (add-to-load-path "/ruta/para/guix/comprobente") ,use (guix build gnu-build-system) (map car %standard-phases) @result{} (set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)

source: $ guix refresh hello
es: $ guix refresh hola

source: $ guix refresh hello --update
es: $ guix refresh saludo --update

source: (define %my-services (modify-services %base-services ;; @dots{} (mingetty-service-type config => (auto-login-to-tty config "tty3" "alice"))))
es: (define %mis-servicios (modify-services %base-services ;; @dots{} (mingetty-service-type config => (auto-login-to-tty config "tty3" "alice"))))

source: (operating-system ;; @dots{} (services %my-services))
es: (operating-system ;; @dots{} (services %mis-servicios))

source: (define-public my-linux-libre (package (inherit (customize-linux #:linux linux-libre #:defconfig (local-file "defconfig"))) (name "my-linux-libre")))
es: (define-public my-linux-libre (package (inherit (customize-linux #:linux linux-libre #:defconfig (local-file "defconfig"))) (name "mi-linux-libre")))

source: $ bluetoothctl [NEW] Controller 00:11:22:33:95:7F BlueZ 5.40 [default]
es: $ bluetoothctl [NEW] Controlador 00:11:22:33:95:7F BlueZ 5.40 [predet.]

source: [bluetooth]# power on [bluetooth]# Changing power on succeeded
es: [bluetooth]# power on [bluetooth]# Cambiando a encendido correcto

source: R version 4.2.1 (2022-06-23) -- "Funny-Looking Kid" Copyright (C) 2022 The R Foundation for Statistical Computing @dots{} > e <- Sys.getenv("GUIX_ENVIRONMENT") > Sys.setenv(GIT_SSL_CAINFO=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_FILE=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_DIR=paste0(e, "/etc/ssl/certs")) > install.packages("Cairo", lib=paste0(getwd())) @dots{} * installing *source* package 'Cairo' ... @dots{} * DONE (Cairo)
es: R version 4.2.1 (2022-06-23) -- "Funny-Looking Kid" © 2022 La base de R para el cálculo estadístico @dots{} > e <- Sys.getenv("GUIX_ENVIRONMENT") > Sys.setenv(GIT_SSL_CAINFO=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_FILE=paste0(e, "/etc/ssl/certs/ca-certificates.crt")) > Sys.setenv(SSL_CERT_DIR=paste0(e, "/etc/ssl/certs")) > install.packages("Cairo", lib=paste0(getwd())) @dots{} * installing *source* package 'Cairo' ... @dots{} * DONE (Cairo)

source: (display (string-append "Hello " "Guix" "\n")) @print{} Hello Guix @result{} #<unspecified>
ru: (display (string-append "Привет " "Guix" "\n")) @print{} Привет Guix @result{} #<unspecified>

source: (service postgresql-service-type (postgresql-configuration (postgresql postgresql-14)))
ru: (service postgresql-service-type (postgresql-configuration (postgresql postgresql-10)))

source: systemctl daemon-reload systemctl restart guix-daemon
ru: systemctl daemon-reload systemctl restart guix-daemon.service
