Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: For instance, a user installing a graphical program that depends on a command line tool might only be interested in the graphical part, so there is no need to force the command line tool into the user profile. The dependency is a concern to the package, not to the user. @emph{Inputs} make it possible to handle dependencies without bugging the user by adding undesired executable files (or libraries) to their profile.
es: Por ejemplo, un usuario que instala un programa gráfico que depende de una herramienta de línea de comandos puede que sólo esté interesado en la parte gráfica, por lo que no hay necesidad de forzar la herramienta de línea de comandos en el perfil de usuario. La dependencia es una preocupación para el paquete, no para el usuario. @emph{Inputs} permite gestionar las dependencias sin molestar al usuario añadiendo archivos ejecutables (o bibliotecas) no deseados a su perfil.
it: Ad esempio, un utente che installa un programma grafico che dipende da uno strumento a riga di comando potrebbe essere interessato solo alla parte grafica, quindi non è necessario forzare lo strumento a riga di comando nel profilo utente. La dipendenza è una preoccupazione del pacchetto, non dell'utente. Gli @emph{Inputs} rendono possibile gestire le dipendenze senza infastidire l'utente aggiungendo file eseguibili (o librerie) indesiderati al loro profilo.
pt_br: Por exemplo, um usuário que instala um programa gráfico que depende de uma ferramenta de linha de comando pode estar interessado apenas na parte gráfica, portanto não há necessidade de forçar a ferramenta de linha de comando no perfil do usuário. A dependência é uma preocupação do pacote, não do usuário. @emph{Inputs} tornam possível lidar com dependências sem incomodar o usuário, adicionando arquivos executáveis (ou bibliotecas) indesejados ao seu perfil.
sk: Napríklad, ak inštalujete grafický program, ktorý závisí na nejakom nástroji spúšťanom v príkazovom riadku, tak vám pravdepodobne ide len o tú grafickú časť. Nie je teda potrebné siliť inštaláciu nástroja spúšťaného v príkazovom riadku do používateľského profilu. Závislosti sú spravované balíkmi a nie používateľmi. @emph{Vstupy} umožňujú spravovať závislosti bez toho, aby to nejako zaťažovalo používateľov pridávaním neužitočných programov či knižníc do ich profilu.

source: Same goes for @emph{native-inputs}: once the program is installed, build-time dependencies can be safely garbage-collected. It also matters when a substitute is available, in which case only the @emph{inputs} and @emph{propagated inputs} will be fetched: the @emph{native inputs} are not required to install a package from a substitute.
es: Lo mismo ocurre con @emph{native-inputs}: una vez instalado el programa, las dependencias en tiempo de construcción pueden ser recolectadas de forma segura. También es importante cuando un sustituto está disponible, en cuyo caso sólo el @code{inputs} y @code{propagated-inputs} será recuperado: el @code{native-inputs} no son necesarios para instalar un paquete de un sustituto.
it: Lo stesso vale per gli @emph{native-inputs}: una volta installato il programma, le dipendenze di compilazione possono essere tranquillamente raccolte come spazzatura. È importante anche quando è disponibile un sostituto, nel qual caso verranno scaricati solo gli @emph{inputs} e gli @emph{propagated inputs}: gli @emph{native inputs} non sono richiesti per installare un pacchetto da un sostituto.
pt_br: O mesmo vale para @emph{native-inputs}: depois que o programa é instalado, as dependências em tempo de construção podem ser coletadas como lixo com segurança. Também importa quando um substituto está disponível, caso em que apenas @emph{inputs} e @emph{propagated inputs} serão obtidos: os @emph{native inputs} não são necessários para instalar um pacote de um substituto.
sk: Rovnako to platí aj pre @emph{native-inputs}: po inštalácii programu môžu byť závislosti vyžadované pri zostavovaní bezpečne odstránené zberačom odpadkov. Okrem toho, ak je dostupná binárna náhrada, stiahnu sa len @emph{inputs} a @emph{propagated inputs}: @emph{native inputs} nie sú pri inštalácii balíka prostredníctvom náhrady potrebné.

source: Note
es: Nota
it: Nota
pt_br: Nota
ru: Примечание
sk: Poznámka
sv: Observera

source: You may see here and there snippets where package inputs are written quite differently, like so:
es: Aquí puede ver y esos fragmentos de código donde entradas de paquetes son escritos poco diferentemente, como así:
it: Potresti vedere qua e là snippet in cui gli input dei pacchetti sono scritti in modo piuttosto diverso, come questo:
pt_br: Você pode ver aqui e ali trechos onde as entradas do pacote são escritas de maneira bem diferente, assim:
sk: Tu a tam nájdete úryvky, v ktorých sú vstupy zapísané pomerne odlišne, teda asi takto:

source: ;; The "old style" for inputs. (inputs `(("libssh2" ,libssh2) ("http-parser" ,http-parser) ("python" ,python-wrapper)))
es: ;; El "estilo más antiguo" para entradas. (inputs `(("libssh2" ,libssh2) ("http-parser" ,http-parser) ("python" ,python-wrapper)))
it: ;; Il "vecchio stile" per gli input. (inputs `(("libssh2" ,libssh2) ("http-parser" ,http-parser) ("python" ,python-wrapper)))
pt_br: ;; O "estilo antigo" para entradas. (inputs `(("libssh2" ,libssh2) ("http-parser" ,http-parser) ("python" ,python-wrapper)))
sk: ;; „Pôvodný tvar“ zápisu vstupov (inputs `(("libssh2" ,libssh2) ("http-parser" ,http-parser) ("python" ,python-wrapper)))

source: This is the ``old style'', where each input in the list is explicitly given a label (a string). It is still supported but we recommend using the style above instead. @xref{package Reference,,, guix, GNU Guix Reference Manual}, for more info.
es: Éste es el ``estilo antiguo'', donde cada entrada en el listado se proporciona explícitamente como una etiqueta (una cadena). Todavía está mantenido pero recomendamos utilizar en su lugar el estilo anterior.
it: Questo è il ``vecchio stile'', dove a ciascun input nell'elenco viene esplicitamente data un'etichetta (una stringa). È ancora supportato ma raccomandiamo di usare invece lo stile sopra. @xref{Riferimenti per 'package',,, guix.it, Manuale di riferimento di GNU Guix}, per maggiori informazioni.
pt_br: Este é o ``estilo antigo'', onde cada entrada na lista recebe explicitamente um rótulo (uma string). Ainda é compatível, mas recomendamos usar o estilo acima. @xref{Referência do package,,, guix.pt_BR, Manual de Referência do GNU Guix}, para mais informações.
sk: Toto je „pôvodný tvar“, v ktorom má každá položka zoznamu vstupov pridelenú menovku (reťazec). Tento tvar je stále podporovaný ale odporúčame vám používať už len vyššie uvedený tvar. Viď @ref{package Reference,,, guix, GNU Guix Reference Manual} pre viac podrobností.

source: Outputs
es: Salidas
it: Prodotti
pt_br: Saídas
ru: Результаты
sk: Výstupy
sv: Utdata

source: Just like how a package can have multiple inputs, it can also produce multiple outputs.
es: Tan solo como un paquete puede tener múltiples entradas, puede producir además múltiples salidas.
it: Proprio come un pacchetto può avere più input, può anche produrre più output.
pt_br: Assim como um pacote pode ter múltiplas entradas, ele também pode produzir múltiplas saídas.
sk: Tak ako môže mať balík viacero vstupov, môže mať aj viacero výstupov.
sv: Precis som ett paket kan ha flera indata kan det också producera flera utdata.

source: Each output corresponds to a separate directory in the store.
es: Cada salida corresponde a un directorio separado en el almacén.
it: Ogni output corrisponde a una directory separata nello store.
pt_br: Cada saída corresponde a um diretório separado no armazém.
sk: Každý výstup má osobitný priečinok v úložisku.

source: The user can choose which output to install; this is useful to save space or to avoid polluting the user profile with unwanted executables or libraries.
es: El usuario puede elegir cual salida para instalar; esto es útil para ahorrar espacio o para evitar repartir el perfil de usuario cuando ejecutables o bibliotecas no son deseados.
it: L'utente può scegliere quale output installare; questo è utile per risparmiare spazio o per evitare di inquinare il profilo utente con eseguibili o librerie indesiderate.
pt_br: O usuário pode escolher qual saída instalar; isso é útil para economizar espaço ou evitar poluir o perfil do usuário com executáveis ou bibliotecas indesejadas.
sk: Používateľ si môže vybrať, ktorý výstup nainštaluje; pomáha to šetriť úložné miesto a predchádzať znečisteniu používateľského profilu nechcenými programami či knižnicami.

source: Output separation is optional. When the @code{outputs} field is left out, the default and only output (the complete package) is referred to as @code{"out"}.
es: La separación de salida es opcional. Cuando el campo @code{salidas} se dejan fuera, lo predeterminado y solamente la salida (el paquete completo) está referenciado como @code{"out"} (salida).
it: La separazione dell'output è opzionale. Quando il campo @code{outputs} viene omesso, l'output predefinito e unico (il pacchetto completo) è indicato come @code{"out"}.
pt_br: A separação de saída é opcional. Quando o campo @code{outputs} é omitido, a saída padrão e única (o pacote completo) é referida como @code{"out"}.
sk: Oddeľovanie výstupov je voliteľné. Ak sa pole @code{outputs} vynechá, predvoleným a jediným výstupom (celý balík) bude @code{"out"}.

source: Typical separate output names include @code{debug} and @code{doc}.
es: Los nombres de salida separados típicos incluyen @code{defauilt} y @code{doc}.
it: I nomi tipici degli output separati includono @code{debug} e @code{doc}.
pt_br: Nomes de saída separados típicos incluem @code{debug} e @code{doc}.
sk: Často vidíme oddelené výstupy s názvom @code{debug} alebo @code{doc}.

source: It's advised to separate outputs only when you've shown it's worth it: if the output size is significant (compare with @code{guix size}) or in case the package is modular.
es: Se advierte separar las salidas solo cuando es mostrada es peor si: el tamaño de salida es significante (compara con @code{tamaño guix}) o en caso de cuando el paquete es modular.
it: Si consiglia di separare gli output solo quando si è dimostrato che ne vale la pena: se la dimensione dell'output è significativa (confrontare con @code{guix size}) o nel caso in cui il pacchetto sia modulare.
pt_br: É aconselhável separar as saídas apenas quando você mostrar que vale a pena: se o tamanho da saída for significativo (compare com @code{guix size}) ou caso o pacote seja modular.
sk: Oddelené výstupy by ste mali používať len vtedy, keď sa to oplatí: ak je výstup značne veľký (možno porovnať pomocou @code{guix size}), alebo ak je balík modulárny.

source: Build system arguments
es: Argumentos del sistema de construcción
it: Argomenti del sistema di compilazione
pt_br: Argumentos do sistema de compilação
sk: Argumenty zostavovacieho systému

source: The @code{arguments} is a keyword-value list used to configure the build process.
es: Los @code{arguments} son un valor de palabra clave utilizada para configurar el proceso de construcción.
it: L'argomento @code{arguments} è un elenco di coppie chiave-valore utilizzato per configurare il processo di compilazione.
pt_br: O @code{arguments} é uma lista de valores de palavras-chave usadas para configurar o processo de construção.
sk: Pole @code{arguments} obsahuje páry kľúč-hodnota používané pri nastavovaní postupu zostavenia.

source: The simplest argument @code{#:tests?} can be used to disable the test suite when building the package. This is mostly useful when the package does not feature any test suite. It's strongly recommended to keep the test suite on if there is one.
es: El argumento @code{#:test?} más simple puede ser utilizado para deshabilitar la suite de test cuando construya el paquete. Esto es mayormente útil cuando el paquete no capacita ningún suite de test. Es recomendado fuertemente conservar la suite de test si hay una.
it: L'argomento più semplice @code{#:tests?} può essere utilizzato per disabilitare la suite di test durante la compilazione del pacchetto. Questo è utile soprattutto quando il pacchetto non dispone di alcuna suite di test. Si consiglia vivamente di mantenere la suite di test attiva se presente.
pt_br: O argumento mais simples @code{#:tests?} pode ser usado para desabilitar o conjunto de testes ao construir o pacote. Isso é útil principalmente quando o pacote não apresenta nenhum conjunto de testes. É altamente recomendável manter o conjunto de testes ativado, se houver.
sk: Ten najjednoduchší argument @code{#:tests?} možno použiť na vynechanie testov po zostavení balíka. Je to užitočné najmä v prípade, keď balík neobsahuje žiadnu testovaciu súpravu. Je dôrazne odporúčané ponechať testovaciu súpravu povolenú, ak je nejaká dostupná.

source: Another common argument is @code{:make-flags}, which specifies a list of flags to append when running make, as you would from the command line. For instance, the following flags
es: Otro argumento común es @code{:crear-indicadores}, el cual especifica un listado de indicadores para adjuntar cuando ejecute make, como haría desde la línea de comando. Por instancia, los indicadores proporcionan
it: Un altro argomento comune è @code{:make-flags}, che specifica un elenco di flag da aggiungere quando si esegue make, come si farebbe dalla riga di comando. Ad esempio, i seguenti flag
pt_br: Outro argumento comum é @code{:make-flags}, que especifica uma lista de sinalizadores a serem acrescentados ao executar o make, como faria na linha de comando. Por exemplo, os seguintes sinalizadores
sk: Ďalším bežným argumentom je @code{:make-flags} určujúci zoznam dodatočných príznakov, ktoré sa majú použiť pri spúšťaní nástroja make ako keby ste pridali priamo do príkazového riadku. Napríklad, nasledovné príznaky

source: translate into
es: traducir en
it: si traducono in
pt_br: traduzir para
sk: sú chápané ako
sv: översätt till

source: This sets the C compiler to @code{gcc} and the @code{prefix} variable (the installation directory in Make parlance) to @code{(assoc-ref %outputs "out")}, which is a build-stage global variable pointing to the destination directory in the store (something like @file{/gnu/store/...-my-libgit2-20180408}).
es: Estos establece el compilador C para @code{gcc} y la variable @code{prefix} (el directorio de instalación en el lenguaje Make) para @code{(assoc-ref %outputs "salida")} la cual es una variable local de lado-de-construcción apuntando al directorio destino dentro del almacenaje (alguna cosa como @file{/gnu/store/...-my-libgit2-20180408}).
it: Questo imposta il compilatore C a @code{gcc} e la variabile @code{prefix} (la directory di installazione nel linguaggio Make) a @code{(assoc-ref %outputs "out")}, che è una variabile globale di fase di compilazione che punta alla directory di destinazione nello store (qualcosa come @file{/gnu/store/...-my-libgit2-20180408}).
pt_br: Isso define o compilador C para @code{gcc} e a variável @code{prefix} (o diretório de instalação no jargão Make) para @code{(assoc-ref %outputs "out")}, que é um estágio de construção global variável apontando para o diretório de destino no armazém (algo como @file{/gnu/store/...-my-libgit2-20180408}).
sk: Toto nastaví prekladač jazyka C na @code{gcc} a premennú @code{prefix} (cieľový priečinok inštalácie v prípade nástroja Make) na @code{(assoc-ref %outputs "out")}, čo predstavuje globálnu premennú prítomnú pri zostavovaní, ktorá udáva cestu k cieľovému priečinku v úložisku (niečo ako @file{/gnu/store/...-my-libgit2-20180408}).

source: Similarly, it's possible to set the configure flags:
es: Similarmente, es posible poner los indicadores de configuración:
it: Allo stesso modo, è possibile impostare i flag di configurazione:
pt_br: Da mesma forma, é possível definir os sinalizadores de configuração:
sk: Podobným spôsobom môžete nastaviť aj príznaky nastavenia:

source: The @code{%build-inputs} variable is also generated in scope. It's an association table that maps the input names to their store directories.
es: La variable @code{%build-inputs} también está generada en ámbito. Es una tabla de asociación que asocia los nombres de entrada a sus directorios de almacenaje.
it: La variabile @code{%build-inputs} viene anche generata nello scope. È una tabella di associazione che mappa i nomi degli input alle loro directory dello store.
pt_br: A variável @code{%build-inputs} também é gerada no escopo. Ela é uma tabela de associações que mapeia os nomes de entrada para seus diretórios de armazém.
sk: Dostupná je aj premenná @code{%build-inputs}. Predstavuje tabuľku, ktorá priraďuje názvy vstupov k ich priečinkom v úložisku.

source: The @code{phases} keyword lists the sequential steps of the build system. Typically phases include @code{unpack}, @code{configure}, @code{build}, @code{install} and @code{check}. To know more about those phases, you need to work out the appropriate build system definition in @samp{$GUIX_CHECKOUT/guix/build/gnu-build-system.scm}:
es: La palabra clave @code{phases} crea listas de pasos secuenciales del sistema de construcción. Las fases típicamente incluyen @code{unpack}, @code{configure}, @code{build}, @code{instalar} y @code{check}. Para saber más sobre estas fases, necesita trabajar fuera de la definición del sistema de construcción apropiado en @samp{$GUIX_CHECKOUT/guix/build/gnu-build-system.scm}:
it: La parola chiave @code{phases} elenca i passaggi sequenziali del sistema di compilazione. Tipicamente le fasi includono @code{unpack}, @code{configure}, @code{build}, @code{install} e @code{check}. Per saperne di più su queste fasi, è necessario trovare la definizione appropriata del sistema di compilazione in @samp{$GUIX_CHECKOUT/ guix/build/gnu-build-system.scm}:
pt_br: A palavra-chave @code{phases} lista as etapas sequenciais do sistema de compilação. Normalmente as fases incluem @code{unpack}, @code{configure}, @code{build}, @code{install} e @code{check}. Para saber mais sobre essas fases, você precisa definir a definição apropriada do sistema de compilação em @samp{$GUIX_CHECKOUT/guix/build/gnu-build-system.scm}:
sk: Kľúčové slovo @code{phases} predstavuje postupnosť krokov zostavovacieho systému. Medzi bežné kroky patria @code{unpack}, @code{configure}, @code{build}, @code{install} a @code{check}. Ak chcete o týchto krokoch zistiť viac, musíte nájsť to správne zadanie zostavovacieho systému v @samp{$GUIX_CHECKOUT/guix/build/gnu-build-system.scm}:

source: (define %standard-phases ;; Standard build phases, as a list of symbol/procedure pairs. (let-syntax ((phases (syntax-rules () ((_ p ...) `((p . ,p) ...))))) (phases set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)))
es: (define %standard-phases ;; Fases de construcción estándar, como un listado de parejas símbolo/procedimiento. (let-syntax ((phases (syntax-rules () ((_ p ...) `((p . ,p) ...))))) (phases set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)))
it: (define %standard-phases ;; Fasi di compilazione standard, come un elenco di coppie simbolo/procedura. (let-syntax ((phases (syntax-rules () ((_ p ...) `((p . ,p) ...))))) (phases set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)))
pt_br: (define %standard-phases ;; Fases de construção padrão, como uma lista de pares de símbolos/procedimentos. (let-syntax ((phases (syntax-rules () ((_ p ...) `((p . ,p) ...))))) (phases set-SOURCE-DATE-EPOCH set-paths install-locale unpack bootstrap patch-usr-bin-file patch-source-shebangs configure patch-generated-file-shebangs build check install patch-shebangs strip validate-runpath validate-documentation-location delete-info-dir-file patch-dot-desktop-files make-dynamic-linker-cache install-license-files reset-gzip-timestamps compress-documentation)))

source: Or from the REPL:
es: O desde el REPL:
it: O dalla REPL:
pt_br: Ou do REPL:
sk: Alebo cez REPL:

source: If you want to know more about what happens during those phases, consult the associated procedures.
es: Si desea conocer más sobre que sucede durante esas fases, consulte los procedimientos asociados.
it: Se vuoi saperne di più su cosa succede durante queste fasi, consulta le procedure associate.
pt_br: Se quiser saber mais sobre o que acontece nessas fases, consulte os procedimentos associados.
sk: Ak chcete vedieť čo sa počas jednotlivých krokov odohráva, preštudujte si príslušné funkcie.

source: For instance, as of this writing the definition of @code{unpack} for the GNU build system is:
es: Para instanciar, como esta escribe la definición de @code{unpack} (desempaquetar) para el sistema compilador de GNU es:
it: Ad esempio, al momento in cui scrivo, la definizione di @code{unpack} per il sistema di compilazione GNU è:
pt_br: Por exemplo, no momento em que este livro foi escrito, a definição de @code{unpack} para o sistema de compilação GNU era:
sk: Napríklad, v čase písania týchto riadkov, bolo zadanie kroku @code{unpack} v zostavovacom systéme GNU nasledovné:

source: (define* (unpack #:key source #:allow-other-keys) "Unpack SOURCE in the working directory, and change directory within the source. When SOURCE is a directory, copy it in a sub-directory of the current working directory." (if (file-is-directory? source) (begin (mkdir "source") (chdir "source")
it: (define* (unpack #:key source #:allow-other-keys) "Decomprime SOURCE nella directory di lavoro e cambia directory all'interno del sorgente. Quando SOURCE è una directory, copiala in una sottodirectory della directory di lavoro corrente." (if (file-is-directory? source) (begin (mkdir "source") (chdir "source")
pt_br: (define* (unpack #:key source #:allow-other-keys) "Descompacte SOURCE no diretório de trabalho e altere o diretório dentro do source. Quando SOURCE for um diretório, copie-o em um subdiretório do atual diretório de trabalho." (if (file-is-directory? source) (begin (mkdir "source") (chdir "source")
