Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: updating Guix
pt_br: atualizando Guix

source: pull
pt_br: puxar

source: security, @command{guix pull}
pt_br: segurança, @command{guix pull}

source: authenticity, of code obtained with @command{guix pull}
pt_br: autenticidade, do código obtido com @command{guix pull}

source: Packages are installed or upgraded to the latest version available in the distribution currently available on your local machine. To update that distribution, along with the Guix tools, you must run @command{guix pull}: the command downloads the latest Guix source code and package descriptions, and deploys it. Source code is downloaded from a @uref{https://git-scm.com/book/en/, Git} repository, by default the official GNU@tie{}Guix repository, though this can be customized. @command{guix pull} ensures that the code it downloads is @emph{authentic} by verifying that commits are signed by Guix developers.
pt_br: Os pacotes são instalados ou atualizados para a versão mais recente disponível na distribuição atualmente disponível na sua máquina local. Para atualizar essa distribuição, junto com as ferramentas Guix, você deve executar @command{guix pull}: o comando baixa o código-fonte Guix mais recente e as descrições dos pacotes, e os implementa. O código-fonte é baixado de um repositório @uref{https://git-scm.com/book/pt-br/, Git}, por padrão o repositório oficial GNU@tie{}Guix, embora isso possa ser personalizado. @command{guix pull} garante que o código que ele baixa é @emph{autêntico}, verificando se os commits são assinados pelos desenvolvedores Guix.

source: Specifically, @command{guix pull} downloads code from the @dfn{channels} (@pxref{Channels}) specified by one of the following, in this order:
pt_br: Especificamente, @command{guix pull} baixa o código dos @dfn{canais} (@pxref{Canais}) especificados por um dos seguintes, nesta ordem:

source: the @option{--channels} option;
pt_br: a opção @option{--channels};

source: the user's @file{~/.config/guix/channels.scm} file, unless @option{-q} is passed;
pt_br: o arquivo @file{~/.config/guix/channels.scm} do usuário, a menos que @option{-q} seja passado;

source: the system-wide @file{/etc/guix/channels.scm} file, unless @option{-q} is passed (on Guix System, this file can be declared in the operating system configuration, @pxref{guix-configuration-channels, @code{channels} field of @code{guix-configuration}});
pt_br: o arquivo @file{/etc/guix/channels.scm} de todo o sistema, a menos que @option{-q} seja passado (no sistema Guix, este arquivo pode ser declarado na configuração do sistema operacional, @pxref{guix-configuration-channels, campo @code{channels} de @code{guix-configuration}});

source: the built-in default channels specified in the @code{%default-channels} variable.
pt_br: os canais padrão integrados especificados na variável @code{%default-channels}.

source: On completion, @command{guix package} will use packages and package versions from this just-retrieved copy of Guix. Not only that, but all the Guix commands and Scheme modules will also be taken from that latest version. New @command{guix} sub-commands added by the update also become available.
pt_br: Após a conclusão, @command{guix package} usará pacotes e versões de pacotes desta cópia recém-recuperada do Guix. Não apenas isso, mas todos os comandos Guix e módulos Scheme também serão retirados dessa versão mais recente. Novos subcomandos @command{guix} adicionados pela atualização também se tornam disponíveis.

source: Any user can update their Guix copy using @command{guix pull}, and the effect is limited to the user who ran @command{guix pull}. For instance, when user @code{root} runs @command{guix pull}, this has no effect on the version of Guix that user @code{alice} sees, and vice versa.
pt_br: Qualquer usuário pode atualizar sua cópia do Guix usando @command{guix pull}, e o efeito é limitado ao usuário que executou @command{guix pull}. Por exemplo, quando o usuário @code{root} executa @command{guix pull}, isso não tem efeito na versão do Guix que o usuário @code{alice} vê, e vice-versa.

source: The result of running @command{guix pull} is a @dfn{profile} available under @file{~/.config/guix/current} containing the latest Guix.
pt_br: O resultado da execução de @command{guix pull} é um @dfn{perfil} disponível em @file{~/.config/guix/current} contendo o Guix mais recente.

source: The @option{--list-generations} or @option{-l} option lists past generations produced by @command{guix pull}, along with details about their provenance:
pt_br: A opção @option{--list-generations} ou @option{-l} lista gerações anteriores produzidas por @command{guix pull}, juntamente com detalhes sobre sua procedência:

source: $ guix pull -l Generation 1 Jun 10 2018 00:18:18 guix 65956ad repository URL: https://git.guix.gnu.org/guix.git branch: origin/master commit: 65956ad3526ba09e1f7a40722c96c6ef7c0936fe
pt_br: $ guix pull -l Geração 1 10 jun 2018 00:18:18 guix 65956ad URL do repositório: https://git.guix.gnu.org/guix.git ramo: origin/master commit: 65956ad3526ba09e1f7a40722c96c6ef7c0936fe

source: Generation 2 Jun 11 2018 11:02:49 guix e0cc7f6 repository URL: https://git.guix.gnu.org/guix.git branch: origin/master commit: e0cc7f669bec22c37481dd03a7941c7d11a64f1d
pt_br: Geração 2 11 jun 2018 11:02:49 guix e0cc7f6 URL do repositório: https://git.guix.gnu.org/guix.git ramo: origin/master commit: e0cc7f669bec22c37481dd03a7941c7d11a64f1d

source: Generation 3 Jun 13 2018 23:31:07 (current) guix 844cc1c repository URL: https://git.guix.gnu.org/guix.git branch: origin/master commit: 844cc1c8f394f03b404c5bb3aee086922373490c
pt_br: Geração 3 13 jun 2018 23:31:07 (atual) guix 844cc1c URL do repositório: https://git.guix.gnu.org/guix.git ramo: origin/master commit: 844cc1c8f394f03b404c5bb3aee086922373490c

source: @xref{Invoking guix describe, @command{guix describe}}, for other ways to describe the current status of Guix.
pt_br: @xref{Invoking guix describe, @command{guix describe}}, para outras maneiras de descrever o status atual do Guix.

source: This @code{~/.config/guix/current} profile works exactly like the profiles created by @command{guix package} (@pxref{Invoking guix package}). That is, you can list generations, roll back to the previous generation---i.e., the previous Guix---and so on:
pt_br: Este perfil @code{~/.config/guix/current} funciona exatamente como os perfis criados por @command{guix package} (@pxref{Invoking guix package}). Ou seja, você pode listar gerações, reverter para a geração anterior --- ou seja, o Guix anterior --- e assim por diante:

source: $ guix pull --roll-back switched from generation 3 to 2 $ guix pull --delete-generations=1 deleting /var/guix/profiles/per-user/charlie/current-guix-1-link
pt_br: $ guix pull --roll-back trocado da geração 3 para 2 $ guix pull --delete-generations=1 excluindo /var/guix/profiles/per-user/charlie/current-guix-1-link

source: You can also use @command{guix package} (@pxref{Invoking guix package}) to manage the profile by naming it explicitly:
pt_br: Você também pode usar @command{guix package} (@pxref{Invoking guix package}) para gerenciar o perfil nomeando-o explicitamente:

source: $ guix package -p ~/.config/guix/current --roll-back switched from generation 3 to 2 $ guix package -p ~/.config/guix/current --delete-generations=1 deleting /var/guix/profiles/per-user/charlie/current-guix-1-link
pt_br: $ guix package -p ~/.config/guix/current --roll-back trocado da geração 3 para 2 $ guix package -p ~/.config/guix/current --delete-generations=1 excluindo /var/guix/profiles/per-user/charlie/current-guix-1-link

source: The @command{guix pull} command is usually invoked with no arguments, but it supports the following options:
pt_br: O comando @command{guix pull} geralmente é invocado sem argumentos, mas suporta as seguintes opções:

source: --branch=@var{branch}
pt_br: --branch=@var{ramo}

source: Download code for the @code{guix} channel from the specified @var{url}, at the given @var{commit} (a valid Git commit ID represented as a hexadecimal string or the name of a tag), or @var{branch}.
pt_br: Baixe o código para o canal @code{guix} do @var{url} especificado, no @var{commit} fornecido (um ID de commit Git válido representado como uma string hexadecimal ou o nome de uma tag) ou @var{ramo}.

source: @file{channels.scm}, configuration file
pt_br: @file{channels.scm}, arquivo de configuração

source: configuration file for channels
pt_br: arquivo de configuração para canais

source: These options are provided for convenience, but you can also specify your configuration in the @file{~/.config/guix/channels.scm} file or using the @option{--channels} option (see below).
pt_br: Essas opções são fornecidas para sua conveniência, mas você também pode especificar sua configuração no arquivo @file{~/.config/guix/channels.scm} ou usando a opção @option{--channels} (veja abaixo).

source: --channels=@var{file}
pt_br: --channels=@var{arquivo}

source: -C @var{file}
pt_br: -C @var{arquivo}

source: Read the list of channels from @var{file} instead of @file{~/.config/guix/channels.scm} or @file{/etc/guix/channels.scm}. @var{file} must contain Scheme code that evaluates to a list of channel objects. @xref{Channels}, for more information.
pt_br: Leia a lista de canais de @var{arquivo} em vez de @file{~/.config/guix/channels.scm} ou @file{/etc/guix/channels.scm}. @var{arquivo} deve conter código Scheme que avalia uma lista de objetos de canal. @xref{Channels}, para mais informações.

source: Inhibit loading of the user and system channel files, @file{~/.config/guix/channels.scm} and @file{/etc/guix/channels.scm}.
pt_br: Inibir o carregamento dos arquivos de canal do usuário e do sistema, @file{~/.config/guix/channels.scm} e @file{/etc/guix/channels.scm}.

source: channel news
pt_br: canal de notícias

source: Display news written by channel authors for their users for changes made since the previous generation (@pxref{Channels, Writing Channel News}). When @option{--details} is passed, additionally display new and upgraded packages.
pt_br: Exibir notícias escritas por autores de canais para seus usuários para alterações feitas desde a geração anterior (@pxref{Channels, Escrevendo Notícias de Canal}). Quando @option{--details} é passado, exibir adicionalmente pacotes novos e atualizados.

source: You can view that information for previous generations with @command{guix pull -l}.
pt_br: Você pode visualizar essas informações de gerações anteriores com @command{guix pull -l}.

source: List all the generations of @file{~/.config/guix/current} or, if @var{pattern} is provided, the subset of generations that match @var{pattern}. The syntax of @var{pattern} is the same as with @code{guix package --list-generations} (@pxref{Invoking guix package}).
pt_br: Liste todas as gerações de @file{~/.config/guix/current} ou, se @var{padrão} for fornecido, o subconjunto de gerações que correspondem a @var{padrão}. A sintaxe de @var{padrão} é a mesma de @code{guix package --list-generations} (@pxref{Invoking guix package}).

source: By default, this prints information about the channels used in each revision as well as the corresponding news entries. If you pass @option{--details}, it will also print the list of packages added and upgraded in each generation compared to the previous one.
pt_br: Por padrão, isso imprime informações sobre os canais usados em cada revisão, bem como as entradas de notícias correspondentes. Se você passar @option{--details}, ele também imprimirá a lista de pacotes adicionados e atualizados em cada geração em comparação com a anterior.

source: Instruct @option{--list-generations} or @option{--news} to display more information about the differences between subsequent generations---see above.
pt_br: Instrua @option{--list-generations} ou @option{--news} para exibir mais informações sobre as diferenças entre gerações subsequentes — veja acima.

source: Roll back to the previous @dfn{generation} of @file{~/.config/guix/current}---i.e., undo the last transaction.
pt_br: Reverta para a @dfn{geração} anterior de @file{~/.config/guix/current}---ou seja, desfaça a última transação.

source: If the current generation matches, it is @emph{not} deleted.
pt_br: Se a geração atual corresponder, ela @emph{não} será excluída.

source: @xref{Invoking guix describe}, for a way to display information about the current generation only.
pt_br: @xref{Invoking guix describe}, para uma maneira de exibir informações somente sobre a geração atual.

source: Use @var{profile} instead of @file{~/.config/guix/current}.
pt_br: Use @var{perfil} em vez de @file{~/.config/guix/current}.

source: Show which channel commit(s) would be used and what would be built or substituted but do not actually do it.
pt_br: Mostre quais commits de canal seriam usados e o que seria construído ou substituído, mas não faça isso de fato.

source: Allow pulling older or unrelated revisions of channels than those currently in use.
pt_br: Permitir extrair revisões de canais mais antigas ou não relacionadas às que estão em uso atualmente.

source: downgrade attacks, protection against
pt_br: ataques de downgrade, proteção contra

source: By default, @command{guix pull} protects against so-called ``downgrade attacks'' whereby the Git repository of a channel would be reset to an earlier or unrelated revision of itself, potentially leading you to install older, known-vulnerable versions of software packages.
pt_br: Por padrão, @command{guix pull} protege contra os chamados "ataques de downgrade'', nos quais o repositório Git de um canal seria redefinido para uma revisão anterior ou não relacionada a si mesmo, potencialmente levando você a instalar versões mais antigas e conhecidas de pacotes de software.

source: Make sure you understand its security implications before using @option{--allow-downgrades}.
pt_br: Certifique-se de entender as implicações de segurança antes de usar @option{--allow-downgrades}.

source: Allow pulling channel code without authenticating it.
pt_br: Permitir extrair código de canal sem autenticá-lo.

source: authentication, of channel code
pt_br: autenticação, de código de canal

source: By default, @command{guix pull} authenticates code downloaded from channels by verifying that its commits are signed by authorized developers, and raises an error if this is not the case. This option instructs it to not perform any such verification.
pt_br: Por padrão, @command{guix pull} autentica o código baixado de canais verificando se seus commits são assinados por desenvolvedores autorizados e gera um erro se esse não for o caso. Esta opção o instrui a não executar nenhuma verificação desse tipo.

source: Make sure you understand its security implications before using @option{--disable-authentication}.
pt_br: Certifique-se de entender as implicações de segurança antes de usar @option{--disable-authentication}.

source: -s @var{system}
pt_br: -s @var{sistema}

source: Attempt to build for @var{system}---e.g., @code{i686-linux}---instead of the system type of the build host.
pt_br: Tente compilar para @var{sistema}---por exemplo, @code{i686-linux}---em vez do tipo de sistema do host de compilação.

source: Use the bootstrap Guile to build the latest Guix. This option is only useful to Guix developers.
pt_br: Use o bootstrap Guile para construir o Guix mais recente. Esta opção é útil somente para desenvolvedores Guix.

source: The @dfn{channel} mechanism allows you to instruct @command{guix pull} which repository and branch to pull from, as well as @emph{additional} repositories containing package modules that should be deployed. @xref{Channels}, for more information.
pt_br: O mecanismo dos @dfn{canais} permite que você instrua @command{guix pull} de qual repositório e branch extrair, bem como @emph{repositórios adicionais} contendo módulos de pacote que devem ser implantados. @xref{Channels}, para mais informações.

source: In addition, @command{guix pull} supports all the common build options (@pxref{Common Build Options}).
pt_br: Além disso, @command{guix pull} suporta todas as opções de compilação comuns (@pxref{Common Build Options}).

source: Invoking @command{guix time-machine}
pt_br: Invocando @command{guix time-machine}

source: pinning, channels
pt_br: fixação, canais

source: replicating Guix
pt_br: replicando Guix

source: reproducibility, of Guix
pt_br: reprodutibilidade, de Guix

source: The @command{guix time-machine} command provides access to other revisions of Guix, for example to install older versions of packages, or to reproduce a computation in an identical environment. The revision of Guix to be used is defined by a commit or by a channel description file created by @command{guix describe} (@pxref{Invoking guix describe}).
pt_br: O comando @command{guix time-machine} fornece acesso a outras revisões do Guix, por exemplo, para instalar versões mais antigas de pacotes ou para reproduzir uma computação em um ambiente idêntico. A revisão do Guix a ser usada é definida por um commit ou por um arquivo de descrição de canal criado por @command{guix describe} (@pxref{Invoking guix describe}).

source: Let's assume that you want to travel to those days of November 2020 when version 1.2.0 of Guix was released and, once you're there, run the @command{guile} of that time:
pt_br: Vamos supor que você queira viajar para aqueles dias de novembro de 2020, quando a versão 1.2.0 do Guix foi lançada e, uma vez lá, executar o @command{guile} daquela época:

source: The command above fetches Guix@tie{}1.2.0 (and possibly other channels specified by your @file{channels.scm} configuration files---see below) and runs its @command{guix environment} command to spawn an environment in a container running @command{guile} (@command{guix environment} has since been subsumed by @command{guix shell}; @pxref{Invoking guix shell}). It's like driving a DeLorean@footnote{If you don't know what a DeLorean is, consider traveling back to the 1980's. (@uref{https://www.imdb.com/title/tt0088763/, Back to the Future (1985)})}! The first @command{guix time-machine} invocation can be expensive: it may have to download or even build a large number of packages; the result is cached though and subsequent commands targeting the same commit are almost instantaneous.
pt_br: O comando acima busca Guix@tie{}1.2.0 (e possivelmente outros canais especificados pelos seus arquivos de configuração @file{channels.scm} --- veja abaixo) e executa seu comando @command{guix environment} para gerar um ambiente em um contêiner executando @command{guile} (@command{guix environment} foi desde então subsumido por @command{guix shell}; @pxref{Invoking guix shell}). É como dirigir um DeLorean@footnote{Se você não sabe o que é um DeLorean, considere viajar de volta para a década de 1980. (@uref{https://www.imdb.com/title/tt0088763/, De Volta para o Futuro (1985)})}! A primeira invocação de @command{guix time-machine} pode ser cara: pode ser necessário baixar ou até mesmo construir um grande número de pacotes; o resultado é armazenado em cache e os comandos subsequentes direcionados ao mesmo commit são quase instantâneos.

source: As for @command{guix pull}, in the absence of any options, @command{time-machine} fetches the latest commits of the channels specified in @file{~/.config/guix/channels.scm}, @file{/etc/guix/channels.scm}, or the default channels; the @option{-q} option lets you ignore these configuration files. The command:
pt_br: Quanto ao @command{guix pull}, na ausência de quaisquer opções, o @command{time-machine} busca os últimos commits dos canais especificados em @file{~/.config/guix/channels.scm}, @file{/etc/guix/channels.scm}, ou os canais padrão; a opção @option{-q} permite que você ignore esses arquivos de configuração. O comando:

source: will thus build the package @code{hello} as defined in the main branch of Guix, without any additional channel, which is in general a newer revision of Guix than you have installed. Time travel works in both directions!
pt_br: construirá então o pacote @code{hello} conforme definido no branch principal do Guix, sem nenhum canal adicional, que é em geral uma revisão mais nova do Guix do que a que você instalou. A viagem no tempo funciona em ambas as direções!

source: The history of Guix is immutable and @command{guix time-machine} provides the exact same software as they are in a specific Guix revision. Naturally, no security fixes are provided for old versions of Guix or its channels. A careless use of @command{guix time-machine} opens the door to security vulnerabilities. @xref{Invoking guix pull, @option{--allow-downgrades}}.
pt_br: O histórico do Guix é imutável e @command{guix time-machine} fornece exatamente o mesmo software que eles estão em uma revisão específica do Guix. Naturalmente, nenhuma correção de segurança é fornecida para versões antigas do Guix ou seus canais. Um uso descuidado do @command{guix time-machine} abre a porta para vulnerabilidades de segurança. @xref{Invoking guix pull, @option{--allow-downgrades}}.

source: @command{guix time-machine} raises an error when attempting to travel to commits older than ``v0.16.0'' (commit @samp{4a0b87f0}), dated Dec.@: 2018. This is one of the oldest commits supporting the channel mechanism that makes ``time travel'' possible.
pt_br: @command{guix time-machine} gera um erro ao tentar viajar para commits mais antigos que "v0.16.0" (commit @samp{4a0b87f0}), datados de Dez.@: 2018. Este é um dos commits mais antigos que oferecem suporte ao mecanismo de canal que torna a "viagem no tempo" possível.

source: Although it should technically be possible to travel to such an old commit, the ease to do so will largely depend on the availability of binary substitutes. When traveling to a distant past, some packages may not easily build from source anymore. One such example are old versions of OpenSSL whose tests would fail after a certain date. This particular problem can be worked around by running a @dfn{virtual build machine} with its clock set to the right time (@pxref{build-vm, Virtual Build Machines}).
pt_br: Embora seja tecnicamente possível viajar para um commit tão antigo, a facilidade para fazê-lo dependerá em grande parte da disponibilidade de substitutos binários. Ao viajar para um passado distante, alguns pacotes podem não ser mais facilmente construídos a partir da fonte. Um exemplo são as versões antigas do OpenSSL cujos testes falhavam após uma certa data. Esse problema em particular pode ser contornado executando uma @dfn{máquina de construção virtual} com seu relógio ajustado para a hora certa (@pxref{build-vm, Máquinas de Construção Virtual}).

source: guix time-machine @var{options}@dots{} -- @var{command} @var {arg}@dots{}
pt_br: guix time-machine @var{opções}@dots{} -- @var{comando} @var {arg}@dots{}

source: where @var{command} and @var{arg}@dots{} are passed unmodified to the @command{guix} command of the specified revision. The @var{options} that define this revision are the same as for @command{guix pull} (@pxref{Invoking guix pull}):
pt_br: onde @var{comando} e @var{arg}@dots{} são passados sem modificações para o comando @command{guix} da revisão especificada. As @var{opções} que definem esta revisão são as mesmas que para @command{guix pull} (@pxref{Invoking guix pull}):

source: Use the @code{guix} channel from the specified @var{url}, at the given @var{commit} (a valid Git commit ID represented as a hexadecimal string or the name of a tag), or @var{branch}.
pt_br: Use o canal @code{guix} do @var{url} especificado, no @var{commit} fornecido (um ID de commit Git válido representado como uma string hexadecimal ou o nome de uma tag) ou @var{ramo}.
