Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: @xref{Build Systems,,, guix, GNU Guix Reference Manual}, for more information on build systems, or check the source code in the @samp{$GUIX_CHECKOUT/guix/build} and @samp{$GUIX_CHECKOUT/guix/build-system} directories.
es: @xref{Sistemas de construcción,,, guix.es, Manual de referencia de GNU Guix}, para más información sobre sistemas de compilación, o consulte el código fuente en los directorios @samp{$GUIX_CHECKOUT/guix/build} y @samp{$GUIX_CHECKOUT/guix/build-system}.
it: @xref{Sistemi di build,,, guix.it, Manuale di riferimento di GNU Guix}, per maggiori informazioni sui sistemi di compilazione, o controlla il codice sorgente nelle directory @samp{$GUIX_CHECKOUT/guix/build} e @samp{$GUIX_CHECKOUT/guix/build-system}.
pt_br: @xref{Sistemas de compilação,,, guix.pt_BR, Manual de Referência GNU Guix}, para obter mais informações sobre sistemas de construção, ou verifique o código-fonte em @samp{$GUIX_CHECKOUT/guix/build} e @samp{$GUIX_CHECKOUT/guix/build -sistema} diretórios.
sk: Viď @ref{Build Systems,,, guix, GNU Guix Reference Manual} alebo zdrojový kód v priečinkoch @samp{$GUIX_CHECKOUT/guix/build} a @samp{$GUIX_CHECKOUT/guix/build-system} pre viac podrobností o zostavovacích systémoch.

source: We can't repeat it enough: having a full-fledged programming language at hand empowers us in ways that reach far beyond traditional package management.
es: No nos cansaremos de repetirlo: tener a mano un lenguaje de programación completo nos capacita de formas que van mucho más allá de la gestión tradicional de paquetes.
it: Non possiamo ripeterlo abbastanza: avere un linguaggio di programmazione completo a portata di mano ci dà potere in modi che vanno ben oltre la tradizionale gestione dei pacchetti.
pt_br: Não podemos repetir o suficiente: ter uma linguagem de programação completa em mãos nos capacita de maneiras que vão muito além do gerenciamento tradicional de pacotes.
sk: Nemôžme to nezdôrazniť: mať po ruke plnohodnotný programovací jazyk nám umožňuje oveľa viac než len bežnú správu balíkov.

source: Let's illustrate this with some awesome features of Guix!
es: Ilustraremos esto con algunas características asombrosas de Guix.
it: Illustriamo questo con alcune fantastiche funzionalità di Guix!
pt_br: Vamos ilustrar isso com alguns recursos incríveis do Guix!
sk: Ukážme si to na príklade niekoľkých úžasných súčastí Guixu!

source: You might find some build systems good enough that there is little to do at all to write a package, to the point that it becomes repetitive and tedious after a while. A @emph{raison d'être} of computers is to replace human beings at those boring tasks. So let's tell Guix to do this for us and create the package definition of an R package from CRAN (the output is trimmed for conciseness):
es: Puedes encontrar algunos sistemas de construcción lo suficientemente buenos como para que haya poco que hacer para escribir un paquete, hasta el punto de que se vuelve repetitivo y tedioso después de un tiempo. Una @emph{razón de ser} de los ordenadores es reemplazar a los seres humanos en esas tareas aburridas. Así que vamos a decirle a Guix que haga esto por nosotros y cree la definición de paquete de un paquete R desde CRAN (la salida está recortada para ser concisos):
it: Potresti trovare alcuni sistemi di compilazione così buoni che c'è poco da fare per scrivere un pacchetto, al punto che diventa ripetitivo e noioso dopo un po'. Una @emph{ragione d'essere} dei computer è quella di sostituire gli esseri umani in questi compiti noiosi. Quindi, diciamo a Guix di farlo per noi e di creare la definizione di pacchetto di un pacchetto R da CRAN (l'output è troncato per brevità):
pt_br: Você pode achar alguns sistemas de compilação bons o suficiente para que haja pouco a fazer para escrever um pacote, a ponto de se tornar repetitivo e tedioso depois de um tempo. Uma @emph{razão de ser} dos computadores é substituir os seres humanos nessas tarefas chatas. Então, vamos dizer ao Guix para fazer isso para nós e criar a definição de pacote de um pacote R do CRAN (a saída é cortada para ser concisa):
sk: Niektoré zostavovacie systémy sú natoľko dobré, že toho na zadanie balíka ani veľa netreba, a to až do takej miery, že sa vám zadávanie balíkov rýchlo zunuje. Jedným z dôvodov bytia počítačov je nahradiť ľudí pri vykonávaní týchto nudných činností. Nechajme teda Guix urobiť to za nás a vytvoriť zadanie nejakého balíka R pochádzajúceho z CRANu (výstup bol skrátený pre ušetrenie miesta):

source: (define-public r-walrus (package (name "r-walrus") (version "1.0.3") (source (origin (method url-fetch) (uri (cran-uri "walrus" version)) (sha256 (base32 "1nk2glcvy4hyksl5ipq2mz8jy4fss90hx6cq98m3w96kzjni6jjj")))) (build-system r-build-system) (propagated-inputs (list r-ggplot2 r-jmvcore r-r6 r-wrs2)) (home-page "https://github.com/jamovi/walrus") (synopsis "Robust Statistical Methods") (description "This package provides a toolbox of common robust statistical tests, including robust descriptives, robust t-tests, and robust ANOVA. It is also available as a module for 'jamovi' (see <https://www.jamovi.org> for more information). Walrus is based on the WRS2 package by Patrick Mair, which is in turn based on the scripts and work of Rand Wilcox. These analyses are described in depth in the book 'Introduction to Robust Estimation & Hypothesis Testing'.") (license gpl3)))
es: (define-public r-walrus (package (name "r-walrus") (version "1.0.3") (source (origin (method url-fetch) (uri (cran-uri "walrus" version)) (sha256 (base32 "1nk2glcvy4hyksl5ipq2mz8jy4fss90hx6cq98m3w96kzjni6jjj")))) (build-system r-build-system) (propagated-inputs (list r-ggplot2 r-jmvcore r-r6 r-wrs2)) (home-page "https://github.com/jamovi/walrus") (synopsis "Robust Statistical Methods") (description "Este paquete proporciona una caja de herramientas de pruebas estadísticas robustas comunes, incluidas las descriptivas robustas, pruebas-t robustas, y ANOVA robusto. También está disponible como módulo para 'jamovi' (consulte <https://www.jamovi.org> para más información). Walrus está baso en el paquete WRS2 de Patrick Mair, que a su vez se basa en los guiones y el trabajo de Rand Wilcox. Estos análisis se describen en profundidad en el libro 'Introducción a la estimación robusta y la comprobación de hipótesis'.") (licencia gpl3)))
it: (define-public r-walrus (package (name "r-walrus") (version "1.0.3") (source (origin (method url-fetch) (uri (cran-uri "walrus" version)) (sha256 (base32 "1nk2glcvy4hyksl5ipq2mz8jy4fss90hx6cq98m3w96kzjni6jjj")))) (build-system r-build-system) (propagated-inputs (list r-ggplot2 r-jmvcore r-r6 r-wrs2)) (home-page "https://github.com/jamovi/walrus") (synopsis "Metodi Statistici Robusti") (description "Questo pacchetto fornisce una cassetta degli attrezzi di comuni test statistici robusti, inclusi descrittori robusti, t-test robusti e ANOVA robusta. È disponibile anche come modulo per 'jamovi' (vedere <https://www.jamovi.org> per maggiori informazioni). Walrus si basa sul pacchetto WRS2 di Patrick Mair, che a sua volta si basa sugli script e sul lavoro di Rand Wilcox. Queste analisi sono descritte in dettaglio nel libro 'Introduction to Robust Estimation & Hypothesis Testing'.") (license gpl3)))
pt_br: (define-public r-walrus (package (name "r-walrus") (version "1.0.3") (source (origin (method url-fetch) (uri (cran-uri "walrus" version)) (sha256 (base32 "1nk2glcvy4hyksl5ipq2mz8jy4fss90hx6cq98m3w96kzjni6jjj")))) (build-system r-build-system) (propagated-inputs (list r-ggplot2 r-jmvcore r-r6 r-wrs2)) (home-page "https://github.com/jamovi/walrus") (synopsis "Métodos Estatísticos Robustos") (description "Este pacote fornece uma caixa de ferramentas de testes estatísticos robustos comuns, incluindo descritivos robustos, testes t robustos e ANOVA robusto. Ele também está disponível como um módulo para 'jamovi' (veja <https://www.jamovi.org> para mais informações). O Walrus é baseado no pacote WRS2 de Patrick Mair, que por sua vez é baseado nos scripts e trabalho de Rand Wilcox. Essas análises são descritas em profundidade no livro 'Introdução à Estimativa Robusta e Teste de Hipóteses'.") (license gpl3)))

source: The recursive importer won't import packages for which Guix already has package definitions, except for the very first.
es: El importador recursivo no importará paquetes para los que Guix ya tenga definiciones de paquetes, excepto para el primero.
it: L'importatore ricorsivo non importerà i pacchetti per i quali Guix ha già definizioni di pacchetto, ad eccezione del primissimo.
pt_br: O importador recursivo não importará pacotes para os quais o Guix já possui definições de pacote, exceto o primeiro.
sk: Rekurzívny nahrávač nahrá len balíky, pre ktoré Guix ešte nemá zadanie, okrem úplne prvého.

source: Not all applications can be packaged this way, only those relying on a select number of supported systems. Read about the full list of importers in the guix import section of the manual (@pxref{Invoking guix import,,, guix, GNU Guix Reference Manual}).
es: No todas las aplicaciones pueden empaquetarse de esta forma, sólo aquellas que dependen de un número selecto de sistemas soportados. Lea sobre la lista completa de importadores en la sección guix import del manual (@pxref{Invocación de guix import,, guix, Manual de referencia de GNU Guix}).
it: Non tutte le applicazioni possono essere impacchettate in questo modo, solo quelle che si basano su un numero selezionato di sistemi supportati. Leggi l'elenco completo degli importatori nella sezione import di guix del manuale (@pxref{Invocare guix import,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: Nem todos os aplicativos podem ser empacotados dessa forma, apenas aqueles que dependem de um número selecionado de sistemas suportados. Leia sobre a lista completa de importadores na seção de importação de guix do manual (@pxref{Invocando guix import,,, guix.pt_BR, Manual de Referência do GNU Guix}).
sk: Takto vytvoriť zadania balíkov nie je možné pre všetky aplikácie, iba pre tie, ktoré sa opierajú o vybraný počet podporovaných systémov. Viď úplný zoznam nahrávačov v príslušnom oddiele príručky (@pxref{Invoking guix import,,, guix, GNU Guix Reference Manual}).

source: Guix can be smart enough to check for updates on systems it knows. It can report outdated package definitions with
es: Guix puede ser lo suficientemente inteligente como para buscar actualizaciones en los sistemas que conoce. Puede informar de definiciones de paquetes obsoletas con
it: Guix è abbastanza intelligente da controllare gli aggiornamenti sui sistemi che conosce. Può segnalare definizioni di pacchetto obsolete con
pt_br: O Guix pode ser inteligente o suficiente para verificar atualizações nos sistemas que conhece. Ele pode relatar definições de pacotes desatualizadas com
sk: Guix môže byť dostatočne múdry na to, aby vyhľadal aktualizácie v systémoch, ktoré pozná. To, ktoré balíky sú zastarané možno zistiť pomocou

source: In most cases, updating a package to a newer version requires little more than changing the version number and the checksum. Guix can do that automatically as well:
es: En la mayoría de los casos, actualizar un paquete a una versión más reciente requiere poco más que cambiar el número de versión y la suma de comprobación. Guix también puede hacerlo automáticamente:
it: Nella maggior parte dei casi, l'aggiornamento di un pacchetto a una versione più recente richiede poco più che la modifica del numero di versione e del checksum. Guix può farlo anche automaticamente:
pt_br: Na maioria dos casos, atualizar um pacote para uma versão mais recente requer pouco mais do que alterar o número da versão e a soma de verificação. Guix também pode fazer isso automaticamente:
sk: Vo väčšine prípadov vyžaduje aktualizácia balíka na novšiu verziu len o niečo viac ako zmeniť číslo verzie a kontrolný súčet. Aj toto môže Guix vykonať automaticky:

source: If you've started browsing the existing package definitions, you might have noticed that a significant number of them have a @code{inherit} field:
es: Si has empezado a navegar por las definiciones de paquetes existentes, te habrás dado cuenta de que un número significativo de ellos tienen un campo @code{inherit}:
it: Se hai iniziato a sfogliare le definizioni dei pacchetti esistenti, potresti aver notato che un numero significativo di esse ha un campo @code{inherit}:
pt_br: Se você começou a navegar pelas definições de pacotes existentes, deve ter notado que um número significativo deles possui um campo @code{inherit}:
sk: Ak ste si už začali prezerať zadania jestvujúcich balíkov, možno ste si všimli, že niektoré z nich obsahujú pole @code{inherit}:

source: All unspecified fields are inherited from the parent package. This is very convenient to create alternative packages, for instance with different source, version or compilation options.
es: Todos los campos no especificados son heredados desde el paquete antecesor. Esto es muy conveniente para crear paquetes alternativos, para instancia con opciones de fuentes, versión o compilación diferentes.
it: Tutti i campi non specificati sono ereditati dal pacchetto padre. Questo è molto comodo per creare pacchetti alternativi, ad esempio con sorgenti, versioni o opzioni di compilazione diverse.
pt_br: Todos os campos não especificados são herdados do pacote pai. Isto é muito conveniente para criar pacotes alternativos, por exemplo, com diferentes fontes, versões ou opções de compilação.
sk: Všetky neupresnené polia sú zdedené z nadradeného balíka. Je to veľmi užitočné na vytváranie obmien balíkov, napr. s odlišným zdrojom, verziou alebo voľbami zostavenia.

source: Sadly, some applications can be tough to package. Sometimes they need a patch to work with the non-standard file system hierarchy enforced by the store. Sometimes the tests won't run properly. (They can be skipped but this is not recommended.) Other times the resulting package won't be reproducible.
es: Tristemente, algunas aplicaciones pueden ser cambiadas para empaquetar. Algunas veces necesitan un parche para funcionar con la jerarquía del sistema de archivo no estándar forzadas por el almacenaje. Algunas veces las pruebas no funcionarán apropiadamente. (Pueden ser omitidos pero esto no es lo recomentado.) Otras veces el paquete resultante no sería reproducible.
it: Purtroppo, alcune applicazioni possono essere difficili da impacchettare. A volte hanno bisogno di una patch per funzionare con la gerarchia del file system non standard imposta dallo store. A volte i test non vengono eseguiti correttamente. (Possono essere saltati ma questo non è raccomandato.) Altre volte il pacchetto risultante non sarà riproducibile.
pt_br: Infelizmente, alguns aplicativos podem ser difíceis de empacotar. Às vezes, eles precisam de um patch para funcionar com a hierarquia do sistema de arquivos não padrão imposta pelo armazém. Às vezes, os testes não funcionam corretamente. (Eles podem ser ignorados, mas isso não é recomendado.) Outras vezes, o pacote resultante não será reproduzível.
sk: Nanešťastie, zadanie balíka môže byť pre niektoré aplikácie veľmi zložité. Niekedy je potrebná záplata, aby mohla aplikácia fungovať v neobyčajnom systéme súborov úložiska. Niekedy sa zase sústava testov nespúšťa správne (môžete ich preskočiť ale neodporúča sa to). Inokedy nie je výsledný balík opakovateľný.

source: Should you be stuck, unable to figure out how to fix any sort of packaging issue, don't hesitate to ask the community for help.
es: Estaría atascado, incapaz de figurar como reparar cualquier breve problema de empaquetado, no dude preguntar a la comunidad para ayuda.
it: Se dovessi trovarti bloccato, incapace di capire come risolvere qualsiasi tipo di problema di packaging, non esitare a chiedere aiuto alla comunità.
pt_br: Se você estiver emperrado, incapaz de descobrir como resolver qualquer tipo de problema de empacotamento, não hesite em pedir ajuda à comunidade.
sk: Keď už neviete ako ďalej a nie ste schopní prísť na to, ako vyriešiť nejakú ťažkosť so zadávaním balíka, neváhajte požiadať o pomoc spoločenstvo.

source: See the @uref{https://guix.gnu.org/contact/, Guix homepage} for information on the mailing lists, IRC, etc.
es: Consulte la @uref{https://guix.gnu.org/contact/, página inicial de Guix} para información sobre los listados de correo, IRC, etc.
it: Vedi la @uref{https://guix.gnu.org/contact/, homepage di Guix} per informazioni sulle mailing list, IRC, ecc.

source: This tutorial was a showcase of the sophisticated package management that Guix boasts. At this point we have mostly restricted this introduction to the @code{gnu-build-system} which is a core abstraction layer on which more advanced abstractions are based.
es: Este tutorial fue una muestra de caso de la gestión de empaquetado sofisticado que lleva Guix. En este punto estamos restringidos mayormente esta introducción sobre el @code{gnu-system} el cual es una capa de abstracción del núcleo en el cual están basadas más abstracciones avanzadas.
it: Questo tutorial è stato una vetrina della sofisticata gestione dei pacchetti di cui Guix si vanta. A questo punto abbiamo in gran parte limitato questa introduzione al @code{gnu-build-system} che è un livello di astrazione fondamentale su cui si basano astrazioni più avanzate.
pt_br: Este tutorial foi uma amostra do sofisticado gerenciamento de pacotes que o Guix possui. Neste ponto, restringimos principalmente esta introdução ao @code{gnu-build-system}, que é uma camada de abstração central na qual se baseiam abstrações mais avançadas.
sk: Tento návod vám predviedol vyumelkovanú správu balíkov, ktorou sa Guix chváli. V tejto chvíli sme tento úvod zúžili na @code{gnu-build-system} predstavujúci ústrednú abstrakčnú vrstvu, na ktorej sú založené pokročilejšie abstrakčné vrstvy.

source: Where do we go from here? Next we ought to dissect the innards of the build system by removing all abstractions, using the @code{trivial-build-system}: this should give us a thorough understanding of the process before investigating some more advanced packaging techniques and edge cases.
es: ¿donde vamos desde aquí? Siguiente quisimos deseccionar los internas del sistema de construcción eliminando todas las abstracciones, utilizando el @code{trivial-build-system}: esto nos proporcionaría una comprensión a través del proceso antes de investigar algunas técnicas de empaquetado más avanzado y casos del borde.
it: Da dove proseguiamo? Successivamente dovremmo dissezionare le viscere del sistema di compilazione rimuovendo tutte le astrazioni, usando il @code{trivial-build-system}: questo dovrebbe darci una comprensione approfondita del processo prima di indagare su alcune tecniche di packaging più avanzate e casi limite.
pt_br: Para onde vamos daqui? Em seguida, devemos dissecar as entranhas do sistema de construção, removendo todas as abstrações, usando o @code{trivial-build-system}: isso deve nos dar uma compreensão completa do processo antes de investigar algumas técnicas de empacotamento mais avançadas e casos extremos.
sk: Kam teraz? Ďalej by sme si mali posvietiť na vnútorné fungovanie zostavovacích systémov vynechajúc všetky abstrakčné vrstvy prostredníctvom @code{trivial-build-system}. Malo by nám to umožniť lepšie porozumieť postupu zostavenia, skôr ako sa dostaneme k pokročilejším postupom a výnimkám.

source: Other features worth exploring are the interactive editing and debugging capabilities of Guix provided by the Guile REPL@.
es: Otras características los cuales exploran son la interactividad editanto y depurando capacidades de Guix proporcionadas por el REPL@ de Guile.
it: Altre funzionalità degne di esplorazione sono le capacità di editing e debugging interattivi di Guix fornite dal Guile REPL@.
pt_br: Outros recursos que valem a pena explorar são os recursos interativos de edição e depuração do Guix fornecidos pelo Guile REPL@.
sk: Ďalšie funkcie, ktoré sa oplatí preskúmať, sú interaktívna úprava a možnosti ladenia Guixu poskytované cez Guile REPL@.

source: Those fancy features are completely optional and can wait; now is a good time to take a well-deserved break. With what we've introduced here you should be well armed to package lots of programs. You can get started right away and hopefully we will see your contributions soon!
es: Esas características de lujo son completamente opcionales y pueden esperar; ahora es un buen momento para tomarse un merecido descanso. Con lo que hemos presentado aquí deberías estar bien armado para empaquetar muchos programas. Puede empezar ahora mismo y esperamos ver pronto sus contribuciones.
it: Queste fantasiose funzionalità sono completamente opzionali e possono aspettare; ora è un buon momento per prendersi una meritata pausa. Con quanto abbiamo introdotto qui dovresti essere ben attrezzato per impacchettare molti programmi. Puoi iniziare subito e speriamo di vedere i tuoi contributi presto!
pt_br: Esses recursos sofisticados são totalmente opcionais e podem esperar; agora é um bom momento para fazer uma pausa bem merecida. Com o que apresentamos aqui você deve estar bem preparado para empacotar muitos programas. Você pode começar imediatamente e esperamos ver suas contribuições em breve!
sk: Tieto pokročilé funkcie sú len doplnkové a môžu počkať. Teraz je ten správny čas na zaslúženú prestávku. S tým, čo sme si ukázali, by ste si mali vystačiť pri zadávaní balíkov pre mnoho programov. Môžete sa do toho hneď pustiť a dúfame, že nás vašim príspevkom potešíte už čoskoro!

source: The @uref{https://guix.gnu.org/manual/en/html_node/Defining-Packages.html, package reference in the manual}
es: La @uref{https://guix.gnu.org/manual/es/html_node/Definicion-de-paquetes.html, referencia de paquete dentro del manual}
it: La @uref{https://guix.gnu.org/manual/devel/it/html_node/Definire-i-pacchetti.html, reference del pacchetto nel manuale}

source: @uref{https://gitlab.com/pjotrp/guix-notes/blob/master/HACKING.org, Pjotr’s hacking guide to GNU Guix}
es: @uref{https://gitlab.com/pjotrp/guix-notes/blob/master/HACKING.org, La guía de jaqueo de Pjotr para GNU Guix}
it: @uref{https://gitlab.com/pjotrp/guix-notes/blob/master/HACKING.org, la guida di hacking di Pjotr a GNU Guix}
pt_br: @uref{https://gitlab.com/pjotrp/guix-notes/blob/master/HACKING.org, guia de hacking de Pjotr para GNU Guix}
sk: @uref{https://gitlab.com/pjotrp/guix-notes/blob/master/HACKING.org, Pjotrova príručka na prispôsobenie GNU Guix}

source: @uref{https://guix.gnu.org/guix-ghm-andreas-20130823.pdf, ``GNU Guix: Package without a scheme!''}, by Andreas Enge
es: @uref{https://guix.gnu.org/guix-ghm-andreas-20130823.pdf, ``GNU Guix: ¡Paquete sin un scheme!''}, de Andreas Enge
it: @uref{https://guix.gnu.org/guix-ghm-andreas-20130823.pdf, ``GNU Guix: Package without a scheme!''}, di Andreas Enge
