Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: This is a way to ``convert'' command-line arguments into a manifest. For example, imagine you are tired of typing long lines and would like to get a manifest equivalent to this command line:
pt_br: Esta é uma maneira de ``converter'' argumentos de linha de comando em um manifesto. Por exemplo, imagine que você está cansado de digitar linhas longas e gostaria de obter um manifesto equivalente a esta linha de comando:

source: Just add @option{--export-manifest} to the command line above:
pt_br: Basta adicionar @option{--export-manifest} à linha de comando acima:

source: You can store it into a file, say @file{manifest.scm}, and from there pass it to @command{guix shell} or indeed pretty much any @command{guix} command:
pt_br: Você pode armazená-lo em um arquivo, digamos @file{manifest.scm}, e de lá passá-lo para @command{guix shell} ou praticamente qualquer comando @command{guix}:

source: Voilà, you've converted a long command line into a manifest! That conversion process honors package transformation options (@pxref{Package Transformation Options}) so it should be lossless.
pt_br: Voilà, você converteu uma longa linha de comando em um manifesto! Esse processo de conversão honra opções de transformação de pacote (@pxref{Package Transformation Options}), então deve ser sem perdas.

source: Create an environment containing the packages installed in @var{profile}. Use @command{guix package} (@pxref{Invoking guix package}) to create and manage profiles.
pt_br: Crie um ambiente contendo os pacotes instalados em @var{perfil}. Use @command{guix package} (@pxref{Invoking guix package}) para criar e gerenciar perfis.

source: Unset existing environment variables when building the new environment, except those specified with @option{--preserve} (see below). This has the effect of creating an environment in which search paths only contain package inputs.
pt_br: Desconfigura variáveis de ambiente existentes ao construir o novo ambiente, exceto aquelas especificadas com @option{--preserve} (veja abaixo). Isso tem o efeito de criar um ambiente no qual os caminhos de pesquisa contêm apenas entradas de pacote.

source: When used alongside @option{--pure}, preserve the environment variables matching @var{regexp}---in other words, put them on a ``white list'' of environment variables that must be preserved. This option can be repeated several times.
pt_br: Quando usado junto com @option{--pure}, preserva as variáveis de ambiente que correspondem a @var{regexp}---em outras palavras, coloca-as em uma ``lista branca'' de variáveis de ambiente que devem ser preservadas. Esta opção pode ser repetida várias vezes.

source: This example runs @command{mpirun} in a context where the only environment variables defined are @env{PATH}, environment variables whose name starts with @samp{SLURM}, as well as the usual ``precious'' variables (@env{HOME}, @env{USER}, etc.).
pt_br: Este exemplo executa @command{mpirun} em um contexto onde as únicas variáveis de ambiente definidas são @env{PATH}, variáveis de ambiente cujo nome começa com @samp{SLURM}, bem como as variáveis ``preciosas'' usuais (@env{HOME}, @env{USER}, etc.).

source: Display the environment variable definitions that make up the environment.
pt_br: Exiba as definições de variáveis de ambiente que compõem o ambiente.

source: Attempt to build for @var{system}---e.g., @code{i686-linux}.
pt_br: Tente construir para @var{sistema}---por exemplo, @code{i686-linux}.

source: Run @var{command} within an isolated container. The current working directory outside the container is mapped inside the container. Additionally, unless overridden with @option{--user}, a dummy home directory is created that matches the current user's home directory, and @file{/etc/passwd} is configured accordingly.
pt_br: Execute @var{comando} dentro de um contêiner isolado. O diretório de trabalho atual fora do contêiner é mapeado dentro do contêiner. Além disso, a menos que substituído por @option{--user}, um diretório pessoal (home) fictício é criado que corresponde ao diretório pessoal do usuário atual, e @file{/etc/passwd} é configurado adequadamente.

source: The spawned process runs as the current user outside the container. Inside the container, it has the same UID and GID as the current user, unless @option{--user} is passed (see below).
pt_br: O processo gerado é executado como o usuário atual fora do contêiner. Dentro do contêiner, ele tem o mesmo UID e GID que o usuário atual, a menos que @option{--user} seja passado (veja abaixo).

source: For containers, share the network namespace with the host system. Containers created without this flag only have access to the loopback device.
pt_br: Para contêineres, compartilhe o namespace de rede com o sistema host. Os contêineres criados sem esse sinalizador têm acesso somente ao dispositivo de loopback.

source: For containers, link the environment profile to @file{~/.guix-profile} within the container and set @code{GUIX_ENVIRONMENT} to that. This is equivalent to making @file{~/.guix-profile} a symlink to the actual profile within the container. Linking will fail and abort the environment if the directory already exists, which will certainly be the case if @command{guix shell} was invoked in the user's home directory.
pt_br: Para contêineres, vincule o perfil do ambiente a @file{~/.guix-profile} dentro do contêiner e defina @code{GUIX_ENVIRONMENT} para isso. Isso é equivalente a tornar @file{~/.guix-profile} uma ligação simbólica para o perfil real dentro do contêiner. A vinculação falhará e abortará o ambiente se o diretório já existir, o que certamente será o caso se @command{guix shell} foi invocado no diretório pessoal do usuário.

source: Certain packages are configured to look in @file{~/.guix-profile} for configuration files and data;@footnote{For example, the @code{fontconfig} package inspects @file{~/.guix-profile/share/fonts} for additional fonts.} @option{--link-profile} allows these programs to behave as expected within the environment.
pt_br: Certos pacotes são configurados para procurar em @file{~/.guix-profile} por arquivos de configuração e dados;@footnote{Por exemplo, o pacote @code{fontconfig} inspeciona @file{~/.guix-profile/share/fonts} por fontes adicionais.} @option{--link-profile} permite que esses programas se comportem conforme o esperado no ambiente.

source: --user=@var{user}
pt_br: --user=@var{usuário}

source: -u @var{user}
pt_br: -u @var{usuário}

source: For containers, use the username @var{user} in place of the current user. The generated @file{/etc/passwd} entry within the container will contain the name @var{user}, the home directory will be @file{/home/@var{user}}, and no user GECOS data will be copied. Furthermore, the UID and GID inside the container are 1000. @var{user} need not exist on the system.
pt_br: Para contêineres, use o nome de usuário @var{usuário} no lugar do usuário atual. A entrada @file{/etc/passwd} gerada dentro do contêiner conterá o nome @var{usuário}, o diretório pessoal será @file{/home/@var{usuário}} e nenhum dado GECOS do usuário será copiado. Além disso, o UID e o GID dentro do contêiner são 1000. @var{usuário} não precisa existir no sistema.

source: Additionally, any shared or exposed path (see @option{--share} and @option{--expose} respectively) whose target is within the current user's home directory will be remapped relative to @file{/home/USER}; this includes the automatic mapping of the current working directory.
pt_br: Além disso, qualquer caminho compartilhado ou exposto (veja @option{--share} e @option{--expose} respectivamente) cujo destino esteja dentro do pessoal do usuário atual será remapeado em relação a @file{/home/USUÁRIO}; isso inclui o mapeamento automático do diretório de trabalho atual.

source: While this will limit the leaking of user identity through home paths and each of the user fields, this is only one useful component of a broader privacy/anonymity solution---not one in and of itself.
pt_br: Embora isso limite o vazamento da identidade do usuário por meio de caminhos iniciais e de cada um dos campos do usuário, esse é apenas um componente útil de uma solução mais ampla de privacidade/anonimato — não uma solução em si.

source: For containers, the default behavior is to share the current working directory with the isolated container and immediately change to that directory within the container. If this is undesirable, @option{--no-cwd} will cause the current working directory to @emph{not} be automatically shared and will change to the user's home directory within the container instead. See also @option{--user}.
pt_br: Para contêineres, o comportamento padrão é compartilhar o diretório de trabalho atual com o contêiner isolado e mudar imediatamente para esse diretório dentro do contêiner. Se isso for indesejável, @option{--no-cwd} fará com que o diretório de trabalho atual @emph{não} seja compartilhado automaticamente e mudará para o diretório pessoal do usuário dentro do contêiner. Veja também @option{--user}.

source: --expose=@var{source}[=@var{target}]
pt_br: --expose=@var{fonte}[=@var{alvo}]

source: --share=@var{source}[=@var{target}]
pt_br: --share=@var{fonte}[=@var{alvo}]

source: For containers, @option{--expose} (resp. @option{--share}) exposes the file system @var{source} from the host system as the read-only (resp. writable) file system @var{target} within the container. If @var{target} is not specified, @var{source} is used as the target mount point in the container.
pt_br: Para contêineres, @option{--expose} (resp. @option{--share}) expõe o sistema de arquivos @var{fonte} do sistema host como o sistema de arquivos somente leitura (resp. gravável) @var{alvo} dentro do contêiner. Se @var{alvo} não for especificado, @var{fonte} será usado como o ponto de montagem de destino no contêiner.

source: The example below spawns a Guile REPL in a container in which the user's home directory is accessible read-only via the @file{/exchange} directory:
pt_br: O exemplo abaixo gera um Guile REPL em um contêiner no qual o diretório pessoal do usuário é acessível somente para leitura por meio do diretório @file{/exchange}:

source: symbolic links, guix shell
pt_br: ligações simbólicas, guix shell

source: For containers, create the symbolic links specified by @var{spec}, as documented in @ref{pack-symlink-option}.
pt_br: Para contêineres, crie as ligações simbólicas especificadas por @var{spec}, conforme documentado em @ref{pack-symlink-option}.

source: file system hierarchy standard (FHS)
pt_br: padrão de hierarquia do sistema de arquivos (FHS)

source: FHS (file system hierarchy standard)
pt_br: FHS (padrão de hierarquia do sistema de arquivos)

source: When used with @option{--container}, emulate a @uref{https://refspecs.linuxfoundation.org/fhs.shtml, Filesystem Hierarchy Standard (FHS)} configuration within the container, providing @file{/bin}, @file{/lib}, and other directories and files specified by the FHS.
pt_br: Quando usado com @option{--container}, emule uma configuração do @uref{https://refspecs.linuxfoundation.org/fhs.shtml, padrão de hierarquia do sistema de arquivos (Filesystem Hierarchy Standard, FHS)} dentro do contêiner, fornecendo @file{/bin}, @file{/lib} e outros diretórios e arquivos especificados pelo FHS.

source: As Guix deviates from the FHS specification, this option sets up the container to more closely mimic that of other GNU/Linux distributions. This is useful for reproducing other development environments, testing, and using programs which expect the FHS specification to be followed. With this option, the container will include a version of glibc that will read @file{/etc/ld.so.cache} within the container for the shared library cache (contrary to glibc in regular Guix usage) and set up the expected FHS directories: @file{/bin}, @file{/etc}, @file{/lib}, and @file{/usr} from the container's profile.
pt_br: Como Guix desvia da especificação FHS, esta opção configura o contêiner para imitar mais de perto o de outras distribuições GNU/Linux. Isto é útil para reproduzir outros ambientes de desenvolvimento, testar e usar programas que esperam que a especificação FHS seja seguida. Com esta opção, o contêiner incluirá uma versão do glibc que lerá @file{/etc/ld.so.cache} dentro do contêiner para o cache da biblioteca compartilhada (ao contrário do glibc no uso regular do Guix) e configurará os diretórios FHS esperados: @file{/bin}, @file{/etc}, @file{/lib} e @file{/usr} do perfil do contêiner.

source: nested containers, for @command{guix shell}
pt_br: contêineres aninhados, para @command{guix shell}

source: container nesting, for @command{guix shell}
pt_br: aninhamento de contêineres, para @command{guix shell}

source: When used with @option{--container}, provide Guix @emph{inside} the container and arrange so that it can interact with the build daemon that runs outside the container. This is useful if you want, within your isolated container, to create other containers, as in this sample session:
pt_br: Quando usado com @option{--container}, forneça Guix @emph{dentro} do contêiner e organize para que ele possa interagir com o daemon de construção que roda fora do contêiner. Isso é útil se você quiser, dentro do seu contêiner isolado, criar outros contêineres, como nesta sessão de exemplo:

source: $ guix shell -CW coreutils [env]$ guix shell -C guile -- guile -c '(display "hello!\n")' hello! [env]$ exit
pt_br: $ guix shell -CW coreutils [env]$ guix shell -C guile -- guile -c '(display "olá!\n")' olá! [env]$ exit

source: The session above starts a container with @code{coreutils} programs available in @env{PATH}. From there, we spawn @command{guix shell} to create a @emph{nested} container that provides nothing but Guile.
pt_br: A sessão acima inicia um contêiner com programas @code{coreutils} disponíveis em @env{PATH}. A partir daí, geramos @command{guix shell} para criar um contêiner @emph{aninhado} que fornece nada além de Guile.

source: Another example is evaluating a @file{guix.scm} file that is untrusted, as shown here:
pt_br: Outro exemplo é avaliar um arquivo @file{guix.scm} que não é confiável, conforme mostrado aqui:

source: The @command{guix build} command as executed above can only access the current directory.
pt_br: O comando @command{guix build} executado acima só pode acessar o diretório atual.

source: Under the hood, the @option{-W} option does several things:
pt_br: Nos bastidores, a opção @option{-W} faz várias coisas:

source: map the daemon's socket (by default @file{/var/guix/daemon-socket/socket}) inside the container;
pt_br: mapeia o socket do daemon (por padrão, @file{/var/guix/daemon-socket/socket}) dentro do contêiner;

source: map the whole store (by default @file{/gnu/store}) inside the container such that store items made available by nested @command{guix} invocations are visible;
pt_br: mapeia todo o armazém (por padrão @file{/gnu/store}) dentro do contêiner de forma que os itens do armazém disponibilizados por invocações aninhadas @command{guix} sejam visíveis;

source: add the currently-used @command{guix} command to the profile in the container, such that @command{guix describe} returns the same state inside and outside the container;
pt_br: adiciona o comando @command{guix} usado atualmente ao perfil no contêiner, de modo que @command{guix describe} retorne o mesmo estado dentro e fora do contêiner;

source: share the cache (by default @file{~/.cache/guix}) with the host, to speed up operations such as @command{guix time-machine} and @command{guix shell}.
pt_br: compartilha o cache (por padrão @file{~/.cache/guix}) com o host, para acelerar operações como @command{guix time-machine} e @command{guix shell}.

source: caching, of profiles
pt_br: cache, de perfis

source: caching, in @command{guix shell}
pt_br: caching, em @command{guix shell}

source: In most cases, @command{guix shell} caches the environment so that subsequent uses are instantaneous. Least-recently used cache entries are periodically removed. The cache is also invalidated, when using @option{--file} or @option{--manifest}, anytime the corresponding file is modified.
pt_br: Na maioria dos casos, @command{guix shell} armazena em cache o ambiente para que os usos subsequentes sejam instantâneos. As entradas de cache menos usadas recentemente são removidas periodicamente. O cache também é invalidado, ao usar @option{--file} ou @option{--manifest}, sempre que o arquivo correspondente for modificado.

source: The @option{--rebuild-cache} forces the cached environment to be refreshed. This is useful when using @option{--file} or @option{--manifest} and the @command{guix.scm} or @command{manifest.scm} file has external dependencies, or if its behavior depends, say, on environment variables.
pt_br: O @option{--rebuild-cache} força o ambiente em cache a ser atualizado. Isso é útil ao usar @option{--file} ou @option{--manifest} e o arquivo @command{guix.scm} ou @command{manifest.scm} tem dependências externas, ou se seu comportamento depende, digamos, de variáveis de ambiente.

source: --root=@var{file}
pt_br: --root=@var{arquivo}

source: -r @var{file}
pt_br: -r @var{arquivo}

source: persistent environment
pt_br: ambiente persistente

source: garbage collector root, for environments
pt_br: coletor de lixo raiz, para ambientes

source: Make @var{file} a symlink to the profile for this environment, and register it as a garbage collector root.
pt_br: Crie @var{arquivo} como uma ligação simbólica para o perfil deste ambiente e registre-a como raiz do coletor de lixo.

source: This is useful if you want to protect your environment from garbage collection, to make it ``persistent''.
pt_br: Isso é útil se você deseja proteger seu ambiente da coleta de lixo, para torná-lo ``persistente''.

source: When this option is omitted, @command{guix shell} caches profiles so that subsequent uses of the same environment are instantaneous---this is comparable to using @option{--root} except that @command{guix shell} takes care of periodically removing the least-recently used garbage collector roots.
pt_br: Quando esta opção é omitida, @command{guix shell} armazena em cache os perfis para que os usos subsequentes do mesmo ambiente sejam instantâneos — isso é comparável ao uso de @option{--root}, exceto que @command{guix shell} cuida da remoção periódica das raízes do coletor de lixo menos usadas recentemente.

source: In some cases, @command{guix shell} does not cache profiles---e.g., if transformation options such as @option{--with-latest} are used. In those cases, the environment is protected from garbage collection only for the duration of the @command{guix shell} session. This means that next time you recreate the same environment, you could have to rebuild or re-download packages.
pt_br: Em alguns casos, @command{guix shell} não armazena perfis em cache---por exemplo, se opções de transformação como @option{--with-latest} forem usadas. Nesses casos, o ambiente é protegido da coleta de lixo somente durante a sessão @command{guix shell}. Isso significa que na próxima vez que você recriar o mesmo ambiente, poderá ter que reconstruir ou baixar novamente os pacotes.

source: @xref{Invoking guix gc}, for more on GC roots.
pt_br: @xref{Invoking guix pack}, para mais sobre as raízes do coletor de lixo.

source: @command{guix shell} also supports all of the common build options that @command{guix build} supports (@pxref{Common Build Options}) as well as package transformation options (@pxref{Package Transformation Options}).
pt_br: @command{guix shell} também suporta todas as opções de compilação comuns que @command{guix build} suporta (@pxref{Common Build Options}), bem como opções de transformação de pacotes (@pxref{Package Transformation Options}).

source: Invoking @command{guix environment}
pt_br: Invocando @command{guix environment}

source: The purpose of @command{guix environment} is to assist in creating development environments.
pt_br: O objetivo do @command{guix environment} é auxiliar na criação de ambientes de desenvolvimento.

source: Deprecation warning
pt_br: Aviso de descontinuação

source: The @command{guix environment} command is deprecated in favor of @command{guix shell}, which performs similar functions but is more convenient to use. @xref{Invoking guix shell}.
pt_br: O comando @command{guix environment} foi descontinuado em favor do @command{guix shell}, que executa funções semelhantes, mas é mais conveniente de usar. @xref{Invoking guix shell}.

source: Being deprecated, @command{guix environment} is slated for eventual removal, but the Guix project is committed to keeping it until May 1st, 2023. Please get in touch with us at @email{guix-devel@@gnu.org} if you would like to discuss it.
pt_br: Sendo obsoleto, o @command{guix environment} está programado para remoção futura, mas o projeto Guix está comprometido em mantê-lo até 1º de maio de 2023. Entre em contato conosco pelo e-mail @email{guix-devel@@gnu.org} se quiser discutir o assunto.

source: guix environment @var{options} @var{package}@dots{}
pt_br: guix environment @var{opções} @var{pacote}@dots{}

source: The following example spawns a new shell set up for the development of GNU@tie{}Guile:
pt_br: O exemplo a seguir gera uma nova configuração de shell para o desenvolvimento do GNU@tie{}Guile:

source: If the needed dependencies are not built yet, @command{guix environment} automatically builds them. The environment of the new shell is an augmented version of the environment that @command{guix environment} was run in. It contains the necessary search paths for building the given package added to the existing environment variables. To create a ``pure'' environment, in which the original environment variables have been unset, use the @option{--pure} option@footnote{Users sometimes wrongfully augment environment variables such as @env{PATH} in their @file{~/.bashrc} file. As a consequence, when @command{guix environment} launches it, Bash may read @file{~/.bashrc}, thereby introducing ``impurities'' in these environment variables. It is an error to define such environment variables in @file{.bashrc}; instead, they should be defined in @file{.bash_profile}, which is sourced only by log-in shells. @xref{Bash Startup Files,,, bash, The GNU Bash Reference Manual}, for details on Bash start-up files.}.
pt_br: Se as dependências necessárias ainda não foram construídas, @command{guix environment} as constrói automaticamente. O ambiente do novo shell é uma versão aumentada do ambiente em que @command{guix environment} foi executado. Ele contém os caminhos de pesquisa necessários para construir o pacote fornecido adicionado às variáveis de ambiente existentes. Para criar um ambiente ``puro'', no qual as variáveis de ambiente originais foram desconfiguradas, use a opção @option{--pure}@footnote{Às vezes, os usuários aumentam incorretamente as variáveis de ambiente, como @env{PATH} em seu arquivo @file{~/.bashrc}. Como consequência, quando @command{guix environment} o inicia, o Bash pode ler @file{~/.bashrc}, introduzindo assim ``impurezas'' nessas variáveis de ambiente. É um erro definir essas variáveis de ambiente em @file{.bashrc}; em vez disso, elas devem ser definidas em @file{.bash_profile}, que é originado apenas por shells de login. @xref{Bash Startup Files,,, bash, Manual de referência do GNU Bash}, para detalhes sobre os arquivos de inicialização do Bash.}.
