Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: In the Configurations tab, press "Edit" on the default Debian profile. Under "Block Device Assignment" click "Add a Device". It should be @file{/dev/sdc} and you can select the "Guix" disk. Save Changes.
es: En la pestaña Configuraciones, pulse «Editar» en el perfil Debian por defecto. En «Asignación de dispositivos en bloque» pulse «Añadir un dispositivo». Debe ser @file{/dev/sdc} y puede seleccionar el disco «Guix». Guarde los cambios.
it: Nella scheda Configurazioni, premi "Modifica" sul profilo Debian predefinito. Sotto "Assegnazione Dispositivo a Blocchi" clicca "Aggiungi un Dispositivo". Dovrebbe essere @file{/dev/sdc} e puoi selezionare il disco "Guix". Salva le modifiche.
pt_br: Na aba Configurações, pressione “Editar” no perfil Debian padrão. Em "Bloquear atribuição de dispositivo", clique em "Adicionar um dispositivo". Deve ser @file{/dev/sdc} e você pode selecionar o disco "Guix". Salvar alterações.
sk: Na karte „Configurations“ (nastavenia) kliknite na „Edit“ (upraviť) pri predvolenom profile Debianu. Pod „Block Device Assignment“ (pridelenie diskových zariadení) kliknite na „Add a Device“ (pridať zariadenie). Malo by to byť @file{/dev/sdc} a môžete pridať disk „Guix“. Uložte zmeny.

source: Now "Add a Configuration", with the following:
es: Ahora «Añadir una configuración», con lo siguiente:
it: Ora "Aggiungi una Configurazione", con quanto segue:
pt_br: Agora "Adicionar uma configuração", com o seguinte:
sk: Teraz „Add a Configuration“ (pridať nastavenie) s nasledovným:

source: Label: Guix
es: Etiqueta: Guix
it: Etichetta: Guix
pt_br: Etiqueta: Guix
sk: Label (menovka): Guix

source: Kernel:GRUB 2 (it's at the bottom! This step is @b{IMPORTANT!})
es: Kernel:GRUB 2 (¡está al final! Este paso es @b{¡IMPORTANTE!})
it: Kernel:GRUB 2 (è in fondo! Questo passaggio è @b{IMPORTANTE!})
pt_br: Kernel:GRUB 2 (está na parte inferior! Esta etapa é @b{IMPORTANTE!})
sk: Kernel (jadro): GRUB 2 (je to naspodku! Tento krok je @b{DÔLEŽITÝ!})

source: Block device assignment:
es: Asignación de dispositivos en bloque:
it: Assegnazione dispositivo a blocchi:
pt_br: Bloquear atribuição de dispositivo:
sk: Block device assignment (pridelenie diskových zariadení):

source: Root device: @file{/dev/sda}
es: Dispositivo raíz: @file{/dev/sda}
it: Dispositivo root: @file{/dev/sda}
pt_br: Dispositivo raiz: @file{/dev/sda}
sk: Root device (koreňové zariadenie): @file{/dev/sda}

source: Turn off all the filesystem/boot helpers
es: Desactivar todos los ayudantes del sistema de archivos/arranque
it: Disattiva tutti gli assistenti di filesystem/avvio
pt_br: Desligue todos os auxiliares de sistema de arquivos/inicialização
sk: Vypnite všetky pomocné programy pre systém súborov a zavádzanie

source: Now power it back up, booting with the Debian configuration. Once it's running, ssh to your server via @code{ssh root@@@var{<your-server-IP-here>}}. (You can find your server IP address in your Linode Summary section.) Now you can run the "install guix from @pxref{Binary Installation,,, guix, GNU Guix}" steps:
es: Ahora enciéndelo de nuevo, arrancando con la configuración de Debian. Una vez que esté funcionando, conéctese a su servidor mediante @code{ssh root@@@var{<your-server-IP-here>}}. (Puede encontrar la dirección IP de su servidor en la sección Resumen de su Linode.) Ahora puede ejecutar los pasos de "instalar guix desde @pxref{Instalación binaria,,, guix.es, GNU Guix}":
it: Ora riaccendilo, avviando con la configurazione Debian. Una volta in esecuzione, connettiti al tuo server via ssh con @code{ssh root@@@var{<il-tuo-IP-server-qui>}}. (Puoi trovare l'indirizzo IP del tuo server nella sezione Riepilogo di Linode.) Ora puoi eseguire i passaggi per "installare Guix da @pxref{Installazione binaria,,, guix.it, GNU Guix}":
pt_br: Agora ligue-o novamente, inicializando com a configuração do Debian. Quando estiver em execução, faça ssh para o seu servidor via @code{ssh root@@@var{<your-server-IP-here>}}. (Você pode encontrar o endereço IP do seu servidor na seção Resumo do Linode.) Agora você pode executar as etapas "instalar o guix de @pxref{Instalação de binários,,, guix.pt_BR, GNU Guix}":
sk: Teraz opätovne spustite server s nastavením Debianu. Po spustení sa k vášmu serveru pripojte cez SSH pomocou @code{ssh root@@@var{<IP-adresa-vasho-servera-tu>}} (IP adresu vášho servera môžete nájsť v odseku „Summary“, t.j. zhrnutie, na Linode). Teraz môžete vykonať inštalačné kroky z @pxref{Binary Installation,,, guix, GNU Guix}:

source: Now it's time to write out a config for the server. The key information is below. Save the resulting file as @file{guix-config.scm}.
es: Ahora es el momento de escribir una configuración para el servidor. La información clave está por debajo. Guarde el archivo resultante como @file{guix-config.scm}.
it: Ora è il momento di scrivere una configurazione per il server. Le informazioni chiave sono qui sotto. Salva il file risultante come @file{guix-config.scm}.
pt_br: Agora é hora de escrever uma configuração para o servidor. As principais informações estão abaixo. Salve o arquivo resultante como @file{guix-config.scm}.
sk: Teraz je čas dať dohromady nastavenia servera. Kľúčové poznatky sú uvedené nižšie. Uložte výsledný súbor ako @file{guix-config.scm}.

source: (operating-system (host-name "my-server") (timezone "America/New_York") (locale "en_US.UTF-8") ;; This goofy code will generate the grub.cfg ;; without installing the grub bootloader on disk. (bootloader (bootloader-configuration (bootloader (bootloader (inherit grub-bootloader) (installer #~(const #true)))))) (file-systems (cons (file-system (device "/dev/sda") (mount-point "/") (type "ext4")) %base-file-systems))
es: (operating-system (host-name "my-server") (timezone "America/New_York") (locale "en_US.UTF-8") ;; Este tonto código generará el grub.cfg ;; sin instalar el gestor de arranque grub en el disco. (bootloader (bootloader-configuration (bootloader (bootloader (inherit grub-bootloader) (installer #~(const #true)))))) (file-systems (cons (file-system (device "/dev/sda") (mount-point "/") (type "ext4")) %base-file-systems))
it: (operating-system (host-name "my-server") (timezone "America/New_York") (locale "en_US.UTF-8") ;; Questo codice strambo genererà il grub.cfg ;; senza installare il bootloader grub sul disco. (bootloader (bootloader-configuration (bootloader (bootloader (inherit grub-bootloader) (installer #~(const #true)))))) (file-systems (cons (file-system (device "/dev/sda") (mount-point "/") (type "ext4")) %base-file-systems))
pt_br: (operating-system (host-name "my-server") (timezone "America/New_York") (locale "en_US.UTF-8") ;; Este código bobo irá gerar o grub.cfg ;; sem instalar o bootloader grub no disco. (bootloader (bootloader-configuration (bootloader (bootloader (inherit grub-bootloader) (installer #~(const #true)))))) (file-systems (cons (file-system (device "/dev/sda") (mount-point "/") (type "ext4")) %base-file-systems))
sk: (operating-system (host-name "moj-server") (timezone "Europe/Bratislava") (locale "sk_SK.UTF-8") ;; Tento kód vytvorí grub.cfg ;; bez inštalácie grubu na disk. (bootloader (bootloader-configuration (bootloader (bootloader (inherit grub-bootloader) (installer #~(const #true)))))) (file-systems (cons (file-system (device "/dev/sda") (mount-point "/") (type "ext4")) %base-file-systems))

source: (initrd-modules (cons "virtio_scsi" ; Needed to find the disk %base-initrd-modules))
it: (initrd-modules (cons "virtio_scsi" ; Necessario per trovare il disco %base-initrd-modules))
pt_br: (initrd-modules (cons "virtio_scsi" ; Necessário para encontrar o disco %base-initrd-modules))
sk: (initrd-modules (cons "virtio_scsi" ; Potrebné pre nájdenie disku %base-initrd-modules))

source: (users (cons (user-account (name "janedoe") (group "users") ;; Adding the account to the "wheel" group ;; makes it a sudoer. (supplementary-groups '("wheel")) (home-directory "/home/janedoe")) %base-user-accounts))
es: (users (cons (user-account (name "janedoe") (group "users") ;; Añadir la cuenta al grupo "wheel ;; makes it a sudoer. (supplementary-groups '("wheel")) (home-directory "/home/janedoe")) %base-user-accounts))
it: (users (cons (user-account (name "janedoe") (group "users") ;; Aggiungendo l'account al gruppo "wheel" ;; lo rende un sudoer. (supplementary-groups '("wheel")) (home-directory "/home/janedoe")) %base-user-accounts))
pt_br: (users (cons (user-account (name "janedoe") (group "users") ;; Adicionando a conta ao grupo "wheel" ;; o torna um super-usuário (supplementary-groups '("wheel")) (home-directory "/home/janedoe")) %base-user-accounts))
sk: (users (cons (user-account (name "jozkomrkvicka") (group "users") ;; Pridá účet do skupiny „wheel“, ;; aby sa z neho stal sudoer. (supplementary-groups '("wheel")) (home-directory "/home/jozkomrkvicka")) %base-user-accounts))

source: Replace the following fields in the above configuration:
es: Sustituya los siguientes campos en la configuración anterior:
it: Sostituisci i seguenti campi nella configurazione sopra:
pt_br: Substitua os seguintes campos na configuração acima:
sk: Nahraďte nasledovné polia vo vyššie uvedenom nastavení:

source: (host-name "my-server") ; replace with your server name ; if you chose a linode server outside the U.S., then ; use tzselect to find a correct timezone string (timezone "America/New_York") ; if needed replace timezone (name "janedoe") ; replace with your username ("janedoe" ,(local-file "janedoe_rsa.pub")) ; replace with your ssh key ("root" ,(local-file "janedoe_rsa.pub")) ; replace with your ssh key
es: (host-name "my-server") ; sustitúyalo por el nombre de su servidor ; si eligió un servidor linode fuera de los EE.UU., entonces ; utilice tzselect para encontrar una cadena de zona horaria correcta (timezone "America/New_York") ; si es necesario, sustituya la zona horaria (name "janedoe") ; sustitúyalo por su nombre de usuario ("janedoe" ,(local-file "janedoe_rsa.pub")) ; reemplace con su clave ssh ("root" ,(local-file "janedoe_rsa.pub")) ; reemplace con su clave ssh
it: (host-name "il-mio-server") ; sostituisci con il nome del tuo server ; se hai scelto un server linode fuori dagli Stati Uniti, allora ; usa tzselect per trovare una stringa di fuso orario corretta (timezone "America/New_York") ; se necessario sostituisci il fuso orario (name "janedoe") ; sostituisci con il tuo nome utente ("janedoe" ,(local-file "janedoe_rsa.pub")) ; sostituisci con la tua chiave ssh ("root" ,(local-file "janedoe_rsa.pub")) ; sostituisci con la tua chiave ssh
pt_br: (host-name "my-server"); substitua pelo nome do seu servidor ; se você escolheu um servidor linode fora dos EUA, então ; use tzselect para encontrar uma string de fuso horário correta (timezone "America/New_York"); se necessário, substitua o fuso horário (name "janedoe"); substitua pelo seu nome de usuário ("janedoe" ,(local-file "janedoe_rsa.pub")) ; substitua pela sua chave ssh ("root" ,(local-file "janedoe_rsa.pub")) ; substitua pela sua chave ssh
sk: (host-name "moj-server") ; nahraďte názvom vášho servera ; ak si vyberiete Linode server mimo Slovenska, tak pomocou ; tzselect vyhľadajte správne nastavenie časového pásma (timezone "Europe/Bratislava") ; v prípade potreby, nahraďte časové pásmo (name "jozkomrkvicka") ; nahraďte vašim používateľským menom ("jozkomrkvicka" ,(local-file "jozkomrkvicka_rsa.pub")) ; nahraďte vašim používateľským menom a SSH kľúčom ("root" ,(local-file "jozkomrkvicka_rsa.pub")) ; nahraďte vašim SSH kľúčom

source: The last line in the above example lets you log into the server as root and set the initial root password (see the note at the end of this recipe about root login). After you have done this, you may delete that line from your configuration and reconfigure to prevent root login.
es: La última línea del ejemplo anterior le permite iniciar sesión en el servidor como root y establecer la contraseña inicial de root (consulte la nota al final de esta receta sobre el inicio de sesión de root). Una vez hecho esto, puede eliminar esa línea de la configuración y volver a configurarla para evitar el inicio de sesión de root.
it: L'ultima riga nell'esempio sopra ti permette di accedere al server come root e impostare la password iniziale di root (vedi la nota alla fine di questa ricetta su l'accesso come root). Dopo aver fatto ciò, puoi eliminare quella riga dalla tua configurazione e riconfigurare per impedire l'accesso come root.
pt_br: A última linha no exemplo acima permite que você faça login no servidor como root e defina a senha root inicial (veja a nota no final desta receita sobre login root). Depois de fazer isso, você pode excluir essa linha da sua configuração e reconfigurar para evitar o login root.
sk: Posledný riadok vo vyššie uvedenom príklade vám umožňuje prihlásiť sa na server ako root a nastaviť prvotné heslo používateľa root (viď poznámku o prihlasovaní používateľa root na konci receptu). Po tomto môžete daný riadok z nastavenia vymazať a znovunastaviť, aby ste zabránili prihlasovaniu ako root.

source: Copy your ssh public key (eg: @file{~/.ssh/id_rsa.pub}) as @file{@var{<your-username-here>}_rsa.pub} and put @file{guix-config.scm} in the same directory. In a new terminal run these commands.
es: Copia tu clave pública ssh (eg: @file{~/.ssh/id_rsa.pub}) como @file{@var{<tu-nombre-de-usuario-aquí>}_rsa.pub} y pone @file{guix-config.scm} en el mismo directorio. En un nuevo terminal ejecute estos comandos.
it: Copia la tua chiave pubblica ssh (es: @file{~/.ssh/id_rsa.pub}) come @file{@var{<il-tuo-nomeutente-qui>}_rsa.pub} e metti @file{guix-config.scm} nella stessa directory. In un nuovo terminale esegui questi comandi.
pt_br: Copie sua chave pública ssh (por exemplo: @file{~/.ssh/id_rsa.pub}) como @file{@var{<seu-nome-de-usuário-aqui>}_rsa.pub} e coloque @file{guix-config.scm } no mesmo diretório. Em um novo terminal execute estes comandos.
sk: Skopírujte váš verejný SSH kľúč (napr. @file{~/.ssh/id_rsa.pub}) do @file{@var{<vase-pouzivatelske-meno-tu>}_rsa.pub} a premiestnite @file{guix-config.scm} do rovnakého priečinka. V novom príkazovom riadku vykonajte nasledovné príkazy.

source: sftp root@@<remote server ip address> put /path/to/files/<username>_rsa.pub . put /path/to/files/guix-config.scm .
es: sftp root@@<dirección ip del servidor remoto> put /path/to/files/<nombre-usuario>_rsa.pub . put /path/to/files/guix-config.scm .
it: sftp root@@<indirizzo ip del server remoto> put /percorso/ai/files/<nomeutente>_rsa.pub . put /percorso/ai/files/guix-config.scm .
pt_br: sftp root@@<endereço IP do servidor remoto> put /caminho/para/arquivos/<nome de usuário>_rsa.pub . put /caminho/para/arquivos/guix-config.scm .
sk: sftp root@@<ip adresa vzdialeného servera> put /cesta/k/súborom/<používateľ>_rsa.pub . put /cesta/k/súborom/guix-config.scm .

source: In your first terminal, mount the guix drive:
es: En tu primer terminal, monta la unidad guix:
it: Nel tuo primo terminale, monta l'unità guix:
pt_br: No seu primeiro terminal, monte o drive guix:
sk: Vo vašom prvom príkazovom riadku pripojte disk guix:

source: Due to the way we set up the bootloader section of the guix-config.scm, only the grub configuration file will be installed. So, we need to copy over some of the other GRUB stuff already installed on the Debian system:
es: Debido a la forma en que configuramos la sección del gestor de arranque de guix-config.scm, sólo se instalará el fichero de configuración de grub. Por lo tanto, necesitamos copiar algunas de las otras cosas de GRUB ya instaladas en el sistema Debian:
it: A causa del modo in cui abbiamo configurato la sezione del bootloader di guix-config.scm, solo il file di configurazione di grub verrà installato. Quindi, dobbiamo copiare parte del resto del GRUB già installato sul sistema Debian:
pt_br: Devido à forma como configuramos a seção bootloader do guix-config.scm, apenas o arquivo de configuração grub será instalado. Então, precisamos copiar algumas das outras coisas do GRUB já instaladas no sistema Debian:
sk: Kvôli spôsobu akým sme nastavili zavádzač v príslušnom oddieli guix-config.scm sa nainštaluje iba súbor nastavení grubu. Musíme, teda, prekopírovať nejaké súbory zavádzača GRUB, ktoré už sú nainštalované v systéme Debian:

source: Now initialize the Guix installation:
es: Ahora inicialice la instalación de Guix:
it: Ora inizializza l'installazione di Guix:
pt_br: Agora inicialize a instalação do Guix:
sk: Teraz nastavte inštaláciu Guixu do východzieho stavu:

source: Ok, power it down! Now from the Linode console, select boot and select "Guix".
es: Bien, ¡apágalo! Ahora desde la consola de Linode, selecciona boot y selecciona "Guix".
it: Ok, spegnilo! Ora dalla console di Linode, seleziona boot e seleziona "Guix".
pt_br: Ok, desligue-o! Agora, no console Linode, selecione boot e selecione "Guix".
sk: Dobre, vypnite server! Cez príkazový riadok Linode spustite server a vyberte „Guix“.

source: Once it boots, you should be able to log in via SSH! (The server config will have changed though.) You may encounter an error like:
es: Una vez que arranque, debería poder iniciar sesión a través de SSH. (La configuración del servidor habrá cambiado sin embargo.) Puede encontrar un error como:
it: Una volta avviato, dovresti essere in grado di accedere via SSH! (La configurazione del server sarà cambiata però.) Potresti incontrare un errore come:
pt_br: Depois de inicializar, você poderá fazer login via SSH! (A configuração do servidor terá mudado.) Você pode encontrar um erro como:
sk: Po spustení by ste mali byť schopní prihlásiť sa cez SSH! (Nastavenie servera ale bude zmenené.) Môžete sa stretnúť s chybou ako je táto:

source: $ ssh root@@<server ip address> @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ IT IS POSSIBLE THAT SOMEONE IS DOING SOMETHING NASTY! Someone could be eavesdropping on you right now (man-in-the-middle attack)! It is also possible that a host key has just been changed. The fingerprint for the ECDSA key sent by the remote host is SHA256:0B+wp33w57AnKQuHCvQP0+ZdKaqYrI/kyU7CfVbS7R4. Please contact your system administrator. Add correct host key in /home/joshua/.ssh/known_hosts to get rid of this message. Offending ECDSA key in /home/joshua/.ssh/known_hosts:3 ECDSA host key for 198.58.98.76 has changed and you have requested strict checking. Host key verification failed.
es: $ ssh root@@<server ip address> @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ ADVERTENCIA: ¡LA IDENTIFICACIÓN DEL HOST REMOTO HA CAMBIADO! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ¡ES POSIBLE QUE ALGUIEN ESTÉ HACIENDO ALGO DESAGRADABLE! ¡Alguien podría estar escuchándole en este momento (ataque de intermediario).! También es posible que se acabe de cambiar una clave de host. La huella digital de la clave ECDSA enviada por el host remoto es SHA256:0B+wp33w57AnKQuHCvQP0+ZdKaqYrI/kyU7CfVbS7R4. Póngase en contacto con el administrador del sistema. Añada la clave de host correcta en /home/joshua/.ssh/known_hosts para deshacerse de este mensaje. Clave ECDSA infractora en /home/joshua/.ssh/known_hosts:3 La clave de host ECDSA para 198.58.98.76 ha cambiado y ha solicitado una comprobación estricta. Error en la verificación de la clave del host.
it: $ ssh root@@<indirizzo ip del server> @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ ATTENZIONE: L'IDENTIFICAZIONE DELL'HOST REMOTO È CAMBIATA! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ È POSSIBILE CHE QUALCUNO STIA FACENDO QUALCOSA DI BRUTTO! Qualcuno potrebbe intercettarti in questo momento (attacco man-in-the-middle)! È anche possibile che una chiave host sia stata appena cambiata. L'impronta digitale della chiave ECDSA inviata dall'host remoto è SHA256:0B+wp33w57AnKQuHCvQP0+ZdKaqYrI/kyU7CfVbS7R4. Si prega di contattare l'amministratore del sistema. Aggiungi la chiave host corretta in /home/joshua/.ssh/known_hosts per eliminare questo messaggio. Chiave ECDSA offensiva in /home/joshua/.ssh/known_hosts:3 La chiave host ECDSA per 198.58.98.76 è cambiata e hai richiesto un controllo rigoroso. Verifica della chiave host fallita.
sk: $ ssh root@@<ip adresa servera> @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ IT IS POSSIBLE THAT SOMEONE IS DOING SOMETHING NASTY! Someone could be eavesdropping on you right now (man-in-the-middle attack)! It is also possible that a host key has just been changed. The fingerprint for the ECDSA key sent by the remote host is SHA256:0B+wp33w57AnKQuHCvQP0+ZdKaqYrI/kyU7CfVbS7R4. Please contact your system administrator. Add correct host key in /home/jozkomrkvicka/.ssh/known_hosts to get rid of this message. Offending ECDSA key in /home/jozkomrkvicka/.ssh/known_hosts:3 ECDSA host key for 198.58.98.76 has changed and you have requested strict checking. Host key verification failed.

source: Either delete @file{~/.ssh/known_hosts} file, or delete the offending line starting with your server IP address.
es: O bien borra el archivo @file{~/.ssh/known_hosts}, o borra la linea ofendida de inicio con su dirección IP de servidor.
it: Elimina il file @file{~/.ssh/known_hosts} oppure elimina la riga incriminata che inizia con l'indirizzo IP del tuo server.
pt_br: Exclua o arquivo @file{~/.ssh/known_hosts} ou exclua a linha incorreta começando com o endereço IP do seu servidor.
sk: Buď odstráňte súbor @file{~/.ssh/known_hosts}, alebo vymažte dotknutý riadok začínajúci IP adresou vášho servera.

source: Be sure to set your password and root's password.
es: Asegúrate de establecer tu contraseña y la de root.
it: Assicurati di impostare la tua password e quella di root.
pt_br: Certifique-se de definir sua senha e a senha do root.
sk: Nezabudnite si nastaviť vaše heslo ako aj heslo používateľa root.

source: ssh root@@<remote ip address> passwd ; for the root password passwd <username> ; for the user password
es: ssh root@@<dirección ip remota> passwd ; para la contraseña de root passwd <nombre-usuario> ; para la contraseña de usuario
it: ssh root@@<indirizzo ip remoto> passwd ; per la password di root passwd <nomeutente> ; per la password utente
pt_br: ssh root@@<endereço IP remoto> passwd; para a senha root passwd <nome de usuário>; para a senha do usuário
sk: ssh root@@<vzdialená ip adresa> passwd ; pre nastavenie hesla používateľa root passwd <používateľ> ; pre nastavenie hesla daného používateľa
