Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: {Data Type} lirc-configuration
pt_br: {Tipo de dados} lirc-configuration

source: {Data Type} spice-vdagent-configuration
pt_br: {Tipo de dados} spice-vdagent-configuration

source: {Data Type} inputattach-configuration
pt_br: {Tipo de dados} inputattach-configuration

source: @code{device} (default: @code{"/dev/ttyS0"})
pt_br: @code{device} (padrão: @code{"/dev/ttyS0"})

source: dictionary
pt_br: dicionário

source: {Data Type} dicod-configuration
pt_br: {Tipo de dados} dicod-configuration

source: {Data Type} dicod-handler
pt_br: {Tipo de dados} dicod-handler

source: {Data Type} dicod-database
pt_br: {Tipo de dados} dicod-database

source: {Data Type} containerd-configuration
pt_br: {Tipo de dados} containerd-configuration

source: {Data Type} docker-configuration
pt_br: {Tipo de dados} docker-configuration

source: {Data Type} oci-container-configuration
pt_br: {Tipo de dados} oci-container-configuration

source: {Data Type} oci-image
pt_br: {Tipo de dados} oci-image

source: @command{auditctl} from the @code{audit} package can be used in order to add or remove events to be tracked (until the next reboot). In order to permanently track events, put the command line arguments of auditctl into a file called @code{audit.rules} in the configuration directory (see below). @command{aureport} from the @code{audit} package can be used in order to view a report of all recorded events. The audit daemon by default logs into the file @file{/var/log/audit.log}.
pt_br: @command{auditctl} do pacote @code{audit} pode ser usado para adicionar ou remover eventos a serem rastreaddos (até o próximo reinício). A fim de rastrear permanentemente eventos, ponha os argumentos de linha de comando do auditctl num arquivo chamado @code{audit.rules} no diretório de configurações (veja abaixo). @command{aureport} do pacote @code{audit} pode ser usado para visualizar um relatório de todos os eventos gravados. O daemon audit por padrão, produz logs no arquivo @file{/var/log/audit.log}.

source: {Data Type} auditd-configuration
pt_br: {Tipo de dados} auditd-configuration

source: {Data Type} rshiny-configuration
pt_br: {Tipo de dados} rshiny-configuration

source: {Data Type} nix-configuration
pt_br: {Tipo de dados} nix-configuration

source: {Data Type} fail2ban-configuration
pt_br: {Tipo de dados} fail2ban-configuration

source: {Data Type} fail2ban-ignore-cache-configuration
pt_br: {Tipo de dados} fail2ban-ignore-cache-configuration

source: {Data Type} fail2ban-jail-action-configuration
pt_br: {Tipo de dados} fail2ban-jail-action-configuration

source: {Data Type} fail2ban-jail-configuration
pt_br: {Tipo de dados} fail2ban-jail-configuration

source: {Data Type} fail2ban-jail-filter-configuration
pt_br: {Tipo de dados} fail2ban-jail-filter-configuration

source: {Data Type} restic-backup-configuration
pt_br: {Tipo de dados} restic-backup-configuration

source: {Data Type} restic-backup-job
pt_br: {Tipo de dados} restic-backup-job

source: {Data Type} readymedia-configuration
pt_br: {Tipo de dados} readymedia-configuration

source: {Data Type} readymedia-media-directory
pt_br: {Tipo de dados} readymedia-media-directory

source: {Data Type} privileged-program
pt_br: {Tipo de dados} privileged-program

source: X.509 certificates
pt_br: Certificados X.509

source: {Data Type} name-service-switch
pt_br: {Tipo de dados} name-service-switch

source: {Data Type} name-service
pt_br: {Tipo de dados} name-service

source: {Data Type} bootloader-configuration
pt_br: {Tipo de dados} bootloader-configuration

source: keyboard layout, for the bootloader
pt_br: disposição do teclado, para o carregador de inicialização

source: {Data Type} menu-entry
pt_br: {Tipo de dados} menu-entry

source: {Data Type} grub-theme
pt_br: {Tipo de dados} grub-theme

source: The command:
pt_br: O comando:

source: {Data Type} machine
pt_br: {Tipo de dados} machine

source: {Data Type} machine-ssh-configuration
pt_br: {Tipo de dados} machine-ssh-configuration

source: {Data Type} digital-ocean-configuration
pt_br: {Tipo de dados} digital-ocean-configuration

source: Running Guix in a Virtual Machine
pt_br: Usando o Guix em uma Máquina Virtual

source: {Data Type} service-type
pt_br: {Tipo de dados} service-type

source: service type
pt_br: tipo de serviço

source: @code{compose} (default: @code{#f})
pt_br: @code{compose} (padrão: @code{#f})

source: @code{extend} (default: @code{#f})
pt_br: @code{extend} (padrão: @code{#f})

source: {Data Type} shepherd-service
pt_br: {Tipo de dados} shepherd-service

source: @code{respawn?} (default: @code{#t})
pt_br: @code{respawn?} (padrão: @code{#t})

source: {Data Type} shepherd-action
pt_br: {Tipo de dados} shepherd-action

source: {Data Type} shepherd-configuration
pt_br: {Tipo de dados} shepherd-configuration

source: home configuration
pt_br: Configuração pessoal

source: home services
pt_br: serviços pessoais

source: {Data Type} home-dotfiles-configuration
pt_br: {Tipo de dados} home-dotfiles-configuration

source: {Data Type} home-shell-profile-configuration
pt_br: {Tipo de dados} home-shell-profile-configuration

source: {Data Type} home-bash-configuration
pt_br: {Tipo de dados} home-bash-configuration

source: {Data Type} home-bash-extension
pt_br: {Tipo de dados} home-bash-extension

source: {Data Type} home-zsh-configuration
pt_br: {Tipo de dados} home-zsh-configuration

source: {Data Type} home-inputrc-configuration
pt_br: {Tipo de dados} home-inputrc-configuration

source: Scheduled User's Job Execution
pt_br: Execução de trabalho agendado pessoal

source: {Data Type} home-mcron-configuration
pt_br: {Tipo de dados} home-mcron-configuration

source: {Data Type} home-batsignal-configuration
pt_br: {Tipo de dados} home-batsignal-configuration

source: {Data Type} home-shepherd-configuration
pt_br: {Tipo de dados} home-shepherd-configuration

source: {Data Type} home-openssh-configuration
pt_br: {Tipo de dados} home-openssh-configuration

source: {Data Type} openssh-host
pt_br: {Tipo de dados} openssh-host

source: {Data Type} proxy-jump
pt_br: {Tipo de dados} proxy-jump

source: {Data Table} home-parcimonie-configuration
pt_br: {Tipo de dados} home-parcimonie-configuration

source: {Data Type} home-ssh-agent-configuration
pt_br: {Tipo de dados} home-ssh-agent-configuration

source: {Data Type} home-gpg-agent-configuration
pt_br: {Tipo de dados} home-gpg-agent-configuration

source: {Data Type} home-redshift-configuration
pt_br: {Tipo de dados} home-redshift-configuration

source: {Data Type} home-dbus-configuration
pt_br: {Tipo de dados} home-dbus-configuration

source: {Data Type} home-unclutter-configuration
pt_br: {Tipo de dados} home-unclutter-configuration

source: {Data Type} home-xmodmap-configuration
pt_br: {Tipo de dados} home-xmodmap-configuration

source: PulseAudio, home service
pt_br: PulseAudio, serviço pessoal

source: PipeWire, home service
pt_br: PipeWire, serviço pessoal

source: {Data Type} home-pipewire-configuration
pt_br: {Tipo de dados} home-pipewire-configuration

source: {Data Type} home-msmtp-configuration
pt_br: {Tipo de dados} home-msmtp-configuration

source: {Data Type} msmtp-account
pt_br: {Tipo de dados} msmtp-account

source: {Data Type} msmtp-configuration
pt_br: {Tipo de dados} msmtp-configuration

source: {Data Type} home-znc-configuration
pt_br: {Tipo de dados} home-znc-configuration

source: {Data Type} home-kodi-configuration
pt_br: {Tipo de dados} home-kodi-configuration

source: Sway window manager
it: Window manager Sway
pt_br: Gerenciador de janelas Sway

source: {Data Type} sway-configuration
pt_br: {Tipo de dados} sway-configuration

source: Example:
pt_br: Exemplo:

source: {Data Type} sway-input
pt_br: {Tipo de dados} sway-input

source: {Data Type} sway-output
pt_br: {Tipo de dados} sway-output

source: {Data Type} sway-border-color
pt_br: {Tipo de dados} sway-border-color

source: {Data Type} sway-color
pt_br: {Tipo de dados} sway-color

source: {Data Type} sway-bar
pt_br: {Tipo de dados} sway-bar

source: {Data Type} sway-mode
pt_br: {Tipo de dados} sway-mode

source: provenance tracking, of the home environment
pt_br: rastreamento de proveniência, do ambiente pessoal

source: {Data Type} platform
pt_br: {Tipo de dados} platform

source: system images
pt_br: imagens de sistema

source: {Data Type} image
pt_br: {Tipo de dados} image

source: Whether to use the host network interfaces within the image, as a boolean. This is only used for the @code{'docker} image format. It defaults to @code{#false}.
pt_br: Se deve usar as interfaces de rede do host dentro da imagem, como um booleano. Isso é usado apenas para o formato de imagem @code{'docker}. O padrão é @code{#false}.

source: @code{partition} Reference
pt_br: Referência do @code{partition}

source: {Data Type} partition
pt_br: {Tipo de dados} partition

source: The partition file system creation options that should be passed to the partition creation tool, as a list of strings. This is only supported when creating @code{"vfat"}, @code{"fat16"}, @code{"fat32"} or @code{"ext4"} partitions.
pt_br: As opções de criação do sistema de arquivos de partição que devem ser passadas para a ferramenta de criação de partição, como uma lista de strings. Isso só é suportado ao criar partições @code{"vfat"}, @code{"fat16"}, @code{"fat32"} ou @code{"ext4"}.

source: Note that the first and third partitions use generic initializers procedures, initialize-efi-partition and initialize-root-partition respectively. The initialize-efi-partition installs a GRUB EFI loader that is loading the GRUB bootloader located in the root partition. The initialize-root-partition instantiates a complete system as defined by the @code{%simple-os} operating-system.
pt_br: Note que a primeira e a terceira partições usam procedimentos de inicializadores genéricos, initialize-efi-partition e initialize-root-partition, respectivamente. O initialize-efi-partition instala um carregador EFI GRUB que está carregando o carregador de inicialização GRUB localizado na partição raiz. O initialize-root-partition instancia um sistema completo conforme definido pelo sistema operacional @code{%simple-os}.

source: You can now run:
pt_br: Agora você pode executar:

source: to instantiate the @code{image} definition. That produces a disk image which has the expected structure:
pt_br: para instanciar a definição @code{image}. Isso produz uma imagem de disco que tem a estrutura esperada:

source: A Docker image that can be used to spawn a Docker container.
pt_br: Uma imagem do Docker que pode ser usada para gerar um contêiner do Docker.

source: {Data Type} image-type
pt_br: {Tipo de dados} image-type

source: Build an image based on the @code{mbr-disk-image} image.
pt_br: Crie uma imagem baseada na imagem @code{mbr-disk-image}.

source: Build an MBR image with a single partition starting at a @code{1024KiB} offset. This is useful to leave some room to install a bootloader in the post-MBR gap.
pt_br: Crie uma imagem MBR com uma única partição começando em um deslocamento @code{1024KiB}. Isso é útil para deixar algum espaço para instalar um bootloader na lacuna pós-MBR.

source: So, if we get back to the @code{guix system image} command taking an @code{operating-system} declaration as argument. By default, the @code{mbr-raw-image-type} is used to turn the provided @code{operating-system} into an actual bootable image.
pt_br: Então, se voltarmos ao comando @code{guix system image} tomando uma declaração @code{operating-system} como argumento. Por padrão, o @code{mbr-raw-image-type} é usado para transformar o @code{operating-system} fornecido em uma imagem inicializável real.

source: To use a different @code{image-type}, the @code{--image-type} option can be used. The @code{--list-image-types} option will list all the supported image types. It turns out to be a textual listing of all the @code{image-types} variables described just above (@pxref{Invoking guix system}).
pt_br: Para usar um @code{image-type} diferente, a opção @code{--image-type} pode ser usada. A opção @code{--list-image-types} listará todos os tipos de imagem suportados. Acontece que é uma listagem textual de todas as variáveis @code{image-types} descritas logo acima (@pxref{Invoking guix system}).

source: Let's take the example of the Pine64, an ARM based machine. To be able to produce an image targeting this board, we need the following elements:
pt_br: Vamos pegar o exemplo do Pine64, uma máquina baseada em ARM. Para poder produzir uma imagem direcionada a essa placa, precisamos dos seguintes elementos:

source: An @code{operating-system} record containing at least
pt_br: Um registro @code{operating-system} contendo pelo menos

source: an appropriate kernel (@code{linux-libre-arm64-generic}) and bootloader @code{u-boot-pine64-lts-bootloader}) for the Pine64.
pt_br: um kernel apropriado (@code{linux-libre-arm64-generic}) e bootloader @code{u-boot-pine64-lts-bootloader}) para o Pine64.

source: The problem with debugging information is that it takes up a fair amount of disk space. For example, debugging information for the GNU C Library weighs in at more than 60 MiB@. Thus, as a user, keeping all the debugging info of all the installed programs is usually not an option. Yet, space savings should not come at the cost of an impediment to debugging---especially in the GNU system, which should make it easier for users to exert their computing freedom (@pxref{GNU Distribution}).
pt_br: O problema com informações de depuração é que elas ocupam uma quantidade considerável de espaço em disco. Por exemplo, informações de depuração para a GNU C Library pesam mais de 60 MiB@. Assim, como usuário, manter todas as informações de depuração de todos os programas instalados geralmente não é uma opção. No entanto, a economia de espaço não deve vir ao custo de um impedimento à depuração --- especialmente no sistema GNU, o que deve tornar mais fácil para os usuários exercerem sua liberdade de computação (@pxref{GNU Distribution}).

source: As we saw above, some packages, but not all, provide debugging info in a @code{debug} output. What can you do when debugging info is missing? The @option{--with-debug-info} option provides a solution to that: it allows you to rebuild the package(s) for which debugging info is missing---and only those---and to graft those onto the application you're debugging. Thus, while it's not as fast as installing a @code{debug} output, it is relatively inexpensive.
pt_br: Como vimos acima, alguns pacotres, mas não todos, provêem informação de depuração numa saída @code{debug}. O que podemos fazer quando informação de depuração está faltando? A opção @option{--with-debug-info} provê uma solução para isso: ela te permite reconstruir os pacotes para os quais a informação está faltando --- e nomente estes --- e exertá-los no aplicativo que você está deupurando. Portanto, enquanto isso não é tão rápido quanto a instalação de uma saída do @code{debug}, isso é relativamente menos custoso.

source: Using @TeX{} and @LaTeX{}
pt_br: Usando @TeX{} e @LaTeX{}

source: @TeX{} packages
pt_br: pacotes @TeX{}

source: @LaTeX{} packages
pt_br: pacotes @LaTeX{}

source: Guix provides packages for the @TeX{}, @LaTeX{}, ConTeXt, LuaTeX, and related typesetting systems, taken from the @uref{https://www.tug.org/texlive/, @TeX{} Live distribution}. Because @TeX{} Live is so huge and because finding one's way in this maze is tricky, this section provides some guidance on how to deploy the relevant packages to compile @TeX{} and @LaTeX{} documents.
pt_br: Guix provê pacotes para os @TeX{}, @LaTeX{}, ConTeXt, LuaTeX e sistemas de tipografia afins, retirados da @uref{https://www.tug.org/texlive/, distribuição @TeX{} Live}. Por conta da @TeX{} Live ser tão grande e encontrar um método neste labirinto é complicado, essa seção providenciará um guia de como implantar os pacotes relevantes para compilar documentos @TeX{} e @LaTeX{}.

source: @TeX{} Live currently comes in two mutually exclusive flavors in Guix:
pt_br: @TeX{} Live atualmente vem em dois sabores mutualmente excluisvos no Guix:

source: The ``monolithic'' @code{texlive} package: it comes with @emph{every single @TeX{} Live package} (roughly 4,200), but it is huge---more than 4@tie{}GiB for a single package!
pt_br: O pacote ``monolítico'' @code{texlive}: vem com @emph{todo pacote único da @TeX{} Live} (rigorosamente 4.200), mas isso é enorme --- mais que 4@tie{}GiB para um único pacote!

source: A ``modular'' @TeX{} Live distribution, in which you only install the packages you need, whose name is always prefixed with @samp{texlive-}.
pt_br: Uma distribuição ``modular'' da @TeX{} Live, na qual você instala os pacotes que você necessita, cujo nome é sempre prefixado com @samp{texlive-}.

source: If needed, you may then complete your system with individual packages, particularly when they belong to a large collection you're not otherwise interested in.
pt_br: Se necessário, você pode completar seu sistema com pacotes individuais, principalmente quando eles pertencem a uma coleção grande na qual você não tem interesse.

source: For instance, the following manifest is a reasonable, yet frugal starting point for a French @LaTeX{} user:
pt_br: Por exemplo. o seguinte manifesto e algo razoável, e ainda um ponto de partidal frugal para um usuário francês de @LaTeX{}:

source: How do you determine what the missing package is? In the first case, you will find the answer by running:
pt_br: Como determinar qual é o pacote que falta? No primeiro caso, encontrará a resposta executando:

source: In the second case, @command{guix search} turns up nothing. Instead, you can search the @TeX{} Live package database using the @command{tlmgr} command:
pt_br: No segundo caso, @command{guix search} não fornece nada. Ao invés disso, você pode buscar na base de dados de pacotes do @TeX{} Live usando o comando @command{tlmgr}:

source: The file is available in the @TeX{} Live @code{helvetic} package, which is known in Guix as @code{texlive-helvetic}. Quite a ride, but you found it!
pt_br: O arquivo está disponível no pacote @TeX{} Live @code{helvetic}, que é conhecido no Guix como @code{texlive-helvetic}. Uma viagem e tanto, mas você encontrou!

source: security updates
pt_br: atualizações de segurança

source: Occasionally, important security vulnerabilities are discovered in software packages and must be patched. Guix developers try hard to keep track of known vulnerabilities and to apply fixes as soon as possible in the @code{master} branch of Guix (we do not yet provide a ``stable'' branch containing only security updates). The @command{guix lint} tool helps developers find out about vulnerable versions of software packages in the distribution:
pt_br: Ocasionalmente, vulnerabilidades de segurança importantes são descobertas em pacotes de software e devem ser corrigidas. Os desenvolvedores do Guix se esforçam para manter o controle das vulnerabilidades conhecidas e aplicar correções o mais rápido possível no branch @code{master} do Guix (ainda não fornecemos um branch ``stable'' contendo apenas atualizações de segurança). A ferramenta @command{guix lint} ajuda os desenvolvedores a descobrirem sobre versões vulneráveis de pacotes de software na distribuição:

source: @xref{Invoking guix lint}, for more information.
pt_br: @xref{Invoking guix lint}, para mais informações.

source: Guix follows a functional package management discipline (@pxref{Introduction}), which implies that, when a package is changed, @emph{every package that depends on it} must be rebuilt. This can significantly slow down the deployment of fixes in core packages such as libc or Bash, since basically the whole distribution would need to be rebuilt. Using pre-built binaries helps (@pxref{Substitutes}), but deployment may still take more time than desired.
pt_br: Guix segue uma disciplina de gerenciamento de pacotes funcional (@pxref{Introdução}), o que implica que, quando um pacote é alterado, @emph{todo pacote que depende dele} deve ser reconstruído. Isso pode desacelerar significativamente a implantação de correções em pacotes principais, como libc ou Bash, já que basicamente toda a distribuição precisaria ser reconstruída. Usar binários pré-construídos ajuda (@pxref{Substitutos}), mas a implantação ainda pode levar mais tempo do que o desejado.

source: @dots{} and compare the store file names that you get with those above. Likewise for a complete Guix system generation:
pt_br: @dots{} e compare os nomes dos arquivos de armazém que você obtém com os acima. Da mesma forma para uma geração completa do sistema Guix:

source: Lastly, to check which Bash running processes are using, you can use the @command{lsof} command:
pt_br: Por fim, para verificar quais processos Bash estão em execução, você pode usar o comando @command{lsof}:

source: bootstrapping
pt_br: inicialização

source: Bootstrapping in our context refers to how the distribution gets built ``from nothing''. Remember that the build environment of a derivation contains nothing but its declared inputs (@pxref{Introduction}). So there's an obvious chicken-and-egg problem: how does the first package get built? How does the first compiler get compiled?
pt_br: Bootstrapping em nosso contexto se refere a como a distribuição é construída ``do nada''. Lembre-se de que o ambiente de construção de uma derivação não contém nada além de suas entradas declaradas (@pxref{Introdução}). Então há um problema óbvio de galinha e ovo: como o primeiro pacote é construído? Como o primeiro compilador é compilado?

source: It is tempting to think of this question as one that only die-hard hackers may care about. However, while the answer to that question is technical in nature, its implications are wide-ranging. How the distribution is bootstrapped defines the extent to which we, as individuals and as a collective of users and hackers, can trust the software we run. It is a central concern from the standpoint of @emph{security} and from a @emph{user freedom} viewpoint.
pt_br: É tentador pensar nessa questão como algo com que apenas hackers obstinados podem se importar. No entanto, embora a resposta a essa questão seja de natureza técnica, suas implicações são abrangentes. Como a distribuição é bootstrapped define até que ponto nós, como indivíduos e como um coletivo de usuários e hackers, podemos confiar no software que executamos. É uma preocupação central do ponto de vista da @emph{segurança} e do ponto de vista da @emph{liberdade do usuário}.

source: bootstrap binaries
pt_br: binários bootstrap

source: The GNU system is primarily made of C code, with libc at its core. The GNU build system itself assumes the availability of a Bourne shell and command-line tools provided by GNU Coreutils, Awk, Findutils, `sed', and `grep'. Furthermore, build programs---programs that run @code{./configure}, @code{make}, etc.---are written in Guile Scheme (@pxref{Derivations}). Consequently, to be able to build anything at all, from scratch, Guix relies on pre-built binaries of Guile, GCC, Binutils, libc, and the other packages mentioned above---the @dfn{bootstrap binaries}.
pt_br: O sistema GNU é feito principalmente de código C, com libc em seu núcleo. O próprio sistema de construção GNU assume a disponibilidade de um Bourne shell e ferramentas de linha de comando fornecidas pelo GNU Coreutils, Awk, Findutils, `sed' e `grep'. Além disso, programas de construção --- programas que executam @code{./configure}, @code{make}, etc. --- são escritos em Guile Scheme (@pxref{Derivations}). Consequentemente, para ser capaz de construir qualquer coisa, do zero, Guix depende de binários pré-construídos de Guile, GCC, Binutils, libc e os outros pacotes mencionados acima --- os @dfn{binários bootstrap}.
