Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Exiting from a Guix environment is the same as exiting from the shell, and will place the user back in the old environment before @command{guix environment} was invoked. The next garbage collection (@pxref{Invoking guix gc}) will clean up packages that were installed from within the environment and are no longer used outside of it.
pt_br: Sair de um ambiente Guix é o mesmo que sair do shell, e colocará o usuário de volta no ambiente antigo antes de @command{guix environment} ser invocado. A próxima coleta de lixo (@pxref{Invoking guix gc}) limpará os pacotes que foram instalados de dentro do ambiente e não são mais usados fora dele.

source: @command{guix environment} defines the @env{GUIX_ENVIRONMENT} variable in the shell it spawns; its value is the file name of the profile of this environment. This allows users to, say, define a specific prompt for development environments in their @file{.bashrc} (@pxref{Bash Startup Files,,, bash, The GNU Bash Reference Manual}):
pt_br: @command{guix environment} define a variável @env{GUIX_ENVIRONMENT} no shell que ele gera; seu valor é o nome do arquivo do perfil deste ambiente. Isso permite que os usuários, digamos, definam um prompt específico para ambientes de desenvolvimento em seu @file{.bashrc} (@pxref{Bash Startup Files,,, bash, Manual de referência do GNU Bash}):

source: Additionally, more than one package may be specified, in which case the union of the inputs for the given packages are used. For example, the command below spawns a shell where all of the dependencies of both Guile and Emacs are available:
pt_br: Além disso, mais de um pacote pode ser especificado, em cujo caso a união das entradas para os pacotes fornecidos é usada. Por exemplo, o comando abaixo gera um shell onde todas as dependências do Guile e do Emacs estão disponíveis:

source: Sometimes an interactive shell session is not desired. An arbitrary command may be invoked by placing the @code{--} token to separate the command from the rest of the arguments:
pt_br: Às vezes, uma sessão de shell interativa não é desejada. Um comando arbitrário pode ser invocado colocando o token @code{--} para separar o comando do resto dos argumentos:

source: In other situations, it is more convenient to specify the list of packages needed in the environment. For example, the following command runs @command{python} from an environment containing Python@tie{}3 and NumPy:
pt_br: Em outras situações, é mais conveniente especificar a lista de pacotes necessários no ambiente. Por exemplo, o comando a seguir executa @command{python} de um ambiente contendo Python@tie{}3 e NumPy:

source: Furthermore, one might want the dependencies of a package and also some additional packages that are not build-time or runtime dependencies, but are useful when developing nonetheless. Because of this, the @option{--ad-hoc} flag is positional. Packages appearing before @option{--ad-hoc} are interpreted as packages whose dependencies will be added to the environment. Packages appearing after are interpreted as packages that will be added to the environment directly. For example, the following command creates a Guix development environment that additionally includes Git and strace:
pt_br: Além disso, pode-se querer as dependências de um pacote e também alguns pacotes adicionais que não são dependências de tempo de construção ou tempo de execução, mas são úteis ao desenvolver, no entanto. Por causa disso, o sinalizador @option{--ad-hoc} é posicional. Pacotes que aparecem antes de @option{--ad-hoc} são interpretados como pacotes cujas dependências serão adicionadas ao ambiente. Pacotes que aparecem depois são interpretados como pacotes que serão adicionados ao ambiente diretamente. Por exemplo, o comando a seguir cria um ambiente de desenvolvimento Guix que inclui adicionalmente Git e strace:

source: Sometimes it is desirable to isolate the environment as much as possible, for maximal purity and reproducibility. In particular, when using Guix on a host distro that is not Guix System, it is desirable to prevent access to @file{/usr/bin} and other system-wide resources from the development environment. For example, the following command spawns a Guile REPL in a ``container'' where only the store and the current working directory are mounted:
pt_br: Às vezes, é desejável isolar o ambiente o máximo possível, para máxima pureza e reprodutibilidade. Em particular, ao usar Guix em uma distribuição host que não seja Guix System, é desejável impedir o acesso a @file{/usr/bin} e outros recursos de todo o sistema do ambiente de desenvolvimento. Por exemplo, o comando a seguir gera um Guile REPL em um ``contêiner'' onde apenas o armazém e o diretório de trabalho atual são montados:

source: The @option{--container} option requires Linux-libre 3.19 or newer.
pt_br: A opção @option{--container} requer Linux-libre 3.19 ou mais recente.

source: certificates
pt_br: certificados

source: Another typical use case for containers is to run security-sensitive applications such as a web browser. To run Eolie, we must expose and share some files and directories; we include @code{nss-certs} and expose @file{/etc/ssl/certs/} for HTTPS authentication; finally we preserve the @env{DISPLAY} environment variable since containerized graphical applications won't display without it.
pt_br: Outro caso de uso típico para contêineres é executar aplicativos sensíveis à segurança, como um navegador da web. Para executar o Eolie, precisamos expor e compartilhar alguns arquivos e diretórios; incluímos @code{nss-certs} e expomos @file{/etc/ssl/certs/} para autenticação HTTPS; finalmente, preservamos a variável de ambiente @env{DISPLAY}, pois os aplicativos gráficos em contêiner não serão exibidos sem ela.

source: Set up the environment and check whether the shell would clobber environment variables. @xref{Invoking guix shell, @option{--check}}, for more info.
pt_br: Configure o ambiente e verifique se o shell sobrecarregaria as variáveis de ambiente. @xref{Invoking guix shell, @option{--check}}, para mais informações.

source: When this option is omitted, the environment is protected from garbage collection only for the duration of the @command{guix environment} session. This means that next time you recreate the same environment, you could have to rebuild or re-download packages. @xref{Invoking guix gc}, for more on GC roots.
pt_br: Quando esta opção pe omitida, o ambiente é protegido da coleta de lixo apenas pela duração da sessão do @command{guix environment}. Isso significa que na próxima vez que você recriar o mesmo ambiente, você tpoderia ter que reconstruir ou refazer o download dos pacotes. @xref{Invoking guix gc}, para mais sobre GC roots.

source: --load=@var{file}
pt_br: --load=@var{arquivo}

source: -l @var{file}
pt_br: -l @var{arquivo}

source: Create an environment for the package or list of packages that the code within @var{file} evaluates to.
pt_br: Crie um ambiente para o pacote ou lista de pacotes que o código dentro de @var{arquivo} avalia.

source: @xref{shell-export-manifest, @command{guix shell --export-manifest}}, for information on how to ``convert'' command-line options into a manifest.
pt_br: @xref{shell-export-manifest, @command{guix shell --export-manifest}}, para obter informações sobre como ``converter'' opções de linha de comando em um manifesto.

source: Include all specified packages in the resulting environment, as if an @i{ad hoc} package were defined with them as inputs. This option is useful for quickly creating an environment without having to write a package expression to contain the desired inputs.
pt_br: Inclui todos os pacotes especificados no ambiente resultante, como se um pacote @i{ad hoc} fosse definido com eles como entradas. Esta opção é útil para criar rapidamente um ambiente sem ter que escrever uma expressão de pacote para conter as entradas desejadas.

source: For instance, the command:
pt_br: Por exemplo, o comando:

source: runs @command{guile} in an environment where Guile and Guile-SDL are available.
pt_br: executa @command{guile} em um ambiente onde Guile e Guile-SDL estão disponíveis.

source: Note that this example implicitly asks for the default output of @code{guile} and @code{guile-sdl}, but it is possible to ask for a specific output---e.g., @code{glib:bin} asks for the @code{bin} output of @code{glib} (@pxref{Packages with Multiple Outputs}).
pt_br: Observe que este exemplo solicita implicitamente a saída padrão de @code{guile} e @code{guile-sdl}, mas é possível solicitar uma saída específica — por exemplo, @code{glib:bin} solicita a saída @code{bin} de @code{glib} (@pxref{Packages with Multiple Outputs}).

source: This option may be composed with the default behavior of @command{guix environment}. Packages appearing before @option{--ad-hoc} are interpreted as packages whose dependencies will be added to the environment, the default behavior. Packages appearing after are interpreted as packages that will be added to the environment directly.
pt_br: Esta opção pode ser composta com o comportamento padrão de @command{guix environment}. Pacotes que aparecem antes de @option{--ad-hoc} são interpretados como pacotes cujas dependências serão adicionadas ao ambiente, o comportamento padrão. Pacotes que aparecem depois são interpretados como pacotes que serão adicionados ao ambiente diretamente.

source: For containers, link the environment profile to @file{~/.guix-profile} within the container and set @code{GUIX_ENVIRONMENT} to that. This is equivalent to making @file{~/.guix-profile} a symlink to the actual profile within the container. Linking will fail and abort the environment if the directory already exists, which will certainly be the case if @command{guix environment} was invoked in the user's home directory.
pt_br: Para contêineres, vincule o perfil do ambiente a @file{~/.guix-profile} dentro do contêiner e defina @code{GUIX_ENVIRONMENT} para isso. Isso é equivalente a tornar @file{~/.guix-profile} uma ligação simbólica para o perfil real dentro do contêiner. A vinculação falhará e abortará o ambiente se o diretório já existir, o que certamente será o caso se @command{guix environment} foi invocado no diretório pessoal do usuário.

source: For containers, emulate a Filesystem Hierarchy Standard (FHS) configuration within the container, see @uref{https://refspecs.linuxfoundation.org/fhs.shtml, the official specification}. As Guix deviates from the FHS specification, this option sets up the container to more closely mimic that of other GNU/Linux distributions. This is useful for reproducing other development environments, testing, and using programs which expect the FHS specification to be followed. With this option, the container will include a version of @code{glibc} which will read @code{/etc/ld.so.cache} within the container for the shared library cache (contrary to @code{glibc} in regular Guix usage) and set up the expected FHS directories: @code{/bin}, @code{/etc}, @code{/lib}, and @code{/usr} from the container's profile.
pt_br: Para contêineres, emule uma configuração Filesystem Hierarchy Standard (FHS) dentro do contêiner, veja @uref{https://refspecs.linuxfoundation.org/fhs.shtml, a especificação oficial}. Como o Guix se desvia da especificação FHS, esta opção configura o contêiner para imitar mais de perto o de outras distribuições GNU/Linux. Isto é útil para reproduzir outros ambientes de desenvolvimento, testar e usar programas que esperam que a especificação FHS seja seguida. Com esta opção, o contêiner incluirá uma versão de @code{glibc} que lerá @code{/etc/ld.so.cache} dentro do contêiner para o cache da biblioteca compartilhada (ao contrário de @code{glibc} no uso regular do Guix) e configurará os diretórios FHS esperados: @code{/bin}, @code{/etc}, @code{/lib} e @code{/usr} do perfil do contêiner.

source: @command{guix environment} also supports all of the common build options that @command{guix build} supports (@pxref{Common Build Options}) as well as package transformation options (@pxref{Package Transformation Options}).
pt_br: @command{guix environment} também oferece suporte a todas as opções de compilação comuns que @command{guix build} oferece suporte (@pxref{Common Build Options}), bem como opções de transformação de pacotes (@pxref{Package Transformation Options}).

source: Invoking @command{guix pack}
pt_br: Invocando @command{guix pack}

source: Occasionally you want to pass software to people who are not (yet!) lucky enough to be using Guix. You'd tell them to run @command{guix package -i @var{something}}, but that's not possible in this case. This is where @command{guix pack} comes in.
pt_br: Ocasionalmente você quer passar software para pessoas que não têm (ainda!) a sorte de usar Guix. Você diria para elas executarem @command{guix package -i @var{algo}}, mas isso não é possível neste caso. É aqui que @command{guix pack} entra.

source: If you are looking for ways to exchange binaries among machines that already run Guix, @pxref{Invoking guix copy}, @ref{Invoking guix publish}, and @ref{Invoking guix archive}.
pt_br: Se você estiver procurando maneiras de trocar binários entre máquinas que já executam Guix, @pxref{Invoking guix copy}, @ref{Invoking guix publish} e @ref{Invoking guix archive}.

source: bundle
pt_br: embalagem

source: application bundle
pt_br: embalagem de aplicativos

source: software bundle
pt_br: embalagem de software

source: The @command{guix pack} command creates a shrink-wrapped @dfn{pack} or @dfn{software bundle}: it creates a tarball or some other archive containing the binaries of the software you're interested in, and all its dependencies. The resulting archive can be used on any machine that does not have Guix, and people can run the exact same binaries as those you have with Guix. The pack itself is created in a bit-reproducible fashion, so anyone can verify that it really contains the build results that you pretend to be shipping.
pt_br: O comando @command{guix pack} cria uma @dfn{embalagem de software} encapsulado: ele cria um tarball ou algum outro arquivo contendo os binários do software em que você está interessado e todas as suas dependências. O arquivo resultante pode ser usado em qualquer máquina que não tenha Guix, e as pessoas podem executar exatamente os mesmos binários que você tem com Guix. A embalagem em si é criada de forma reproduzível em bits, para que qualquer um possa verificar se ela realmente contém os resultados da compilação que você pretende enviar.

source: For example, to create a bundle containing Guile, Emacs, Geiser, and all their dependencies, you can run:
pt_br: Por exemplo, para criar uma embalagem contenda Guile, Emacs, Geiser e todas as suas dependências, você pode executar:

source: The result here is a tarball containing a @file{/gnu/store} directory with all the relevant packages. The resulting tarball contains a @dfn{profile} with the three packages of interest; the profile is the same as would be created by @command{guix package -i}. It is this mechanism that is used to create Guix's own standalone binary tarball (@pxref{Binary Installation}).
pt_br: O resultado aqui é um tarball contendo um diretório @file{/gnu/store} com todos os pacotes relevantes. O tarball resultante contém um @dfn{perfil} com os três pacotes de interesse; o perfil é o mesmo que seria criado por @command{guix package -i}. É esse mecanismo que é usado para criar o próprio tarball binário autônomo do Guix (@pxref{Binary Installation}).

source: Users of this pack would have to run @file{/gnu/store/@dots{}-profile/bin/guile} to run Guile, which you may find inconvenient. To work around it, you can create, say, a @file{/opt/gnu/bin} symlink to the profile:
pt_br: Usuários desta embalagem teriam que executar @file{/gnu/store/@dots{}-profile/bin/guile} para executar o Guile, o que você pode achar inconveniente. Para contornar isso, você pode criar, digamos, uma ligação simbólica @file{/opt/gnu/bin} para o perfil:

source: That way, users can happily type @file{/opt/gnu/bin/guile} and enjoy.
pt_br: Dessa forma, os usuários podem digitar @file{/opt/gnu/bin/guile} e aproveitar.

source: relocatable binaries, with @command{guix pack}
pt_br: binários relocáveis, com @command{guix pack}

source: What if the recipient of your pack does not have root privileges on their machine, and thus cannot unpack it in the root file system? In that case, you will want to use the @option{--relocatable} option (see below). This option produces @dfn{relocatable binaries}, meaning they can be placed anywhere in the file system hierarchy: in the example above, users can unpack your tarball in their home directory and directly run @file{./opt/gnu/bin/guile}.
pt_br: E se o destinatário do sua embalagem não tiver privilégios de root na máquina dele e, portanto, não puder descompactá-lo no sistema de arquivos raiz? Nesse caso, você vai querer usar a opção @option{--relocatable} (veja abaixo). Essa opção produz @dfn{binários relocáveis}, o que significa que eles podem ser colocados em qualquer lugar na hierarquia do sistema de arquivos: no exemplo acima, os usuários podem descompactar seu tarball no diretório pessoal deles e executar diretamente @file{./opt/gnu/bin/guile}.

source: Docker, build an image with guix pack
pt_br: Docker, construa uma imagem com guix pack

source: Alternatively, you can produce a pack in the Docker image format using the following command:
pt_br: Como alternativa, você pode produzir uma embalagem no formato de imagem do Docker usando o seguinte comando:

source: The result is a tarball that can be passed to the @command{docker load} command, followed by @code{docker run}:
pt_br: O resultado é um tarball que pode ser passado para o comando @command{docker load}, seguido por @code{docker run}:

source: docker load < @var{file} docker run -ti guile-guile-readline /bin/guile
pt_br: docker load < @var{arquivo} docker run -ti guile-guile-readline /bin/guile

source: where @var{file} is the image returned by @command{guix pack}, and @code{guile-guile-readline} is its ``image tag''. See the @uref{https://docs.docker.com/engine/reference/commandline/load/, Docker documentation} for more information.
pt_br: onde @var{arquivo} é a imagem retornada por @command{guix pack}, e @code{guile-guile-readline} é sua ``image tag''. Veja @uref{https://docs.docker.com/engine/reference/commandline/load/, documentação do Docker} para mais informações.

source: Singularity, build an image with guix pack
pt_br: Singularity, construa uma imagem com guix pack

source: SquashFS, build an image with guix pack
pt_br: SquashFS, construa uma imagem com guix pack

source: Yet another option is to produce a SquashFS image with the following command:
pt_br: Outra opção é produzir uma imagem SquashFS com o seguinte comando:

source: The result is a SquashFS file system image that can either be mounted or directly be used as a file system container image with the @uref{https://www.sylabs.io/docs/, Singularity container execution environment}, using commands like @command{singularity shell} or @command{singularity exec}.
pt_br: O resultado é uma imagem do sistema de arquivos SquashFS que pode ser montada ou usada diretamente como uma imagem de contêiner do sistema de arquivos com o @uref{https://www.sylabs.io/docs/, ambiente de execução do contêiner Singularity}, usando comandos como @command{singularity shell} ou @command{singularity exec}.

source: Another format internally based on SquashFS is @uref{https://appimage.org/, AppImage}. An AppImage file can be created and executed without any special privileges:
pt_br: Outro formato internamente baseado em SquashFS é o @uref{https://appimage.org/, AppImage}. Um arquivo de AppImage pode ser criado e executado sem qualquer provilégio especial:

source: Several command-line options allow you to customize your pack:
pt_br: Várias opções de linha de comando permitem que você personalize sua embalagem:

source: Produce a pack in the given @var{format}.
pt_br: Produza uma embalagem no @var{formato} fornecido.

source: The available formats are:
pt_br: Os formatos disponíveis são:

source: This is the default format. It produces a tarball containing all the specified binaries and symlinks.
pt_br: Este é o formato padrão. Ele produz um tarball contendo todos os binários e ligações simbólicas especificados.

source: This produces a tarball that follows the @uref{https://github.com/docker/docker/blob/master/image/spec/v1.2.md, Docker Image Specification}. By default, the ``repository name'' as it appears in the output of the @command{docker images} command is computed from package names passed on the command line or in the manifest file. Alternatively, the ``repository name'' can also be configured via the @option{--image-tag} option. Refer to @option{--help-docker-format} for more information on such advanced options.
pt_br: Isso produz um tarball que segue o @uref{https://github.com/docker/docker/blob/master/image/spec/v1.2.md, Docker Image Specification}. Por padrão, o ``nome do repositório'' como aparece na saída do comando @command{docker images} é computado a partir de nomes de pacotes passados na linha de comando ou no arquivo manifesto. Como alternativa, o ``nome do repositório'' também pode ser configurado por meio da opção @option{--image-tag}. Consulte @option{--help-docker-format} para obter mais informações sobre essas opções avançadas.

source: This produces a SquashFS image containing all the specified binaries and symlinks, as well as empty mount points for virtual file systems like procfs.
pt_br: Isso produz uma imagem SquashFS contendo todos os binários e ligações simbólicas especificados, bem como pontos de montagem vazios para sistemas de arquivos virtuais como procfs.

source: Singularity @emph{requires} you to provide @file{/bin/sh} in the image. For that reason, @command{guix pack -f squashfs} always implies @code{-S /bin=bin}. Thus, your @command{guix pack} invocation must always start with something like:
pt_br: Singularity @emph{requer} que você forneça @file{/bin/sh} na imagem. Por esse motivo, @command{guix pack -f squashfs} sempre implica @code{-S /bin=bin}. Portanto, sua invocação @command{guix pack} deve sempre começar com algo como:

source: If you forget the @code{bash} (or similar) package, @command{singularity run} and @command{singularity exec} will fail with an unhelpful ``no such file or directory'' message.
pt_br: Se você esquecer o pacote @code{bash} (ou similar), @command{singularity run} e @command{singularity exec} falharão com uma mensagem inútil ``nenhum arquivo ou diretório''.

source: Debian, build a .deb package with guix pack
pt_br: Debian, construa um pacote .deb com guix pack

source: This produces a Debian archive (a package with the @samp{.deb} file extension) containing all the specified binaries and symbolic links, that can be installed on top of any dpkg-based GNU(/Linux) distribution. Advanced options can be revealed via the @option{--help-deb-format} option. They allow embedding control files for more fine-grained control, such as activating specific triggers or providing a maintainer configure script to run arbitrary setup code upon installation.
pt_br: Isso produz um arquivo Debian (um pacote com a extensão de arquivo @samp{.deb}) contendo todos os binários e ligações simbólicas especificados, que podem ser instalados em cima de qualquer distribuição GNU(/Linux) baseada em dpkg. Opções avançadas podem ser reveladas por meio da opção @option{--help-deb-format}. Elas permitem incorporar arquivos de controle para um controle mais refinado, como ativar gatilhos específicos ou fornecer um script de configuração do mantenedor para executar código de configuração arbitrário na instalação.
