Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: What's special.
it: Cosa c'è di speciale.
pt_br: O que há de especial.

source: GNU Distribution
it: Distribuzione GNU
pt_br: Distribuição GNU

source: The packages and tools.
it: I pacchetti e gli strumenti.
pt_br: Os pacotes e as ferramentas.

source: Binary Installation
it: Installazione binaria
pt_br: Instalação de binários

source: Getting Guix running in no time!
it: Fare funzionare Guix in pochissimo tempo!
pt_br: Faça o Guix funcionar rapidamente!

source: Setting Up the Daemon
it: Configurazione del demone
pt_br: Configurando o daemon

source: Preparing the build daemon's environment.
it: Preparazione dell'ambiente del demone di compilazione.
pt_br: Preparando o ambiente do daemon de compilação.

source: Invoking guix-daemon
it: Invocare guix-daemon
pt_br: Invocando guix-daemon

source: Running the build daemon.
it: Esecuzione del demone di compilazione.
pt_br: Executando o daemon de compilação.

source: Application Setup
it: Configurazione dell'applicazione
pt_br: Configuração de aplicativo

source: Application-specific setup.
it: Configurazione specifica dell'applicazione.
pt_br: Configuração específica de aplicativo.

source: Upgrading Guix
it: Aggiornamento di Guix
pt_br: Atualizando o Guix

source: Upgrading Guix and its build daemon.
it: Aggiornamento di Guix e del suo demone di compilazione.
pt_br: Atualizando o Guix e seu daemon de compilação.

source: Build Environment Setup
it: Configurazione dell'ambiente di build
pt_br: Configuração do ambiente de compilação

source: Preparing the isolated build environment.
it: Preparazione dell'ambiente di compilazione isolato.
pt_br: Preparando o ambiente de compilação isolado.

source: Daemon Offload Setup
it: Configurazione dello scarico del demone
pt_br: Configuração de descarregamento de daemon

source: Offloading builds to remote machines.
it: Scaricare le compilazioni su macchine remote.
pt_br: Descarregando compilações para máquinas remotas.

source: SELinux Support
it: Supporto SELinux
pt_br: Suporte a SELinux

source: Using an SELinux policy for the daemon.
it: Utilizzo di una politica SELinux per il demone.
pt_br: Usando um política SELinux para o daemon.

source: Limitations
it: Limitazioni
pt_br: Limitações

source: What you can expect.
it: Cosa puoi aspettarti.
pt_br: O que você pode esperar.

source: Hardware Considerations
it: Considerazioni sull'hardware
pt_br: Considerações de hardware

source: Supported hardware.
it: Hardware supportato.
pt_br: Hardware suportado.

source: USB Stick and DVD Installation
it: Installazione da chiavetta USB e DVD
pt_br: Instalação em um pendrive e em DVD

source: Preparing the installation medium.
it: Preparazione del supporto di installazione.
pt_br: Preparando a mídia de instalação.

source: Preparing for Installation
it: Preparazione all'installazione
pt_br: Preparando para instalação

source: Networking, partitioning, etc.
it: Rete, partizionamento, ecc.
pt_br: Rede, particionamento, etc.

source: Guided Graphical Installation
it: Installazione grafica guidata
pt_br: Instalação gráfica guiada

source: Easy graphical installation.
it: Installazione grafica semplice.
pt_br: Instalação gráfica fácil.

source: Manual Installation
it: Installazione manuale
pt_br: Instalação manual

source: Manual installation for wizards.
it: Installazione manuale per maghi.
pt_br: Instalação manual para magos.

source: After System Installation
it: Dopo l'installazione del sistema
pt_br: Após a instalação do sistema

source: When installation succeeded.
it: Quando l'installazione è riuscita.
pt_br: Quando a instalação conclui com sucesso.

source: Installing Guix in a VM
it: Installare Guix in una VM
pt_br: Instalando Guix em uma VM

source: Guix System playground.
it: Area di prova per Guix System.
pt_br: Parque de diversões do Guix System.

source: Building the Installation Image
it: Creare l'immagine di installazione
pt_br: Compilando a imagem de instalação

source: How this comes to be.
it: Come questo viene creato.
pt_br: Como isso vem a ser.

source: Keyboard Layout and Networking and Partitioning
it: Layout della tastiera e rete e partizionamento
pt_br: Disposição de teclado e rede e particionamento

source: Initial setup.
it: Configurazione iniziale.
pt_br: Configuração inicial.

source: Proceeding with the Installation
it: Procedere con l'installazione
pt_br: Prosseguindo com a instalação

source: Installing.
it: Installazione.
pt_br: Instalando.

source: Features
it: Funzionalità
pt_br: Recursos

source: How Guix will make your life brighter.
it: Come Guix renderà la tua vita più luminosa.
pt_br: Como o Guix vai iluminar a sua vida.

source: Invoking guix package
it: Invocare guix package
pt_br: Invocando guix package

source: Package installation, removal, etc.
it: Installazione, rimozione, ecc. dei pacchetti.
pt_br: Instalação de pacote, remoção, etc.

source: Substitutes
it: Sostituti
pt_br: Substitutos

source: Downloading pre-built binaries.
it: Scaricare binari pre-compilati.
pt_br: Baixando binários pré-compilados.

source: Packages with Multiple Outputs
it: Pacchetti con output multipli
pt_br: Pacotes com múltiplas saídas

source: Single source package, multiple outputs.
it: Singolo pacchetto sorgente, output multipli.
pt_br: Um único pacote de fontes, várias saídas.

source: Invoking guix locate
it: Invocare guix locate
pt_br: Invocando guix locate

source: Locating packages that provide a file.
it: Trovare pacchetti che forniscono un file.
pt_br: Localizando pacotes que fornecem um arquivo.

source: Invoking guix gc
it: Invocare guix gc
pt_br: Invocando guix gc

source: Running the garbage collector.
it: Eseguire il garbage collector.
pt_br: Executando o coletor de lixo.

source: Invoking guix pull
it: Invocare guix pull
pt_br: Invocando guix pull

source: Fetching the latest Guix and distribution.
it: Ottenere l'ultima versione di Guix e della distribuzione.
pt_br: Obtendo o Guix mais recente e distribuição.

source: Invoking guix time-machine
it: Invocare guix time-machine
pt_br: Invocando guix time-machine

source: Running an older revision of Guix.
it: Eseguire una revisione precedente di Guix.
pt_br: Executando uma revisão mais antiga do Guix.

source: Inferiors
it: Inferiori
pt_br: Inferiores

source: Interacting with another revision of Guix.
it: Interagire con un'altra revisione di Guix.
pt_br: Interagindo com outra revisão do Guix.

source: Invoking guix describe
it: Invocare guix describe
pt_br: Invocando guix describe

source: Display information about your Guix revision.
it: Mostrare informazioni sulla tua revisione di Guix.
pt_br: Exibe informações sobre sua revisão do Guix.

source: Invoking guix archive
it: Invocare guix archive
pt_br: Invocando guix archive

source: Exporting and importing store files.
it: Esportare e importare file dallo store.
pt_br: Exportando e importando arquivos do armazém.

source: One particular source of substitutes.
it: Una fonte particolare di sostituti.
pt_br: Uma fonte específica de substitutos.

source: Substitute Server Authorization
it: Autorizzazione del server di sostituti
pt_br: Autorização de servidor substituto

source: How to enable or disable substitutes.
it: Come abilitare o disabilitare i sostituti.
pt_br: Como habilitar ou desabilitar substitutos.

source: Getting Substitutes from Other Servers
it: Ottenere sostituti da altri server
pt_br: Obtendo substitutos de outros servidores

source: Substitute diversity.
it: Diversità dei sostituti.
pt_br: Diversidade de substitutos.

source: Substitute Authentication
it: Autenticazione dei sostituti
pt_br: Autenticação de substituto

source: How Guix verifies substitutes.
it: Come Guix verifica i sostituti.
pt_br: Como Guix verifica substitutos.

source: Proxy Settings
it: Impostazioni proxy
pt_br: Configurações de proxy

source: How to get substitutes via proxy.
it: Come ottenere sostituti tramite proxy.
pt_br: Como obter substitutos via proxy.

source: Substitution Failure
it: Fallimento della sostituzione
pt_br: Falha na substituição

source: What happens when substitution fails.
it: Cosa succede quando la sostituzione fallisce.
pt_br: O que acontece quando a substituição falha.

source: On Trusting Binaries
it: Sulla fiducia nei binari
pt_br: Confiança em binários

source: How can you trust that binary blob?
it: Come puoi fidarti di quel blob binario?
pt_br: Como você pode confiar naquele blob binário?

source: Specifying Additional Channels
it: Specificare canali aggiuntivi
pt_br: Especificando canais adicionais

source: Extending the package collection.
it: Estendere la collezione di pacchetti.
pt_br: Ampliando a coleta de pacotes.

source: Using a Custom Guix Channel
it: Usare un canale Guix personalizzato
pt_br: Usando um canal Guix personalizado

source: Using a customized Guix.
it: Usare un Guix personalizzato.
pt_br: Usando um Guix personalizado.

source: Replicating Guix
it: Replicare Guix
pt_br: Replicando Guix

source: Running the @emph{exact same} Guix.
it: Eseguire l'@emph{esatto stesso} Guix.
pt_br: Executando o @emph{exatamente o mesmo} Guix.

source: Channel Authentication
it: Autenticazione dei canali
pt_br: Autenticação de canal

source: How Guix verifies what it fetches.
it: Come Guix verifica ciò che scarica.
pt_br: Como o Guix verifica o que busca.

source: Channels with Substitutes
it: Canali con sostituti
pt_br: Canais com substitutos

source: Using channels with available substitutes.
it: Usare canali con sostituti disponibili.
pt_br: Utilizando canais com substitutos disponíveis.

source: Creating a Channel
it: Creare un canale
pt_br: Criando um canal

source: How to write your custom channel.
it: Come scrivere il tuo canale personalizzato.
pt_br: Como escrever seu canal personalizado.

source: Package Modules in a Sub-directory
it: Moduli di pacchetti in una sottocartella
pt_br: Módulos de pacote em um subdiretório

source: Specifying the channel's package modules location.
it: Specificare la posizione dei moduli dei pacchetti del canale.
pt_br: Especificando a localização dos módulos do pacote do canal.

source: Declaring Channel Dependencies
it: Dichiarare le dipendenze dei canali
pt_br: Declarando dependências de canal

source: How to depend on other channels.
it: Come dipendere da altri canali.
pt_br: Como depender de outros canais.

source: Specifying Channel Authorizations
it: Specificare le autorizzazioni dei canali
pt_br: Especificando autorizações de canal

source: Defining channel authors authorizations.
it: Definire le autorizzazioni degli autori dei canali.
pt_br: Definindo autorizações de autores de canais.

source: Primary URL
it: URL primario
pt_br: URL principal

source: Distinguishing mirror to original.
it: Distinguere il mirror dall'originale.
pt_br: Distinguir o espelho do original.

source: Writing Channel News
it: Scrivere le novità del canale
pt_br: Escrevendo notícias do canal

source: Communicating information to channel's users.
it: Comunicare informazioni agli utenti del canale.
pt_br: Comunicar informações aos usuários do canal.

source: Invoking guix shell
it: Invocare guix shell
pt_br: Invocando guix shell

source: Invoking guix environment
it: Invocare guix environment
pt_br: Invocando guix environment

source: Setting up development environments.
it: Impostare ambienti di sviluppo.
pt_br: Configurando ambientes de desenvolvimento.

source: Invoking guix pack
it: Invocare guix pack
pt_br: Invocando guix pack

source: Creating software bundles.
it: Creare pacchetti software.
pt_br: Criando embalagens de software.

source: The GCC toolchain
it: La toolchain GCC
pt_br: A cadeia de ferramentas do GCC

source: Working with languages supported by GCC.
it: Lavorare con i linguaggi supportati da GCC.
pt_br: Trabalhando com idiomas suportados pelo GCC.

source: Invoking guix git authenticate
it: Invocare guix git authenticate
pt_br: Invocando guix git authenticate

source: Authenticating Git repositories.
it: Autenticare i repository Git.
pt_br: Autenticando repositórios Git.

source: Package Modules
it: Moduli di pacchetti
pt_br: Módulos de pacote

source: Packages from the programmer's viewpoint.
it: Pacchetti dal punto di vista del programmatore.
pt_br: Pacotes do ponto de vista do programador.

source: Defining Packages
it: Definire i pacchetti
pt_br: Definindo pacotes

source: Defining new packages.
it: Definire nuovi pacchetti.
pt_br: Definindo novos pacotes.

source: Defining Package Variants
it: Definire varianti di pacchetto
pt_br: Definindo variantes de pacote

source: Customizing packages.
it: Personalizzare i pacchetti.
pt_br: Personalização de pacotes.

source: Writing Manifests
it: Scrivere manifesti
pt_br: Escrevendo manifestos

source: The bill of materials of your environment.
it: L'elenco dei materiali del tuo ambiente.
pt_br: A lista de materiais do seu ambiente.

source: Build Systems
it: Sistemi di build
pt_br: Sistemas de compilação

source: Specifying how packages are built.
it: Specificare come vengono compilati i pacchetti.
pt_br: Especificando como pacotes são compilados.

source: Build Phases
it: Fasi di build
pt_br: Fases de construção

source: Phases of the build process of a package.
it: Fasi del processo di build di un pacchetto.
pt_br: Fases do processo de construção de um pacote.

source: Build Utilities
it: Utilità di build
pt_br: Construir utilitários

source: Helpers for your package definitions and more.
it: Aiuti per le definizioni dei tuoi pacchetti e altro.
pt_br: Auxiliares para suas definições de pacotes e muito mais.

source: Search Paths
it: Percorsi di ricerca
pt_br: Caminhos de pesquisa

source: The Store
it: Lo store
pt_br: O armazém

source: Manipulating the package store.
it: Manipolare lo store dei pacchetti.
pt_br: Manipulação do armazém de pacotes.

source: Derivations
it: Derivazioni
pt_br: Derivações

source: Low-level interface to package derivations.
it: Interfaccia a basso livello per le derivazioni dei pacchetti.
pt_br: Interface de baixo nível para derivações de pacotes.

source: The Store Monad
it: La monade dello store
pt_br: A mônada do armazém

source: Purely functional interface to the store.
it: Interfaccia puramente funzionale allo store.
pt_br: Interface puramente funcional para o armazém.

source: G-Expressions
it: G-expression
pt_br: Expressões-G

source: Manipulating build expressions.
it: Manipolare le espressioni di build.
pt_br: Manipulação de expressões de compilação.

source: Invoking guix repl
it: Invocare guix repl
pt_br: Invocando guix repl

source: Programming Guix in Guile
it: Programmare Guix in Guile
pt_br: Programação Guix em Guile

source: Using Guix Interactively
it: Usare Guix interattivamente
pt_br: Usando Guix interativamente

source: Fine-grain interaction at the REPL.
it: Interazione a grana fine nella REPL.
pt_br: Interação de granulação fina no REPL.

source: package Reference
it: Riferimenti per 'package'
pt_br: Referência do package

source: The package data type.
it: Il tipo di dato 'package'.
pt_br: O tipo de dados package.

source: origin Reference
it: Riferimenti per 'origin'
pt_br: Referência do origin

source: The origin data type.
it: Il tipo di dato 'origin'.
pt_br: O tipo de dados origin.

source: Invoking guix build
it: Invocare guix build
pt_br: Invocando guix build

source: Building packages from the command line.
it: Compilare pacchetti da riga di comando.
pt_br: Compilando pacotes a partir da linha de comando.

source: Invoking guix edit
it: Invocare guix edit
pt_br: Invocando guix edit

source: Editing package definitions.
it: Modificare le definizioni dei pacchetti.
pt_br: Editando definições de pacote.

source: Invoking guix download
it: Invocare guix download
pt_br: Invocando guix download

source: Downloading a file and printing its hash.
it: Scaricare un file e stamparne l'hash.
pt_br: Baixando um arquivo e imprimindo seu hash.

source: Invoking guix hash
it: Invocare guix hash
pt_br: Invocando guix hash

source: Computing the cryptographic hash of a file.
it: Calcolare l'hash crittografico di un file.
pt_br: Computando a hash criptográfica de um arquivo.

source: Invoking guix import
it: Invocare guix import
pt_br: Invocando guix import

source: Importing package definitions.
it: Importare le definizioni dei pacchetti.
pt_br: Importando definições de pacote.

source: Invoking guix refresh
it: Invocare guix refresh
pt_br: Invocando guix refresh

source: Updating package definitions.
it: Aggiornare le definizioni dei pacchetti.
pt_br: Atualizando definições de pacotes.

source: Invoking guix style
it: Invocare guix style
pt_br: Invocando guix style

source: Invoking guix lint
it: Invocare guix lint
pt_br: Invocando guix lint

source: Finding errors in package definitions.
it: Trovare errori nelle definizioni dei pacchetti.
pt_br: Encontrando erros nas definições de pacote.

source: Invoking guix size
it: Invocare guix size
pt_br: Invocando guix size

source: Profiling disk usage.
it: Profilare l'uso del disco.
pt_br: Perfilando uso de disco.

source: Invoking guix graph
it: Invocare guix graph
pt_br: Invocando guix graph

source: Visualizing the graph of packages.
it: Visualizzare il grafico dei pacchetti.
pt_br: Visualizando o grafo de pacotes.

source: Invoking guix publish
it: Invocare guix publish
pt_br: Invocando guix publish

source: Sharing substitutes.
it: Condividere sostituti.
pt_br: Compartilhando substitutos.

source: Invoking guix challenge
it: Invocare guix challenge
pt_br: Invocando guix challenge

source: Challenging substitute servers.
it: Sfidare i server di sostituti.
pt_br: Desafiando servidores substitutos.

source: Invoking guix copy
it: Invocare guix copy
pt_br: Invocando guix copy

source: Copying to and from a remote store.
it: Copiare da e verso uno store remoto.
pt_br: Copiando para e de um armazém remoto.

source: Invoking guix container
it: Invocare guix container
pt_br: Invocando guix container

source: Process isolation.
it: Isolamento dei processi.
pt_br: Isolação de processo.

source: Invoking guix weather
it: Invocare guix weather
pt_br: Invocando guix weather

source: Assessing substitute availability.
it: Valutare la disponibilità dei sostituti.
pt_br: Acessando disponibilidade de substituto.

source: Invoking guix processes
it: Invocare guix processes
pt_br: Invocando guix processes

source: Listing client processes.
it: Elencare i processi client.
pt_br: Listando processos do cliente.

source: Invoking @command{guix build}
it: Invocare @command{guix build}
pt_br: Invocando @command{guix build}

source: Common Build Options
it: Opzioni di build comuni
pt_br: Opções de compilação comuns

source: Build options for most commands.
it: Opzioni di build per la maggior parte dei comandi.
pt_br: Opções de compilação para a maioria dos comandos.

source: Package Transformation Options
it: Opzioni di trasformazione dei pacchetti
pt_br: Opções de transformação de pacote

source: Creating variants of packages.
it: Creare varianti di pacchetti.
pt_br: Criando variantes de pacotes.

source: Additional Build Options
it: Opzioni di build aggiuntive
pt_br: Opções de compilação adicional

source: Options specific to 'guix build'.
it: Opzioni specifiche per 'guix build'.
pt_br: Opções específicas para "guix build".

source: Debugging Build Failures
it: Debug dei fallimenti di build
pt_br: Depurando falhas de compilação

source: Real life packaging experience.
it: Esperienza di pacchettizzazione nella vita reale.
pt_br: Experiência de empacotamento na vida real.

source: Cross-Compilation
it: Compilazione incrociata
pt_br: Compilação cruzada

source: Cross-compiling for another architecture.
it: Compilazione incrociata per un'altra architettura.
pt_br: Compilação cruzada para outra arquitetura.

source: Native Builds
it: Build nativi
pt_br: Construções nativas

source: Getting Started with the System
it: Primi passi con il sistema
pt_br: Começando com o Sistema

source: Using the Configuration System
it: Usare il sistema di configurazione
pt_br: Usando o sistema de configuração

source: Customizing your GNU system.
it: Personalizzare il tuo sistema GNU.
pt_br: Personalizando seu sistema GNU.

source: operating-system Reference
it: Riferimenti per 'operating-system'
pt_br: Referência do operating-system

source: Detail of operating-system declarations.
it: Dettagli sulle dichiarazioni di operating-system.
pt_br: Detalhe das declarações do operating-system.

source: File Systems
it: Filesystem
pt_br: Sistemas de arquivos

source: Configuring file system mounts.
it: Configurare i mount del file system.
pt_br: Configurando montagens de sistema de arquivos.

source: Mapped Devices
it: Dispositivi mappati
pt_br: Dispositivos mapeados

source: Block device extra processing.
it: Elaborazione extra dei dispositivi a blocchi.
pt_br: Processamento extra de dispositivo de bloco.

source: Swap Space
it: Spazio di swap
pt_br: Espaço de troca (swap)

source: Backing RAM with disk space.
it: Supportare la RAM con spazio su disco.
pt_br: Apoiando a RAM com espaço em disco.

source: User Accounts
it: Account utente
pt_br: Contas de usuário

source: Specifying user accounts.
it: Specificare gli account utente.
pt_br: Especificando contas de usuários.

source: Keyboard Layout
it: Layout della tastiera
pt_br: Disposição do teclado

source: How the system interprets key strokes.
it: Come il sistema interpreta la pressione dei tasti.
pt_br: Como o sistema interpreta pressionamento de teclas.

source: Locales
it: Lingue
pt_br: Localidades

source: Language and cultural convention settings.
it: Impostazioni di lingua e convenzioni culturali.
pt_br: Configurações de idioma e de convenção cultural.

source: Specifying system services.
it: Specificare i servizi di sistema.
pt_br: Especificando serviços de sistema.

source: X.509 Certificates
it: Certificati X.509
pt_br: Certificados X.509

source: Authenticating HTTPS servers.
it: Autenticazione dei server HTTPS.
pt_br: Autenticando servidores HTTPS.

source: Configuring libc's name service switch.
it: Configurare il name service switch della libc.
pt_br: Configurando name service switch do libc.

source: Initial RAM Disk
it: Disco RAM iniziale
pt_br: Disco de RAM inicial

source: Linux-Libre bootstrapping.
it: Bootstrap di Linux-Libre.
pt_br: Inicialização do Linux-Libre.

source: Bootloader Configuration
it: Configurazione del bootloader
pt_br: Configuração do carregador de inicialização

source: Configuring the boot loader.
it: Configurare il boot loader.
pt_br: Configurando o "bootloader".

source: Invoking guix system
it: Invocare guix system
pt_br: Invocando guix system

source: Instantiating a system configuration.
it: Instanziare una configurazione di sistema.
pt_br: Inicializando uma configuração de sistema.

source: Invoking guix deploy
it: Invocare guix deploy
pt_br: Invocando guix deploy

source: Deploying a system configuration to a remote host.
it: Distribuire una configurazione di sistema su un host remoto.
pt_br: Implantando uma configuração de sistema em um host remoto.

source: Running Guix in a VM
it: Eseguire Guix in una VM
pt_br: Executando Guix em uma VM

source: How to run Guix System in a virtual machine.
it: Come eseguire Guix System in una macchina virtuale.
pt_br: Como executar Guix System em uma máquina virtual.

source: Defining Services
it: Definire i servizi
pt_br: Definindo serviços

source: Adding new service definitions.
it: Aggiungere nuove definizioni di servizi.
pt_br: Adicionando novas definições de serviço.

source: Btrfs file system
it: File system Btrfs
pt_br: Sistema de arquivos Btrfs

source: Base Services
it: Servizi di base
pt_br: Serviços básicos

source: Essential system services.
it: Servizi di sistema essenziali.
pt_br: Serviços essenciais do sistema.

source: Scheduled Job Execution
it: Esecuzione di lavori pianificati
pt_br: Execução de trabalho agendado

source: The mcron service.
it: Il servizio mcron.
pt_br: O serviço mcron.

source: Log Rotation
it: Rotazione dei log
pt_br: Rotação de log
