Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: One use case for this is the Guix self-contained binary tarball (@pxref{Binary Installation}).
pt_br: Um caso de uso para isso é o tarball binário independente do Guix (@pxref{Binary Installation}).

source: Print the name of the derivation that builds the pack.
pt_br: Exiba o nome da derivação que constrói a embalagem.

source: Use the bootstrap binaries to build the pack. This option is only useful to Guix developers.
pt_br: Use os binários bootstrap para construir a embalagem. Esta opção é útil somente para desenvolvedores do Guix.

source: In addition, @command{guix pack} supports all the common build options (@pxref{Common Build Options}) and all the package transformation options (@pxref{Package Transformation Options}).
pt_br: Além disso, @command{guix pack} suporta todas as opções de compilação comuns (@pxref{Common Build Options}) e todas as opções de transformação de pacote (@pxref{Package Transformation Options}).

source: linker wrapper
pt_br: envoltório do vinculador

source: toolchain, for C development
pt_br: cadeia de ferramentas, para desenvolvimento em C

source: toolchain, for Fortran development
pt_br: cadeia de ferramentas, para desenvolvimento Fortran

source: If you need a complete toolchain for compiling and linking C or C++ source code, use the @code{gcc-toolchain} package. This package provides a complete GCC toolchain for C/C++ development, including GCC itself, the GNU C Library (headers and binaries, plus debugging symbols in the @code{debug} output), Binutils, and a linker wrapper.
pt_br: Se você precisa de uma cadeia de ferramentas completa para compilar e vincular código-fonte C ou C++, use o pacote @code{gcc-toolchain}. Este pacote fornece uma cadeia de ferramentas GCC completa para desenvolvimento C/C++, incluindo o próprio GCC, a GNU C Library (cabeçalhos e binários, além de símbolos de depuração na saída @code{debug}), Binutils e um wrapper de vinculador.

source: The wrapper's purpose is to inspect the @code{-L} and @code{-l} switches passed to the linker, add corresponding @code{-rpath} arguments, and invoke the actual linker with this new set of arguments. You can instruct the wrapper to refuse to link against libraries not in the store by setting the @env{GUIX_LD_WRAPPER_ALLOW_IMPURITIES} environment variable to @code{no}.
pt_br: O propósito do wrapper é inspecionar os switches @code{-L} e @code{-l} passados para o vinculador, adicionar argumentos @code{-rpath} correspondentes e invocar o vinculador real com esse novo conjunto de argumentos. Você pode instruir o wrapper a se recusar a vincular bibliotecas que não estejam no store definindo a variável de ambiente @env{GUIX_LD_WRAPPER_ALLOW_IMPURITIES} como @code{no}.

source: The package @code{gfortran-toolchain} provides a complete GCC toolchain for Fortran development. For other languages, please use @samp{guix search gcc toolchain} (@pxref{guix-search,, Invoking guix package}).
pt_br: O pacote @code{gfortran-toolchain} fornece uma cadeia de ferramentas GCC completa para desenvolvimento Fortran. Para outras linguagens, use @samp{guix search gcc toolchain} (@pxref{guix-search,, Invoking guix package}).

source: Invoking @command{guix git authenticate}
pt_br: Invocando @command{guix git authenticate}

source: The @command{guix git authenticate} command authenticates a Git checkout following the same rule as for channels (@pxref{channel-authentication, channel authentication}). That is, starting from a given commit, it ensures that all subsequent commits are signed by an OpenPGP key whose fingerprint appears in the @file{.guix-authorizations} file of its parent commit(s).
pt_br: O comando @command{guix git authenticate} autentica um checkout do Git seguindo a mesma regra dos canais (@pxref{channel-authentication, autenticação dos canais}). Ou seja, a partir de um commit determinado, ele garante que todos os commits subsequentes sejam assinados por uma chave OpenPGP cuja impressão digital apareça no arquivo @file{.guix-authorizations} de seus commits pais.

source: You will find this command useful if you maintain a channel. But in fact, this authentication mechanism is useful in a broader context, so you might want to use it for Git repositories that have nothing to do with Guix.
pt_br: Você achará esse comando útil se mantiver um canal. Mas, na verdade, esse mecanismo de autenticação é útil em um contexto mais amplo, então você pode querer usá-lo para repositórios Git que não tenham nada a ver com Guix.

source: introduction, for Git authentication
pt_br: introdução, para autenticação Git

source: guix git authenticate [@var{options}@dots{}]
pt_br: guix git authenticate [@var{opções}@dots{}]

source: Should you have branches that require different introductions, you can specify them directly in @file{.git/config}. For example, if the branch called @code{personal-fork} has a different introduction than other branches, you can extend @file{.git/config} along these lines:
pt_br: Caso você tenha ramos que exijam introduções diferentes, você pode especificá-las diretamente em @file{.git/config}. Por exemplo, se o ramo chamado @code{personal-fork} tiver uma introdução diferente de outros ramos, você pode estender @file{.git/config} ao longo destas linhas:

source: The first run also attempts to install pre-push and post-merge hooks, such that @command{guix git authenticate} is invoked as soon as you run @command{git push}, @command{git pull}, and related commands; it does not overwrite preexisting hooks though.
pt_br: A primeira execução também tenta instalar ganchos pré-push e pós-mesclagem, de modo que @command{guix git authenticate} seja invocado assim que você executar @command{git push}, @command{git pull} e comandos relacionados; no entanto, ele não substitui ganchos preexistentes.

source: The command-line options described below allow you to fine-tune the process.
pt_br: As opções de linha de comando descritas abaixo permitem que você ajuste o processo.

source: --repository=@var{directory}
pt_br: --repository=@var{diretório}

source: -r @var{directory}
pt_br: -r @var{diretório}

source: Open the Git repository in @var{directory} instead of the current directory.
pt_br: Abra o repositório Git em @var{diretório} em vez do diretório atual.

source: --keyring=@var{reference}
pt_br: --keyring=@var{referência}

source: -k @var{reference}
pt_br: -k @var{referência}

source: Load OpenPGP keyring from @var{reference}, the reference of a branch such as @code{origin/keyring} or @code{my-keyring}. The branch must contain OpenPGP public keys in @file{.key} files, either in binary form or ``ASCII-armored''. By default the keyring is loaded from the branch named @code{keyring}.
pt_br: Carregue o chaveiro OpenPGP de @var{referência}, a referência de uma ramificação como @code{origin/keyring} ou @code{my-keyring}. A ramificação deve conter chaves públicas OpenPGP em arquivos @file{.key}, em formato binário ou ``ASCII-armored''. Por padrão, o chaveiro é carregado da ramificação chamada @code{keyring}.

source: Authenticate revisions up to @var{commit}.
pt_br: Autentique revisões até @var{commit}.

source: Display commit signing statistics upon completion.
pt_br: Exibir estatísticas de assinatura de confirmação após a conclusão.

source: --cache-key=@var{key}
pt_br: --cache-key=@var{chave}

source: Previously-authenticated commits are cached in a file under @file{~/.cache/guix/authentication}. This option forces the cache to be stored in file @var{key} in that directory.
pt_br: Os commits autenticados anteriormente são armazenados em cache em um arquivo em @file{~/.cache/guix/authentication}. Esta opção força o cache a ser armazenado no arquivo @var{chave} naquele diretório.

source: --historical-authorizations=@var{file}
pt_br: --historical-authorizations=@var{arquivo}

source: By default, any commit whose parent commit(s) lack the @file{.guix-authorizations} file is considered inauthentic. In contrast, this option considers the authorizations in @var{file} for any commit that lacks @file{.guix-authorizations}. The format of @var{file} is the same as that of @file{.guix-authorizations} (@pxref{channel-authorizations, @file{.guix-authorizations} format}).
pt_br: Por padrão, qualquer commit cujo(s) commit(s) pai(s) não tenha(m) o arquivo @file{.guix-authorizations} é considerado não autêntico. Em contraste, esta opção considera as autorizações em @var{arquivo} para qualquer commit que não tenha @file{.guix-authorizations}. O formato de @var{arquivo} é o mesmo que o de @file{.guix-authorizations} (@pxref{channel-authorizations, formato @file{.guix-authorizations}}).

source: GNU Guix provides several Scheme programming interfaces (APIs) to define, build, and query packages. The first interface allows users to write high-level package definitions. These definitions refer to familiar packaging concepts, such as the name and version of a package, its build system, and its dependencies. These definitions can then be turned into concrete build actions.
pt_br: O GNU Guix fornece várias interfaces de programação Scheme (APIs) para definir, construir e consultar pacotes. A primeira interface permite que os usuários escrevam definições de pacotes de alto nível. Essas definições se referem a conceitos de empacotamento familiares, como o nome e a versão de um pacote, seu sistema de construção e suas dependências. Essas definições podem então ser transformadas em ações de construção concretas.

source: Build actions are performed by the Guix daemon, on behalf of users. In a standard setup, the daemon has write access to the store---the @file{/gnu/store} directory---whereas users do not. The recommended setup also has the daemon perform builds in chroots, under specific build users, to minimize interference with the rest of the system.
pt_br: As ações de build são executadas pelo daemon Guix, em nome dos usuários. Em uma configuração padrão, o daemon tem acesso de gravação ao armazém---o diretório @file{/gnu/store}---enquanto os usuários não têm. A configuração recomendada também faz com que o daemon execute builds em chroots, sob usuários de compilação específicos, para minimizar a interferência com o resto do sistema.

source: Lower-level APIs are available to interact with the daemon and the store. To instruct the daemon to perform a build action, users actually provide it with a @dfn{derivation}. A derivation is a low-level representation of the build actions to be taken, and the environment in which they should occur---derivations are to package definitions what assembly is to C programs. The term ``derivation'' comes from the fact that build results @emph{derive} from them.
pt_br: APIs de nível inferior estão disponíveis para interagir com o daemon e o armazém. Para instruir o daemon a executar uma ação de compilação, os usuários na verdade fornecem a ele uma @dfn{derivação}. Uma derivação é uma representação de baixo nível das ações de compilação a serem tomadas e do ambiente no qual elas devem ocorrer --- derivações são para definições de pacotes o que assembly é para programas C. O termo ``derivação'' vem do fato de que os resultados de compilação @emph{derivam} deles.

source: This chapter describes all these APIs in turn, starting from high-level package definitions. @xref{Source Tree Structure}, for a more general overview of the source code.
pt_br: Este capítulo descreve todas essas APIs, começando pelas definições de pacotes de alto nível. @xref{Source Tree Structure}, para uma visão geral mais geral do código-fonte.

source: From a programming viewpoint, the package definitions of the GNU distribution are provided by Guile modules in the @code{(gnu packages @dots{})} name space@footnote{Note that packages under the @code{(gnu packages @dots{})} module name space are not necessarily ``GNU packages''. This module naming scheme follows the usual Guile module naming convention: @code{gnu} means that these modules are distributed as part of the GNU system, and @code{packages} identifies modules that define packages.} (@pxref{Modules, Guile modules,, guile, GNU Guile Reference Manual}). For instance, the @code{(gnu packages emacs)} module exports a variable named @code{emacs}, which is bound to a @code{<package>} object (@pxref{Defining Packages}).
pt_br: Do ponto de vista da programação, as definições de pacotes da distribuição GNU são fornecidas pelos módulos Guile no namespace @code{(gnu packages @dots{})}@footnote{Observe que os pacotes sob o namespace do módulo @code{(gnu packages @dots{})} não são necessariamente ``pacotes GNU''. Este esquema de nomenclatura de módulos segue a convenção usual de nomenclatura de módulos Guile: @code{gnu} significa que esses módulos são distribuídos como parte do sistema GNU, e @code{packages} identifica módulos que definem pacotes.} (@pxref{Modules, módulos Guile,, guile, Manual de Referência do GNU Guile}). Por exemplo, o módulo @code{(gnu packages emacs)} exporta uma variável chamada @code{emacs}, que é vinculada a um objeto @code{<package>} (@pxref{Defining Packages}).

source: The @code{(gnu packages @dots{})} module name space is automatically scanned for packages by the command-line tools. For instance, when running @code{guix install emacs}, all the @code{(gnu packages @dots{})} modules are scanned until one that exports a package object whose name is @code{emacs} is found. This package search facility is implemented in the @code{(gnu packages)} module.
pt_br: O namespace do módulo @code{(gnu packages @dots{})} é automaticamente escaneado em busca de pacotes pelas ferramentas de linha de comando. Por exemplo, ao executar @code{guix install emacs}, todos os módulos @code{(gnu packages @dots{})} são escaneados até que um que exporte um objeto de pacote cujo nome é @code{emacs} seja encontrado. Esse recurso de busca de pacotes é implementado no módulo @code{(gnu packages)}.

source: package module search path
pt_br: caminho de pesquisa dos módulos de pacote

source: Users can store package definitions in modules with different names---e.g., @code{(my-packages emacs)}@footnote{Note that the file name and module name must match. For instance, the @code{(my-packages emacs)} module must be stored in a @file{my-packages/emacs.scm} file relative to the load path specified with @option{--load-path} or @env{GUIX_PACKAGE_PATH}. @xref{Modules and the File System,,, guile, GNU Guile Reference Manual}, for details.}. There are two ways to make these package definitions visible to the user interfaces:
pt_br: Os usuários podem armazenar definições de pacotes em módulos com nomes diferentes --- por exemplo, @code{(my-packages emacs)}@footnote{Observe que o nome do arquivo e o nome do módulo devem corresponder. Por exemplo, o módulo @code{(my-packages emacs)} deve ser armazenado em um arquivo @file{my-packages/emacs.scm} relativo ao caminho de carregamento especificado com @option{--load-path} ou @env{GUIX_PACKAGE_PATH}. @xref{Modules and the File System,,, guile, Manual de Referência do GNU Guile}, para detalhes.}. Há duas maneiras de tornar essas definições de pacotes visíveis para as interfaces do usuário:

source: By adding the directory containing your package modules to the search path with the @code{-L} flag of @command{guix package} and other commands (@pxref{Common Build Options}), or by setting the @env{GUIX_PACKAGE_PATH} environment variable described below.
pt_br: Ao adicionar o diretório que contém os módulos do seu pacote ao caminho de pesquisa com o sinalizador @code{-L} do @command{guix package} e outros comandos (@pxref{Common Build Options}), ou definindo a variável de ambiente @env{GUIX_PACKAGE_PATH} descrita abaixo.

source: By defining a @dfn{channel} and configuring @command{guix pull} so that it pulls from it. A channel is essentially a Git repository containing package modules. @xref{Channels}, for more information on how to define and use channels.
pt_br: Ao definir um @dfn{canal} e configurando @command{guix pull} para que ele puxe dele. Um canal é essencialmente um repositório Git contendo módulos de pacote. @xref{Channels}, para mais informações sobre como definir e usar canais.

source: @env{GUIX_PACKAGE_PATH} works similarly to other search path variables:
pt_br: @env{GUIX_PACKAGE_PATH} funciona de forma semelhante a outras variáveis de caminho de pesquisa:

source: {Environment Variable} GUIX_PACKAGE_PATH
pt_br: {Variável de ambiente} GUIX_PACKAGE_PATH

source: This is a colon-separated list of directories to search for additional package modules. Directories listed in this variable take precedence over the own modules of the distribution.
pt_br: Esta é uma lista de diretórios separados por dois pontos para procurar módulos de pacotes adicionais. Os diretórios listados nesta variável têm precedência sobre os próprios módulos da distribuição.

source: The distribution is fully @dfn{bootstrapped} and @dfn{self-contained}: each package is built based solely on other packages in the distribution. The root of this dependency graph is a small set of @dfn{bootstrap binaries}, provided by the @code{(gnu packages bootstrap)} module. For more information on bootstrapping, @pxref{Bootstrapping}.
pt_br: A distribuição é totalmente @dfn{bootstrapped} e @dfn{auto-contida}: cada pacote é construído com base somente em outros pacotes na distribuição. A raiz deste grafo de dependência é um pequeno conjunto dos @dfn{binários bootstrap}, fornecido pelo módulo @code{(gnu packages bootstrap)}. Para mais informações sobre bootstrapping, @pxref{Bootstrapping}.

source: The high-level interface to package definitions is implemented in the @code{(guix packages)} and @code{(guix build-system)} modules. As an example, the package definition, or @dfn{recipe}, for the GNU Hello package looks like this:
pt_br: A interface de alto nível para definições de pacotes é implementada nos módulos @code{(guix packages)} e @code{(guix build-system)}. Como exemplo, a definição de pacote, ou @dfn{receita}, para o pacote GNU Hello se parece com isto:

source: Without being a Scheme expert, the reader may have guessed the meaning of the various fields here. This expression binds the variable @code{hello} to a @code{<package>} object, which is essentially a record (@pxref{SRFI-9, Scheme records,, guile, GNU Guile Reference Manual}). This package object can be inspected using procedures found in the @code{(guix packages)} module; for instance, @code{(package-name hello)} returns---surprise!---@code{"hello"}.
pt_br: Sem ser um especialista em Scheme, o leitor pode ter adivinhado o significado dos vários campos aqui. Esta expressão vincula a variável @code{hello} a um objeto @code{<package>}, que é essencialmente um registro (@pxref{SRFI-9, Scheme records,, guile, Manual de Referência do GNU Guile}). Este objeto de pacote pode ser inspecionado usando procedimentos encontrados no módulo @code{(guix packages)}; por exemplo, @code{(package-name hello)} retorna---surpresa!---@code{"hello"}.

source: With luck, you may be able to import part or all of the definition of the package you are interested in from another repository, using the @code{guix import} command (@pxref{Invoking guix import}).
pt_br: Com sorte, você poderá importar parte ou toda a definição do pacote de seu interesse de outro repositório, usando o comando @code{guix import} (@pxref{Invoking guix import}).

source: In the example above, @code{hello} is defined in a module of its own, @code{(gnu packages hello)}. Technically, this is not strictly necessary, but it is convenient to do so: all the packages defined in modules under @code{(gnu packages @dots{})} are automatically known to the command-line tools (@pxref{Package Modules}).
pt_br: No exemplo acima, @code{hello} é definido em um módulo próprio, @code{(gnu packages hello)}. Tecnicamente, isso não é estritamente necessário, mas é conveniente fazê-lo: todos os pacotes definidos em módulos sob @code{(gnu packages @dots{})} são automaticamente conhecidos pelas ferramentas de linha de comando (@pxref{Package Modules}).

source: There are a few points worth noting in the above package definition:
pt_br: Há alguns pontos que vale a pena observar na definição do pacote acima:

source: The @code{source} field of the package is an @code{<origin>} object (@pxref{origin Reference}, for the complete reference). Here, the @code{url-fetch} method from @code{(guix download)} is used, meaning that the source is a file to be downloaded over FTP or HTTP.
pt_br: O campo @code{source} do pacote é um objeto @code{<origin>} (@pxref{origin Reference}, para a referência completa). Aqui, o método @code{url-fetch} de @code{(guix download)} é usado, o que significa que a fonte é um arquivo a ser baixado por FTP ou HTTP.

source: The @code{mirror://gnu} prefix instructs @code{url-fetch} to use one of the GNU mirrors defined in @code{(guix download)}.
pt_br: O prefixo @code{mirror://gnu} instrui @code{url-fetch} a usar um dos espelhos GNU definidos em @code{(guix download)}.

source: The @code{sha256} field specifies the expected SHA256 hash of the file being downloaded. It is mandatory, and allows Guix to check the integrity of the file. The @code{(base32 @dots{})} form introduces the base32 representation of the hash. You can obtain this information with @code{guix download} (@pxref{Invoking guix download}) and @code{guix hash} (@pxref{Invoking guix hash}).
pt_br: O campo @code{sha256} especifica o hash SHA256 esperado do arquivo que está sendo baixado. É obrigatório e permite que o Guix verifique a integridade do arquivo. O formulário @code{(base32 @dots{})} introduz a representação base32 do hash. Você pode obter essas informações com @code{guix download} (@pxref{Invoking guix download}) e @code{guix hash} (@pxref{Invoking guix hash}).

source: patches
pt_br: remendos

source: When needed, the @code{origin} form can also have a @code{patches} field listing patches to be applied, and a @code{snippet} field giving a Scheme expression to modify the source code.
pt_br: Quando necessário, o formulário @code{origin} também pode ter um campo @code{patches} listando os remendos a serem aplicados e um campo @code{snippet} fornecendo uma expressão Scheme para modificar o código-fonte.

source: GNU Build System
pt_br: Sistema de construção GNU

source: The @code{build-system} field specifies the procedure to build the package (@pxref{Build Systems}). Here, @code{gnu-build-system} represents the familiar GNU Build System, where packages may be configured, built, and installed with the usual @code{./configure && make && make check && make install} command sequence.
pt_br: O campo @code{build-system} especifica o procedimento para construir o pacote (@pxref{Build Systems}). Aqui, @code{gnu-build-system} representa o familiar GNU Build System, onde os pacotes podem ser configurados, construídos e instalados com a sequência de comando usual @code{./configure && make && make check && make install}.

source: When you start packaging non-trivial software, you may need tools to manipulate those build phases, manipulate files, and so on. @xref{Build Utilities}, for more on this.
pt_br: Ao começar a empacotar software não trivial, você pode precisar de ferramentas para manipular essas fases de compilação, manipular arquivos e assim por diante. @xref{Build Utilities}, para mais informações sobre isso.

source: The @code{arguments} field specifies options for the build system (@pxref{Build Systems}). Here it is interpreted by @code{gnu-build-system} as a request run @file{configure} with the @option{--enable-silent-rules} flag.
pt_br: O campo @code{arguments} especifica opções para o sistema de compilação (@pxref{Build Systems}). Aqui, ele é interpretado por @code{gnu-build-system} como uma solicitação executada @file{configure} com o sinalizador @option{--enable-silent-rules}.

source: quoting
pt_br: literais, inibição de avaliação

source: backquote (quasiquote)
pt_br: crase (quasiquote)
