Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: Take a look at the profile reported by @command{guix size} (@pxref{Invoking guix size}). This will allow you to notice references to other packages unwillingly retained. It may also help determine whether to split the package (@pxref{Packages with Multiple Outputs}), and which optional dependencies should be used. In particular, avoid adding @code{texlive} as a dependency: because of its extreme size, use @code{texlive-local-tree} procedure instead.
it: Dai un'occhiata al profilo riportato da @command{guix size} (@pxref{Invoking guix size}). Questo ti permetterà di notare riferimenti a altri pacchetti trattenuti involontariamente. Può anche aiutare a determinare se dividere il pacchetto (@pxref{Packages with Multiple Outputs}), e quali dipendenze opzionali dovrebbero essere usate. In particolare, evita di aggiungere @code{texlive} come dipendenza: a causa delle sue dimensioni estreme, usa invece la procedura @code{texlive-local-tree}.
pt_br: Dê uma olhada no perfil relatado por @command{guix size} (@pxref{Invoking guix size}). Isso permitirá que você perceba referências a outros pacotes retidos involuntariamente. Também pode ajudar a determinar se deve dividir o pacote (@pxref{Packages with Multiple Outputs}) e quais dependências opcionais devem ser usadas. Em particular, evite adicionar @code{texlive} como uma dependência: devido ao seu tamanho extremo, em vez disso, use o procedimento @code{texlive-local-tree}.

source: Check that dependent packages (if applicable) are not affected by the change; @command{guix refresh --list-dependent @var{package}} will help you do that (@pxref{Invoking guix refresh}).
it: Verifica che i pacchetti dipendenti (se applicabile) non siano influenzati dalla modifica; @command{guix refresh --list-dependent @var{package}} ti aiuterà a farlo (@pxref{Invoking guix refresh}).
pt_br: Verifique-se os pacotes dependentes (se aplicável) não são afetados pela alteração; @command{guix refresh --list-dependent @var{pacote}} ajudará você a fazer isso (@pxref{Invoking guix refresh}).

source: determinism, of build processes
it: determinismo, dei processi di compilazione
pt_br: determinismo, de processos de compilação

source: reproducible builds, checking
it: build riproducibili, controllo
pt_br: compilações reproduzíveis, verificação

source: Check whether the package's build process is deterministic. This typically means checking whether an independent build of the package yields the exact same result that you obtained, bit for bit.
it: Verifica se il processo di compilazione del pacchetto è deterministico. Questo significa tipicamente verificare se una compilazione indipendente del pacchetto produce lo stesso identico risultato che hai ottenuto, bit per bit.
pt_br: Verifique se o processo de compilação do pacote é determinístico. Isso normalmente significa verificar se uma compilação independente do pacote produz o mesmo resultado que você obteve, bit por bit.

source: A simple way to do that is by building the same package several times in a row on your machine (@pxref{Invoking guix build}):
it: Un modo semplice per farlo è costruire lo stesso pacchetto più volte di seguito sulla tua macchina (@pxref{Invoking guix build}):
pt_br: Uma maneira simples de fazer isso é compilar o mesmo pacote várias vezes seguidas em sua máquina (@pxref{Invoking guix build}):

source: guix build --rounds=2 my-package
it: guix build --rounds=2 mio-pacchetto
pt_br: guix build --rounds=2 meu-pacote

source: This is enough to catch a class of common non-determinism issues, such as timestamps or randomly-generated output in the build result.
it: Questo è sufficiente per catturare una classe di problemi comuni di non determinismo, come timestamp o output generato casualmente nel risultato della compilazione.
pt_br: Isso é suficiente para capturar uma classe de problemas comuns de não-determinismo, como registros de data e hora ou saída gerada aleatoriamente no resultado da compilação.

source: Another option is to use @command{guix challenge} (@pxref{Invoking guix challenge}). You may run it once the package has been committed and built by @code{@value{SUBSTITUTE-SERVER-1}} to check whether it obtains the same result as you did. Better yet: Find another machine that can build it and run @command{guix publish}. Since the remote build machine is likely different from yours, this can catch non-determinism issues related to the hardware---e.g., use of different instruction set extensions---or to the operating system kernel---e.g., reliance on @code{uname} or @file{/proc} files.
it: Un'altra opzione è usare @command{guix challenge} (@pxref{Invoking guix challenge}). Puoi eseguirlo una volta che il pacchetto è stato committato e compilato da @code{@value{SUBSTITUTE-SERVER-1}} per verificare se ottiene lo stesso risultato che hai ottenuto tu. Ancora meglio: trova un'altra macchina che possa compilarlo ed esegui @command{guix publish}. Poiché la macchina di compilazione remota è probabilmente diversa dalla tua, questo può rilevare problemi di non-determinismo legati all'hardware --- ad esempio, l'uso di diverse estensioni del set di istruzioni --- o al kernel del sistema operativo --- ad esempio, la dipendenza da @code{uname} o dai file di @file{/proc}.
pt_br: Outra opção é usar @command{guix challenge} (@pxref{Invoking guix challenge}). Você pode executá-lo uma vez que o pacote se tenha sido feito o commit e compilação por @code{SUBSTITUTE-SERVER-1} para verificar se obtém o mesmo resultado que você fez. Melhor ainda: encontre outra máquina que possa compilá-lo e executar @command{guix publish}. Como a máquina de compilação remota provavelmente é diferente da sua, isso pode capturar problemas de não determinismo relacionados ao hardware - por exemplo, uso de extensões de conjunto de instruções diferentes – ou ao kernel do sistema operacional – por exemplo, confiança em @code{uname} ou arquivos de @file{/proc}.

source: When writing documentation, please use gender-neutral wording when referring to people, such as @uref{https://en.wikipedia.org/wiki/Singular_they, singular ``they''@comma{} ``their''@comma{} ``them''}, and so forth.
it: Quando scrivi la documentazione, per favore usa un linguaggio neutro dal punto di vista del genere quando ti riferisci a persone, come @uref{https://en.wikipedia.org/wiki/Singular_they, il ``loro'' singolare}, ecc.
pt_br: Ao escrever documentação, por favor, use palavras de gênero neutras ao se referir a pessoas, como @uref{https://en.wikipedia.org/wiki/Singular_they, singular ``they''@comma{} ``their'' @comma{} ``them''}, e assim por diante.

source: Verify that your patch contains only one set of related changes. Bundling unrelated changes together makes reviewing harder and slower.
it: Verifica che la tua patch contenga solo un insieme di modifiche correlate. Raggruppare modifiche non correlate rende la revisione più difficile e lenta.
pt_br: Verifique se o seu patch contém apenas um conjunto de alterações relacionadas. Agrupar mudanças não relacionadas juntas torna a revisão mais difícil e lenta.

source: Examples of unrelated changes include the addition of several packages, or a package update along with fixes to that package.
it: Esempi di modifiche non correlate includono l'aggiunta di diversi pacchetti, o un aggiornamento di un pacchetto insieme a correzioni per quel pacchetto.
pt_br: Exemplos de alterações não relacionadas incluem a adição de vários pacotes ou uma atualização de pacote juntamente com correções para esse pacote.

source: Please follow our code formatting rules, possibly running @command{guix style} script to do that automatically for you (@pxref{Formatting Code}).
it: Per favore, segui le nostre regole di formattazione del codice, eventualmente eseguendo lo script @command{guix style} per farlo automaticamente per te (@pxref{Formatting Code}).
pt_br: Siga nossas regras de formatação de código, possivelmente executando o script @command{guix style} para fazer isso automaticamente para você (@pxref{Formatting Code}).

source: When possible, use mirrors in the source URL (@pxref{Invoking guix download}). Use reliable URLs, not generated ones. For instance, GitHub archives are not necessarily identical from one generation to the next, so in this case it's often better to clone the repository. Don't use the @code{name} field in the URL: it is not very useful and if the name changes, the URL will probably be wrong.
it: Quando possibile, usa i mirror nell'URL sorgente (@pxref{Invoking guix download}). Usa URL affidabili, non generati. Ad esempio, gli archivi di GitHub non sono necessariamente identici da una generazione all'altra, quindi in questo caso è spesso meglio clonare il repository. Non usare il campo @code{name} nell'URL: non è molto utile e se il nome cambia, l'URL sarà probabilmente sbagliato.
pt_br: Quando possível, use espelhos no URL fonte (@pxref{Invoking guix download}). Use URLs confiáveis, não os gerados. Por exemplo, os arquivos do GitHub não são necessariamente idênticos de uma geração para a seguinte, portanto, nesse caso, geralmente é melhor clonar o repositório. Não use o campo @code{name} no URL: não é muito útil e se o nome mudar, o URL provavelmente estará errado.

source: Check if Guix builds (@pxref{Building from Git}) and address the warnings, especially those about use of undefined symbols.
it: Controlla se Guix si compila (@pxref{Building from Git}) e risolvi gli avvisi, specialmente quelli sull'uso di simboli non definiti.
pt_br: Verifique se o Guix compila (@pxref{Building from Git}) e resolva os avisos, especialmente aqueles sobre o uso de símbolos indefinidos.

source: Make sure your changes do not break Guix and simulate a @command{guix pull} with:
it: Assicurati che le tue modifiche non rompano Guix e simula un @command{guix pull} con:
pt_br: Certifique-se de que suas alterações não quebrem o Guix e simule um @command{guix pull} com:

source: guix pull --url=/path/to/your/checkout --profile=/tmp/guix.master --disable-authentication
it: guix pull --url=/percorso/del/tuo/checkout --profile=/tmp/guix.master --disable-authentication
pt_br: guix pull --url=/caminho/para/seu/checkout --profile=/tmp/guix.master --disable-authentication

source: When posting a patch to the mailing list, use @samp{[PATCH] @dots{}} as a subject, if your patch is to be applied on a branch other than @code{master}, say @code{core-updates}, specify it in the subject like @samp{[PATCH core-updates] @dots{}}.
it: Quando invii una patch alla mailing list, usa @samp{[PATCH] @dots{}} come oggetto. Se la tua patch deve essere applicata a un ramo diverso da @code{master}, ad esempio @code{core-updates}, specifica questo nell'oggetto come @samp{[PATCH core-updates] @dots{}}.
pt_br: Ao postar um patch na lista de discussão, use @samp{[PATCH] @dots{}} como assunto. Se seu patch for aplicado em uma ramificação diferente de @code{master}, digamos @code{core-updates}, especifique-o no assunto como @samp{[PATCH core-updates] @dots{}}.

source: You may use your email client, the @command{git send-email} command (@pxref{Sending a Patch Series}) or the @command{mumi send-email} command (@pxref{Debbugs User Interfaces}). We prefer to get patches in plain text messages, either inline or as MIME attachments. You are advised to pay attention if your email client changes anything like line breaks or indentation which could potentially break the patches.
it: Puoi usare il tuo client email, il comando @command{git send-email} (@pxref{Sending a Patch Series}) o il comando @command{mumi send-email} (@pxref{Debbugs User Interfaces}). Preferiamo ricevere le patch in messaggi di testo puro, in linea o come allegati MIME. Ti consigliamo di prestare attenzione se il tuo client email modifica qualcosa come interruzioni di riga o rientri che potrebbero potenzialmente danneggiare le patch.
pt_br: Você pode usar seu cliente de e-mail, o comando @command{git send-email} (@pxref{Sending a Patch Series}) ou o comando @command{mumi send-email} (@pxref{Debbugs User Interfaces}). Preferimos obter patches em mensagens de texto simples, seja em linha ou como anexos MIME. É aconselhável que você preste atenção se seu cliente de e-mail alterar algo como quebras de linha ou recuo, o que pode potencialmente quebrar os patches.

source: Expect some delay when you submit your very first patch to @email{guix-patches@@gnu.org}. You have to wait until you get an acknowledgement with the assigned tracking number. Future acknowledgements should not be delayed.
it: Prevedi un certo ritardo quando invii la tua prima patch a @email{guix-patches@@gnu.org}. Devi attendere fino a ricevere un riconoscimento con il numero di tracciamento assegnato. I riconoscimenti futuri non dovrebbero subire ritardi.
pt_br: Espere algum atraso quando você enviar seu primeiro patch para @email{guix-patches@@gnu.org}. Você tem que esperar até receber uma confirmação com o número de rastreamento atribuído. Confirmações futuras não devem ser atrasadas.

source: When a bug is resolved, please close the thread by sending an email to @email{@var{ISSUE_NUMBER}-done@@debbugs.gnu.org}.
it: Quando un bug viene risolto, chiudi la discussione inviando un'email a @email{@var{ISSUE_NUMBER}-done@@debbugs.gnu.org}.
pt_br: Quando um erro for resolvido, feche o tópico enviando um e-mail para @email{@var{NÚMERO_DE_ISSÃO}-done@@debbugs.gnu.org}.

source: Configuring Git
it: Configurazione di Git
pt_br: Configurando o Git

source: Sending a Patch Series
it: Invio di una Serie di Patch
pt_br: Enviando uma série de patches

source: git configuration
it: configurazione di git
pt_br: Configuração do git

source: If you have not done so already, you may wish to set a name and email that will be associated with your commits (@pxref{telling git your name, , Telling Git your name, git, Git User Manual}). If you wish to use a different name or email just for commits in this repository, you can use @command{git config --local}, or edit @file{.git/config} in the repository instead of @file{~/.gitconfig}.
it: Se non l'hai già fatto, potresti voler impostare un nome e un'email che saranno associati ai tuoi commit (@pxref{telling git your name, , Telling Git your name, git, Manuale Utente di Git}). Se desideri usare un nome o un'email diversi solo per i commit in questo repository, puoi usare @command{git config --local}, o modificare @file{.git/config} nel repository invece di @file{~/.gitconfig}.
pt_br: Se você ainda não fez isso, você pode querer definir um nome e e-mail que serão associados aos seus commits (@pxref{telling git your name, , Telling Git your name, git, Git User Manual}). Se você quiser usar um nome ou e-mail diferente apenas para commits neste repositório, você pode usar @command{git config --local}, ou editar @file{.git/config} no repositório em vez de @file{~/.gitconfig}.

source: commit-msg hook
it: hook commit-msg
pt_br: gancho commit-msg

source: Other important Git configuration will automatically be configured when building the project (@pxref{Building from Git}). A @file{.git/hooks/commit-msg} hook will be installed that embeds @samp{Change-Id} Git @emph{trailers} in your commit messages for traceability purposes. It is important to preserve these when editing your commit messages, particularly if a first version of your proposed changes was already submitted for review. If you have a @file{commit-msg} hook of your own you would like to use with Guix, you can place it under the @file{.git/hooks/commit-msg.d/} directory.
it: Altre configurazioni importanti di Git verranno configurate automaticamente durante la compilazione del progetto (@pxref{Building from Git}). Verrà installato un hook @file{.git/hooks/commit-msg} che incorpora @emph{trailer} @samp{Change-Id} di Git nei messaggi di commit per scopi di tracciabilità. È importante preservare questi elementi durante la modifica dei messaggi di commit, specialmente se una prima versione delle modifiche proposte è già stata inviata per la revisione. Se hai un tuo hook @file{commit-msg} che desideri usare con Guix, puoi posizionarlo nella directory @file{.git/hooks/commit-msg.d/}.
pt_br: Outras configurações importantes do Git serão configuradas automaticamente ao construir o projeto (@pxref{Building from Git}). Um hook @file{.git/hooks/commit-msg} será instalado, incorporando @samp{Change-Id} Git @emph{trailers} em suas mensagens de commit para fins de rastreabilidade. É importante preservá-los ao editar suas mensagens de commit, principalmente se uma primeira versão de suas alterações propostas já foi enviada para revisão. Se você tiver um hook @file{commit-msg} próprio que gostaria de usar com o Guix, pode colocá-lo no diretório @file{.git/hooks/commit-msg.d/}.

source: patch series
it: serie di patch
pt_br: série de patches

source: Warning
it: Avviso
pt_br: Aviso

source: This section is about contributing code by sending patches by email. This option is supported until December 31st, 2025, but we recommend getting familiar with the @dfn{pull request} workflow, which will become the norm after that date. @xref{Submitting Patches}, for more info.
it: Questa sezione riguarda il contributo al codice inviando patch via email. Questa opzione è supportata fino al 31 dicembre 2025, ma raccomandiamo di familiarizzare con il flusso di lavoro delle @dfn{pull request}, che diventerà la norma dopo quella data. @xref{Submitting Patches}, per maggiori informazioni.
pt_br: Esta seção aborda a contribuição de código por meio do envio de patches por e-mail. Esta opção é suportada até 31 de dezembro de 2025, mas recomendamos que você se familiarize com o fluxo de trabalho @dfn{pull request}, que se tornará padrão após essa data. Consulte @xref{Submitting Patches} para mais informações.

source: Single Patches
pt_br: Patches únicos

source: The @command{git send-email} command is the best way to send both single patches and patch series (@pxref{Multiple Patches}) to the Guix mailing list. Sending patches as email attachments may make them difficult to review in some mail clients, and @command{git diff} does not store commit metadata.
it: Il comando @command{git send-email} è il modo migliore per inviare sia patch singole che serie di patch (@pxref{Multiple Patches}) alla mailing list di Guix. L'invio di patch come allegati email potrebbe renderle difficili da revisionare in alcuni client di posta, e @command{git diff} non memorizza i metadati dei commit.
pt_br: O comando @command{git send-email} é a melhor maneira de enviar patches únicos e séries de patches (@pxref{Multiple Patches}) para a lista de discussão do Guix. Enviar patches como anexos de e-mail pode dificultar sua revisão em alguns clientes de e-mail, e @command{git diff} não armazena metadados de commit.

source: The @command{git send-email} command is provided by the @code{send-email} output of the @code{git} package, i.e. @code{git:send-email}.
it: Il comando @command{git send-email} è fornito dall'output @code{send-email} del pacchetto @code{git}, cioè @code{git:send-email}.
pt_br: O comando @command{git send-email} é fornecido pela saída @code{send-email} do pacote @code{git}, ou seja, @code{git:send-email}.

source: The following command will create a patch email from the latest commit, open it in your @var{EDITOR} or @var{VISUAL} for editing, and send it to the Guix mailing list to be reviewed and merged. Assuming you have already configured Git according to @xref{Configuring Git}, you can simply use:
it: Il comando seguente creerà un'email di patch dall'ultimo commit, la aprirà nel tuo @var{EDITOR} o @var{VISUAL} per la modifica e la invierà alla mailing list di Guix per essere revisionata e unita. Supponendo che tu abbia già configurato Git secondo @xref{Configuring Git}, puoi semplicemente usare:
pt_br: O comando a seguir criará um e-mail de patch a partir do último commit, abrirá no seu @var{EDITOR} ou @var{VISUAL} para edição e o enviará para a lista de discussão do Guix para ser revisado e mesclado. Supondo que você já tenha configurado o Git de acordo com @xref{Configuring Git}, você pode simplesmente usar:

source: Tip
it: Suggerimento:
pt_br: Dica

source: To add a prefix to the subject of your patch, you may use the @option{--subject-prefix} option. The Guix project uses this to specify that the patch is intended for a branch or repository other than the @code{master} branch of @url{https://codeberg.org/guix/guix.git}.
it: Per aggiungere un prefisso all'oggetto della tua patch, puoi usare l'opzione @option{--subject-prefix}. Il progetto Guix usa questo per specificare che la patch è destinata a un ramo o repository diverso dal ramo @code{master} di @url{https://codeberg.org/guix/guix.git}.
pt_br: Para adicionar um prefixo ao assunto do seu patch, você pode usar a opção @option{--subject-prefix}. O projeto Guix usa isso para especificar que o patch é destinado a um branch ou repositório diferente do branch @code{master} do @url{https://codeberg.org/guix/guix.git}.

source: The patch email contains a three-dash separator line after the commit message. You may ``annotate'' the patch with explanatory text by adding it under this line. If you do not wish to annotate the email, you may drop the @option{--annotate} option.
it: L'email della patch contiene una linea separatrice di tre trattini dopo il messaggio di commit. Puoi ``annotare'' la patch con testo esplicativo aggiungendolo sotto questa linea. Se non desideri annotare l'email, puoi omettere l'opzione @option{--annotate}.
pt_br: O e-mail do patch contém uma linha separadora de três traços após a mensagem de commit. Você pode ``anotar'' o patch com texto explicativo adicionando-o abaixo desta linha. Se não quiser anotar o e-mail, você pode remover a opção @option{--annotate}.

source: If you need to send a revised patch, don't resend it like this or send a ``fix'' patch to be applied on top of the last one; instead, use @command{git commit --amend} or @url{https://git-rebase.io, @command{git rebase}} to modify the commit, and use the @email{@var{ISSUE_NUMBER}@@debbugs.gnu.org} address and the @option{-v} flag with @command{git send-email}.
it: Se devi inviare una patch rivista, non reinviarla così o inviare una patch ``fix'' da applicare sopra l'ultima; invece, usa @command{git commit --amend} o @url{https://git-rebase.io, @command{git rebase}} per modificare il commit, e usa l'indirizzo @email{@var{ISSUE_NUMBER}@@debbugs.gnu.org} e il flag @option{-v} con @command{git send-email}.
pt_br: Se você precisar enviar um patch revisado, não o reenvie dessa forma ou envie um patch ``fix'' para ser aplicado sobre o último; em vez disso, use @command{git commit --amend} ou @url{https://git-rebase.io, @command{git rebase}} para modificar o commit e use o endereço @email{@var{NÚMERO_DE_ISSÃO}@@debbugs.gnu.org} e o sinalizador @option{-v} com @command{git send-email}.

source: $ git commit --amend $ git send-email --annotate -v@var{REVISION} \ --to=@var{ISSUE_NUMBER}@@debbugs.gnu.org -1
pt_br: $ git commit --amend $ git send-email --annotate -v@var{REVISÃO} \ --to=@var{NÚMERO_DE_ISSÃO}@@debbugs.gnu.org -1

source: Due to an apparent bug in @command{git send-email}, @option{-v @var{REVISION}} (with the space) will not work; you @emph{must} use @option{-v@var{REVISION}}.
it: A causa di un apparente bug in @command{git send-email}, @option{-v @var{REVISION}} (con lo spazio) non funzionerà; @emph{devi} usare @option{-v@var{REVISION}}.
pt_br: Devido a um bug aparente em @command{git send-email}, @option{-v @var{REVISÃO}} (com o espaço) não funcionará; você @emph{deve} usar @option{-v@var{REVISÃO}}.
