Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Configuration for use as a two-factor authenticator (2FA)
es: Configuración para su uso como autenticador de dos factores (2FA)
it: Configurazione per l'uso come autenticatore a due fattori (2FA)
pt_br: Configuração para uso como autenticador de dois fatores (2FA)
sk: Nastavenie pre použitie v rámci dvojstupňového overenia (2FA)

source: To be usable, the udev rules of the system should be extended with key-specific rules. The following shows how to extend your udev rules with the @file{lib/udev/rules.d/70-u2f.rules} udev rule file provided by the @code{libfido2} package from the @code{(gnu packages security-token)} module and add your user to the @samp{"plugdev"} group it uses:
es: Para que sean utilizables, las reglas udev del sistema deben ampliarse con reglas específicas para cada clave. A continuación se muestra cómo ampliar sus reglas udev con el archivo de reglas udev @file{lib/udev/rules.d/70-u2f.rules} proporcionado por el paquete @code{libfido2} del módulo @code{(gnu packages security-token)} y añadir su usuario al grupo @samp{"plugdev"} que utiliza:
it: Per essere utilizzabile, le regole udev del sistema dovrebbero essere estese con regole specifiche per la chiave. Il seguente mostra come estendere le tue regole udev con il file di regole udev @file{lib/udev/rules.d/70-u2f.rules} fornito dal pacchetto @code{libfido2} dal modulo @code{(gnu packages security-token)} e aggiungere il tuo utente al gruppo @samp{"plugdev"} che utilizza:
pt_br: Para serem utilizáveis, as regras do udev do sistema devem ser estendidas com regras específicas de chave. O seguinte mostra como estender suas regras do udev com o arquivo de regras do udev @file{lib/udev/rules.d/70-u2f.rules} fornecido pelo pacote @code{libfido2} do @code{(gnu packages security- token)} e adicione seu usuário ao grupo @samp{"plugdev"} que ele usa:
sk: Aby sa kľúč dal použiť, je nutné rozšíriť udev pravidlá systému o pravidlá príznačné pre daný kľúč. Nasledovný postup popisuje kroky pre rozšírenie udev pravidiel prostredníctvom súboru udev pravidiel @file{lib/udev/rules.d/70-u2f.rules} poskytovaného balíkom @code{libfido2} z modulu @code{(gnu packages security-token)} a pre pridanie vášho používateľského účtu do skupiny @samp{"plugdev"}, ktorú využíva:

source: (use-package-modules ... security-token ...) ... (operating-system ... (users (cons* (user-account (name "your-user") (group "users") (supplementary-groups '("wheel" "netdev" "audio" "video" "plugdev")) ;<- added system group (home-directory "/home/your-user")) %base-user-accounts)) ... (services (cons* ... (udev-rules-service 'fido2 libfido2 #:groups '("plugdev")))))
it: (use-package-modules ... security-token ...) ... (operating-system ... (users (cons* (user-account (name "tuo-utente") (group "users") (supplementary-groups '("wheel" "netdev" "audio" "video" "plugdev")) ;<- gruppo di sistema aggiunto (home-directory "/home/tuo-utente")) %base-user-accounts)) ... (services (cons* ... (udev-rules-service 'fido2 libfido2 #:groups '("plugdev")))))
pt_br: (use-package-modules ... security-token ...) ... (operating-system ... (users (cons* (user-account (name "your-user") (group "users") (supplementary-groups '("wheel" "netdev" "audio" "video" "plugdev")) ;<- grupo de sistema adicionado (home-directory "/home/your-user")) %base-user-accounts)) ... (services (cons* ... (udev-rules-service 'fido2 libfido2 #:groups '("plugdev")))))
sk: (use-package-modules ... security-token ...) ... (operating-system ... (users (cons* (user-account (name "vas-pouzivatelsky-ucet") (group "users") (supplementary-groups '("wheel" "netdev" "audio" "video" "plugdev")) ;<- pridaná systémová skupina (home-directory "/home/vas-pouzivatelsky-ucet")) %base-user-accounts)) ... (services (cons* ... (udev-rules-service 'fido2 libfido2 #:groups '("plugdev")))))

source: After re-configuring your system and re-logging in your graphical session so that the new group is in effect for your user, you can verify that your key is usable by launching:
es: Después de reconfigurar su sistema y volver a iniciar su sesión gráfica para que el nuevo grupo esté en vigor para su usuario, puede verificar que su clave es utilizable iniciando:
it: Dopo aver riconfigurato il sistema e aver effettuato nuovamente l'accesso alla sessione grafica in modo che il nuovo gruppo sia effettivo per il tuo utente, puoi verificare che la tua chiave sia utilizzabile avviando:
pt_br: Depois de reconfigurar seu sistema e fazer login novamente em sua sessão gráfica para que o novo grupo esteja em vigor para seu usuário, você pode verificar se sua chave pode ser usada iniciando:
sk: Znovunastavením systému a opätovným prihlásením do vášho grafického sedenia uplatníte členstvo vášho používateľského účtu v novej skupine. Potom môžete overiť použiteľnosť vášho kľúča spustením:

source: and validating that the security key can be reset via the ``Reset your security key'' menu. If it works, congratulations, your security key is ready to be used with applications supporting two-factor authentication (2FA).
es: y validando que la clave de seguridad se puede restablecer a través del menú ``Restablezca su clave de seguridad''. Si funciona, enhorabuena, tu clave de seguridad está lista para ser utilizada con aplicaciones que admitan la autenticación de dos factores (2FA).
it: e verificando che la chiave di sicurezza possa essere resettata tramite il menu ``Reset your security key''. Se funziona, congratulazioni, la tua chiave di sicurezza è pronta per essere utilizzata con applicazioni che supportano l'autenticazione a due fattori (2FA).
pt_br: e validar que a chave de segurança pode ser redefinida através do menu ``Redefinir sua chave de segurança''. Se funcionar, parabéns, sua chave de segurança está pronta para ser usada com aplicativos que suportam autenticação de dois fatores (2FA).
sk: a potvrdením, že bezpečnostný kľúč sa dá vynulovať v ponuke „Vynulovať váš bezpečnostný kľúč“. Ak to funguje, blahoželáme! Váš bezpečnostný kľúč je pripravený na použitie v aplikáciách podporujúcich dvojstupňové overenie (2FA).

source: Disabling OTP code generation for a Yubikey
es: Desactivar la generación de código OTP para un Yubikey
it: Disabilitazione della generazione di codici OTP per una Yubikey
pt_br: Desativando a geração de código OTP para um Yubikey
sk: Vypnúť vytváranie OTP kódov pre Yubikey

source: disabling yubikey OTP
es: desactivar yubikey OTP
it: disabilitazione OTP yubikey
pt_br: desabilitando o yubikey OTP
sk: vypnutie OTP pre yubikey

source: If you use a Yubikey security key and are irritated by the spurious OTP codes it generates when inadvertently touching the key (e.g. causing you to become a spammer in the @samp{#guix} channel when discussing from your favorite IRC client!), you can disable it via the following @command{ykman} command:
es: Si utilizas una clave de seguridad Yubikey y te irritan los códigos OTP espurios que genera cuando tocas inadvertidamente la clave (¡por ejemplo, haciendo que te conviertas en un spammer en el canal @samp{#guix} cuando discutes desde tu cliente IRC favorito!), puedes desactivarla mediante el siguiente comando @command{ykman}:
it: Se utilizzi una chiave di sicurezza Yubikey e sei irritato dai codici OTP spuri che genera quando tocchi involontariamente la chiave (ad esempio, facendoti diventare uno spammer nel canale @samp{#guix} mentre discuti dal tuo client IRC preferito!), puoi disabilitarlo tramite il seguente comando @command{ykman}:
pt_br: Se você usa uma chave de segurança Yubikey e fica irritado com os códigos OTP falsos que ela gera ao tocar inadvertidamente na chave (por exemplo, fazendo com que você se torne um spammer no canal @samp{#guix} ao discutir sobre seu cliente de IRC favorito!), você pode desativá-lo através do seguinte comando @command{ykman}:
sk: Ak používate bezpečnostný kľúč Yubikey a otravujú vás nesprávne OTP kódy, ktoré vytvára, keď nedopatrením kľúč zmeníte (napr. z vás spraví odosielateľa nevyžiadaných správ v kanáli @samp{#guix} zatiaľčo sa zhovárate vo vašom obľúbenom IRC klientovi!), môžete to vypnúť nasledovným @command{ykman} príkazom:

source: Alternatively, you could use the @command{ykman-gui} command provided by the @code{yubikey-manager-qt} package and either wholly disable the @samp{OTP} application for the USB interface or, from the @samp{Applications -> OTP} view, delete the slot 1 configuration, which comes pre-configured with the Yubico OTP application.
es: Alternativamente, puede utilizar el comando @command{ykman-gui} proporcionado por el paquete @code{yubikey-manager-qt} y desactivar completamente la aplicación @samp{OTP} para la interfaz USB o, desde la vista @samp{Applications -&gt; OTP}, eliminar la configuración de la ranura 1, que viene preconfigurada con la aplicación OTP de Yubico.
it: In alternativa, potresti usare il comando @command{ykman-gui} fornito dal pacchetto @code{yubikey-manager-qt} e disabilitare completamente l'applicazione @samp{OTP} per l'interfaccia USB oppure, dalla vista @samp{Applications -> OTP}, eliminare la configurazione dello slot 1, che viene preconfigurata con l'applicazione Yubico OTP.
pt_br: Alternativamente, você pode usar o comando @command{ykman-gui} fornecido pelo pacote @code{yubikey-manager-qt} e desativar totalmente o aplicativo @samp{OTP} para a interface USB ou, a partir do pacote @samp{Applications -> Visualização OTP}, exclua a configuração do slot 1, que vem pré-configurada com o aplicativo Yubico OTP.
sk: Ďalšou možnosťou je použiť príkaz @command{ykman-gui} z balíka @code{yubikey-manager-qt} a buď úplne vypnúť @samp{OTP} aplikáciu pre rozhranie USB, alebo z @samp{Applications -> OTP} vymazať nastavenie zásuvky 1, prednastavenej aplikáciou Yubico OTP.

source: Requiring a Yubikey to open a KeePassXC database
es: Requerir un Yubikey para abrir una base de datos KeePassXC
it: Richiedere una Yubikey per aprire un database KeePassXC
pt_br: Exigindo que um Yubikey abra um banco de dados KeePassXC
sk: Požiadať o Yubikey na otvorenie KeePassXC databázy

source: yubikey, keepassxc integration
es: yubikey, integración de keepassxc
it: yubikey, integrazione keepassxc
sk: yubikey, prepojenie s keepassxc

source: The KeePassXC password manager application has support for Yubikeys, but it requires installing a udev rules for your Guix System and some configuration of the Yubico OTP application on the key.
es: La aplicación de gestión de contraseñas KeePassXC tiene soporte para Yubikeys, pero requiere la instalación de una regla udev para tu sistema Guix y alguna configuración de la aplicación Yubico OTP en la llave.
it: L'applicazione KeePassXC, gestore di password, supporta le Yubikey, ma richiede l'installazione di regole udev per il tuo sistema Guix e una certa configurazione dell'applicazione Yubico OTP sulla chiave.
pt_br: O aplicativo gerenciador de senhas KeePassXC tem suporte para Yubikeys, mas requer a instalação de regras udev para seu sistema Guix e algumas configurações do aplicativo Yubico OTP na chave.
sk: Správca hesiel KeePassXC podporuje kľúče Yubikeys, ale táto podpora si vyžaduje inštaláciu udev pravidiel pre váš systém Guix a nastavenie aplikácie Yubico OTP na vybraný kľúč.

source: The necessary udev rules file comes from the @code{yubikey-personalization} package, and can be installed like:
es: El archivo de reglas udev necesario proviene del paquete @code{yubikey-personalization}, y puede instalarse como:
it: Il file di regole udev necessario proviene dal pacchetto @code{yubikey-personalization}, e può essere installato così:
pt_br: O arquivo de regras do udev necessário vem do pacote @code{yubikey-personalization} e pode ser instalado como:
sk: Potrebný súbor udev pravidiel pochádza z balíka @code{yubikey-personalization} a možno ho nainštalovať nasledovne:

source: After reconfiguring your system (and reconnecting your Yubikey), you'll then want to configure the OTP challenge/response application of your Yubikey on its slot 2, which is what KeePassXC uses. It's easy to do so via the Yubikey Manager graphical configuration tool, which can be invoked with:
es: Después de reconfigurar tu sistema (y reconectar tu Yubikey), querrás configurar la aplicación de desafío/respuesta OTP de tu Yubikey en su ranura 2, que es la que utiliza KeePassXC. Es fácil hacerlo a través de la herramienta de configuración gráfica Yubikey Manager, que se puede invocar con:
it: Dopo aver riconfigurato il sistema (e ricollegato la tua Yubikey), dovrai poi configurare l'applicazione di sfida/risposta OTP della tua Yubikey sullo slot 2, che è ciò che KeePassXC usa. È facile farlo tramite lo strumento di configurazione grafica Yubikey Manager, che può essere invocato con:
pt_br: Depois de reconfigurar seu sistema (e reconectar seu Yubikey), você desejará configurar o aplicativo de desafio/resposta OTP de seu Yubikey em seu slot 2, que é o que o KeePassXC usa. É fácil fazer isso por meio da ferramenta de configuração gráfica Yubikey Manager, que pode ser invocada com:

source: First, ensure @samp{OTP} is enabled under the @samp{Interfaces} tab, then navigate to @samp{Applications -> OTP}, and click the @samp{Configure} button under the @samp{Long Touch (Slot 2)} section. Select @samp{Challenge-response}, input or generate a secret key, and click the @samp{Finish} button. If you have a second Yubikey you'd like to use as a backup, you should configure it the same way, using the @emph{same} secret key.
es: En primer lugar, asegúrese de que @samp{OTP} está activado en la pestaña @samp{Interfaces} y, a continuación, vaya a @samp{Aplicaciones -&gt; OTP} y haga clic en el botón @samp{Configurar} de la sección @samp{Táctil largo (ranura 2)}. Seleccione @samp{Reto-respuesta}, introduzca o genere una clave secreta y haga clic en el botón @samp{Finalizar}. Si tiene un segundo Yubikey que desea utilizar como copia de seguridad, debe configurarlo de la misma manera, utilizando la clave secreta @emph{same}.
it: Innanzitutto, assicurati che @samp{OTP} sia abilitato nella scheda @samp{Interfacce}, quindi vai a @samp{Applicazioni -> OTP} e fai clic sul pulsante @samp{Configura} nella sezione @samp{Tocco lungo (Slot 2)}. Seleziona @samp{Challenge-response}, inserisci o genera una chiave segreta e fai clic sul pulsante @samp{Fine}. Se hai una seconda Yubikey che desideri utilizzare come backup, dovresti configurarla nello stesso modo, utilizzando la @emph{stessa} chiave segreta.
pt_br: Primeiro, certifique-se de que @samp{OTP} esteja habilitado na aba @samp{Interfaces}, depois navegue até @samp{Applications -> OTP} e clique no botão @samp{Configure} abaixo de @samp{Long Touch (Slot 2 )} seção. Selecione @samp{Challenge-response}, insira ou gere uma chave secreta e clique no botão @samp{Finish}. Se você tiver um segundo Yubikey que gostaria de usar como backup, você deve configurá-lo da mesma forma, usando a chave secreta @emph{mesma}.

source: Your Yubikey should now be detected by KeePassXC. It can be added to a database by navigating to KeePassXC's @samp{Database -> Database Security...} menu, then clicking the @samp{Add additional protection...} button, then @samp{Add Challenge-Response}, selecting the security key from the drop-down menu and clicking the @samp{OK} button to complete the setup.
es: Tu Yubikey ahora debería ser detectado por KeePassXC. Puede añadirse a una base de datos accediendo al menú @samp{Database -&gt; Database Security...} de KeePassXC, haciendo clic en el botón @samp{Add additional protection...}, luego en @samp{Add Challenge-Response}, seleccionando la clave de seguridad en el menú desplegable y haciendo clic en el botón @samp{OK} para completar la configuración.
it: La tua Yubikey dovrebbe ora essere rilevata da KeePassXC. Può essere aggiunta a un database navigando nel menu @samp{Database -> Sicurezza database...} di KeePassXC, quindi facendo clic sul pulsante @samp{Aggiungi protezione aggiuntiva...}, quindi su @samp{Aggiungi Challenge-Response}, selezionando la chiave di sicurezza dal menu a discesa e facendo clic sul pulsante @samp{OK} per completare la configurazione.
pt_br: Seu Yubikey agora deve ser detectado pelo KeePassXC. Ele pode ser adicionado a um banco de dados navegando até o menu @samp{Database -> Database Security...} do KeePassXC e clicando no botão @samp{Adicionar proteção adicional...} e em @samp{Add Challenge-Response}, selecionando a chave de segurança no menu suspenso e clicando no botão @samp{OK} para concluir a configuração.

source: dynamic DNS, DDNS
es: DNS dinámico, DDNS
it: DNS dinamico, DDNS
pt_br: DNS dinâmico, DDNS

source: If your @acronym{ISP, Internet Service Provider} only provides dynamic IP addresses, it can be useful to setup a dynamic @acronym{DNS, Domain Name System} (also known as @acronym{DDNS, Dynamic DNS}) service to associate a static host name to a public but dynamic (often changing) IP address. There are multiple existing services that can be used for this; in the following mcron job, @url{https://duckdns.org, DuckDNS} is used. It should also work with other dynamic DNS services that offer a similar interface to update the IP address, such as @url{https://freedns.afraid.org/}, with minor adjustments.
es: Si su @acronym{ISP, Proveedor de Servicios de Internet} sólo proporciona direcciones IP dinámicas, puede ser útil configurar un servicio @acronym{DNS, Sistema de Nombres de Dominio} dinámico (también conocido como @acronym{DDNS, DNS Dinámico}) para asociar un nombre de host estático a una dirección IP pública pero dinámica (a menudo cambiante). Existen varios servicios que pueden utilizarse para ello; en la siguiente tarea mcron, se utiliza @url{https://duckdns.org, DuckDNS}. También debería funcionar con otros servicios DNS dinámicos que ofrezcan una interfaz similar para actualizar la dirección IP, como @url{https://freedns.afraid.org/}, con pequeños ajustes.
it: Se il tuo @acronym{ISP, Internet Service Provider} fornisce solo indirizzi IP dinamici, può essere utile configurare un servizio @acronym{DNS, Domain Name System} dinamico (noto anche come @acronym{DDNS, Dynamic DNS}) per associare un nome host statico a un indirizzo IP pubblico ma dinamico (spesso variabile). Esistono diversi servizi che possono essere utilizzati a questo scopo; nel seguente job mcron, @url{https://duckdns.org, DuckDNS} viene utilizzato. Dovrebbe funzionare anche con altri servizi DNS dinamici che offrono un'interfaccia simile per aggiornare l' indirizzo IP, come @url{https://freedns.afraid.org/}, con piccole modifiche.
pt_br: Se o seu @acronym{ISP, Internet Service Provider} fornece apenas endereços IP dinâmicos, pode ser útil configurar um serviço @acronym{DNS, Domain Name System} dinâmico (também conhecido como @acronym{DDNS, Dynamic DNS}) para associar um nome de host estático para um endereço IP público, mas dinâmico. Existem vários serviços que podem ser usados para isso; no job mcron a seguir, @url{https://duckdns.org, DuckDNS} é usado. Também deve funcionar com outros serviços DNS dinâmicos que oferecem uma interface semelhante para atualizar o endereço IP.

source: The mcron job is provided below, where @var{DOMAIN} should be substituted for your own domain prefix, and the DuckDNS provided token associated to @var{DOMAIN} added to the @file{/etc/duckdns/@var{DOMAIN}.token} file.
es: El trabajo mcron se proporciona a continuación, donde @var{DOMAIN} debe ser sustituido por su propio prefijo de dominio, y el token proporcionado por DuckDNS asociado a @var{DOMAIN} añadido al archivo @file{/etc/duckdns/@var{DOMAIN}.token}.
it: Il job mcron è fornito di seguito, dove @var{DOMAIN} dovrebbe essere sostituito con il tuo prefisso di dominio, e il token fornito da DuckDNS associato a @var{DOMAIN} aggiunto al file @file{/etc/duckdns/@var{DOMAIN}.token}.
pt_br: O Job mcron é fornecido abaixo, onde @var{DOMAIN} deve ser substituído pelo seu próprio prefixo de domínio, e o token fornecido pelo DuckDNS é associado a @var{DOMAIN} e adicionado ao arquivo @file{/etc/duckdns/@var{DOMAIN} arquivo .token}.

source: (define duckdns-job ;; Update personal domain IP every 5 minutes. #~(job '(next-minute (range 0 60 5)) #$(program-file "duckdns-update" (with-extensions (list guile-gnutls) ;required by (web client) #~(begin (use-modules (ice-9 textual-ports) (web client)) (let ((token (string-trim-both (call-with-input-file "/etc/duckdns/@var{DOMAIN}.token" get-string-all))) (query-template (string-append "https://www.duckdns.org/" "update?domains=@var{DOMAIN}" "&token=~a&ip="))) (http-get (format #f query-template token)))))) "duckdns-update" #:user "nobody"))
it: (define duckdns-job ;; Aggiorna l'IP del dominio personale ogni 5 minuti. #~(job '(next-minute (range 0 60 5)) #$(program-file "duckdns-update" (with-extensions (list guile-gnutls) ;richiesto da (web client) #~(begin (use-modules (ice-9 textual-ports) (web client)) (let ((token (string-trim-both (call-with-input-file "/etc/duckdns/@var{DOMAIN}.token" get-string-all))) (query-template (string-append "https://www.duckdns.org/" "update?domains=@var{DOMAIN}" "&token=~a&ip="))) (http-get (format #f query-template token)))))) "duckdns-update" #:user "nobody"))
pt_br: (define duckdns-job ;; Atualize o IP do domínio pessoal a cada 5 minutos. #~(job '(next-minute (range 0 60 5)) #$(program-file "duckdns-update" (with-extensions (list guile-gnutls) ;required by (web client) #~(begin (use-modules (ice-9 textual-ports) (web client)) (let ((token (string-trim-both (call-with-input-file "/etc/duckdns/@var{DOMAIN}.token" get-string-all))) (query-template (string-append "https://www.duckdns.org/" "update?domains=@var{DOMAIN}" "&token=~a&ip="))) (http-get (format #f query-template token)))))) "duckdns-update" #:user "nobody"))

source: The job then needs to be added to the list of mcron jobs for your system, using something like:
es: El trabajo entonces necesita ser añadido a la lista de trabajos mcron para su sistema, usando algo como:
it: Il job deve quindi essere aggiunto all'elenco dei job mcron per il tuo sistema, usando qualcosa come:
pt_br: O Job então precisa ser adicionado à lista de trabalhos mcron do seu sistema, usando algo como:

source: To connect to a Wireguard VPN server you need the kernel module to be loaded in memory and a package providing networking tools that support it (e.g. @code{wireguard-tools} or @code{network-manager}).
es: Para conectarse a un servidor VPN Wireguard necesita que el módulo del kernel esté cargado en memoria y un paquete que proporcione herramientas de red que lo soporten (por ejemplo, @code{wireguard-tools} o @code{network-manager}).
it: Per connettersi a un server VPN Wireguard è necessario che il modulo del kernel sia caricato in memoria e un pacchetto che fornisca strumenti di rete che lo supportino (ad esempio, @code{wireguard-tools} o @code{network-manager}).
pt_br: Para se conectar a um servidor VPN Wireguard, você precisa que o módulo do kernel esteja carregado na memória e um pacote que forneça ferramentas de rede que o suportem (por exemplo, @code{wireguard-tools} ou @code{network-manager}).
sk: Pre pripojenie k serveru Wireguard VPN je potrebné načítať príslušný modul jadra ako aj balík poskytujúci sieťové nástroje, ktoré ho podporujú (napr. @code{wireguard-tools} alebo @code{network-manager}).
