Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: Guix offers a flexible language for declaratively configuring your Guix System. This flexibility can at times be overwhelming. The purpose of this chapter is to demonstrate some advanced configuration concepts.
es: Guix ofrece un lenguaje flexible para configurar de forma declarativa su sistema Guix. Esta flexibilidad puede resultar a veces abrumadora. El propósito de este capítulo es demostrar algunos conceptos avanzados de configuración.
it: Guix offre un linguaggio flessibile per configurare dichiarativamente il tuo sistema Guix. Questa flessibilità può a volte essere eccessiva. Lo scopo di questo capitolo è dimostrare alcuni concetti avanzati di configurazione.
pt_br: Guix oferece uma linguagem flexível para configurar declarativamente seu sistema Guix. Essa flexibilidade às vezes pode ser esmagadora. O objetivo deste capítulo é demonstrar alguns conceitos avançados de configuração.
sk: Guix ponúka všestranný jazyk na deklaratívne nastavenie vášho systému Guix. Táto všestrannosť sa môže niekedy zdať nadmerná. Účelom tohto oddielu je predstaviť niektoré pokročilé spôsoby nastavenia.
sv: Guix erbjuder ett flexibelt språk för att deklarativt konfigurera ditt Guix Syste. Den här flexibiliteten kan ibland vara överväldigande. Syftet med det här kapitlet är att demonstrera några avancerade konfigurationsbegrepp.

source: @pxref{System Configuration,,, guix, GNU Guix Reference Manual} for a complete reference.
es: @pxref{Configuración del sistema,,, guix, Manual Referencial de GNU Guix} para una referencia completa.
it: @pxref{Configurazione di sistema,,, guix.it, Manuale di riferimento di GNU Guix} per un riferimento completo.
pt_br: @pxref{Configuração do sistema,,, guix.pt_BR, Manual de referência do GNU Guix} para uma referência completa.
sk: Viď úplnú odvolávku v @pxref{System Configuration,,, guix, GNU Guix Reference Manual}.

source: While the Guix manual explains auto-login one user to @emph{all} TTYs (@pxref{auto-login to TTY,,, guix, GNU Guix Reference Manual}), some might prefer a situation, in which one user is logged into one TTY with the other TTYs either configured to login different users or no one at all. Note that one can auto-login one user to any TTY, but it is usually advisable to avoid @code{tty1}, which, by default, is used to log warnings and errors.
es: Mientras que el manual de Guix explica el auto-login de un usuario a @emph{all} TTYs (@pxref{auto-login to TTY,,, guix, GNU Guix Reference Manual}), algunos pueden preferir una situación, en la que un usuario se registra en un TTY con los otros TTYs configurados para registrar diferentes usuarios o ninguno en absoluto. Tenga en cuenta que uno puede auto-login un usuario a cualquier TTY, pero por lo general es aconsejable evitar @code{tty1}, que, por defecto, se utiliza para registrar advertencias y errores.
it: Mentre il manuale di Guix spiega l'auto-login di un utente su @emph{tutte} le TTY (@pxref{auto-login to TTY,,, guix.it, Manuale di riferimento di GNU Guix}), alcuni potrebbero preferire una situazione in cui un utente è loggato su una TTY con le altre TTY configurate per accedere a utenti diversi o a nessuno. Si noti che si può auto-loggare un utente su qualsiasi TTY, ma di solito è consigliabile evitare @code{tty1}, che, per impostazione predefinita, viene utilizzata per registrare avvisi ed errori.
pt_br: Embora o manual do Guix explique o login automático de um usuário para @emph{todas} TTYs (@pxref{auto-login to TTY,,, guix.pt_BR, Manual de Referência do GNU Guix}), alguns podem preferir uma situação em que um usuário está logado em um TTY com os outros TTYs configurados para fazer login com usuários diferentes ou com nenhum. Observe que é possível fazer login automático de um usuário em qualquer TTY, mas geralmente é aconselhável evitar @code{tty1}, que, por padrão, é usado para registrar avisos e erros.
sk: Zatiaľ čo príručka pre Guix popisuje automatické prihlásenie jedného používateľa ku @emph{všetkým} TTY (@pxref{auto-login to TTY,,, guix, GNU Guix Reference Manual}), mohol by vám viac vyhovovať stav, keď je jeden používateľ pripojený k jednému TTY a ostatné TTY sú nastavené na prihlasovanie ďalších používateľov alebo nikoho. Všimnite si, že jedného používateľa je možné automaticky prihlásiť k akémukoľvek TTY. Avšak, je lepšie vynechať @code{tty1}, ktorý je predvolene využívaný na zobrazovanie varovaných a chybových hlásení.

source: Here is how one might set up auto login for one user to one tty:
es: Así es como se puede configurar el inicio de sesión automático para un usuario en un tty:
it: Ecco come si potrebbe impostare l'accesso automatico per un utente a una tty:
pt_br: Aqui está como se pode configurar o login automático para um usuário em um tty:
sk: Takto je možné nastaviť automatické prihlásenie jedného používateľa k jednému TTY:

source: One could also @code{compose} (@pxref{Higher-Order Functions,,, guile, The Guile Reference Manual}) @code{auto-login-to-tty} to login multiple users to multiple ttys.
es: También se podría @code{compose} (@pxref{Higher-Order Functions,,, guile, The Guile Reference Manual}) @code{auto-login-to-tty} para iniciar sesión de múltiples usuarios en múltiples ttys.
it: Si potrebbe anche @code{compose} (@pxref{Higher-Order Functions,,, guile, Manuale di riferimento di Guile}) @code{auto-login-to-tty} per accedere a più utenti su più tty.
pt_br: Pode-se também @code{compose} (@pxref{Higher-Order Functions,,,, guile, Manual de referência do GNU Guile}) @code{auto-login-to-tty} para fazer login de vários usuários em vários ttys.
sk: Tiež je možné použiť @code{compose} (@pxref{Higher-Order Functions,,, guile, The Guile Reference Manual}) s @code{auto-login-to-tty} pre prihlásenie viacerých používateľov k viacerým TTY.

source: Finally, here is a note of caution. Setting up auto login to a TTY, means that anyone can turn on your computer and run commands as your regular user. However, if you have an encrypted root partition, and thus already need to enter a passphrase when the system boots, auto-login might be a convenient option.
es: Por último, una nota de precaución. Configurar el inicio de sesión automático en un TTY, significa que cualquiera puede encender tu ordenador y ejecutar comandos como tu usuario habitual. Sin embargo, si tienes una partición raíz cifrada, y por lo tanto ya necesitas introducir una frase de contraseña cuando se inicia el sistema, el inicio de sesión automático puede ser una opción conveniente.
it: Infine, ecco una nota di cautela. Impostare l'auto-login su una TTY significa che chiunque può accendere il tuo computer ed eseguire comandi come il tuo utente regolare. Tuttavia, se hai una partizione root crittografata, e quindi hai già bisogno di inserire una passphrase all'avvio del sistema, l'auto-login potrebbe essere un' opzione comoda.
pt_br: Finalmente, aqui está uma nota de cautela. Configurar o login automático em um TTY significa que qualquer pessoa pode ligar seu computador e executar comandos como seu usuário normal. No entanto, se você tiver uma partição raiz criptografada e, portanto, já precisar inserir uma senha quando o sistema inicializar, o login automático pode ser uma opção conveniente.
sk: Varovanie na koniec. Nastavenie automatického prihlásenia k TTY znamená, že ktokoľvek môže zapnúť váš počítač a spúšťať príkazy ako zvyčajný používateľ. Hoci, ak používate zašifrovaný koreňový systém a pri spustení systému je nutné zadať heslo, automatické prihlásenie predstavuje praktickú možnosť.

source: Guix is, at its core, a source based distribution with substitutes (@pxref{Substitutes,,, guix, GNU Guix Reference Manual}), and as such building packages from their source code is an expected part of regular package installations and upgrades. Given this starting point, it makes sense that efforts are made to reduce the amount of time spent compiling packages, and recent changes and upgrades to the building and distribution of substitutes continues to be a topic of discussion within Guix.
es: Guix es, en su núcleo, una distribución basada en fuentes con sustituciones (@pxref{Sustituciones,,, guix.es, Manual referencial de GNU Guix}), y como tal la construcción de paquetes desde su código fuente es una parte esperada de las instalaciones y actualizaciones regulares de paquetes. Dado este punto de partida, tiene sentido que se hagan esfuerzos para reducir la cantidad de tiempo dedicado a la compilación de paquetes, y los recientes cambios y actualizaciones en la construcción y distribución de sustitutos sigue siendo un tema de discusión dentro de Guix.
it: Guix è, al suo interno, una distribuzione basata su sorgente con sostituti (@pxref{Sostituti,,, guix.it, Manuale di riferimento di GNU Guix}), e come tale la compilazione di pacchetti dal loro codice sorgente è una parte prevista delle normali installazioni e aggiornamenti di pacchetti. Dato questo punto di partenza, ha senso che siano fatti sforzi per ridurre il tempo impiegato nella compilazione dei pacchetti, e i recenti cambiamenti e aggiornamenti alla costruzione e distribuzione dei sostituti continuano ad essere un argomento di discussione all'interno di Guix.
pt_br: Guix é, em sua essência, uma distribuição baseada em código-fonte com substitutos (@pxref{Substitutos,,, guix.pt_BR, Manual de Referência do GNU Guix}) e, como tal, construir pacotes a partir de seu código-fonte é uma parte esperada das instalações e atualizações regulares de pacotes. Dado este ponto de partida, faz sentido que sejam feitos esforços para reduzir a quantidade de tempo gasto na compilação de pacotes, e as recentes mudanças e atualizações na construção e distribuição de substitutos continuam a ser um tópico de discussão dentro do Guix.
sk: Guix je, vo svojom jadre, distribúcia založená na zdrojových súboroch a náhradách (@pxref{Substitutes,,, guix, GNU Guix Reference Manual}). Zostavovanie balíkov z ich zdrojových súborov je teda prirodzenou súčasťou inštalácie a aktualizácie balíkov. Vzhľadom na túto skutočnosť dáva zmysel snaha o zníženie množstva času potrebného na zostavenie balíkov a nedávne zmeny v zostavovaní a šírení náhrad sú aj naďalej súčasťou rozhovorov vrámci projektu Guix.

source: The kernel, while not requiring an overabundance of RAM to build, does take a rather long time on an average machine. The official kernel configuration, as is the case with many GNU/Linux distributions, errs on the side of inclusiveness, and this is really what causes the build to take such a long time when the kernel is built from source.
es: El núcleo, aunque no requiere una sobreabundancia de RAM para construirse, tarda bastante tiempo en una máquina media. La configuración oficial del kernel, como es el caso de muchas distribuciones GNU/Linux, peca de inclusiva, y esto es realmente lo que hace que la construcción tarde tanto tiempo cuando el kernel se compila desde el código fuente.
it: Il kernel, pur non richiedendo un'eccessiva quantità di RAM per la compilazione, impiega un tempo piuttosto lungo su una macchina media. La configurazione ufficiale del kernel, come accade con molte distribuzioni GNU/Linux, tende all'inclusività, ed è proprio questo che fa sì che la compilazione richieda così tanto tempo quando il kernel viene compilato dal sorgente.
pt_br: O kernel, embora não exija uma superabundância de RAM para ser construído, leva muito tempo em uma máquina média. A configuração oficial do kernel, como é o caso de muitas distribuições GNU/Linux, erra pelo lado da inclusão, e é isso que realmente faz com que a construção demore tanto tempo quando o kernel é compilado a partir do código-fonte.
sk: Aj keď nevyžaduje veľké množstvo pamäte RAM, zostavenie jadra na priemerných počítačoch môže trvať veľmi dlho. Oficiálne nastavenie jadra, tak ako je to v prípade mnohých iných distribúcií GNU/Linuxu, sa prikláňa k širšej ponuke súčastí a to je to, čo spôsobuje, že zostavenie jadra zo zdrojových súborov trvá tak dlho.

source: The Linux kernel, however, can also just be described as a regular old package, and as such can be customized just like any other package. The procedure is a little bit different, although this is primarily due to the nature of how the package definition is written.
es: El núcleo de Linux, sin embargo, también puede describirse como un paquete normal y corriente, y como tal puede personalizarse como cualquier otro paquete. El procedimiento es un poco diferente, aunque esto se debe principalmente a la naturaleza de cómo está escrita la definición del paquete.
it: Il kernel Linux, tuttavia, può anche essere semplicemente descritto come un normale vecchio pacchetto, e come tale può essere personalizzato proprio come qualsiasi altro pacchetto. La procedura è leggermente diversa, anche se ciò è dovuto principalmente alla natura di come è scritta la definizione del pacchetto.
pt_br: O kernel do Linux, entretanto, também pode ser descrito apenas como um pacote antigo normal e, como tal, pode ser personalizado como qualquer outro pacote. O procedimento é um pouco diferente, embora isso se deva principalmente à natureza de como a definição do pacote é escrita.
sk: Avšak, aj samotné jadro Linuxu možno opísať ako balík a teda prispôsobiť ho rovnako ako hociktorý iný balík. Postup je mierne odlišný, aj keď hlavne kvôli tomu ako je zadanie balíka napísané.

source: The @code{linux-libre} kernel package definition is actually a procedure which creates a package.
es: La definición del paquete del núcleo @code{linux-libre} es en realidad un procedimiento que crea un paquete.
it: La definizione del pacchetto kernel @code{linux-libre} è in realtà una procedura che crea un pacchetto.
pt_br: A definição do pacote do kernel @code{linux-libre} é na verdade um procedimento que cria um pacote.
sk: Balík jadra @code{linux-libre} je vlastne funkcia tvoriaca balík.

source: (define* (make-linux-libre* version gnu-revision source supported-systems #:key (extra-version #f) ;; A function that takes an arch and a variant. ;; See kernel-config for an example. (configuration-file #f) (defconfig "defconfig") (extra-options (default-extra-linux-options version))) ...)
es: (define* (make-linux-libre* version gnu-revision source supported-systems #:key (extra-version #f) ;; Una función que toma un arco y una variante. ;; Consulte kernel-config para ver un ejemplo. (configuration-file #f) (defconfig "defconfig") (extra-options (default-extra-linux-options version))) ...)
it: (define* (make-linux-libre* version gnu-revision source supported-systems #:key (extra-version #f) ;; Una funzione che accetta un'architettura e una variante. ;; Vedi kernel-config per un esempio. (configuration-file #f) (defconfig "defconfig") (extra-options (default-extra-linux-options version))) ...)
pt_br: (define* (make-linux-libre* versão gnu-revision fonte sistemas-suportados #:key (extra-version #f) ;; Uma função que pega um arch e uma variante. ;; Veja kernel-config para um exemplo. (configuration-file #f) (defconfig "defconfig") (extra-options %default-extra-linux-options)) ...)
sk: (define* (make-linux-libre* version gnu-revision source supported-systems #:key (extra-version #f) ;; Funkcia vyžadujúca označenie a druh architektúry. ;; Viď príklad v kernel-config. (configuration-file #f) (defconfig "defconfig") (extra-options (default-extra-linux-options version))) ...)

source: The current @code{linux-libre} package is for the 5.15.x series, and is declared like this:
es: El paquete @code{linux-libre} actual es para la serie 5.15.x, y se declara así:
it: L'attuale pacchetto @code{linux-libre} è per la serie 5.15.x, ed è dichiarato così:
pt_br: O pacote @code{linux-libre} atual é para a série 5.15.x e é declarado assim:
sk: Terajší balík @code{linux-libre} pre vydania 5.15.x je zadaný nasledovne:

source: Any keys which are not assigned values inherit their default value from the @code{make-linux-libre} definition. When comparing the two snippets above, notice the code comment that refers to @code{#:configuration-file}. Because of this, it is not actually easy to include a custom kernel configuration from the definition, but don't worry, there are other ways to work with what we do have.
es: Cualquier clave a la que no se le asignen valores hereda su valor por defecto de la definición @code{make-linux-libre}. Al comparar los dos fragmentos anteriores, observe el comentario de código que hace referencia a @code{#:configuration-file}. Debido a esto, en realidad no es fácil incluir una configuración personalizada del kernel desde la definición, pero no te preocupes, hay otras maneras de trabajar con lo que tenemos.
it: Qualsiasi chiave a cui non sono stati assegnati valori eredita il loro valore predefinito dalla definizione @code{make-linux-libre}. Confrontando i due snippet sopra, nota il commento al codice che si riferisce a @code{#:configuration-file}. A causa di ciò, non è effettivamente facile includere una configurazione personalizzata del kernel dalla definizione, ma non preoccuparti, ci sono altri modi per lavorare con ciò che abbiamo.
pt_br: Quaisquer chaves às quais não sejam atribuídos valores herdam seu valor padrão da definição @code{make-linux-libre}. Ao comparar os dois trechos acima, observe o comentário do código que se refere a @code{#:configuration-file}. Por causa disso, não é realmente fácil incluir uma configuração de kernel personalizada na definição, mas não se preocupe, existem outras maneiras de trabalhar com o que temos.
sk: Kľúče, ktoré nemajú pridelenú hodnotu dedia ich predvolenú hodnotu zo zadania @code{make-linux-libre}. Pri porovnávaní vyššie uvedených úryvkov zdrojového kódu si všimnite komentár odvolávajúci sa na @code{#:configuration-file}. Kvôli tomu vlastne nie je jednoduché zahrnúť do zadania svoje vlastné nastavenie jadra, ale nezúfajte, pretože jestvujú ďalšie spôsoby ako pracovať s tým čo máme.

source: There are two ways to create a kernel with a custom kernel configuration. The first is to provide a standard @file{defconfig} to @code{customize-linux} procedure. To produce such file you need to obtain Linux source code, create a @file{.config} file (using @code{make menuconfig} command, for example) or provide one you already have. After that you will need to run @code{make savedefconfig} command within the kernel source tree---this will produce the @file{defconfig} file which we will use to build a custom kernel.
it: Ci sono due modi per creare un kernel con una configurazione kernel personalizzata. Il primo è fornire un @file{defconfig} standard alla procedura @code{customize-linux}. Per produrre tale file è necessario ottenere il codice sorgente Linux, creare un file @file{.config} (usando il comando @code{make menuconfig}, ad esempio) o fornirne uno che già si possiede. Dopodiché sarà necessario eseguire il comando @code{make savedefconfig} all'interno dell'albero sorgente del kernel --- questo produrrà il file @file{defconfig} che useremo per compilare un kernel personalizzato.

source: Below is a sample kernel package.
es: A continuación se muestra un paquete de núcleo de muestra.
it: Di seguito è riportato un esempio di pacchetto kernel.
pt_br: Abaixo temos um pacote de kernel de exemplo.

source: In the same directory as the file defining @code{my-linux-libre} is a file named @file{defconfig}. This way you can provide kernel options you want to have in the result kernel.
es: En el mismo directorio que el fichero que define @code{my-linux-libre} hay un fichero llamado @file{defconfig}. De esta manera usted puede proporcionar opciones del kernel que desea tener en el kernel resultante.
it: Nella stessa directory del file che definisce @code{my-linux-libre} c'è un file chiamato @file{defconfig}. In questo modo puoi fornire le opzioni del kernel che desideri nel kernel risultante.

source: The second way to create a custom kernel is to pass a new value to the @code{extra-options} keyword of the @code{make-linux-libre} procedure. The @code{extra-options} keyword works with another function defined right below it:
es: La segunda forma de crear un núcleo personalizado es pasar un nuevo valor a la palabra clave @code{extra-options} del procedimiento @code{make-linux-libre}. La palabra clave @code{extra-options} trabaja con otra función definida justo debajo de ella:
it: Il secondo modo per creare un kernel personalizzato è passare un nuovo valore alla parola chiave @code{extra-options} della procedura @code{make-linux-libre}. La parola chiave @code{extra-options} funziona con un'altra funzione definita subito sotto:
pt_br: A segunda maneira de criar um kernel customizado é passar um novo valor para a palavra-chave @code{extra-options} do procedimento @code{make-linux-libre}. A palavra-chave @code{extra-options} funciona com outra função definida logo abaixo dela:
sk: Druhý spôsob ako vytvoriť vlastné jadro je dať novú hodnotu kľúčovému slovu @code{extra-options} funkcie @code{make-linux-libre}. Kľúčové slovo @code{extra-options} funguje s inou funkciou zadanou nižšie:

source: (define (default-extra-linux-options version) `(;; https://lists.gnu.org/archive/html/guix-devel/2014-04/msg00039.html ("CONFIG_DEVPTS_MULTIPLE_INSTANCES" . #true) ;; Modules required for initrd: ("CONFIG_NET_9P" . m) ("CONFIG_NET_9P_VIRTIO" . m) ("CONFIG_VIRTIO_BLK" . m) ("CONFIG_VIRTIO_NET" . m) ("CONFIG_VIRTIO_PCI" . m) ("CONFIG_VIRTIO_BALLOON" . m) ("CONFIG_VIRTIO_MMIO" . m) ("CONFIG_FUSE_FS" . m) ("CONFIG_CIFS" . m) ("CONFIG_9P_FS" . m)))
es: (define (default-extra-linux-options version) `(;; https://lists.gnu.org/archive/html/guix-devel/2014-04/msg00039.html ("CONFIG_DEVPTS_MULTIPLE_INSTANCES" . #true) ;; Módulos necesarios para initrd: ("CONFIG_NET_9P" . m) ("CONFIG_NET_9P_VIRTIO" . m) ("CONFIG_VIRTIO_BLK" . m) ("CONFIG_VIRTIO_NET" . m) ("CONFIG_VIRTIO_PCI" . m) ("CONFIG_VIRTIO_BALLOON" . m) ("CONFIG_VIRTIO_MMIO" . m) ("CONFIG_FUSE_FS" . m) ("CONFIG_CIFS" . m) ("CONFIG_9P_FS" . m)))
it: (define (default-extra-linux-options version) `(;; https://lists.gnu.org/archive/html/guix-devel/2014-04/msg00039.html ("CONFIG_DEVPTS_MULTIPLE_INSTANCES" . #true) ;; Moduli richiesti per initrd: ("CONFIG_NET_9P" . m) ("CONFIG_NET_9P_VIRTIO" . m) ("CONFIG_VIRTIO_BLK" . m) ("CONFIG_VIRTIO_NET" . m) ("CONFIG_VIRTIO_PCI" . m) ("CONFIG_VIRTIO_BALLOON" . m) ("CONFIG_VIRTIO_MMIO" . m) ("CONFIG_FUSE_FS" . m) ("CONFIG_CIFS" . m) ("CONFIG_9P_FS" . m)))
pt_br: (define %default-extra-linux-options `(;; https://lists.gnu.org/archive/html/guix-devel/2014-04/msg00039.html ("CONFIG_DEVPTS_MULTIPLE_INSTANCES" . #true) ;; Modules required for initrd: ("CONFIG_NET_9P" . m) ("CONFIG_NET_9P_VIRTIO" . m) ("CONFIG_VIRTIO_BLK" . m) ("CONFIG_VIRTIO_NET" . m) ("CONFIG_VIRTIO_PCI" . m) ("CONFIG_VIRTIO_BALLOON" . m) ("CONFIG_VIRTIO_MMIO" . m) ("CONFIG_FUSE_FS" . m) ("CONFIG_CIFS" . m) ("CONFIG_9P_FS" . m)))
sk: (define (default-extra-linux-options version) `(;; https://lists.gnu.org/archive/html/guix-devel/2014-04/msg00039.html ("CONFIG_DEVPTS_MULTIPLE_INSTANCES" . #true) ;; Moduly potrebné pre initrd: ("CONFIG_NET_9P" . m) ("CONFIG_NET_9P_VIRTIO" . m) ("CONFIG_VIRTIO_BLK" . m) ("CONFIG_VIRTIO_NET" . m) ("CONFIG_VIRTIO_PCI" . m) ("CONFIG_VIRTIO_BALLOON" . m) ("CONFIG_VIRTIO_MMIO" . m) ("CONFIG_FUSE_FS" . m) ("CONFIG_CIFS" . m) ("CONFIG_9P_FS" . m)))

source: And in the custom configure script from the `make-linux-libre` package:
es: Y en el script de configuración personalizado del paquete `make-linux-libre`:
it: E nello script di configurazione personalizzato del pacchetto `make-linux-libre`:
pt_br: E no script de configuração personalizado do pacote `make-linux-libre`:
sk: A vo vlastnom „configure“ skripte balíka „make-linux-libre“:
