Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: You can find out @var{ISSUE_NUMBER} either by searching on the mumi interface at @url{https://issues.guix.gnu.org} for the name of your patch or reading the acknowledgement email sent automatically by Debbugs in reply to incoming bugs and patches, which contains the bug number.
it: Puoi scoprire @var{ISSUE_NUMBER} cercando l'interfaccia mumi su @url{https://issues.guix.gnu.org} per il nome della tua patch o leggendo l'email di conferma inviata automaticamente da Debbugs in risposta a bug e patch in arrivo, che contiene il numero del bug.
pt_br: Você pode descobrir @var{NÚMERO_DE_ISSÃO} pesquisando na interface do mumi em @url{https://issues.guix.gnu.org} pelo nome do seu patch ou lendo o e-mail de confirmação enviado automaticamente pelo Debbugs em resposta a bugs e patches recebidos, que contém o número do bug.

source: Notifying Teams
it: Notifica ai Team
pt_br: Notificando equipes

source: teams
it: team
pt_br: equipes

source: If your git checkout has been correctly configured (@pxref{Configuring Git}), the @command{git send-email} command will automatically notify the appropriate team members, based on the scope of your changes. This relies on the @file{etc/teams.scm} script, which can also be invoked manually if you do not use the preferred @command{git send-email} command to submit patches. To list the available actions of the script, you can invoke it via the @command{etc/teams.scm help} command. For more information regarding teams, @pxref{Teams}.
it: Se il tuo checkout git è stato configurato correttamente (@pxref{Configuring Git}), il comando @command{git send-email} notificherà automaticamente i membri del team appropriati, in base all'ambito delle tue modifiche. Questo si basa sullo script @file{etc/teams.scm}, che può essere invocato manualmente se non usi il comando preferito @command{git send-email} per inviare patch. Per elencare le azioni disponibili dello script, puoi invocarlo tramite il comando @command{etc/teams.scm help}. Per ulteriori informazioni sui team, @pxref{Teams}.
pt_br: Se o seu git checkout tiver sido configurado corretamente (@pxref{Configuring Git}), o comando @command{git send-email} notificará automaticamente os membros apropriados da equipe, com base no escopo das suas alterações. Isso depende do script @file{etc/teams.scm}, que também pode ser invocado manualmente se você não usar o comando @command{git send-email} preferencial para enviar patches. Para listar as ações disponíveis do script, você pode invocá-lo por meio do comando @command{etc/teams.scm help}. Para obter mais informações sobre equipes, @pxref{Teams}.

source: On foreign distros, you might have to use @command{./pre-inst-env git send-email} for @file{etc/teams.scm} to work.
it: Su distribuzioni esterne, potresti dover usare @command{./pre-inst-env git send-email} per far funzionare @file{etc/teams.scm}.
pt_br: Em distros estrangeiras, talvez seja necessário usar @command{./pre-inst-env git send-email} para que @file{etc/teams.scm} funcione.

source: Multiple Patches
pt_br: Vários Patches

source: cover letter
it: lettera di accompagnamento
pt_br: carta de apresentação

source: While @command{git send-email} alone will suffice for a single patch, an unfortunate flaw in Debbugs means you need to be more careful when sending multiple patches: if you send them all to the @email{guix-patches@@gnu.org} address, a new issue will be created for each patch!
it: Mentre @command{git send-email} da solo è sufficiente per una patch singola, un difetto sfortunato in Debbugs significa che devi essere più attento quando invii più patch: se le invii tutte all'indirizzo @email{guix-patches@@gnu.org}, verrà creato un nuovo issue per ogni patch!
pt_br: Embora @command{git send-email} sozinho seja suficiente para um único patch, uma falha infeliz no Debbugs significa que você precisa ter mais cuidado ao enviar vários patches: se você enviá-los todos para o endereço @email{guix-patches@@gnu.org}, um novo problema será criado para cada patch!

source: When sending a series of patches, it's best to send a Git ``cover letter'' first, to give reviewers an overview of the patch series. We can create a directory called @file{outgoing} containing both our patch series and a cover letter called @file{0000-cover-letter.patch} with @command{git format-patch}.
it: Quando invii una serie di patch, è meglio inviare prima una ``lettera di accompagnamento'' di Git, per dare ai revisori una panoramica della serie di patch. Possiamo creare una directory chiamata @file{outgoing} contenente sia la nostra serie di patch che una lettera di accompagnamento chiamata @file{0000-cover-letter.patch} con @command{git format-patch}.
pt_br: Ao enviar uma série de patches, é melhor enviar uma ``carta de apresentação'' do Git primeiro, para dar aos revisores uma visão geral da série de patches. Podemos criar um diretório chamado @file{outgoing} contendo nossa série de patches e uma carta de apresentação chamada @file{0000-cover-letter.patch} com @command{git format-patch}.

source: $ git format-patch -@var{NUMBER_COMMITS} -o outgoing \ --cover-letter
pt_br: $ git format-patch -@var{NÚMERO_COMMITS} -o outgoing \ --cover-letter --base=auto

source: @code{git format-patch} accepts a wide range of @uref{https://git-scm.com/docs/gitrevisions, revision range} specifiers. For example, if you are working in a branch, you could select all commits in your branch starting at @code{master}.
it: @code{git format-patch} accetta una vasta gamma di specificatori di @uref{https://git-scm.com/docs/gitrevisions, intervallo di revisione}. Ad esempio, se stai lavorando in un ramo, potresti selezionare tutti i commit nel tuo ramo a partire da @code{master}.
pt_br: @code{git format-patch} aceita uma ampla variedade de especificadores de @uref{https://git-scm.com/docs/gitrevisions, intervalo de revisão}. Por exemplo, se você estiver trabalhando em um ramo, poderá selecionar todos os commits em seu ramo começando em @code{master}.

source: $ git format-patch master..@var{MY_BRANCH} -o outgoing \ --cover-letter
pt_br: $ git format-patch master..@var{MEU_RAMO} -o outgoing \ --cover-letter

source: We can now send @emph{just} the cover letter to the @email{guix-patches@@gnu.org} address, which will create an issue that we can send the rest of the patches to.
it: Ora possiamo inviare @emph{solo} la lettera di accompagnamento all'indirizzo @email{guix-patches@@gnu.org}, che creerà un issue a cui possiamo inviare il resto delle patch.
pt_br: Agora podemos enviar @emph{apenas} a carta de apresentação para o endereço @email{guix-patches@@gnu.org}, o que criará um problema para o qual podemos enviar o restante dos patches.

source: $ git send-email outgoing/0000-cover-letter.patch --annotate $ rm outgoing/0000-cover-letter.patch # we don't want to resend it!
it: $ git send-email outgoing/0000-cover-letter.patch --annotate $ rm outgoing/0000-cover-letter.patch # non vogliamo reinviarla!
pt_br: $ git send-email outgoing/0000-cover-letter.patch --annotate $ rm outgoing/0000-cover-letter.patch # não queremos reenviar isso.

source: Ensure you edit the email to add an appropriate subject line and blurb before sending it. Note the automatically generated shortlog and diffstat below the blurb.
it: Assicurati di modificare l'email per aggiungere un oggetto appropriato e una breve descrizione prima di inviarla. Nota il shortlog e il diffstat generati automaticamente sotto la descrizione.
pt_br: Certifique-se de editar o e-mail para adicionar uma linha de assunto e um resumo apropriados antes de enviá-lo. Observe o shortlog e o diffstat gerados automaticamente abaixo do resumo.

source: Once the Debbugs mailer has replied to your cover letter email, you can send the actual patches to the newly-created issue address.
it: Dopo che il mailer Debbugs ha risposto alla tua email di lettera di accompagnamento, puoi inviare le patch effettive al nuovo indirizzo issue creato.
pt_br: Depois que o remetente do Debbugs responder ao seu e-mail de carta de apresentação, você poderá enviar os patches reais para o endereço do problema recém-criado.

source: $ git send-email outgoing/*.patch --to=@var{ISSUE_NUMBER}@@debbugs.gnu.org $ rm -rf outgoing # we don't need these anymore
it: $ git send-email outgoing/*.patch --to=@var{ISSUE_NUMBER}@@debbugs.gnu.org $ rm -rf outgoing # non ci servono più
pt_br: $ git send-email outgoing/*.patch --to=@var{NÚMERO_DE_ISSÃO}@@debbugs.gnu.org $ rm -rf outgoing # we don't need these anymore

source: Thankfully, this @command{git format-patch} dance is not necessary to send an amended patch series, since an issue already exists for the patchset.
it: Fortunatamente, questa danza di @command{git format-patch} non è necessaria per inviare una serie di patch modificata, poiché esiste già un issue per il set di patch.
pt_br: Felizmente, essa dança @command{git format-patch} não é necessária para enviar uma série de patches corrigida, pois já existe um problema para o conjunto de patches.

source: $ git send-email -@var{NUMBER_COMMITS} -v@var{REVISION} \ --to=@var{ISSUE_NUMBER}@@debbugs.gnu.org
pt_br: $ git send-email -@var{NÚMERO_COMMITS} -v@var{REVISÃO} \ --to=@var{NÚMERO_DE_ISSÃO}@@debbugs.gnu.org

source: If need be, you may use @option{--cover-letter --annotate} to send another cover letter, e.g. for explaining what's changed since the last revision, and why these changes are necessary.
it: Se necessario, puoi usare @option{--cover-letter --annotate} per inviare un'altra lettera di accompagnamento, ad esempio per spiegare cosa è cambiato dall'ultima revisione e perché questi cambiamenti sono necessari.
pt_br: Se necessário, você pode usar @option{--cover-letter --annotate} para enviar outra carta de apresentação, por exemplo, para explicar o que mudou desde a última revisão e por que essas mudanças são necessárias.

source: This section describes how the Guix project tracks its bug reports, patch submissions and topic branches.
it: Questa sezione descrive come il progetto Guix tiene traccia dei report di bug, delle sottomissioni di patch e dei rami tematici.
pt_br: Esta seção descreve como o projeto Guix rastreia seus relatórios de bugs, envios de patches e ramificações de tópicos.

source: The Issue Tracker
it: Il Tracker degli Issue
pt_br: O rastreador de problemas

source: The official bug and patch tracker.
it: Il tracker ufficiale di bug e patch.
pt_br: O rastreador oficial de bugs e patches.

source: Managing Patches and Branches
it: Gestione di Patch e Rami
pt_br: Gerenciando Patches e Branches

source: How changes to Guix are managed.
it: Come vengono gestite le modifiche a Guix.
pt_br: Como as alterações no Guix são gerenciadas.

source: Debbugs User Interfaces
it: Interfacce Utente di Debbugs
pt_br: Interfaces de usuário do Debbugs

source: Ways to interact with Debbugs.
it: Modi per interagire con Debbugs.
pt_br: Maneiras de interagir com Debbugs.

source: Debbugs Usertags
it: Usertags di Debbugs
pt_br: Debbugs Marcadores de usuário

source: Tag reports with custom labels.
it: Etichettare i report con etichette personalizzate.
pt_br: Marque relatórios com rótulos personalizados.

source: Cuirass Build Notifications
it: Notifiche di Build di Cuirass
pt_br: Notificações de construção de Cuirass

source: Be alerted of any breakage via RSS feeds.
it: Essere avvisati di qualsiasi interruzione tramite feed RSS.
pt_br: Seja alertado sobre qualquer quebra via feeds RSS.

source: bug reports, tracking
it: report di bug, tracciamento
pt_br: relatórios de bugs, rastreamento

source: patch submissions, tracking
it: sottomissioni di patch, tracciamento
pt_br: envios de patches, rastreamento

source: issue tracking
it: tracciamento degli issue
pt_br: rastreamento de problemas

source: Debbugs, issue tracking system
it: Debbugs, sistema di tracciamento degli issue
pt_br: Debbugs, sistema de rastreamento de problemas

source: Bug reports (@dfn{issues}) and patch submissions (@dfn{pull requests}) are currently tracked at the @uref{https://codeberg.org/guix/guix, project's home at Codeberg}.
it: Le segnalazioni di bug (@dfn{issues}) e l'invio di patch (@dfn{pull request}) sono attualmente tracciate sulla @uref{https://codeberg.org/guix/guix, pagina del progetto su Codeberg}.
pt_br: Submissão de bugs (@dfn{issues}) e envios de patches (@dfn{pull requests}) são atualmente monitorados no @uref{https://codeberg.org/guix/guix, a página inicial do projeto no Codeberg}.

source: Before May 25th, 2025, bug reports and patches were exclusively tracked using the Debbugs instance at @uref{https://bugs.gnu.org}; it may still be used for these purposes until December 31st, 2025, after which Codeberg will become the sole option to report new bugs and propose new changes@footnote{Check out @uref{https://codeberg.org/guix/guix-consensus-documents/src/branch/main/002-codeberg.md, Guix Consensus Document 002} for details on this decision.}. With Debbugs, bug reports are sent by email to @email{bug-guix@@gnu.org} and patches are sent to @email{guix-patches@@gnu.org} (@pxref{Submitting Patches}).
it: Prima del 25 maggio 2025, le segnalazioni di bug e le patch erano tracciate esclusivamente utilizzando l'istanza Debbugs su @uref{https://bugs.gnu.org}; potrà ancora essere utilizzata per questi scopi fino al 31 dicembre 2025, dopodiché Codeberg diventerà l'unica opzione per segnalare nuovi bug e proporre nuove modifiche@footnote{Consulta il @uref{https://codeberg.org/guix/guix-consensus-documents/src/branch/main/002-codeberg.md, Documento di Consenso Guix 002} per i dettagli su questa decisione.}. Con Debbugs, le segnalazioni di bug vengono inviate via email a @email{bug-guix@@gnu.org} e le patch a @email{guix-patches@@gnu.org} (@pxref{Submitting Patches}).
pt_br: Antes de 25 de maio de 2025, relatórios de bugs e patches eram rastreados exclusivamente usando a instância Debbugs em @uref{https://bugs.gnu.org}; ela ainda poderá ser usada para esses propósitos até 31 de dezembro de 2025, quando o Codeberg se tornará a única opção para relatar novos bugs e propor novas alterações. @footnote {Veja @uref{https://codeberg.org/guix/guix-consensus-documents/src/branch/main/002-codeberg.md, Documento de Consenso Guix 002} para obter detalhes sobre esta decisão.} Com o Debbugs, os relatórios de bugs são enviados por e-mail para @email{bug-guix@@gnu.org} e os patches são enviados para @email{guix-patches@@gnu.org} (@pxref{Submitting Patches}).

source: branching strategy
it: strategia di branching
pt_br: estratégia de ramificação

source: rebuild scheduling strategy
it: strategia di pianificazione delle ricostruzioni
pt_br: estratégia de agendamento de recompilação

source: Submitted patches are picked up and tested by the quality assurance service; the result of that testing eventually shows up on the dashboard at @indicateurl{https://qa.guix.gnu.org/issue/@var{ISSUE_NUMBER}}, where @var{ISSUE_NUMBER} is the number assigned by the issue tracker, currently Debbugs (work is in progress to support Codeberg pull requests). Leave time for a review, without committing anything.
it: Le patch inviate vengono raccolte e testate dal servizio di assicurazione qualità; il risultato di questi test appare infine sulla dashboard all'indirizzo @indicateurl{https://qa.guix.gnu.org/issue/@var{ISSUE_NUMBER}}, dove @var{ISSUE_NUMBER} è il numero assegnato dal sistema di tracciamento dei problemi, attualmente Debbugs (è in corso il lavoro per supportare le pull request di Codeberg). Lascia tempo per una revisione, senza fare commit di nulla.
pt_br: Patches submetidos são coletados e testados pelo serviço de garantia de qualidade; o resultado desse teste eventualmente aparece no painel em @indicateurl{https://qa.guix.gnu.org/issue/@var{NÚMERO_DE_ISSÃO}}, onde @var{NÚMERO_DE_ISSÃO} é o número atribuído pelo rastreador de problemas, que atualmente é o Debbugs (estamos trabalhando para dar suporte á pull requests via Codeberg). Reserve um tempo para uma revisão, sem comprometer nada.

source: As an exception, some changes considered ``trivial'' or ``obvious'' may be pushed directly to the @code{master} branch. This includes changes to fix typos and reverting commits that caused immediate problems. This is subject to being adjusted, allowing individuals to commit directly on non-controversial changes on parts they’re familiar with.
it: Come eccezione, alcune modifiche considerate ``banali'' o ``ovvie'' possono essere inviate direttamente al ramo @code{master}. Questo include modifiche per correggere refusi e revert di commit che hanno causato problemi immediati. Questo è soggetto a modifiche, consentendo agli individui di effettuare commit direttamente su modifiche non controverse in parti con cui hanno familiarità.
pt_br: Como exceção, algumas mudanças consideradas ``triviais'' ou ``óbvias'' podem ser enviadas diretamente para o branch @code{master}. Isso inclui mudanças para corrigir erros de digitação e reverter commits que causaram problemas imediatos. Isso está sujeito a ajustes, permitindo que indivíduos se comprometam diretamente com mudanças não controversas em partes com as quais estão familiarizados.

source: Changes which affect more than 300 dependent packages (@pxref{Invoking guix refresh}) should first be pushed to a topic branch other than @code{master}; the set of changes should be consistent---e.g., ``GNOME update'', ``NumPy update'', etc. This allows for testing: the branch will automatically show up at @indicateurl{https://qa.guix.gnu.org/branch/@var{branch}}, with an indication of its build status on various platforms.
it: Le modifiche che interessano più di 300 pacchetti dipendenti (@pxref{Invoking guix refresh}) dovrebbero prima essere inviate a un ramo tematico diverso da @code{master}; l'insieme delle modifiche dovrebbe essere coerente---ad esempio, ``Aggiornamento GNOME'', ``Aggiornamento NumPy'', ecc. Ciò consente di testare: il ramo apparirà automaticamente su @indicateurl{https://qa.guix.gnu.org/branch/@var{branch}}, con un'indicazione del suo stato di build su varie piattaforme.
pt_br: Alterações que afetam mais de 300 pacotes dependentes (@pxref{Invoking guix refresh}) devem primeiro ser enviadas para um branch de tópico diferente de @code{master}; o conjunto de alterações deve ser consistente, por exemplo, ``GNOME update'', ``NumPy update'', etc. Isso permite testes: o branch aparecerá automaticamente em @indicateurl{https://qa.guix.gnu.org/branch/@var{branch}}, com uma indicação de seu status de compilação em várias plataformas.

source: feature branches, coordination
it: rami di funzionalità, coordinamento
pt_br: ramos de recursos, coordenação

source: To help coordinate the merging of branches, you must create a new guix-patches issue each time you create a branch (@pxref{The Issue Tracker}). The title of the issue requesting to merge a branch should have the following format:
it: Per aiutare a coordinare la fusione dei rami, devi creare un nuovo issue guix-patches ogni volta che crei un ramo (@pxref{The Issue Tracker}). Il titolo dell'issue che richiede di unire un ramo dovrebbe avere il seguente formato:
pt_br: Para ajudar a coordenar a fusão de branches, você deve criar um novo problema guix-patches sempre que criar um branch (@pxref{The Issue Tracker}). O título do problema que solicita a fusão de um branch deve ter o seguinte formato:

source: merge requests, template
it: richieste di merge, modello
pt_br: solicitações de mesclagem, modelo

source: Request for merging "@var{name}" branch
it: Richiesta di unione del ramo "@var{name}"
pt_br: Solicitação de mesclagem do branch "@var{name}"

source: The @url{https://qa.guix.gnu.org/, QA infrastructure} recognizes such issues and lists the merge requests on its main page. The following points apply to managing these branches:
it: L'infrastruttura QA @url{https://qa.guix.gnu.org/} riconosce tali issue ed elenca le richieste di merge nella sua pagina principale. I seguenti punti si applicano alla gestione di questi rami:
pt_br: O @url{https://qa.guix.gnu.org/, infraestrutura de QA} reconhece tais problemas e lista as solicitações de mesclagem em sua página principal. Os seguintes pontos se aplicam ao gerenciamento dessas ramificações:

source: The commits on the branch should be a combination of the patches relevant to the branch. Patches not related to the topic of the branch should go elsewhere.
it: I commit sul ramo dovrebbero essere una combinazione delle patch rilevanti per il ramo. Le patch non correlate all'argomento del ramo dovrebbero andare altrove.
pt_br: Os commits no branch devem ser uma combinação dos patches relevantes para o branch. Patches não relacionados ao tópico do branch devem ir para outro lugar.

source: Any changes that can be made on the master branch, should be made on the master branch. If a commit can be split to apply part of the changes on master, this is good to do.
it: Qualsiasi modifica che può essere fatta sul ramo master, dovrebbe essere fatta sul ramo master. Se un commit può essere suddiviso per applicare parte delle modifiche su master, è bene farlo.
pt_br: Quaisquer alterações que possam ser feitas no branch master, devem ser feitas no branch master. Se um commit puder ser dividido para aplicar parte das alterações no master, isso é bom de se fazer.

source: It should be possible to re-create the branch by starting from master and applying the relevant patches.
it: Dovrebbe essere possibile ricreare il ramo partendo da master e applicando le patch rilevanti.
pt_br: Deve ser possível recriar a ramificação iniciando pelo master e aplicando os patches relevantes.

source: Avoid merging master in to the branch. Prefer rebasing or re-creating the branch on top of an updated master revision.
it: Evita di unire master nel ramo. Preferisci il rebasing o la ricreazione del ramo sopra una revisione master aggiornata.
pt_br: Evite mesclar o master no branch. Prefira rebasear ou recriar o branch em cima de uma revisão master atualizada.

source: Minimise the changes on master that are missing on the branch prior to merging the branch in to master. This means that the state of the branch better reflects the state of master should the branch be merged.
it: Minimizza le modifiche su master che mancano sul ramo prima di unire il ramo in master. Ciò significa che lo stato del ramo riflette meglio lo stato di master nel caso in cui il ramo venga unito.
pt_br: Minimize as alterações no master que estão faltando no branch antes de mesclar o branch no master. Isso significa que o estado do branch reflete melhor o estado do master caso o branch seja mesclado.

source: If you don't have commit access, create the ``Request for merging'' issue and request that someone creates the branch. Include a list of issues/patches to include on the branch.
it: Se non hai accesso in commit, crea l'issue ``Richiesta di unione'' e richiedi che qualcuno crei il ramo. Includi un elenco di issue/patch da includere nel ramo.
pt_br: Se você não tiver acesso de commit, crie o issue ``Request for merging'' e solicite que alguém crie o branch. Inclua uma lista de issues/patches para incluir no branch.
