Repository: Millak/guix
Catalog: po/doc/guix-cookbook.*.po
Languages: es, it, pt_br, ru, sk, sv

source: The project name. Using Scheme conventions, we prefer to keep it lower case, without underscore and using dash-separated words.
es: El nombre del proyecto. Utilizando convenciones de Scheme, preferimos conservarlo en minúsculas, son puntuación y utilizando palabras con guion separado.
it: Il nome del progetto. Usando le convenzioni di Scheme, preferiamo mantenerlo in minuscolo, senza trattini bassi e usando parole separate da trattini.
pt_br: O nome do projeto. Usando as convenções do Scheme, preferimos mantê-lo em minúsculas, sem sublinhado e usando palavras separadas por traços.
sk: Názov projektu. Podľa všeobecných zvyklostí ho zapisujeme malými písmenami, bez podčiarkovníkov a s použitím pomlčiek na oddelenie jednotlivých slov.

source: This field contains a description of the source code origin. The @code{origin} record contains these fields:
es: Este campo contiene una descripción del origen del código fuente. El registro @code{origin} contiene estos campos:
it: Questo campo contiene una descrizione dell'origine del codice sorgente. Il record @code{origin} contiene questi campi:
pt_br: Este campo contém uma descrição da origem do código-fonte. O registro @code{origin} contém estes campos:
sk: Toto pole obsahuje popis pôvodu zdrojového kódu. Záznam @code{origin} obsahuje tieto polia:
sv: Det här fältet innehåller en beskrivning av ursprunget till källkoden. The @code{origin} record contains these fields:

source: The method, here @code{url-fetch} to download via HTTP/FTP, but other methods
es: El método, aquí @code{url-fetch} para descargar vía HTTP/FTP, pero otros métodos
it: Il metodo, qui @code{url-fetch} per scaricare via HTTP/FTP, ma altri metodi
pt_br: O método, aqui @code{url-fetch} para download via HTTP/FTP, mas outros métodos
sk: Spôsob, v tomto prípade @code{url-fetch} pre stiahnutie prostredníctvom HTTP/FTP, ale poznáme

source: exist, such as @code{git-fetch} for Git repositories.
es: existen, tal como @code{git-fetch} para repositorios Git.
it: esistono, come @code{git-fetch} per i repository Git.
pt_br: existem, como @code{git-fetch} para repositórios Git.
sk: aj iné spôsoby, ako napr. @code{git-fetch} pre Git repozitáre.

source: The URI, which is typically some @code{https://} location for @code{url-fetch}. Here
es: La URL, la cual es típicamente algún lugar @code{https://} para @code{url-fetch}. Aquí
it: L'URI, che è tipicamente una posizione @code{https://} per @code{url-fetch}. Qui
pt_br: O URI, que normalmente é alguma @code{https://} localização para @code{url-fetch}. Aqui
sk: Prepojenie (URI), čo obyčajne predstavuje nejaké umiestnenie @code{https://} pre @code{url-fetch}. V tomto prípade

source: the special `mirror://gnu` refers to a set of well known locations, all of which can be used by Guix to fetch the source, should some of them fail.
es: el especial `mirror://gnu` refiere a un conjunto de lugares bien conocidos, todo los cuales puden ser utilzados por Guix para obtener la fuente, fallarían algunos de ellos.
it: lo speciale `mirror://gnu` si riferisce a un insieme di posizioni note, tutte utilizzabili da Guix per recuperare il sorgente, nel caso in cui alcune di esse fallissero.
pt_br: o especial `mirror://gnu` refere-se a um conjunto de locais bem conhecidos, todos os quais podem ser usados pelo Guix para buscar a fonte, caso alguns deles falhem.
sk: zvláštne „mirror://gnu“ odkazuje na súbor dobre známych umiestnení, ktoré môžu byť všetky použité na získanie zdrojového kódu ak by niektoré z nich nebolo dostupné.

source: The @code{sha256} checksum of the requested file. This is essential to ensure
es: El checksum @code{sha256} del archivo solicitado. Esto es esencial para asegurar
it: La somma di controllo @code{sha256} del file richiesto. Questo è essenziale per garantire
pt_br: A soma de verificação @code{sha256} do arquivo solicitado. Isto é essencial para garantir
sk: Kontrolný súčet @code{sha256} požadovaného súboru. Je dôležitý pre zaistenie

source: the source is not corrupted. Note that Guix works with base32 strings, hence the call to the @code{base32} function.
es: la fuente no está corrompida. Note que Guix funciona con cadenas de base32, por tanto la invocación para la función @code{base32}.
it: che il sorgente non sia corrotto. Notare che Guix lavora con stringhe base32, da cui la chiamata alla funzione @code{base32}.
pt_br: que a fonte não está corrompida. Observe que o Guix funciona com strings base32, daí a chamada para a função @code{base32}.
sk: celistvosti zdroja. Všimnite si, že Guix pracuje z base32 reťazcami, čo vysvetľuje použitie funkcie @code{base32}.

source: This is where the power of abstraction provided by the Scheme language really shines: in this case, the @code{gnu-build-system} abstracts away the famous @code{./configure && make && make install} shell invocations. Other build systems include the @code{trivial-build-system} which does not do anything and requires from the packager to program all the build steps, the @code{python-build-system}, the @code{emacs-build-system}, and many more (@pxref{Build Systems,,, guix, GNU Guix Reference Manual}).
es: Aquí es donde el poder de abstracción proporcionado por el lenguaje Scheme realmente brilla: en este caso, el @code{gnu-build-system} abstrae las famosas invocaciones al shell @code{./configure && make && make install}. Otros sistemas de construcción incluyen el @code{trivial-build-system} que no hace nada y requiere que el empaquetador programe todos los pasos de construcción, el @code{python-build-system}, el @code{emacs-build-system}, y muchos más (@pxref{Sistemas de construcción,,, guix.es, Manual referencia de GNU Guix}).
it: È qui che il potere di astrazione fornito dal linguaggio Scheme brilla davvero: in questo caso, il @code{gnu-build-system} astrae le famose invocazioni di shell @code{./configure && make && make install}. Altri sistemi di compilazione includono il @code{trivial-build-system} che non fa nulla e richiede al manutentore del pacchetto di programmare tutti i passaggi di compilazione, il @code{python-build-system}, il @code{emacs-build-system} e molti altri (@pxref{Sistemi di build,,, guix.it, Manuale di riferimento di GNU Guix}).
pt_br: É aqui que o poder de abstração fornecido pela linguagem Scheme realmente brilha: neste caso, o @code{gnu-build-system} abstrai as famosas invocações de shell @code{./configure && make && make install}. Outros sistemas de compilação incluem o @code{trivial-build-system} que não faz nada e exige que o empacotador programe todas as etapas de compilação, o @code{python-build-system}, o @code{emacs-build- system} e muito mais (@pxref{Sistemas de compilação,,, guix.pt_BR, Manual de Referência do GNU Guix}).
sk: Práve tu má príležitosť zažiariť sila všeobecnosti jazyka Scheme: v tomto prípade, @code{gnu-build-system} je zovšeobecnenie známych príkazov shellu @code{./configure && make && make install}. Medzi ďalšie zostavovacie systémy patrí @code{trivial-build-system}, ktorý nerobí nič a necháva na programátorovi, aby zadal všetky potrebné kroky zostavenia, @code{python-build-system}, @code{emacs-build-system} a mnohé ďalšie (@pxref{Build Systems,,, guix, GNU Guix Reference Manual}).

source: It should be a concise summary of what the package does. For many packages a tagline from the project's home page can be used as the synopsis.
es: Sería un sumario conciso de que el paquete hace. Para muchos paquetes un etiquetado desde la página inicial del proyecto puede ser utilizada como la sinopsis.
it: Dovrebbe essere un riassunto conciso di ciò che fa il pacchetto. Per molti pacchetti, uno slogan dalla home page del progetto può essere usato come sinossi.
pt_br: Deve ser um resumo conciso do que o pacote faz. Para muitos pacotes, uma etiqueta da página inicial do projeto pode ser usado como sinopse.
sk: Toto by mal byť súhrnný popis toho, na čo balík slúži. Pri mnohých balíkoch je vhodné použiť slogan zo stránky príslušného projektu.
sv: Det bör vara en koncis summering av vad paketet gör. För många paket kan en tagg från projektets webbsida användas som en summering.

source: Same as for the synopsis, it's fine to re-use the project description from the homepage. Note that Guix uses Texinfo syntax.
es: Lo mismo que la sinopsis, es propio reutilizar la descripción del proyecto desde la página inicial. Note que Guix utiliza sintaxis Texinfo.
it: Come per la sinossi, va bene riutilizzare la descrizione del progetto dalla homepage. Notare che Guix usa la sintassi Texinfo.
pt_br: Assim como na sinopse, não há problema em reutilizar a descrição do projeto na página inicial. Observe que o Guix usa a sintaxe de Texinfo.
sk: Podobne ako v prípade súhrnného popisu je vhodné použiť popis projektu z jeho domovskej stránky. Všimnite si, že Guix používa značkovanie Texinfo.

source: Use HTTPS if available.
es: Utilizar HTTPS si está disponible.
it: Usa HTTPS se disponibile.
pt_br: Use HTTPS, se disponível.
sk: Použitie HTTPS prepojenie, ak je dostupné.
sv: Använd HTTPS om det går.

source: See @code{guix/licenses.scm} in the project source for a full list of available licenses.
es: Consulte @code{guix/licenses.scm} en la fuente del proyecto para un listado completo de licencias disponibles.
it: Vedere @code{guix/licenses.scm} nel sorgente del progetto per un elenco completo delle licenze disponibili.
pt_br: Consulte @code{guix/licenses.scm} na fonte do projeto para obter uma lista completa de licenças disponíveis.
sk: Viď @code{guix/licenses.scm} v zdrojovom kóde projektu pre zoznam všetkých dostupných licencií.
sv: Se filen @code{guix/licenses.scm} i projektkällan för en fullständig lista över tillgängliga licenser.

source: Time to build our first package! Nothing fancy here for now: we will stick to a dummy @code{my-hello}, a copy of the above declaration.
es: ¡Es el momento de construir nuestro primer paquete! Nada fantástico aquí por ahora: nos quedaremos con un maniquí @code{my-hello}, una copia de la declaración arriba.
it: È ora di compilare il nostro primo pacchetto! Niente di speciale per ora: ci atterremo a un fittizio @code{my-hello}, una copia della dichiarazione precedente.
pt_br: É hora de construir nosso primeiro pacote! Nada sofisticado aqui por enquanto: vamos nos ater a um @code{my-hello} fictício, uma cópia da declaração acima.
sk: Nastal čas na zostavenie nášho prvého balíka! Zatiaľ nič zvláštne: spoľahneme sa jednoducho na kópiu vyššie uvedeného zadania @code{my-hello}.

source: As with the ritualistic ``Hello World'' taught with most programming languages, this will possibly be the most ``manual'' approach. We will work out an ideal setup later; for now we will go the simplest route.
es: Como con el ``hola mundo`` ritualístico enseño con muchos lenguajes de programación, esto posiblemente será la aproximación más ``manual''. Funcionaremos con una configuración ideal más tarde; por ahora iremos a la rutina más simple.
it: Come per il rituale "Hello World" insegnato con la maggior parte dei linguaggi di programmazione, questo sarà probabilmente l'approccio più "manuale". Elaboreremo una configurazione ideale più tardi; per ora seguiremo la strada più semplice.
pt_br: Tal como acontece com o ritualístico ``Hello World'' ensinado com a maioria das linguagens de programação, esta será possivelmente a abordagem mais ``manual''. Trabalharemos em uma configuração ideal mais tarde; por enquanto seguiremos o caminho mais simples.
sk: Tak ako pri rituálnom „Ahoj svet“, ktorý sa vyučuje pri väčšine programovacích jazykov, toto bude ten „najručnejší“ spôsob zadávania balíka, ktorý použijete. Neskôr si ukážeme dokonalejší postup, no zatiaľ sa vyberieme tou najjednoduchšou cestou.

source: Save the following to a file @file{my-hello.scm}.
es: Guarda lo siguiente para un archivo @file{my-hello.scm}.
it: Salva quanto segue in un file @file{my-hello.scm}.
pt_br: Salve o seguinte em um arquivo @file{my-hello.scm}.
sk: Uložte nasledujúci obsah do súboru s názvom @file{my-hello.scm}.
sv: Spara det följande till en fil @file{my-hello.scm}.

source: (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hello, Guix world: An example custom Guix package") (description "GNU Hello prints the message \"Hello, world!\" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+))
es: (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Hola, mundo Guix: Un ejemplo personalizado de paquete Guix") (description "GNU Hello imprime el mensaje \"Hello, world!\" y después sale. Sirve como un ejemplo de prácticas de codificación GNU estándar. Por tanto, admite argumentos de línea de comando, múltiples lenguajes, y así el resto.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+))
it: (package (name "my-hello") (version "2.10") (source (origin (method url-fetch) (uri (string-append "mirror://gnu/hello/hello-" version ".tar.gz")) (sha256 (base32 "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i")))) (build-system gnu-build-system) (synopsis "Ciao, mondo Guix: Un esempio di pacchetto Guix personalizzato") (description "GNU Hello stampa il messaggio \"Ciao, mondo!\" e poi esce. Serve come esempio delle pratiche di codifica standard di GNU. Come tale, supporta argomenti da riga di comando, più linguaggi, e così via.") (home-page "https://www.gnu.org/software/hello/") (license gpl3+))

source: We will explain the extra code in a moment.
es: Explicaremos el código adicional en un momento.
it: Spiegheremo il codice extra tra un momento.
pt_br: Explicaremos o código extra em um momento.
sk: Dodatočné príkazy si vysvetlíme o chvíľu.
sv: Vi kommer att förklara extrakoden om ett ögonblick.

source: Feel free to play with the different values of the various fields. If you change the source, you'll need to update the checksum. Indeed, Guix refuses to build anything if the given checksum does not match the computed checksum of the source code. To obtain the correct checksum of the package declaration, we need to download the source, compute the sha256 checksum and convert it to base32.
es: Siéntete libre de jugar con los diferentes valores de los distintos campos. Si cambia el código fuente, tendrá que actualizar la suma de comprobación. De hecho, Guix se niega a construir nada si la suma de comprobación dada no coincide con la suma de comprobación calculada del código fuente. Para obtener la suma de comprobación correcta de la declaración del paquete, tenemos que descargar el código fuente, calcular la suma de comprobación sha256 y convertirla a base32.
it: Sentiti libero di giocare con i diversi valori dei vari campi. Se cambi la sorgente, dovrai aggiornare il checksum. Infatti, Guix si rifiuta di compilare qualsiasi cosa se il checksum fornito non corrisponde al checksum calcolato del codice sorgente. Per ottenere il checksum corretto della dichiarazione del pacchetto, dobbiamo scaricare la sorgente, calcolare il checksum sha256 e convertirlo in base32.
pt_br: Sinta-se à vontade para brincar com os diferentes valores dos vários campos. Se você alterar a fonte, precisará atualizar a soma de verificação. Na verdade, Guix se recusa a construir qualquer coisa se a soma de verificação fornecida não corresponder à soma de verificação calculada do código-fonte. Para obter a soma de verificação correta da declaração do pacote, precisamos baixar o código-fonte, calcular a soma de verificação sha256 e convertê-la para base32.
sk: Neváhajte a vyskúšajte si, čo sa stane ak zmeníte hodnoty niektorých polí. Ak zmeníte zdroj balíka, budete musieť aktualizovať aj kontrolný súčet. Guix nezostaví nič ak daný kontrolný súčet neodpovedá kontrolnému súčtu zdrojového kódu. Pre získanie správneho kontrolného súčtu potrebujeme stiahnuť zdroj, vypočítať kontrolný súčet sha256 a previesť ho do base32.

source: Thankfully, Guix can automate this task for us; all we need is to provide the URI:
es: Afortunadamente, Guix puede automatizar esta tarea por nosotros; todo lo que necesitamos es proporcionar la URI:
it: Fortunatamente, Guix può automatizzare questo compito per noi; tutto ciò di cui abbiamo bisogno è fornire l'URI:
pt_br: Felizmente, o Guix pode automatizar essa tarefa para nós; tudo o que precisamos é fornecer o URI:
sk: Našťastie, Guix to môže urobiť za nás; všetko čo budeme potrebovať je prepojenie (URI) zdroja:
sv: Tacksamt nog kan Guix automatisera den här uppgiften för oss; allt vi behöver är att tillhandahålla URI-strängen:

source: Starting download of /tmp/guix-file.JLYgL7 From https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz... following redirection to `https://mirror.ibcp.fr/pub/gnu/hello/hello-2.10.tar.gz'... …10.tar.gz 709KiB 2.5MiB/s 00:00 [##################] 100.0% /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz 0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i
es: Inicio de la descarga de /tmp/guix-file.JLYgL7 Desde https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz... tras la redirección a `https://mirror.ibcp.fr/pub/gnu/hello/hello-2.10.tar.gz'... …10.tar.gz 709KiB 2.5MiB/s 00:00 [##################] 100.0% /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz 0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i
it: Inizio download di /tmp/guix-file.JLYgL7 Da https://ftpmirror.gnu.org/gnu/hello/hello-2.10.tar.gz... redirezione a `https://mirror.ibcp.fr/pub/gnu/hello/hello-2.10.tar.gz'... …10.tar.gz 709KiB 2.5MiB/s 00:00 [##################] 100.0% /gnu/store/hbdalsf5lpf01x4dcknwx6xbn6n5km6k-hello-2.10.tar.gz 0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i

source: In this specific case the output tells us which mirror was chosen. If the result of the above command is not the same as in the above snippet, update your @code{my-hello} declaration accordingly.
es: En este caso concreto, la salida nos indica qué espejo se ha elegido. Si el resultado del comando anterior no es el mismo que en el fragmento anterior, actualice su declaración @code{my-hello} en consecuencia.
it: In questo caso specifico l'output ci dice quale mirror è stato scelto. Se il risultato del comando precedente non è lo stesso dello snippet sopra, aggiorna di conseguenza la tua dichiarazione @code{my-hello}.
pt_br: Neste caso específico a saída nos informa qual espelho foi escolhido. Se o resultado do comando acima não for o mesmo do trecho acima, atualize sua declaração @code{my-hello} de acordo.
sk: V tomto konkrétnom prípade nám výstup hovorí, aké zrkadlo bolo vybraté. Ak výsledok tohto príkazu nie je rovnaký ako v predchádzajúcom úryvku, aktualizujte vaše zadanie @code{my-hello} podľa potreby.

source: Note that GNU package tarballs come with an OpenPGP signature, so you should definitely check the signature of this tarball with `gpg` to authenticate it before going further:
es: Tenga en cuenta que los paquetes tar de GNU vienen con una firma OpenPGP, por lo que debería comprobar la firma de este tar con `gpg` para autenticarlo antes de continuar:
it: Nota che i tarball dei pacchetti GNU sono dotati di una firma OpenPGP, quindi dovresti assolutamente controllare la firma di questo tarball con `gpg` per autenticarlo prima di procedere:
pt_br: Observe que os tarballs do pacote GNU vêm com uma assinatura OpenPGP, então você definitivamente deve verificar a assinatura deste tarball com `gpg` para autenticá-lo antes de prosseguir:
sk: Všimnite si, že archívy GNU balíkov sú poskytované spolu s OpenPGP podpisom, takže by ste si jednoznačne mali overiť podpis tohto archívu pomocou „gpg“ predtým než budete pokračovať:
