Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: {Data Type} openssh-configuration
pt_br: {Tipo de dados} openssh-configuration

source: @code{x11-forwarding?} (default: @code{#f})
pt_br: @code{x11-forwarding?} (padrão: @code{#f})

source: @code{allow-agent-forwarding?} (default: @code{#t})
pt_br: @code{allow-agent-forwarding?} (padrão: @code{#t})

source: @code{allow-tcp-forwarding?} (default: @code{#t})
pt_br: @code{allow-tcp-forwarding?} (padrão: @code{#t})

source: @code{gateway-ports?} (default: @code{#f})
pt_br: @code{gateway-ports?} (padrão: @code{#f})

source: {Data Type} dropbear-configuration
pt_br: {Tipo de dados} dropbear-configuration

source: @code{syslog-output?} (default: @code{#t})
pt_br: @code{syslog-output?} (padrão: @code{#t})

source: {Data Type} autossh-configuration
pt_br: {Tipo de dados} autossh-configuration

source: @code{port} (default @code{"0"})
pt_br: @code{port} (padrão @code{"0"})

source: {Data Type} webssh-configuration
pt_br: {Tipo de dados} webssh-configuration

source: @code{port} (default: @var{8888})
pt_br: @code{port} (padrão: @var{8888})

source: {Data Type} avahi-configuration
pt_br: {Tipo de dados} avahi-configuration

source: @code{host-name} (default: @code{#f})
pt_br: @code{host-name} (padrão: @code{#f})

source: @code{publish?} (default: @code{#t})
pt_br: @code{publish?} (padrão: @code{#t})

source: @code{publish-workstation?} (default: @code{#t})
pt_br: @code{publish-workstation?} (padrão: @code{#t})

source: @code{wide-area?} (default: @code{#f})
pt_br: @code{wide-area?} (padrão: @code{#f})

source: {Data Type} openvswitch-configuration
pt_br: {Tipo de dados} openvswitch-configuration

source: {Data Type} pagekite-configuration
pt_br: {Tipo de dados} pagekite-configuration

source: {Data Type} yggdrasil-configuration
pt_br: {Tipo de dados} yggdrasil-configuration

source: {Data Type} ipfs-configuration
pt_br: {Tipo de dados} ipfs-configuration

source: {Data Type} unattended-upgrade-configuration
pt_br: {Tipo de dados} unattended-upgrade-configuration

source: window manager
pt_br: gerenciadores de janelas

source: {Data Type} gdm-configuration
pt_br: {Tipo de dados} gdm-configuration

source: {Data Type} slim-configuration
pt_br: {Tipo de dados} slim-configuration

source: {Data Type} sddm-configuration
pt_br: {Tipo de dados} sddm-configuration

source: {Data Type} lightdm-configuration
pt_br: {Tipo de dados} lightdm-configuration

source: {Data Type} lightdm-gtk-greeter-configuration
pt_br: {Tipo de dados} lightdm-gtk-greeter-configuration

source: {Data Type} lightdm-seat-configuration
pt_br: {Tipo de dados} lightdm-seat-configuration

source: {Data Type} xorg-configuration
pt_br: {Tipo de dados} xorg-configuration

source: keyboard layout, for Xorg
pt_br: disposição do teclado, para Xorg

source: {Data Type} screen-locker-configuration
pt_br: {Tipo de dados} screen-locker-configuration

source: {Data Type} gnome-desktop-configuration
pt_br: {Tipo de dados} gnome-desktop-configuration

source: {Data Type} plasma-desktop-configuration
pt_br: {Tipo de dados} plasma-desktop-configuration

source: {Data Type} xfce-desktop-configuration
pt_br: {Tipo de dados} xfce-desktop-configuration

source: {Data Type} mate-desktop-configuration
pt_br: {Tipo de dados} mate-desktop-configuration

source: {Data Type} lxqt-desktop-configuration
pt_br: {Tipo de dados} lxqt-desktop-configuration

source: {Data Type} sugar-desktop-configuration
pt_br: {Tipo de dados} sugar-desktop-configuration

source: {Data Type} enlightenment-desktop-service-configuration
pt_br: {Tipo de dados} enlightenment-desktop-service-configuration

source: {Data Type} dbus-configuration
pt_br: {Tipo de dados} dbus-configuration

source: {Data Type} elogind-configuration
pt_br: {Tipo de dados} elogind-configuration

source: {Data Type} upower-configuration
pt_br: {Tipo de dados} upower-configuration

source: @code{watts-up-pro?} (default: @code{#f})
pt_br: @code{watts-up-pro?} (padrão: @code{#f})

source: @code{poll-batteries?} (default: @code{#t})
pt_br: @code{poll-batteries?} (padrão: @code{#t})

source: @code{ignore-lid?} (default: @code{#f})
pt_br: @code{ignore-lid?} (padrão: @code{#f})

source: {Data Type} udisks-configuration
pt_br: {Tipo de dados} udisks-configuration

source: {Data Type} gvfs-configuration
pt_br: {Tipo de dados} gvfs-configuration

source: {Data Type} bluetooth-configuration
pt_br: {Tipo de dados} bluetooth-configuration

source: @code{fast-connectable?} (default: @code{#f})
pt_br: @code{fast-connectable?} (padrão: @code{#f})

source: {Data Type} gnome-keyring-configuration
pt_br: {Tipo de dados} gnome-keyring-configuration

source: {Data Type} seatd-configuration
pt_br: {Tipo de dados} seatd-configuration

source: {Data Type} alsa-configuration
pt_br: {Tipo de dados} alsa-configuration

source: {Data Type} pulseaudio-configuration
pt_br: {Tipo de dados} pulseaudio-configuration

source: {Data Type} file-database-configuration
pt_br: {Tipo de dados} file-database-configuration

source: {Data Type} package-database-configuration
pt_br: {Tipo de dados} package-database-configuration

source: {Data Type} postgresql-configuration
pt_br: {Tipo de dados} postgresql-configuration

source: @code{port} (default: @code{5432})
pt_br: @code{port} (padrão: @code{5432})

source: {Data Type} postgresql-config-file
pt_br: {Tipo de dados} postgresql-config-file

source: {Data Type} postgresql-role
pt_br: {Tipo de dados} postgresql-role

source: {Data Type} postgresql-role-configuration
pt_br: {Tipo de dados} postgresql-role-configuration

source: {Data Type} mysql-configuration
pt_br: {Tipo de dados} mysql-configuration

source: @code{port} (default: @code{3306})
pt_br: @code{port} (padrão: @code{3306})

source: {Data Type} memcached-configuration
pt_br: {Tipo de dados} memcached-configuration

source: {Data Type} redis-configuration
pt_br: {Tipo de dados} redis-configuration

source: @code{port} (default: @code{6379})
pt_br: @code{port} (padrão: @code{6379})

source: Message-ID
pt_br: Mensagem-ID

source: Subject
pt_br: Assunto

source: username
pt_br: nome de usuário

source: home directory
pt_br: diretório pessoal

source: recipient
pt_br: destinatário

source: {Data Type} opensmtpd-configuration
pt_br: {Tipo de dados} opensmtpd-configuration

source: {Data Type} exim-configuration
pt_br: {Tipo de dados} exim-configuration

source: {Data Type} imap4d-configuration
pt_br: {Tipo de dados} imap4d-configuration

source: {Data Type} radicale-configuration
pt_br: {Tipo de dados} radicale-configuration

source: {Data Type} radicale-auth-configuration
pt_br: {Tipo de dados} radicale-auth-configuration

source: {Data Type} radicale-encoding-configuration
pt_br: {Tipo de dados} radicale-encoding-configuration

source: {Data Type} radicale-logging-configuration
pt_br: {Tipo de dados} radicale-logging-configuration

source: {Data Type} radicale-rights-configuration
pt_br: {Tipo de dados} radicale-rights-configuration

source: {Data Type} radicale-server-configuration
pt_br: {Tipo de dados} radicale-server-configuration

source: {Data Type} radicale-storage-configuration
pt_br: {Tipo de dados} radicale-storage-configuration

source: {Data Type} rspamd-configuration
pt_br: {Tipo de dados} rspamd-configuration

source: {Data Type} bitlbee-configuration
pt_br: {Tipo de dados} bitlbee-configuration

source: @code{port} (default: @code{6667})
pt_br: @code{port} (padrão: @code{6667})

source: {Data Type} quassel-configuration
pt_br: {Tipo de dados} quassel-configuration

source: @code{port} (default: @code{4242})
pt_br: @code{port} (padrão: @code{4242})

source: telephony, services
pt_br: telefonia, serviços

source: {Data Type} jami-configuration
pt_br: {Tipo de dados} jami-configuration

source: {Data Type} jami-account
pt_br: {Tipo de dados} jami-account

source: {Data Type} mumble-server-configuration
pt_br: {Tipo de dados} mumble-server-configuration

source: @code{port} (default: @code{64738})
pt_br: @code{port} (padrão: @code{64738})

source: @code{remember-channel?} (default: @code{#f})
pt_br: @code{remember-channel?} (padrão: @code{#f})

source: @code{bonjour?} (default: @code{#f})
pt_br: @code{bonjour?} (padrão: @code{#f})

source: @code{file} (default: @code{#f})
pt_br: @code{file} (padrão: @code{#f})

source: {Data Type} mumble-server-public-registration-configuration
pt_br: {Tipo de dados} mumble-server-public-registration-configuration

source: @code{hostname} (default: @code{#f})
pt_br: @code{hostname} (padrão: @code{#f})

source: {Data Type} transmission-daemon-configuration
pt_br: {Tipo de dados} transmission-daemon-configuration

source: {Data Type} darkstat-configuration
pt_br: {Tipo de dados} darkstat-configuration

source: @code{port} (default: @code{"667"})
pt_br: @code{port} (padrão: @code{"667"})

source: {Data Type} prometheus-node-exporter-configuration
pt_br: {Tipo de dados} prometheus-node-exporter-configuration

source: {Data Type} vnstat-configuration
pt_br: {Tipo de dados} vnstat-configuration

source: {Data Type} zabbix-server-configuration
pt_br: {Tipo de dados} zabbix-server-configuration

source: {Data Type} zabbix-agent-configuration
pt_br: {Tipo de dados} zabbix-agent-configuration

source: {Data Type} zabbix-front-end-configuration
pt_br: {Tipo de dados} zabbix-front-end-configuration

source: {Data Type} krb5-realm
pt_br: {Tipo de dados} krb5-realm

source: {Data Type} krb5-configuration
pt_br: {Tipo de dados} krb5-configuration

source: {Data Type} pam-krb5-configuration
pt_br: {Tipo de dados} pam-krb5-configuration

source: {Data Type} directory-server-instance-configuration
pt_br: {Tipo de dados} directory-server-instance-configuration

source: {Data Type} slapd-configuration
pt_br: {Tipo de dados} slapd-configuration

source: {Data Type} backend-userroot-configuration
pt_br: {Tipo de dados} backend-userroot-configuration

source: {Data Type} httpd-configuration
pt_br: {Tipo de dados} httpd-configuration

source: {Data Type} httpd-module
pt_br: {Tipo de dados} httpd-module

source: {Data Type} httpd-config-file
pt_br: {Tipo de dados} httpd-config-file

source: {Data Type} httpd-virtualhost
pt_br: {Tipo de dados} httpd-virtualhost

source: {Data Type} nginx-configuration
pt_br: {Tipo de dados} nginx-configuration

source: {Data Type} nginx-server-configuration
pt_br: {Tipo de dados} nginx-server-configuration

source: {Data Type} nginx-upstream-configuration
pt_br: {Tipo de dados} nginx-upstream-configuration

source: {Data Type} nginx-location-configuration
pt_br: {Tipo de dados} nginx-location-configuration

source: {Data Type} nginx-named-location-configuration
pt_br: {Tipo de dados} nginx-named-location-configuration

source: {Data Type} varnish-configuration
pt_br: {Tipo de dados} varnish-configuration

source: {Data Type} whoogle-configuration
pt_br: {Tipo de dados} whoogle-configuration

source: @code{port} (default: @code{5000})
pt_br: @code{port} (padrão: @code{5000})

source: {Data Type} patchwork-configuration
pt_br: {Tipo de dados} patchwork-configuration

source: {Data Type} patchwork-settings-module
pt_br: {Tipo de dados} patchwork-settings-module

source: {Data Type} patchwork-database-configuration
pt_br: {Tipo de dados} patchwork-database-configuration

source: @code{port} (default: @code{""})
pt_br: @code{port} (padrão: @code{""})

source: {Data Type} mumi-configuration
pt_br: {Tipo de dados} mumi-configuration

source: {Data Type} fcgiwrap-configuration
pt_br: {Tipo de dados} fcgiwrap-configuration

source: ...@: and much more.
pt_br: ...@: e muito mais.

source: {Data Type} php-fpm-configuration
pt_br: {Tipo de dados} php-fpm-configuration

source: @code{file} (default @code{#f})
pt_br: @code{file} (padrão @code{#f})

source: {Data type} php-fpm-dynamic-process-manager-configuration
pt_br: {Tipo de dados} php-fpm-dynamic-process-manager-configuration

source: {Data type} php-fpm-static-process-manager-configuration
pt_br: {Tipo de dados} php-fpm-static-process-manager-configuration

source: {Data type} php-fpm-on-demand-process-manager-configuration
pt_br: {Tipo de dados} php-fpm-on-demand-process-manager-configuration

source: {Data Type} hpcguix-web-configuration
pt_br: {Tipo de dados} hpcguix-web-configuration

source: {Data Type} gmnisrv-configuration
pt_br: {Tipo de dados} gmnisrv-configuration

source: {Data Type} agate-configuration
pt_br: {Tipo de dados} agate-configuration

source: {Data Type} certbot-configuration
pt_br: {Tipo de dados} certbot-configuration

source: {Data Type} certificate-configuration
pt_br: {Tipo de dados} certificate-configuration

source: @code{challenge} (default: @code{#f})
pt_br: @code{challenge} (padrão: @code{#f})

source: @code{authentication-hook} (default: @code{#f})
pt_br: @code{authentication-hook} (padrão: @code{#f})

source: @code{cleanup-hook} (default: @code{#f})
pt_br: @code{cleanup-hook} (padrão: @code{#f})

source: {Data Type} knot-key-configuration
pt_br: {Tipo de dados} knot-key-configuration

source: @code{algorithm} (default: @code{#f})
pt_br: @code{algorithm} (padrão: @code{#f})

source: {Data Type} knot-acl-configuration
pt_br: {Tipo de dados} knot-acl-configuration

source: @code{deny?} (default: @code{#f})
pt_br: @code{deny?} (padrão: @code{#f})

source: {Data Type} zone-entry
pt_br: {Tipo de dados} zone-entry

source: {Data Type} zone-file
pt_br: {Tipo de dados} zone-file

source: {Data Type} knot-remote-configuration
pt_br: {Tipo de dados} knot-remote-configuration

source: @code{key} (default: @code{#f})
pt_br: @code{key} (padrão: @code{#f})

source: {Data Type} knot-keystore-configuration
pt_br: {Tipo de dados} knot-keystore-configuration

source: {Data Type} knot-policy-configuration
pt_br: {Tipo de dados} knot-policy-configuration

source: @code{manual?} (default: @code{#f})
pt_br: @code{manual?} (padrão: @code{#f})

source: @code{nsec3?} (default: @code{#f})
pt_br: @code{nsec3?} (padrão: @code{#f})

source: {Data Type} knot-zone-configuration
pt_br: {Tipo de dados} knot-zone-configuration

source: @code{zonefile-load} (default: @code{#f})
pt_br: @code{zonefile-load} (padrão: @code{#f})

source: @code{max-journal-usage} (default: @code{#f})
pt_br: @code{max-journal-usage} (padrão: @code{#f})

source: @code{max-journal-depth} (default: @code{#f})
pt_br: @code{max-journal-depth} (padrão: @code{#f})

source: @code{max-zone-size} (default: @code{#f})
pt_br: @code{max-zone-size} (padrão: @code{#f})

source: @code{dnssec-policy} (default: @code{#f})
pt_br: @code{dnssec-policy} (padrão: @code{#f})

source: {Data Type} knot-configuration
pt_br: {Tipo de dados} knot-configuration

source: {Data Type} knot-resolver-configuration
pt_br: {Tipo de dados} knot-resolver-configuration

source: {Data Type} dnsmasq-configuration
pt_br: {Tipo de dados} dnsmasq-configuration

source: @code{no-hosts?} (default: @code{#f})
pt_br: @code{no-hosts?} (padrão: @code{#f})

source: @code{port} (default: @code{53})
pt_br: @code{port} (padrão: @code{53})

source: @code{local-service?} (default: @code{#t})
pt_br: @code{local-service?} (padrão: @code{#t})

source: @code{no-resolv?} (default: @code{#f})
pt_br: @code{no-resolv?} (padrão: @code{#f})

source: @code{cache-size} (default: @code{150})
pt_br: @code{cache-size} (padrão: @code{150})

source: @code{negative-cache?} (default: @code{#t})
pt_br: @code{negative-cache?} (padrão: @code{#t})

source: {Data Type} xvnc-configuration
pt_br: {Tipo de dados} xvnc-configuration

source: {Data Type} openvpn-client-configuration
pt_br: {Tipo de dados} openvpn-client-configuration

source: {Data Type} openvpn-remote-configuration
pt_br: {Tipo de dados} openvpn-remote-configuration

source: Server name.
pt_br: Nome do servidor.

source: {Data Type} openvpn-server-configuration
pt_br: {Tipo de dados} openvpn-server-configuration

source: {Data Type} strongswan-configuration
pt_br: {Tipo de dados} strongswan-configuration

source: {Data Type} wireguard-configuration
pt_br: {Tipo de dados} wireguard-configuration

source: @code{port} (default: @code{51820})
pt_br: @code{port} (padrão: @code{51820})

source: {Data Type} wireguard-peer
pt_br: {Tipo de dados} wireguard-peer

source: {Data Type} nfs-configuration
pt_br: {Tipo de dados} nfs-configuration

source: {Data Type} rpcbind-configuration
pt_br: {Tipo de dados} rpcbind-configuration

source: {Data Type} pipefs-configuration
pt_br: {Tipo de dados} pipefs-configuration

source: {Data Type} gss-configuration
pt_br: {Tipo de dados} gss-configuration

source: {Data Type} idmap-configuration
pt_br: {Tipo de dados} idmap-configuration

source: @code{domain} (default: @code{#f})
pt_br: @code{domain} (padrão: @code{#f})

source: {Data Type} samba-service-configuration
pt_br: {Tipo de dados} samba-service-configuration

source: Web Service Discovery Daemon
it: Demone per la scoperta dei servizi web
pt_br: Daemon de Descoberta de Serviço da Web

source: {Data Type} wsdd-configuration
pt_br: {Tipo de dados} wsdd-configuration

source: {Data Type} cuirass-configuration
pt_br: {Tipo de dados} cuirass-configuration

source: @code{port} (default: @code{8081})
pt_br: @code{port} (padrão: @code{8081})

source: @code{fallback?} (default: @code{#f})
pt_br: @code{fallback?} (padrão: @code{#f})

source: {Data Type} cuirass-remote-server-configuration
pt_br: {Tipo de dados} cuirass-remote-server-configuration

source: {Data Type} cuirass-remote-worker-configuration
pt_br: {Tipo de dados} cuirass-remote-worker-configuration

source: {Data Type} laminar-configuration
pt_br: {Tipo de dados} laminar-configuration

source: {Data Type} power-profiles-daemon-configuration
pt_br: {Tipo de dados} power-profiles-daemon-configuration

source: {Data Type} thermald-configuration
pt_br: {Tipo de dados} thermald-configuration

source: Music Player Daemon
pt_br: Daemon do reprodutor de música

source: {Data Type} mpd-configuration
pt_br: {Tipo de dados} mpd-configuration

source: {Data Type} mpd-plugin
pt_br: {Tipo de dados} mpd-plugin

source: Name.
pt_br: Nome.

source: {Data Type} mpd-partition
pt_br: {Tipo de dados} mpd-partition

source: {Data Type} mpd-output
pt_br: {Tipo de dados} mpd-output

source: {Data Type} mympd-configuration
pt_br: {Tipo de dados} mympd-configuration

source: {Data Type} mympd-ip-acl
pt_br: {Tipo de dados} mympd-ip-acl

source: output to a file, with the given filepath
pt_br: saída para um arquivo, com o caminho de arquivo dado

source: {Data Type} qemu-binfmt-configuration
pt_br: {Tipo de dados} qemu-binfmt-configuration

source: Service type for the QEMU guest agent service.
pt_br: Tipo de serviço para o serviço de agente convidado QEMU.

source: {Data Type} qemu-guest-agent-configuration
pt_br: {Tipo de dados} qemu-guest-agent-configuration

source: {Data Type} virtual-build-machine
pt_br: {Tipo de dados} virtual-build-machine

source: {Data Type} hurd-vm-configuration
pt_br: {Tipo de dados} hurd-vm-configuration

source: {Data Type} ganeti-configuration
pt_br: {Tipo de dados} ganeti-configuration

source: {Data Type} ganeti-os
pt_br: {Tipo de dados} ganeti-os

source: {Data Type} ganeti-os-variant
pt_br: {Tipo de dados} ganeti-os-variant

source: {Data Type} debootstrap-configuration
pt_br: {Tipo de dados} debootstrap-configuration

source: {Data Type} ganeti-noded-configuration
pt_br: {Tipo de dados} ganeti-noded-configuration

source: @code{port} (default: @code{1811})
pt_br: @code{port} (padrão: @code{1811})

source: {Data Type} ganeti-confd-configuration
pt_br: {Tipo de dados} ganeti-confd-configuration

source: @code{port} (default: @code{1814})
pt_br: @code{port} (padrão: @code{1814})

source: {Data Type} ganeti-wconfd-configuration
pt_br: {Tipo de dados} ganeti-wconfd-configuration

source: {Data Type} ganeti-luxid-configuration
pt_br: {Tipo de dados} ganeti-luxid-configuration

source: {Data Type} ganeti-rapi-configuration
pt_br: {Tipo de dados} ganeti-rapi-configuration

source: @code{port} (default: @code{5080})
pt_br: @code{port} (padrão: @code{5080})

source: {Data Type} ganeti-kvmd-configuration
pt_br: {Tipo de dados} ganeti-kvmd-configuration

source: {Data Type} ganeti-mond-configuration
pt_br: {Tipo de dados} ganeti-mond-configuration

source: @code{port} (default: @code{1815})
pt_br: @code{port} (padrão: @code{1815})

source: {Data Type} ganeti-metad-configuration
pt_br: {Tipo de dados} ganeti-metad-configuration

source: {Data Type} ganeti-watcher-configuration
pt_br: {Tipo de dados} ganeti-watcher-configuration

source: {Data Type} ganeti-cleaner-configuration
pt_br: {Tipo de dados} ganeti-cleaner-configuration

source: {Data Type} git-daemon-configuration
pt_br: {Tipo de dados} git-daemon-configuration

source: @code{port} (default: @code{#f})
pt_br: @code{port} (padrão: @code{#f})

source: {Data Type} git-http-configuration
pt_br: {Tipo de dados} git-http-configuration

source: {Data Type} gitolite-configuration
pt_br: {Tipo de dados} gitolite-configuration

source: {Data Type} gitolite-rc-file
pt_br: {Tipo de dados} gitolite-rc-file

source: @code{umask} (default: @code{#o0077})
pt_br: @code{umask} (padrão: @code{#o0077})

source: Gitile service
pt_br: Serviço Gitile

source: {Data Type} gitile-configuration
pt_br: {Tipo de dados} gitile-configuration

source: @code{port} (default: @code{8080})
pt_br: @code{port} (padrão: @code{8080})

source: {Data Type} joycond-configuration
pt_br: {Tipo de dados} joycond-configuration

source: {Data Type} wesnothd-configuration
pt_br: {Tipo de dados} wesnothd-configuration

source: @code{port} (default: @code{15000})
pt_br: @code{port} (padrão: @code{15000})

source: {Data Type} pam-mount-configuration
pt_br: {Tipo de dados} pam-mount-configuration

source: {Data Type} pam-mount-volume-service-type
pt_br: {Tipo de dados} pam-mount-volume-service-type

source: {Data Type} bffe-configuration
pt_br: {Tipo de dados} bffe-configuration

source: {Data Type} guix-build-coordinator-configuration
pt_br: {Tipo de dados} guix-build-coordinator-configuration

source: {Data Type} guix-build-coordinator-agent-configuration
pt_br: {Tipo de dados} guix-build-coordinator-agent-configuration

source: {Data Type} guix-build-coordinator-agent-password-auth
pt_br: {Tipo de dados} guix-build-coordinator-agent-password-auth

source: {Data Type} guix-build-coordinator-agent-password-file-auth
pt_br: {Tipo de dados} guix-build-coordinator-agent-password-file-auth

source: {Data Type} guix-build-coordinator-agent-dynamic-auth
pt_br: {Tipo de dados} guix-build-coordinator-agent-dynamic-auth

source: {Data Type} guix-build-coordinator-agent-dynamic-auth-with-file
pt_br: {Tipo de dados} guix-build-coordinator-agent-dynamic-auth-with-file

source: {Data Type} guix-data-service-configuration
pt_br: {Tipo de dados} guix-data-service-configuration

source: @code{port} (default: @code{8765})
pt_br: @code{port} (padrão: @code{8765})

source: {Data Type} nar-herder-configuration
pt_br: {Tipo de dados} nar-herder-configuration

source: @code{port} (default: @code{8734})
pt_br: @code{port} (padrão: @code{8734})

source: {Data Type} nar-herder-cached-compression-configuration
pt_br: {Tipo de dados} nar-herder-cached-compression-configuration

source: {Data Type} earlyoom-configuration
pt_br: {Tipo de dados} earlyoom-configuration

source: {Data Type} fstrim-configuration
pt_br: {Tipo de dados} fstrim-configuration

source: {Data Type} cachefilesd-configuration
pt_br: {Tipo de dados} cachefilesd-configuration

source: {Data Type} rasdaemon-configuration
pt_br: {Tipo de dados} rasdaemon-configuration

source: {Data Type} zram-device-configuration
pt_br: {Tipo de dados} zram-device-configuration

source: {Data Type} hurd-console-configuration
pt_br: {Tipo de dados} hurd-console-configuration

source: {Data Type} hurd-getty-configuration
pt_br: {Tipo de dados} hurd-getty-configuration

source: {Data Type} sysctl-configuration
pt_br: {Tipo de dados} sysctl-configuration

source: {Data Type} pcscd-configuration
pt_br: {Tipo de dados} pcscd-configuration
