Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: comma (unquote)
pt_br: vírgula (unquote)

source: What about these quote (@code{'}) characters? They are Scheme syntax to introduce a literal list; @code{'} is synonymous with @code{quote}. Sometimes you'll also see @code{`} (a backquote, synonymous with @code{quasiquote}) and @code{,} (a comma, synonymous with @code{unquote}). @xref{Expression Syntax, quoting,, guile, GNU Guile Reference Manual}, for details. Here the value of the @code{arguments} field is a list of arguments passed to the build system down the road, as with @code{apply} (@pxref{Fly Evaluation, @code{apply},, guile, GNU Guile Reference Manual}).
pt_br: E quanto a esses caracteres de citação (@code{'})? Eles são sintaxe Scheme para introduzir uma lista literal; @code{'} é sinônimo de @code{quote}. Às vezes, você também verá @code{`} (uma crase, sinônimo de @code{quasiquote}) e @code{,} (uma vírgula, sinônimo de @code{unquote}). @xref{Expression Syntax, quoting,, guile, Manual de referência do GNU Guile}, para detalhes. Aqui, o valor do campo @code{arguments} é uma lista de argumentos passados para o sistema de construção mais adiante, como com @code{apply} (@pxref{Fly Evaluation, @code{apply},, guile, Manual de referência do GNU Guile}).

source: The hash-colon (@code{#:}) sequence defines a Scheme @dfn{keyword} (@pxref{Keywords,,, guile, GNU Guile Reference Manual}), and @code{#:configure-flags} is a keyword used to pass a keyword argument to the build system (@pxref{Coding With Keywords,,, guile, GNU Guile Reference Manual}).
pt_br: A sequência hash-dois-pontos (@code{#:}) define um @dfn{palavra-chave} em Scheme (@pxref{Keywords,,, guile, Manual de referência do GNU Guile}) e @code{#:configure-flags} é uma palavra-chave usada para passar um argumento de palavra-chave para o sistema de compilação (@pxref{Coding With Keywords,,, guile, Manual de referência do GNU Guile}).

source: The @code{inputs} field specifies inputs to the build process---i.e., build-time or run-time dependencies of the package. Here, we add an input, a reference to the @code{gawk} variable; @code{gawk} is itself bound to a @code{<package>} object.
pt_br: O campo @code{inputs} especifica entradas para o processo de construção---i.e., dependências de tempo de construção ou tempo de execução do pacote. Aqui, adicionamos uma entrada, uma referência à variável @code{gawk}; @code{gawk} é ele próprio vinculado a um objeto @code{<package>}.

source: Note that GCC, Coreutils, Bash, and other essential tools do not need to be specified as inputs here. Instead, @code{gnu-build-system} takes care of ensuring that they are present (@pxref{Build Systems}).
pt_br: Note que GCC, Coreutils, Bash e outras ferramentas essenciais não precisam ser especificadas como entradas aqui. Em vez disso, @code{gnu-build-system} cuida de garantir que elas estejam presentes (@pxref{Build Systems}).

source: However, any other dependencies need to be specified in the @code{inputs} field. Any dependency not specified here will simply be unavailable to the build process, possibly leading to a build failure.
pt_br: No entanto, quaisquer outras dependências precisam ser especificadas no campo @code{inputs}. Qualquer dependência não especificada aqui simplesmente ficará indisponível para o processo de build, possivelmente levando a uma falha de build.

source: @xref{package Reference}, for a full description of possible fields.
pt_br: @xref{package Reference}, para uma descrição completa dos campos possíveis.

source: Scheme programming language, getting started
pt_br: Linguagem de programação Scheme, primeiros passos

source: Intimidated by the Scheme language or curious about it? The Cookbook has a short section to get started that recaps some of the things shown above and explains the fundamentals. @xref{A Scheme Crash Course,,, guix-cookbook, GNU Guix Cookbook}, for more information.
pt_br: Intimidado pela linguagem Scheme ou curioso sobre ela? O Livro de receitas tem uma seção curta para começar que recapitula algumas das coisas mostradas acima e explica os fundamentos. @xref{Um curso intensivo de Scheme,,, guix-cookbook.pt_BR, Livro de receitas do GNU Guix}, para mais informações.

source: Once a package definition is in place, the package may actually be built using the @code{guix build} command-line tool (@pxref{Invoking guix build}), troubleshooting any build failures you encounter (@pxref{Debugging Build Failures}). You can easily jump back to the package definition using the @command{guix edit} command (@pxref{Invoking guix edit}). @xref{Packaging Guidelines}, for more information on how to test package definitions, and @ref{Invoking guix lint}, for information on how to check a definition for style conformance.
pt_br: Uma vez que uma definição de pacote esteja pronta, o pacote pode ser realmente construído usando a ferramenta de linha de comando @code{guix build} (@pxref{Invoking guix build}), solucionando problemas de quaisquer falhas de construção que você encontrar (@pxref{Debugging Build Failures}). Você pode facilmente voltar para a definição do pacote usando o comando @command{guix edit} (@pxref{Invoking guix edit}). @xref{Packaging Guidelines}, para mais informações sobre como testar definições de pacote, e @ref{Invoking guix lint}, para informações sobre como verificar uma definição para conformidade de estilo.

source: Lastly, @pxref{Channels}, for information on how to extend the distribution by adding your own package definitions in a ``channel''.
pt_br: Por fim, @pxref{Channels}, para obter informações sobre como estender a distribuição adicionando suas próprias definições de pacote em um ``canal''.

source: Finally, updating the package definition to a new upstream version can be partly automated by the @command{guix refresh} command (@pxref{Invoking guix refresh}).
pt_br: Por fim, a atualização da definição do pacote para uma nova versão upstream pode ser parcialmente automatizada pelo comando @command{guix refresh} (@pxref{Invoking guix refresh}).

source: Behind the scenes, a derivation corresponding to the @code{<package>} object is first computed by the @code{package-derivation} procedure. That derivation is stored in a @file{.drv} file under @file{/gnu/store}. The build actions it prescribes may then be realized by using the @code{build-derivations} procedure (@pxref{The Store}).
pt_br: Nos bastidores, uma derivação correspondente ao objeto @code{<package>} é primeiro computada pelo procedimento @code{package-derivation}. Essa derivação é armazenada em um arquivo @file{.drv} em @file{/gnu/store}. As ações de construção que ele prescreve podem então ser realizadas usando o procedimento @code{build-derivations} (@pxref{The Store}).

source: {Procedure} package-derivation store package [system]
pt_br: {Procedimento} package-derivation armazém pacote [sistema]

source: Return the @code{<derivation>} object of @var{package} for @var{system} (@pxref{Derivations}).
pt_br: Retorne o objeto @code{<derivation>} de @var{pacote} para @var{sistema} (@pxref{Derivations}).

source: @var{package} must be a valid @code{<package>} object, and @var{system} must be a string denoting the target system type---e.g., @code{"x86_64-linux"} for an x86_64 Linux-based GNU system. @var{store} must be a connection to the daemon, which operates on the store (@pxref{The Store}).
pt_br: @var{pacote} deve ser um objeto @code{<package>} válido e @var{sistema} deve ser uma string que indique o tipo de sistema de destino — por exemplo, @code{"x86_64-linux"} para um sistema GNU baseado em Linux x86_64. @var{armazém} deve ser uma conexão com o daemon, que opera no armazém (@pxref{The Store}).

source: Similarly, it is possible to compute a derivation that cross-builds a package for some other system:
pt_br: Da mesma forma, é possível calcular uma derivação que crie um pacote para algum outro sistema:

source: {Procedure} package-cross-derivation store package target [system]
pt_br: {Procedimento} package-cross-derivation armazém pacote alvo [sistema]

source: Return the @code{<derivation>} object of @var{package} cross-built from @var{system} to @var{target}.
pt_br: Retorne o objeto @code{<derivation>} de @var{pacote} criado de @var{sistema} para @var{alvo}.

source: @var{target} must be a valid GNU triplet denoting the target hardware and operating system, such as @code{"aarch64-linux-gnu"} (@pxref{Specifying Target Triplets,,, autoconf, Autoconf}).
pt_br: @var{alvo} deve ser um tripleto GNU válido que indique o hardware e o sistema operacional de destino, como @code{"aarch64-linux-gnu"} (@pxref{Specifying Target Triplets,,, autoconf, Autoconf}).

source: Once you have package definitions, you can easily define @emph{variants} of those packages. @xref{Defining Package Variants}, for more on that.
pt_br: Depois de ter as definições dos pacotes, você pode definir facilmente @emph{variantes} desses pacotes. @xref{Defining Package Variants}, para mais informações sobre isso.

source: @code{package} Reference
pt_br: Referência do @code{package}

source: This section summarizes all the options available in @code{package} declarations (@pxref{Defining Packages}).
pt_br: Esta seção resume todas as opções disponíveis nas declarações @code{package} (@pxref{Defining Packages}).

source: {Data Type} package
pt_br: {Tipo de dados} package

source: This is the data type representing a package recipe.
pt_br: Este é o tipo de dado que representa uma receita de pacote.

source: An object telling how the source code for the package should be acquired. Most of the time, this is an @code{origin} object, which denotes a file fetched from the Internet (@pxref{origin Reference}). It can also be any other ``file-like'' object such as a @code{local-file}, which denotes a file from the local file system (@pxref{G-Expressions, @code{local-file}}).
pt_br: Um objeto que diz como o código-fonte do pacote deve ser adquirido. Na maioria das vezes, este é um objeto @code{origin}, que denota um arquivo obtido da Internet (@pxref{origin Reference}). Também pode ser qualquer outro objeto ``tipo arquivo'', como um @code{local-file}, que denota um arquivo do sistema de arquivos local (@pxref{G-Expressions, @code{local-file}}).

source: The build system that should be used to build the package (@pxref{Build Systems}).
pt_br: O sistema de compilação que deve ser usado para compilar o pacote (@pxref{Build Systems}).

source: @code{arguments} (default: @code{'()})
pt_br: @code{arguments} (padrão: @code{'()})

source: The arguments that should be passed to the build system (@pxref{Build Systems}). This is a list, typically containing sequential keyword-value pairs, as in this example:
pt_br: Os argumentos que devem ser passados para o sistema de compilação (@pxref{Build Systems}). Esta é uma lista, normalmente contendo pares sequenciais de palavra-chave-valor, como neste exemplo:

source: The exact set of supported keywords depends on the build system (@pxref{Build Systems}), but you will find that almost all of them honor @code{#:configure-flags}, @code{#:make-flags}, @code{#:tests?}, and @code{#:phases}. The @code{#:phases} keyword in particular lets you modify the set of build phases for your package (@pxref{Build Phases}).
pt_br: O conjunto exato de palavras-chave suportadas depende do sistema de compilação (@pxref{Build Systems}), mas você verá que quase todas elas honram @code{#:configure-flags}, @code{#:make-flags}, @code{#:tests?} e @code{#:phases}. A palavra-chave @code{#:phases} em particular permite que você modifique o conjunto de fases de compilação para seu pacote (@pxref{Build Phases}).

source: The REPL has dedicated commands to interactively inspect values of some of these arguments, as a convenient debugging aid (@pxref{Using Guix Interactively}).
pt_br: O REPL tem comandos dedicados para inspecionar interativamente os valores de alguns desses argumentos, como um auxílio de depuração conveniente (@pxref{Using Guix Interactively}).

source: Compatibility Note
pt_br: Nota de compatibilidade

source: Until version 1.3.0, the @code{arguments} field would typically use @code{quote} (@code{'}) or @code{quasiquote} (@code{`}) and no G-expressions, like so:
pt_br: Até a versão 1.3.0, o campo @code{arguments} normalmente usaria @code{quote} (@code{'}) ou @code{quasiquote} (@code{`}) e nenhuma expressão G, assim:

source: To convert from that style to the one shown above, you can run @code{guix style -S arguments @var{package}} (@pxref{Invoking guix style}).
pt_br: Para converter esse estilo para o mostrado acima, você pode executar @code{guix style -S arguments @var{pacote}} (@pxref{Invoking guix style}).

source: @code{inputs} (default: @code{'()})
pt_br: @code{inputs} (padrão: @code{'()})

source: @code{native-inputs} (default: @code{'()})
pt_br: @code{native-inputs} (padrão: @code{'()})

source: @code{propagated-inputs} (default: @code{'()})
pt_br: @code{propagated-inputs} (padrão: @code{'()})

source: inputs, of packages
pt_br: entradas, de pacotes

source: These fields list dependencies of the package. Each element of these lists is either a package, origin, or other ``file-like object'' (@pxref{G-Expressions}); to specify the output of that file-like object that should be used, pass a two-element list where the second element is the output (@pxref{Packages with Multiple Outputs}, for more on package outputs). For example, the list below specifies three inputs:
pt_br: Esses campos listam dependências do pacote. Cada elemento dessas listas é um pacote, origem ou outro ``objeto tipo arquivo'' (@pxref{G-Expressions}); para especificar a saída desse objeto tipo arquivo que deve ser usado, passe uma lista de dois elementos onde o segundo elemento é a saída (@pxref{Packages with Multiple Outputs}, para mais informações sobre saídas de pacotes). Por exemplo, a lista abaixo especifica três entradas:

source: (list libffi libunistring `(,glib "bin")) ;the "bin" output of GLib
pt_br: (list libffi libunistring `(,glib "bin")) ;a saída "bin" de GLib

source: In the example above, the @code{"out"} output of @code{libffi} and @code{libunistring} is used.
pt_br: No exemplo acima, a saída @code{"out"} de @code{libffi} e @code{libunistring} é usada.

source: Until version 1.3.0, input lists were a list of tuples, where each tuple has a label for the input (a string) as its first element, a package, origin, or derivation as its second element, and optionally the name of the output thereof that should be used, which defaults to @code{"out"}. For example, the list below is equivalent to the one above, but using the @dfn{old input style}:
pt_br: Até a versão 1.3.0, as listas de entrada eram uma lista de tuplas, onde cada tupla tem um rótulo para a entrada (uma string) como seu primeiro elemento, um pacote, origem ou derivação como seu segundo elemento e, opcionalmente, o nome da saída que deve ser usada, cujo padrão é @code{"out"}. Por exemplo, a lista abaixo é equivalente à acima, mas usando o @dfn{antigo estilo de entrada}:

source: ;; Old input style (deprecated). `(("libffi" ,libffi) ("libunistring" ,libunistring) ("glib:bin" ,glib "bin")) ;the "bin" output of GLib
pt_br: ;; Estilo de entrada antigo (obsoleto). `(("libffi" ,libffi) ("libunistring" ,libunistring) ("glib:bin" ,glib "bin")) ;a saída "bin" do GLib

source: This style is now deprecated; it is still supported but support will be removed in a future version. It should not be used for new package definitions. @xref{Invoking guix style}, on how to migrate to the new style.
pt_br: Este estilo agora está obsoleto; ele ainda é suportado, mas o suporte será removido em uma versão futura. Ele não deve ser usado para novas definições de pacote. @xref{Invoking guix style}, sobre como migrar para o novo estilo.

source: cross compilation, package dependencies
pt_br: compilação cruzada, dependências de pacotes

source: The distinction between @code{native-inputs} and @code{inputs} is necessary when considering cross-compilation. When cross-compiling, dependencies listed in @code{inputs} are built for the @emph{target} architecture; conversely, dependencies listed in @code{native-inputs} are built for the architecture of the @emph{build} machine.
pt_br: A distinção entre @code{native-inputs} e @code{inputs} é necessária ao considerar a compilação cruzada. Ao compilar cruzadamente, as dependências listadas em @code{inputs} são construídas para a arquitetura @emph{target} (alvo); inversamente, as dependências listadas em @code{native-inputs} são construídas para a arquitetura da máquina @emph{build}.

source: @code{native-inputs} is typically used to list tools needed at build time, but not at run time, such as Autoconf, Automake, pkg-config, Gettext, or Bison. @command{guix lint} can report likely mistakes in this area (@pxref{Invoking guix lint}).
pt_br: @code{native-inputs} é normalmente usado para listar ferramentas necessárias no momento da compilação, mas não no momento da execução, como Autoconf, Automake, pkg-config, Gettext ou Bison. @command{guix lint} pode relatar prováveis erros nesta área (@pxref{Invoking guix lint}).

source: Lastly, @code{propagated-inputs} is similar to @code{inputs}, but the specified packages will be automatically installed to profiles (@pxref{Features, the role of profiles in Guix}) alongside the package they belong to (@pxref{package-cmd-propagated-inputs, @command{guix package}}, for information on how @command{guix package} deals with propagated inputs).
pt_br: Por fim, @code{propagated-inputs} é semelhante a @code{inputs}, mas os pacotes especificados serão instalados automaticamente nos perfis (@pxref{Features, a função dos perfis no Guix}) junto com o pacote ao qual pertencem (@pxref{package-cmd-propagated-inputs, @command{guix package}}, para obter informações sobre como @command{guix package} lida com entradas propagadas).

source: For example this is necessary when packaging a C/C++ library that needs headers of another library to compile, or when a pkg-config file refers to another one @i{via} its @code{Requires} field.
pt_br: Por exemplo, isso é necessário ao empacotar uma biblioteca C/C++ que precisa de cabeçalhos de outra biblioteca para compilar, ou quando um arquivo pkg-config faz referência a outro por meio de seu campo @code{Requires}.

source: Another example where @code{propagated-inputs} is useful is for languages that lack a facility to record the run-time search path akin to the @code{RUNPATH} of ELF files; this includes Guile, Python, Perl, and more. When packaging libraries written in those languages, ensure they can find library code they depend on at run time by listing run-time dependencies in @code{propagated-inputs} rather than @code{inputs}.
pt_br: Outro exemplo em que @code{propagated-inputs} é útil é para linguagens que não têm um recurso para registrar o caminho de pesquisa em tempo de execução semelhante ao @code{RUNPATH} de arquivos ELF; isso inclui Guile, Python, Perl e mais. Ao empacotar bibliotecas escritas nessas linguagens, garanta que elas possam encontrar o código da biblioteca do qual dependem em tempo de execução listando as dependências em tempo de execução em @code{propagated-inputs} em vez de @code{inputs}.

source: @code{outputs} (default: @code{'("out")})
pt_br: @code{outputs} (padrão: @code{'("out")})

source: The list of output names of the package. @xref{Packages with Multiple Outputs}, for typical uses of additional outputs.
pt_br: A lista de nomes de saída do pacote. @xref{Packages with Multiple Outputs}, para usos típicos de saídas adicionais.

source: @code{native-search-paths} (default: @code{'()})
pt_br: @code{native-search-paths} (padrão: @code{'()})

source: @code{search-paths} (default: @code{'()})
pt_br: @code{search-paths} (padrão: @code{'()})

source: A list of @code{search-path-specification} objects describing search-path environment variables honored by the package. @xref{Search Paths}, for more on search path specifications.
pt_br: Uma lista de objetos @code{search-path-specification} descrevendo variáveis de ambiente do caminho de pesquisa respeitadas pelo pacote. @xref{Search Paths}, para mais informações sobre especificações do caminho de pesquisa.

source: As for inputs, the distinction between @code{native-search-paths} and @code{search-paths} only matters when cross-compiling. In a cross-compilation context, @code{native-search-paths} applies exclusively to native inputs whereas @code{search-paths} applies only to host inputs.
pt_br: Quanto às entradas, a distinção entre @code{native-search-paths} e @code{search-paths} só importa quando há compilação cruzada. Em um contexto de compilação cruzada, @code{native-search-paths} se aplica exclusivamente a entradas nativas, enquanto @code{search-paths} se aplica somente a entradas de host.

source: Packages such as cross-compilers care about target inputs---for instance, our (modified) GCC cross-compiler has @env{CROSS_C_INCLUDE_PATH} in @code{search-paths}, which allows it to pick @file{.h} files for the target system and @emph{not} those of native inputs. For the majority of packages though, only @code{native-search-paths} makes sense.
pt_br: Pacotes como compiladores cruzados se importam com entradas de destino --- por exemplo, nosso compilador cruzado GCC (modificado) tem @env{CROSS_C_INCLUDE_PATH} em @code{search-paths}, o que permite que ele escolha arquivos @file{.h} para o sistema de destino e @emph{não} aqueles de entradas nativas. Para a maioria dos pacotes, porém, apenas @code{native-search-paths} faz sentido.

source: @code{replacement} (default: @code{#f})
pt_br: @code{replacement} (padrão: @code{#f})

source: This must be either @code{#f} or a package object that will be used as a @dfn{replacement} for this package. @xref{Security Updates, grafts}, for details.
pt_br: Deve ser @code{#f} ou um objeto de pacote que será usado como um @dfn{substituição} para este pacote. @xref{Security Updates, enxertos}, para detalhes.

source: A one-line description of the package.
pt_br: Uma descrição de uma linha do pacote.

source: A more elaborate description of the package, as a string in Texinfo syntax.
pt_br: Uma descrição mais elaborada do pacote, como uma string na sintaxe Texinfo.

source: license, of packages
pt_br: licença, de pacotes

source: The license of the package; a value from @code{(guix licenses)}, or a list of such values.
pt_br: A licença do pacote; um valor de @code{(guix licenses)}, ou uma lista de tais valores.

source: The URL to the home-page of the package, as a string.
pt_br: A URL para a página inicial do pacote, como uma string.

source: @code{supported-systems} (default: @code{%supported-systems})
pt_br: @code{supported-systems} (padrão: @code{%supported-systems})

source: The list of systems supported by the package, as strings of the form @code{architecture-kernel}, for example @code{"x86_64-linux"}.
pt_br: A lista de sistemas suportados pelo pacote, como strings do formato @code{arquitetura-kernel}, por exemplo @code{"x86_64-linux"}.

source: @code{location} (default: source location of the @code{package} form)
pt_br: @code{location} (padrão: localização de origem do formulário @code{package})

source: The source location of the package. It is useful to override this when inheriting from another package, in which case this field is not automatically corrected.
pt_br: O local de origem do pacote. É útil sobrescrever isso ao herdar de outro pacote, em cujo caso esse campo não é corrigido automaticamente.

source: When used in the @emph{lexical scope} of a package field definition, this identifier resolves to the package being defined.
pt_br: Quando usado no @emph{escopo lexical} de uma definição de campo de pacote, esse identificador é resolvido para o pacote que está sendo definido.
