Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: If you instead wish to use EFI-based GRUB, a FAT32 @dfn{EFI System Partition} (ESP) is required. This partition can be mounted at @file{/boot/efi} for instance and must have the @code{esp} flag set. E.g., for @command{parted}:
pt_br: Se você preferir usar o GRUB baseado em EFI, uma partição de sistema EFI (ESP) FAT32 @dfn{EFI System Partition} é necessária. Essa partição pode ser montada em @file{/boot/efi}, por exemplo, e deve ter o sinalizador @code{esp} definido. Por exemplo, para @command{parted}:

source: Unsure whether to use EFI- or BIOS-based GRUB? If the directory @file{/sys/firmware/efi} exists in the installation image, then you should probably perform an EFI installation, using @code{grub-efi-bootloader}. Otherwise you should use the BIOS-based GRUB, known as @code{grub-bootloader}. @xref{Bootloader Configuration}, for more info on bootloaders.
pt_br: Não tem certeza se deve usar o GRUB baseado em EFI ou BIOS? Se o diretório @file{/sys/firmware/efi} existir na imagem de instalação, então você provavelmente deve executar uma instalação EFI, usando @code{grub-efi-bootloader}. Caso contrário, você deve usar o GRUB baseado em BIOS, conhecido como @code{grub-bootloader}. @xref{Bootloader Configuration}, para mais informações sobre bootloaders.

source: Once you are done partitioning the target hard disk drive, you have to create a file system on the relevant partition(s)@footnote{Currently Guix System only supports ext4, btrfs, JFS, F2FS, and XFS file systems. In particular, code that reads file system UUIDs and labels only works for these file system types.}. For the ESP, if you have one and assuming it is @file{/dev/sda1}, run:
pt_br: Depois de terminar de particionar o disco rígido de destino, você precisa criar um sistema de arquivos na(s) partição(ões) relevante(s)@footnote{Atualmente, o Guix System suporta apenas sistemas de arquivos ext4, btrfs, JFS, F2FS e XFS. Em particular, o código que lê UUIDs e rótulos do sistema de arquivos funciona apenas para esses tipos de sistema de arquivos.}. Para o ESP, se você tiver um e presumindo que seja @file{/dev/sda1}, execute:

source: For the root file system, ext4 is the most widely used format. Other file systems, such as Btrfs, support compression, which is reported to nicely complement file deduplication that the daemon performs independently of the file system (@pxref{Invoking guix-daemon, deduplication}).
pt_br: Para o sistema de arquivos raiz, ext4 é o formato mais amplamente usado. Outros sistemas de arquivos, como Btrfs, suportam compressão, que é relatada como um bom complemento para a desduplicação de arquivos que o daemon executa independentemente do sistema de arquivos (@pxref{Invoking guix-daemon, deduplication}).

source: Preferably, assign file systems a label so that you can easily and reliably refer to them in @code{file-system} declarations (@pxref{File Systems}). This is typically done using the @code{-L} option of @command{mkfs.ext4} and related commands. So, assuming the target root partition lives at @file{/dev/sda2}, a file system with the label @code{my-root} can be created with:
pt_br: De preferência, atribua um rótulo aos sistemas de arquivos para que você possa se referir a eles de forma fácil e confiável nas declarações @code{file-system} (@pxref{File Systems}). Isso normalmente é feito usando a opção @code{-L} de @command{mkfs.ext4} e comandos relacionados. Então, assumindo que a partição raiz de destino esteja em @file{/dev/sda2}, um sistema de arquivos com o rótulo @code{my-root} pode ser criado com:

source: encrypted disk
pt_br: disco criptografado

source: If you are instead planning to encrypt the root partition, you can use the Cryptsetup/LUKS utilities to do that (see @inlinefmtifelse{html, @uref{https://linux.die.net/man/8/cryptsetup, @code{man cryptsetup}}, @code{man cryptsetup}} for more information).
pt_br: Se você estiver planejando criptografar a partição raiz, você pode usar os utilitários Cryptsetup/LUKS para fazer isso (veja @inlinefmtifelse{html, @uref{https://linux.die.net/man/8/cryptsetup, @code{man cryptsetup}}, @code{man cryptsetup}} para mais informações).

source: Assuming you want to store the root partition on @file{/dev/sda2}, the command sequence to format it as a LUKS partition would be along these lines:
pt_br: Supondo que você queira armazenar a partição raiz em @file{/dev/sda2}, a sequência de comandos para formatá-la como uma partição LUKS seria algo como isto:

source: Once that is done, mount the target file system under @file{/mnt} with a command like (again, assuming @code{my-root} is the label of the root file system):
pt_br: Feito isso, monte o sistema de arquivos de destino em @file{/mnt} com um comando como (novamente, assumindo que @code{my-root} é o rótulo do sistema de arquivos raiz):

source: Also mount any other file systems you would like to use on the target system relative to this path. If you have opted for @file{/boot/efi} as an EFI mount point for example, mount it at @file{/mnt/boot/efi} now so it is found by @code{guix system init} afterwards.
pt_br: Monte também quaisquer outros sistemas de arquivos que você gostaria de usar no sistema de destino em relação a este caminho. Se você optou por @file{/boot/efi} como um ponto de montagem EFI, por exemplo, monte-o em @file{/mnt/boot/efi} agora para que ele seja encontrado por @code{guix system init} depois.

source: Finally, if you plan to use one or more swap partitions (@pxref{Swap Space}), make sure to initialize them with @command{mkswap}. Assuming you have one swap partition on @file{/dev/sda3}, you would run:
pt_br: Por fim, se você planeja usar uma ou mais partições swap (@pxref{Swap Space}), certifique-se de inicializá-las com @command{mkswap}. Supondo que você tenha uma partição swap em @file{/dev/sda3}, você executaria:

source: Alternatively, you may use a swap file. For example, assuming that in the new system you want to use the file @file{/swapfile} as a swap file, you would run@footnote{This example will work for many types of file systems (e.g., ext4). However, for copy-on-write file systems (e.g., btrfs), the required steps may be different. For details, see the manual pages for @command{mkswap} and @command{swapon}.}:
pt_br: Alternativamente, você pode usar um arquivo de swap. Por exemplo, supondo que no novo sistema você queira usar o arquivo @file{/swapfile} como um arquivo de swap, você executaria @footnote{Este exemplo funcionará para muitos tipos de sistemas de arquivos (por exemplo, ext4). No entanto, para sistemas de arquivos copy-on-write (por exemplo, btrfs), as etapas necessárias podem ser diferentes. Para detalhes, veja as páginas do manual para @command{mkswap} e @command{swapon}.}:

source: # This is 10 GiB of swap space. Adjust "count" to change the size. dd if=/dev/zero of=/mnt/swapfile bs=1MiB count=10240 # For security, make the file readable and writable only by root. chmod 600 /mnt/swapfile mkswap /mnt/swapfile swapon /mnt/swapfile
pt_br: # Este é 10 GiB de espaço de swap. Ajuste "count" para alterar o tamanho. dd if=/dev/zero of=/mnt/swapfile bs=1MiB count=10240 # Por segurança, torne o arquivo legível e gravável somente pelo root. chmod 600 /mnt/swapfile mkswap /mnt/swapfile swapon /mnt/swapfile

source: Note that if you have encrypted the root partition and created a swap file in its file system as described above, then the encryption also protects the swap file, just like any other file in that file system.
pt_br: Observe que se você criptografou a partição raiz e criou um arquivo de swap em seu sistema de arquivos, conforme descrito acima, a criptografia também protegerá o arquivo de swap, assim como qualquer outro arquivo naquele sistema de arquivos.

source: With the target partitions ready and the target root mounted on @file{/mnt}, we're ready to go. First, run:
pt_br: Com as partições de destino prontas e a raiz de destino montada em @file{/mnt}, estamos prontos para começar. Primeiro, execute:

source: This makes @file{/gnu/store} copy-on-write, such that packages added to it during the installation phase are written to the target disk on @file{/mnt} rather than kept in memory. This is necessary because the first phase of the @command{guix system init} command (see below) entails downloads or builds to @file{/gnu/store} which, initially, is an in-memory file system.
pt_br: Isso torna @file{/gnu/store} copy-on-write, de modo que os pacotes adicionados a ele durante a fase de instalação são gravados no disco de destino em @file{/mnt} em vez de mantidos na memória. Isso é necessário porque a primeira fase do comando @command{guix system init} (veja abaixo) envolve downloads ou compilações para @file{/gnu/store} que, inicialmente, é um sistema de arquivos na memória.

source: Next, you have to edit a file and provide the declaration of the operating system to be installed. To that end, the installation system comes with three text editors. We recommend GNU nano (@pxref{Top,,, nano, GNU nano Manual}), which supports syntax highlighting and parentheses matching; other editors include mg (an Emacs clone), and nvi (a clone of the original BSD @command{vi} editor). We strongly recommend storing that file on the target root file system, say, as @file{/mnt/etc/config.scm}. Failing to do that, you will have lost your configuration file once you have rebooted into the newly-installed system.
pt_br: Em seguida, você precisa editar um arquivo e fornecer a declaração do sistema operacional a ser instalado. Para isso, o sistema de instalação vem com três editores de texto. Recomendamos o GNU nano (@pxref{Top,,, nano, GNU nano Manual}), que suporta realce de sintaxe e correspondência de parênteses; outros editores incluem mg (um clone do Emacs) e nvi (um clone do editor original BSD @command{vi}). Recomendamos fortemente armazenar esse arquivo no sistema de arquivos raiz de destino, digamos, como @file{/mnt/etc/config.scm}. Se isso não for feito, você perderá seu arquivo de configuração depois de reinicializar o sistema recém-instalado.

source: @xref{Using the Configuration System}, for an overview of the configuration file. The example configurations discussed in that section are available under @file{/etc/configuration} in the installation image. Thus, to get started with a system configuration providing a graphical display server (a ``desktop'' system), you can run something along these lines:
pt_br: @xref{Using the Configuration System}, para uma visão geral do arquivo de configuração. As configurações de exemplo discutidas nessa seção estão disponíveis em @file{/etc/configuration} na imagem de instalação. Assim, para começar com uma configuração de sistema fornecendo um servidor de exibição gráfica (um sistema ``desktop''), você pode executar algo como estas linhas:

source: You should pay attention to what your configuration file contains, and in particular:
pt_br: Você deve prestar atenção ao que seu arquivo de configuração contém e, em particular:

source: Make sure the @code{bootloader-configuration} form refers to the targets you want to install GRUB on. It should mention @code{grub-bootloader} if you are installing GRUB in the legacy way, or @code{grub-efi-bootloader} for newer UEFI systems. For legacy systems, the @code{targets} field contain the names of the devices, like @code{(list "/dev/sda")}; for UEFI systems it names the paths to mounted EFI partitions, like @code{(list "/boot/efi")}; do make sure the paths are currently mounted and a @code{file-system} entry is specified in your configuration.
pt_br: Certifique-se de que o formulário @code{bootloader-configuration} se refere aos alvos nos quais você deseja instalar o GRUB. Ele deve mencionar @code{grub-bootloader} se você estiver instalando o GRUB da maneira legada, ou @code{grub-efi-bootloader} para sistemas UEFI mais novos. Para sistemas legados, o campo @code{targets} contém os nomes dos dispositivos, como @code{(list "/dev/sda")}; para sistemas UEFI, ele nomeia os caminhos para partições EFI montadas, como @code{(list "/boot/efi")}; certifique-se de que os caminhos estejam montados no momento e que uma entrada @code{file-system} esteja especificada em sua configuração.

source: Be sure that your file system labels match the value of their respective @code{device} fields in your @code{file-system} configuration, assuming your @code{file-system} configuration uses the @code{file-system-label} procedure in its @code{device} field.
pt_br: Certifique-se de que os rótulos do seu sistema de arquivos correspondam ao valor dos respectivos campos @code{device} na sua configuração @code{file-system}, supondo que sua configuração @code{file-system} use o procedimento @code{file-system-label} no seu campo @code{device}.

source: If there are encrypted or RAID partitions, make sure to add a @code{mapped-devices} field to describe them (@pxref{Mapped Devices}).
pt_br: Se houver partições criptografadas ou RAID, certifique-se de adicionar um campo @code{mapped-devices} para descrevê-las (@pxref{Mapped Devices}).

source: Once you are done preparing the configuration file, the new system must be initialized (remember that the target root file system is mounted under @file{/mnt}):
pt_br: Depois de terminar de preparar o arquivo de configuração, o novo sistema deve ser inicializado (lembre-se de que o sistema de arquivos raiz de destino é montado em @file{/mnt}):

source: This copies all the necessary files and installs GRUB on @file{/dev/sdX}, unless you pass the @option{--no-bootloader} option. For more information, @pxref{Invoking guix system}. This command may trigger downloads or builds of missing packages, which can take some time.
pt_br: Isso copia todos os arquivos necessários e instala o GRUB em @file{/dev/sdX}, a menos que você passe a opção @option{--no-bootloader}. Para mais informações, @pxref{Invoking guix system}. Este comando pode disparar downloads ou compilações de pacotes ausentes, o que pode levar algum tempo.

source: Once that command has completed---and hopefully succeeded!---you can run @command{reboot} and boot into the new system. The @code{root} password in the new system is initially empty; other users' passwords need to be initialized by running the @command{passwd} command as @code{root}, unless your configuration specifies otherwise (@pxref{user-account-password, user account passwords}). @xref{After System Installation}, for what's next!
pt_br: Após a conclusão desse comando -- e esperamos que com sucesso! -- você pode executar o comando @command{reboot} e inicializar no novo sistema. A senha @code{root} no novo sistema está inicialmente vazia; as senhas de outros usuários precisam ser inicializadas executando o comando @command{passwd} como @code{root}, a menos que sua configuração especifique o contrário (@pxref{user-account-password, senhas de contas de usuário}). @xref{After System Installation}, para o que vem a seguir!

source: This builds a new system @dfn{generation} with the latest packages and services.
pt_br: Isso cria uma nova @dfn{geração} sistema com os pacotes e serviços mais recentes.

source: Now, @pxref{Getting Started with the System}, and join us on @code{#guix} on the Libera.Chat IRC network or on @email{guix-devel@@gnu.org} to share your experience!
pt_br: Agora, @pxref{Getting Started with the System}, junte-se a nós no @code{#guix} na rede IRC Libera.Chat ou no @email{guix-devel@@gnu.org} para compartilhar sua experiência!

source: Installing Guix in a Virtual Machine
pt_br: Instalando Guix em uma Máquina Virtual

source: virtual machine, Guix System installation
pt_br: máquina virtual, instalação do Guix System

source: virtual private server (VPS)
pt_br: servidor virtual privado (VPS)

source: VPS (virtual private server)
pt_br: VPS (servidor virtual privado)

source: If you'd like to install Guix System in a virtual machine (VM) or on a virtual private server (VPS) rather than on your beloved machine, this section is for you.
pt_br: Se você deseja instalar o Guix System em uma máquina virtual (VM) ou em um servidor virtual privado (VPS) em vez de na sua máquina favorita, esta seção é para você.

source: To boot a @uref{https://qemu.org/,QEMU} VM for installing Guix System in a disk image, follow these steps:
pt_br: Para inicializar uma VM @uref{https://qemu.org/,QEMU} para instalar o Guix System em uma imagem de disco, siga estas etapas:

source: First, retrieve and decompress the Guix system installation image as described previously (@pxref{USB Stick and DVD Installation}).
pt_br: Primeiro, recupere e descompacte a imagem de instalação do sistema Guix conforme descrito anteriormente (@pxref{USB Stick and DVD Installation}).

source: Create a disk image that will hold the installed system. To make a qcow2-formatted disk image, use the @command{qemu-img} command:
pt_br: Crie uma imagem de disco que irá conter o sistema instalado. Para criar uma imagem de disco formatada em qcow2, use o comando @command{qemu-img}:

source: The resulting file will be much smaller than 50 GB (typically less than 1 MB), but it will grow as the virtualized storage device is filled up.
pt_br: O arquivo resultante será muito menor que 50 GB (normalmente menos de 1 MB), mas aumentará à medida que o dispositivo de armazenamento virtualizado for preenchido.

source: qemu-system-x86_64 -m 1024 -smp 1 -enable-kvm \ -nic user,model=virtio-net-pci -boot menu=on,order=d \ -drive file=guix-system.img \ -drive media=cdrom,readonly=on,file=guix-system-install-@value{VERSION}.@var{system}.iso
pt_br: qemu-system-x86_64 -m 1024 -smp 1 -enable-kvm \ -nic user,model=virtio-net-pci -boot menu=on,order=d \ -drive file=guix-system.img \ -drive media=cdrom,readonly=on,file=guix-system-install-@value{VERSION}.@var{sistema}.iso

source: @code{-enable-kvm} is optional, but significantly improves performance, @pxref{Running Guix in a VM}.
pt_br: @code{-enable-kvm} é opcional, mas melhora significativamente o desempenho, @pxref{Running Guix in a VM}.

source: You're now root in the VM, proceed with the installation process. @xref{Preparing for Installation}, and follow the instructions.
pt_br: Agora você está como root na VM, prossiga com o processo de instalação. @xref{Preparing for Installation} e siga as instruções.

source: Once installation is complete, you can boot the system that's on your @file{guix-system.img} image. @xref{Running Guix in a VM}, for how to do that.
pt_br: Quando a instalação estiver concluída, você pode inicializar o sistema que está na sua imagem @file{guix-system.img}. @xref{Running Guix in a VM}, para saber como fazer isso.

source: installation image
pt_br: imagem de instalação

source: The installation image described above was built using the @command{guix system} command, specifically:
pt_br: A imagem de instalação descrita acima foi criada usando o comando @command{guix system}, especificamente:

source: Have a look at @file{gnu/system/install.scm} in the source tree, and see also @ref{Invoking guix system} for more information about the installation image.
pt_br: Dê uma olhada em @file{gnu/system/install.scm} na árvore de origem e veja também @ref{Invoking guix system} para mais informações sobre a imagem de instalação.

source: Building the Installation Image for ARM Boards
pt_br: Construindo a imagem de instalação para placas ARM

source: Many ARM boards require a specific variant of the @uref{https://www.denx.de/wiki/U-Boot/, U-Boot} bootloader.
pt_br: Muitas placas ARM exigem uma variante específica do bootloader @uref{https://www.denx.de/wiki/U-Boot/, U-Boot}.

source: If you build a disk image and the bootloader is not available otherwise (on another boot drive etc), it's advisable to build an image that includes the bootloader, specifically:
pt_br: Se você criar uma imagem de disco e o bootloader não estiver disponível de outra forma (em outra unidade de inicialização, etc.), é aconselhável criar uma imagem que inclua o bootloader, especificamente:

source: @code{A20-OLinuXino-Lime2} is the name of the board. If you specify an invalid board, a list of possible boards will be printed.
pt_br: @code{A20-OLinuXino-Lime2} é o nome do quadro. Se você especificar um quadro inválido, uma lista de quadros possíveis será mostrada.

source: Presumably, you've reached this section because either you have installed Guix on top of another distribution (@pxref{Installation}), or you've installed the standalone Guix System (@pxref{System Installation}). It's time for you to get started using Guix and this section aims to help you do that and give you a feel of what it's like.
pt_br: Presumivelmente, você chegou a esta seção porque instalou o Guix sobre outra distribuição (@pxref{Installation}) ou instalou o Guix System autônomo (@pxref{System Installation}). É hora de começar a usar o Guix e esta seção tem como objetivo ajudar você a fazer isso e dar uma ideia de como é.

source: Guix is about installing software, so probably the first thing you'll want to do is to actually look for software. Let's say you're looking for a text editor, you can run:
pt_br: Guix é sobre instalar software, então provavelmente a primeira coisa que você vai querer fazer é realmente procurar por software. Digamos que você esteja procurando por um editor de texto, você pode executar:

source: This command shows you a number of matching @dfn{packages}, each time showing the package's name, version, a description, and additional info. Once you've found out the one you want to use, let's say Emacs (ah ha!), you can go ahead and install it (run this command as a regular user, @emph{no need for root privileges}!):
pt_br: Este comando mostra a você um número de @dfn{pacotes} correspondentes, cada vez mostrando o nome do pacote, versão, uma descrição e informações adicionais. Depois de descobrir qual você quer usar, digamos Emacs (ah ha!), você pode prosseguir e instalá-lo (execute este comando como um usuário regular, @emph{não precisa de privilégios de root}!):

source: profile
it: profilo
pt_br: perfil

source: You've installed your first package, congrats! The package is now visible in your default @dfn{profile}, @file{$HOME/.guix-profile}---a profile is a directory containing installed packages. In the process, you've probably noticed that Guix downloaded pre-built binaries; or, if you explicitly chose to @emph{not} use pre-built binaries, then probably Guix is still building software (@pxref{Substitutes}, for more info).
pt_br: Você instalou seu primeiro pacote, parabéns! O pacote agora está visível no seu @dfn{perfil} padrão, @file{$HOME/.guix-profile}---um perfil é um diretório que contém pacotes instalados. No processo, você provavelmente notou que o Guix baixou binários pré-compilados; ou, se você escolheu explicitamente @emph{não} usar binários pré-compilados, então provavelmente o Guix ainda está compilando software (@pxref{Substitutes}, para mais informações).

source: Unless you're using Guix System, the @command{guix install} command must have printed this hint:
pt_br: A menos que você esteja usando o Guix System, o comando @command{guix install} deve ter mostrado esta dica:

source: hint: Consider setting the necessary environment variables by running:
pt_br: dica: Considere definir as variáveis de ambiente necessárias executando:

source: Alternately, see `guix package --search-paths -p "$HOME/.guix-profile"'.
pt_br: Alternativamente, consulte `guix package --search-paths -p "$HOME/.guix-profile"'.
