Repository: Millak/guix
Catalog: po/doc/guix-manual.*.po
Languages: it, pt_br

source: This is only a note and you can safely ignore it. You can get rid of the message by running @command{make -j4}. Until you do, Guile will run slightly slower because it will interpret the code instead of using prepared Guile object (@file{.go}) files.
it: Questa è solo una nota e puoi tranquillamente ignorarla. Puoi eliminare il messaggio eseguendo @command{make -j4}. Finché non lo fai, Guile funzionerà leggermente più lentamente perché interpreterà il codice invece di usare i file oggetto Guile preparati (@file{.go}).
pt_br: Esta é apenas uma nota e você pode ignorá-la com segurança. Você pode se livrar da mensagem executando @command{make -j4}. Até que você faça isso, o Guile será executado um pouco mais devagar porque interpretará o código em vez de usar arquivos de objeto Guile preparados (@file{.go}).

source: You can run @command{make} automatically as you work using @command{watchexec} from the @code{watchexec} package. For example, to build again each time you update a package file, run @samp{watchexec -w gnu/packages -- make -j4}.
it: Puoi eseguire @command{make} automaticamente mentre lavori usando @command{watchexec} dal pacchetto @code{watchexec}. Ad esempio, per ricostruire ogni volta che aggiorni un file di pacchetto, esegui @samp{watchexec -w gnu/packages -- make -j4}.
pt_br: Você pode executar @command{make} automaticamente enquanto trabalha usando @command{watchexec} do pacote @code{watchexec}. Por exemplo, para compilar novamente cada vez que você atualizar um arquivo de pacote, execute @samp{watchexec -w gnu/packages -- make -j4}.

source: The Perfect Setup to hack on Guix is basically the perfect setup used for Guile hacking (@pxref{Using Guile in Emacs,,, guile, Guile Reference Manual}). First, you need more than an editor, you need @url{https://www.gnu.org/software/emacs, Emacs}, empowered by the wonderful @url{https://nongnu.org/geiser/, Geiser}. To set that up, run:
it: La Configurazione Perfetta per hackerare su Guix è fondamentalmente la configurazione perfetta usata per hackerare su Guile (@pxref{Using Guile in Emacs,,, guile, Guile Reference Manual}). Prima di tutto, non hai bisogno di un semplice editor, hai bisogno di @url{https://www.gnu.org/software/emacs, Emacs}, potenziato dal meraviglioso @url{https://nongnu.org/geiser/, Geiser}. Per configurarlo, esegui:
pt_br: A configuração perfeita para hackear no Guix é basicamente a configuração perfeita usada para hackear o Guile (@pxref{Using Guile in Emacs,,, guile, Manual de referência do GNU Guile}). Primeiro, você precisa de mais do que um editor, você precisa de @url{https://www.gnu.org/software/emacs, Emacs}, capacitado pelo maravilhoso @url{https://nongnu.org/geiser/, Geiser }. Para configurar isso, execute:

source: Geiser allows for interactive and incremental development from within Emacs: code compilation and evaluation from within buffers, access to on-line documentation (docstrings), context-sensitive completion, @kbd{M-.} to jump to an object definition, a REPL to try out your code, and more (@pxref{Introduction,,, geiser, Geiser User Manual}). If you allow Emacs to load the @file{.dir-locals.el} file at the root of the project checkout, it will cause Geiser to automatically add the local Guix sources to the Guile load path.
it: Geiser permette uno sviluppo interattivo e incrementale dall'interno di Emacs: compilazione e valutazione del codice dai buffer, accesso alla documentazione online (docstring), completamento contestuale, @kbd{M-.} per saltare alla definizione di un oggetto, un REPL per provare il tuo codice, e altro ancora (@pxref{Introduction,,, geiser, Geiser User Manual}). Se permetti a Emacs di caricare il file @file{.dir-locals.el} nella radice del checkout del progetto, Geiser aggiungerà automaticamente i sorgenti locali di Guix al percorso di caricamento di Guile.
pt_br: O Geiser permite desenvolvimento interativo e incremental de dentro do Emacs: compilação e avaliação de código de dentro de buffers, acesso à documentação on-line (docstrings), conclusão sensível ao contexto, @kbd{M-.} para pular para uma definição de objeto, um REPL para testar seu código e muito mais (@pxref{Introduction,,, geiser, Manual do Usuário do Geiser}). Se você permitir que o Emacs carregue o arquivo @file{.dir-locals.el} na raiz do checkout do projeto, isso fará com que o Geiser adicione automaticamente as fontes locais do Guix ao caminho de carregamento do Guile.

source: To actually edit the code, Emacs already has a neat Scheme mode. But in addition to that, you must not miss @url{https://www.emacswiki.org/emacs/ParEdit, Paredit}. It provides facilities to directly operate on the syntax tree, such as raising an s-expression or wrapping it, swallowing or rejecting the following s-expression, etc.
it: Per modificare effettivamente il codice, Emacs ha già una buona modalità Scheme. Ma in aggiunta a ciò, non puoi farti mancare @url{https://www.emacswiki.org/emacs/ParEdit, Paredit}. Fornisce funzionalità per operare direttamente sull'albero di sintassi, come elevare una s-expression o avvolgerla, inglobare o espellere la s-expression successiva, ecc.
pt_br: Para realmente editar o código, o Emacs já possui um modo Scheme bacana. Mas além disso, você não deve perder @url{https://www.emacswiki.org/emacs/ParEdit, Paredit}. Ele fornece recursos para operar diretamente na árvore sintática, como aumentar ou agrupar uma expressão simbólica (S-expression), engolir ou rejeitar a expressão simbólica seguinte, etc.

source: code snippets
it: frammenti di codice
pt_br: trechos de código

source: templates
it: modelli
pt_br: modelos

source: reducing boilerplate
it: ridurre il boilerplate
pt_br: reduzindo boilerplate

source: We also provide templates for common git commit messages and package definitions in the @file{etc/snippets} directory. These templates can be used to expand short trigger strings to interactive text snippets. If you use @url{https://joaotavora.github.io/yasnippet/, YASnippet}, you may want to add the @file{etc/snippets/yas} snippets directory to the @var{yas-snippet-dirs} variable. If you use @url{https://github.com/minad/tempel/, Tempel}, you may want to add the @file{etc/snippets/tempel/*} path to the @var{tempel-path} variable in Emacs.
it: Forniamo anche dei modelli per i messaggi di commit git comuni e per le definizioni di pacchetto nella directory @file{etc/snippets}. Questi modelli possono essere usati per espandere brevi stringhe di attivazione in frammenti di testo interattivi. Se usi @url{https://joaotavora.github.io/yasnippet/, YASnippet}, potresti voler aggiungere la directory dei frammenti @file{etc/snippets/yas} alla variabile @var{yas-snippet-dirs}. Se usi @url{https://github.com/minad/tempel/, Tempel}, potresti voler aggiungere il percorso @file{etc/snippets/tempel/*} alla variabile @var{tempel-path} in Emacs.
pt_br: Também fornecemos modelos para mensagens comuns de commit do git e definições de pacotes no diretório @file{etc/snippets}. Esses modelos podem ser usados para expandir sequências curtas de gatilho para trechos de texto interativos. Se você usar @url{https://joaotavora.github.io/yasnippet/, YASnippet}, você pode querer adicionar o diretório de snippets @file{etc/snippets/yas} ao @var{yas-snippet-dirs} variável. Se você usar @url{https://github.com/minad/tempel/, Tempel}, você pode querer adicionar o caminho @file{etc/snippets/tempel/*} à variável @var{tempel-path} no Emacs.

source: ;; @r{Assuming the Guix checkout is in ~/src/guix.} ;; @r{Yasnippet configuration} (with-eval-after-load 'yasnippet (add-to-list 'yas-snippet-dirs "~/src/guix/etc/snippets/yas")) ;; @r{Tempel configuration} (with-eval-after-load 'tempel ;; Ensure tempel-path is a list -- it may also be a string. (unless (listp 'tempel-path) (setq tempel-path (list tempel-path))) (add-to-list 'tempel-path "~/src/guix/etc/snippets/tempel/*"))
it: ;; @r{Assumendo che il checkout di Guix sia in ~/src/guix.} ;; @r{Configurazione di Yasnippet} (with-eval-after-load 'yasnippet (add-to-list 'yas-snippet-dirs "~/src/guix/etc/snippets/yas")) ;; @r{Configurazione di Tempel} (with-eval-after-load 'tempel ;; Assicura che tempel-path sia una lista -- potrebbe anche essere una stringa. (unless (listp 'tempel-path) (setq tempel-path (list tempel-path))) (add-to-list 'tempel-path "~/src/guix/etc/snippets/tempel/*"))
pt_br: ;; @r{Assuming the Guix checkout is in ~/src/guix.} ;; @r{Yasnippet configuration} (with-eval-after-load 'yasnippet (add-to-list 'yas-snippet-dirs "~/src/guix/etc/snippets/yas")) ;; @r{Tempel configuration} (with-eval-after-load 'tempel ;; Certifique-se de que tempel-path seja uma lista — também pode ser uma string. (unless (listp 'tempel-path) (setq tempel-path (list tempel-path))) (add-to-list 'tempel-path "~/src/guix/etc/snippets/tempel/*"))

source: The commit message snippets depend on @url{https://magit.vc/, Magit} to display staged files. When editing a commit message type @code{add} followed by @kbd{TAB} to insert a commit message template for adding a package; type @code{update} followed by @kbd{TAB} to insert a template for updating a package; type @code{https} followed by @kbd{TAB} to insert a template for changing the home page URI of a package to HTTPS.
it: I frammenti di messaggio di commit dipendono da @url{https://magit.vc/, Magit} per visualizzare i file in staging. Quando modifichi un messaggio di commit, digita @code{add} seguito da @kbd{TAB} per inserire un modello di messaggio di commit per l'aggiunta di un pacchetto; digita @code{update} seguito da @kbd{TAB} per inserire un modello per l'aggiornamento di un pacchetto; digita @code{https} seguito da @kbd{TAB} per inserire un modello per cambiare l'URI della pagina iniziale di un pacchetto a HTTPS.
pt_br: Os trechos de mensagens de commit dependem de @url{https://magit.vc/, Magit} para exibir arquivos "staged". Ao editar uma mensagem de commit, digite @code{add} seguido por @kbd{TAB} para inserir um modelo de mensagem de commit para adicionar um pacote; digite @code{update} seguido por @kbd{TAB} para inserir um modelo para atualizar um pacote; digite @code{https} seguido por @kbd{TAB} para inserir um modelo para alterar a URI da página inicial de um pacote para HTTPS.

source: The main snippet for @code{scheme-mode} is triggered by typing @code{package...} followed by @kbd{TAB}. This snippet also inserts the trigger string @code{origin...}, which can be expanded further. The @code{origin} snippet in turn may insert other trigger strings ending on @code{...}, which also can be expanded further.
it: Lo snippet principale per @code{scheme-mode} viene attivato digitando @code{package...} seguito da @kbd{TAB}. Questo snippet inserisce anche la stringa di attivazione @code{origin...}, che può essere espansa ulteriormente. Lo snippet @code{origin} a sua volta può inserire altre stringhe di attivazione che terminano con @code{...}, che possono essere anch'esse espanse.
pt_br: O trecho principal para @code{scheme-mode} é acionado digitando @code{package ...} seguido de @kbd{TAB}. Esse trecho também insere a string de acionamento @code{origin...}, que pode ser expandida ainda mais. O trecho @code{origin}, por sua vez, pode inserir outras strings acionadoras que terminam em @code{...}, que também podem ser expandidas.

source: insert or update copyright
it: inserire o aggiornare copyright
pt_br: inserir ou atualizar direitos autorais

source: We additionally provide insertion and automatic update of a copyright in @file{etc/copyright.el}. You may want to set your full name, mail, and load a file.
it: Forniamo inoltre l'inserimento e l'aggiornamento automatico del copyright in @file{etc/copyright.el}. Potrebbe essere necessario impostare il proprio nome completo, l'email e caricare un file.
pt_br: Além disso, fornecemos inserção e atualização automática de direitos autorais em @file{etc/copyright.el}. Você pode definir seu nome completo, e-mail e carregar um arquivo.

source: (setq user-full-name "Alice Doe") (setq user-mail-address "alice@@mail.org") ;; @r{Assuming the Guix checkout is in ~/src/guix.} (load-file "~/src/guix/etc/copyright.el")
it: (setq user-full-name "Alice Doe") (setq user-mail-address "alice@@mail.org") ;; @r{Assumendo che il checkout di Guix sia in ~/src/guix.} (load-file "~/src/guix/etc/copyright.el")
pt_br: (setq user-full-name "Alice Doe") (setq user-mail-address "alice@@mail.org") ;; @r{Supondo que o checkout do Guix esteja em ~/src/guix.} (load-file "~/src/guix/etc/copyright.el")

source: To insert a copyright at the current line invoke @code{M-x guix-copyright}.
it: Per inserire un copyright alla riga corrente, invoca @code{M-x guix-copyright}.
pt_br: Para inserir um copyright na linha atual, invoque @code{M-x guix-copyright}.

source: To update a copyright you need to specify a @code{copyright-names-regexp}.
it: Per aggiornare un copyright, è necessario specificare un @code{copyright-names-regexp}.
pt_br: Para atualizar um copyright você precisa especificar um @code{copyright-names-regexp}.

source: You can check if your copyright is up to date by evaluating @code{M-x copyright-update}. If you want to do it automatically after each buffer save then add @code{(add-hook 'after-save-hook 'copyright-update)} in Emacs.
it: Puoi verificare se il tuo copyright è aggiornato valutando @code{M-x copyright-update}. Se vuoi farlo automaticamente dopo ogni salvataggio del buffer, aggiungi @code{(add-hook 'after-save-hook 'copyright-update)} in Emacs.
pt_br: Você pode verificar se seus direitos autorais estão atualizados avaliando @code{M-x copyright-update}. Se você quiser fazer isso automaticamente após cada salvamento de buffer, adicione @code{(add-hook 'after-save-hook 'copyright-update)} no Emacs.

source: Viewing Bugs within Emacs
it: Visualizzare i bug all'interno di Emacs
pt_br: Visualizando Bugs no Emacs

source: Emacs has a nice minor mode called @code{bug-reference}, which, when combined with @samp{emacs-debbugs} (the Emacs package), can be used to open links such as @samp{<https://bugs.gnu.org/58697>} or @samp{<https://issues.guix.gnu.org/58697>} as bug report buffers. From there you can easily consult the email thread via the Gnus interface, reply or modify the bug status, all without leaving the comfort of Emacs! Below is a sample configuration to add to your @file{~/.emacs} configuration file:
it: Emacs ha una bella modalità minore chiamata @code{bug-reference}, che, se combinata con @samp{emacs-debbugs} (il pacchetto Emacs), può essere usata per aprire link come @samp{<https://bugs.gnu.org/58697>} o @samp{<https://issues.guix.gnu.org/58697>} come buffer di segnalazione di bug. Da lì puoi consultare facilmente il thread email tramite l'interfaccia Gnus, rispondere o modificare lo stato del bug, tutto senza lasciare la comodità di Emacs! Sotto c'è un esempio di configurazione da aggiungere al tuo file di configurazione @file{~/.emacs}:
pt_br: O Emacs tem um modo secundário interessante chamado @code{bug-reference}, que, quando combinado com @samp{emacs-debbugs} (o pacote Emacs), pode ser usado para abrir links como @samp{<https://bugs .gnu.org/58697>} ou @samp{<https://issues.guix.gnu.org/58697>} como buffers de relatório de bugs. A partir daí você pode facilmente consultar o tópico do email através da interface do Gnus, responder ou modificar o status do bug, tudo sem sair do conforto do Emacs! Abaixo está um exemplo de configuração para adicionar ao seu arquivo de configuração @file{~/.emacs}:

source: ;;; This extends the default expression (the top-most, first expression ;;; provided to 'or') to also match URLs such as ;;; <https://issues.guix.gnu.org/58697> or <https://bugs.gnu.org/58697>. ;;; It is also extended to detect "Fixes: #NNNNN" git trailers. (setq bug-reference-bug-regexp (rx (group (or (seq word-boundary (or (seq (char "Bb") "ug" (zero-or-one " ") (zero-or-one "#")) (seq (char "Pp") "atch" (zero-or-one " ") "#") (seq (char "Ff") "ixes" (zero-or-one ":") (zero-or-one " ") "#") (seq "RFE" (zero-or-one " ") "#") (seq "PR " (one-or-more (char "a-z+-")) "/")) (group (one-or-more (char "0-9")) (zero-or-one (seq "#" (one-or-more (char "0-9")))))) (seq (? "<") "https://bugs.gnu.org/" (group-n 2 (one-or-more (char "0-9"))) (? ">")) (seq (? "<") "https://issues.guix.gnu.org/" (? "issue/") (group-n 2 (one-or-more (char "0-9"))) (? ">")))))) (setq bug-reference-url-format "https://issues.guix.gnu.org/%s")
it: ;;; Questo estende l'espressione predefinita (la prima espressione in alto, ;;; fornita a 'or') per corrispondere anche a URL come ;;; <https://issues.guix.gnu.org/58697> o <https://bugs.gnu.org/58697>. ;;; È anche estesa per rilevare i trailer git "Fixes: #NNNNN". (setq bug-reference-bug-regexp (rx (group (or (seq word-boundary (or (seq (char "Bb") "ug" (zero-or-one " ") (zero-or-one "#")) (seq (char "Pp") "atch" (zero-or-one " ") "#") (seq (char "Ff") "ixes" (zero-or-one ":") (zero-or-one " ") "#") (seq "RFE" (zero-or-one " ") "#") (seq "PR " (one-or-more (char "a-z+-")) "/")) (group (one-or-more (char "0-9")) (zero-or-one (seq "#" (one-or-more (char "0-9")))))) (seq (? "<") "https://bugs.gnu.org/" (group-n 2 (one-or-more (char "0-9"))) (? ">")) (seq (? "<") "https://issues.guix.gnu.org/" (? "issue/") (group-n 2 (one-or-more (char "0-9"))) (? ">")))))) (setq bug-reference-url-format "https://issues.guix.gnu.org/%s")
pt_br: ;;; Isso estende a expressão padrão (a primeira expressão mais alta ;;; fornecida para 'or') para também corresponder a URLs como ;;; <https://issues.guix.gnu.org/58697> ou <https://bugs.gnu.org/58697>. ;;; Também é estendido para detectar trailers git "Fixes: #NNNNN". (setq bug-reference-bug-regexp (rx (group (or (seq word-boundary (or (seq (char "Bb") "ug" (zero-or-one " ") (zero-or-one "#")) (seq (char "Pp") "atch" (zero-or-one " ") "#") (seq (char "Ff") "ixes" (zero-or-one ":") (zero-or-one " ") "#") (seq "RFE" (zero-or-one " ") "#") (seq "PR " (one-or-more (char "a-z+-")) "/")) (group (one-or-more (char "0-9")) (zero-or-one (seq "#" (one-or-more (char "0-9")))))) (seq (? "<") "https://bugs.gnu.org/" (group-n 2 (one-or-more (char "0-9"))) (? ">")) (seq (? "<") "https://issues.guix.gnu.org/" (? "issue/") (group-n 2 (one-or-more (char "0-9"))) (? ">")))))) (setq bug-reference-url-format "https://issues.guix.gnu.org/%s")

source: ;; The following allows Emacs Debbugs user to open the issue directly within ;; Emacs. (setq debbugs-browse-url-regexp (rx line-start "http" (zero-or-one "s") "://" (or "debbugs" "issues.guix" "bugs") ".gnu.org" (one-or-more "/") (group (zero-or-one "cgi/bugreport.cgi?bug=")) (group-n 3 (one-or-more digit)) line-end))
it: ;; Quanto segue permette all'utente di Emacs Debbugs di aprire il problema direttamente ;; all'interno di Emacs. (setq debbugs-browse-url-regexp (rx line-start "http" (zero-or-one "s") "://" (or "debbugs" "issues.guix" "bugs") ".gnu.org" (one-or-more "/") (group (zero-or-one "cgi/bugreport.cgi?bug=")) (group-n 3 (one-or-more digit)) line-end))
pt_br: ;; O seguinte permite que o usuário do Emacs Debbugs abra o problema diretamente dentro (setq debbugs-browse-url-regexp (rx line-start "http" (zero-or-one "s") "://" (or "debbugs" "issues.guix" "bugs") ".gnu.org" (one-or-more "/") (group (zero-or-one "cgi/bugreport.cgi?bug=")) (group-n 3 (one-or-more digit)) line-end))

source: ;; Change the default when run as 'M-x debbugs-gnu'. (setq debbugs-gnu-default-packages '("guix" "guix-patches"))
it: ;; Cambia il valore predefinito quando eseguito come 'M-x debbugs-gnu'. (setq debbugs-gnu-default-packages '("guix" "guix-patches"))
pt_br: ;; Altera o padrão quando executado como 'M-x debbugs-gnu'. (setq debbugs-gnu-default-packages '("guix" "guix-patches"))

source: ;; Show feature requests. (setq debbugs-gnu-default-severities '("serious" "important" "normal" "minor" "wishlist"))
it: ;; Mostra le richieste di funzionalità. (setq debbugs-gnu-default-severities '("serious" "important" "normal" "minor" "wishlist"))
pt_br: ;; Mostrar solicitações de recursos. (setq debbugs-gnu-default-severities '("serious" "important" "normal" "minor" "wishlist"))

source: For more information, refer to @ref{Bug Reference,,, emacs, The GNU Emacs Manual} and @ref{Minor Mode,,, debbugs-ug, The Debbugs User Guide}.
it: Per maggiori informazioni, fare riferimento a @ref{Bug Reference,,, emacs, The GNU Emacs Manual} e @ref{Minor Mode,,, debbugs-ug, The Debbugs User Guide}.
pt_br: Para obter mais informações, consulte @ref{Bug Reference,,, emacs, The GNU Emacs Manual} e @ref{Minor Mode,,, debbugs-ug, The Debbugs User Guide}.

source: Alternative setups than Emacs may let you work on Guix with a similar development experience and they might work better with the tools you currently use or help you make the transition to Emacs.
it: Configurazioni alternative a Emacs possono permetterti di lavorare su Guix con un'esperienza di sviluppo simile e potrebbero funzionare meglio con gli strumenti che usi attualmente o aiutarti a passare a Emacs.
pt_br: Configurações alternativas ao Emacs podem permitir que você trabalhe no Guix com uma experiência de desenvolvimento semelhante e podem funcionar melhor com as ferramentas que você usa atualmente ou ajudá-lo a fazer a transição para o Emacs.

source: The options listed below only provide the alternatives to the Emacs based setup, which is the most widely used in the Guix community. If you want to really understand how the perfect setup for Guix development is supposed to work, we encourage you to read the section before this regardless of the editor you choose to use.
it: Le opzioni elencate di seguito forniscono solo le alternative alla configurazione basata su Emacs, che è la più usata nella comunità di Guix. Se vuoi capire veramente come dovrebbe funzionare la configurazione perfetta per lo sviluppo di Guix, ti incoraggiamo a leggere la sezione precedente, indipendentemente dall'editor che scegli di usare.
pt_br: As opções listadas abaixo fornecem apenas alternativas à configuração baseada em Emacs, que é a mais utilizada na comunidade Guix. Se você quiser realmente entender como a configuração perfeita para o desenvolvimento do Guix deve funcionar, nós o encorajamos a ler a seção anterior, independentemente do editor que você escolher usar.

source: Guile Studio
pt_br: Guile Estúdio

source: First step in your transition to Emacs.
it: Primo passo nella tua transizione a Emacs.
pt_br: Primeiro passo na sua transição para o Emacs.

source: Vim and NeoVim
it: Vim e NeoVim
pt_br: Vim e NeoVim

source: When you are evil to the root.
it: Quando sei malvagio fino al midollo.
pt_br: Quando você é mau até a raiz.

source: Guile Studio is a pre-configured Emacs with mostly everything you need to start hacking in Guile. If you are not familiar with Emacs it makes the transition easier for you.
it: Guile Studio è un Emacs pre-configurato con quasi tutto ciò di cui hai bisogno per iniziare a hackerare in Guile. Se non hai familiarità con Emacs, rende la transizione più facile per te.
pt_br: Guile Studio é um Emacs pré-configurado com praticamente tudo que você precisa para começar a hackear no Guile. Se você não estiver familiarizado com o Emacs, a transição será mais fácil para você.

source: Guile Studio comes with Geiser preinstalled and prepared for action.
it: Guile Studio viene fornito con Geiser preinstallato e pronto all'azione.
pt_br: Guile Studio vem com Geiser pré-instalado e preparado para ação.

source: Vim (and NeoVim) are also packaged in Guix, just in case you decided to go for the evil path.
it: Vim (e NeoVim) sono anche pacchettizzati in Guix, nel caso tu abbia deciso di percorrere il sentiero del male.
pt_br: O Vim (e o NeoVim) também são empacotados no Guix, caso você decida seguir o caminho do mal.
